{
  "id": "08bc07839a9e",
  "title": "Day 1224",
  "createdAt": "2025-07-29 03:25:22",
  "tags": [
    "bang"
  ],
  "url": "https://chepenikconor.medium.com/day-1224-08bc07839a9e",
  "content": "# Day 1224\n\nToday was a good day. Grateful that I got some time off work which enabled me to run 4 miles in the scorching heat, see Fantastic Four with my lover, enjoy dinner at my Grandparents, and play PGA 2k, write, walk, and enjoy some podcasts. HOLY HECK I AM A LUCKY GUY.\n\nI mean it sounds silly, but it's so true. Be grateful for your blessings.\n\n![[https://x.com/BrianRoemmele/status/1950002009945305286](https://x.com/BrianRoemmele/status/1950002009945305286)](https://miro.medium.com/1*Q0xW4ttr7hPiUEVHMoegaw.png)\n\nSo cool.\n\n![[https://youtu.be/StTKHskg5Tg](https://youtu.be/StTKHskg5Tg)](https://miro.medium.com/1*ZcDw4At3XXQaPHZXz7GZoA.png)\n\nI also listened to this fascinating conversation which is worth exploring.\n\nThe most insightful part of this interview reveals that **commercial banks, not central banks or governments, are the primary creators of money** by generating new purchasing power \"out of nothing\" when they issue loans. This hidden process of \"bank credit creation\" profoundly impacts the economy, with lending for productive business investment fostering sustainable growth and prosperity, while lending for unproductive asset purchases (like real estate) drives asset bubbles, financial crises, and the concentration of power and wealth.\n\nBut yeah, in general I've just been in the lab today. Crafting myself, improving, enjoying each moment. Thinking how I will improve this freaking book I NEED to publish. I'm going to do so before the end of the year. Check it. Mark it. Bet on it on Polymarket (jk don't do that and also the market doesn't actually exist)\n\n![We are going to need to take this from 24 to 72 pages. Let's get it.](https://miro.medium.com/1*twlxUrSRBsrSoh9vymU1Lg.png)\n\nMy idea to hit the page count KDP requires is to write another section in the book for 10–18 years old and then a section for 18 year olds and up.\n\n7/28/25\n\nConor Jay Chepenik",
  "wordCount": 253,
  "readingTime": 1.5047169811320755,
  "claps": 0,
  "voters": 0
}