{
  "id": "0b463c0f2e0c",
  "title": "Day 1240",
  "createdAt": "2025-08-14 02:54:32",
  "tags": [
    "get",
    "better",
    "every",
    "day",
    "life-is-a-gift"
  ],
  "url": "https://chepenikconor.medium.com/day-1240-0b463c0f2e0c",
  "content": "# Day 1240\n\nWent through a bunch of old photos today and it's insane how fast time moves the older you get. I guess it makes sense. When you've experienced more life, each year feels shorter in comparison. One year to a 1-year-old is their whole life. One year to a 28-year-old is just 1/28th of their life. By the time I'm 50, I can only imagine it will be flying.\n\nHow much life has changed. From having a newborn, no job, and no idea what the hell I was going to do...to now having a second child on the way and my baby boy is almost here, a job in the field I love, and deep gratitude to God for making it all possible.\n\nI read a chapter from a Bible-type book, _52 Weeks Through the Bible Devotional_, and it said that God answers every prayer. The point was you might not like His answer, but He will answer if you ask. The thing is, most people don't ask.\n\nPowerful stuff. We so often suffer in silence when He is always listening.\n\nSo God, I ask this: the courage to do what is right when it's hard. The tenacity to live a long, meaningful life and help educate others about Bitcoin. The strength to lead my family. The wisdom to stick to the goals I set. And the willpower to complete a 72-hour fast next week in honor of You.\n\n> **Our Father, who reigns over all creation,**\nHallowed be Your name, above every idol and every coin (even my favorite orange one).\n\n> **Let Your kingdom come,**\nAnd let Your will be done - \nIn our hearts, in our homes,\nAnd across the network of nations,\nAs perfectly as it is in heaven.\n\n> **Give us this day our honest bread,**\nNot inflated, not stolen,\nBut earned through work that serves and honors You.\n\n> **Forgive us our debts of greed and pride,**\nAs we forgive those who have trespassed against our trust.\n\n> **Lead us not into the temptations**\nOf easy money and dishonest gain,\nBut deliver us from the corruption that enslaves men.\n\n> For Yours is the true store of value,\nThe incorruptible ledger,\nThe unbreakable truth,\nForever and ever. Amen.\n\nAt the end of the day God gave you free will so the ball is still in your court. What \"they\" don't want you to know, they being Satan of course..., is that you can simply ask the Alpha & Omega for help. If you do so He will improve your life in ways you can't imagine.\n\nI will end this with a call to action that American Hodl shared on his Nostr vlogs:\n\n![[https://primal.net/e/nevent1qqs2g20nwsmdh68a33dy89ppwtsy068ndauwf8989wnunzls0k3y5fst2weme](https://primal.net/e/nevent1qqs2g20nwsmdh68a33dy89ppwtsy068ndauwf8989wnunzls0k3y5fst2weme)](https://miro.medium.com/1*C5E38T1offEAixFPFqmVmQ.png)\n\nWorth watching the whole vlog.\n\n8/13/25\n\nConor Jay Chepenik",
  "wordCount": 458,
  "readingTime": 1.9283018867924528,
  "claps": 0,
  "voters": 0
}