{
  "id": "0b838edc258c",
  "title": "Day 1275",
  "createdAt": "2025-09-17 21:15:13",
  "tags": [
    "ai",
    "food",
    "for",
    "thought",
    "exciting-times"
  ],
  "url": "https://chepenikconor.medium.com/day-1275-0b838edc258c",
  "content": "# Day 1275\n\n![[https://x.com/mattppal/status/1966353657512997369](https://x.com/mattppal/status/1966353657512997369)](https://miro.medium.com/1*X5REK1ucM5tWBk9_2Gx6uw.png)\n\n![Generated with AI... naturally](https://miro.medium.com/1*4NLGJ5J7AbhAFLSxUd24IA.png)\n\nI think showing others how to use these tools will be one of the biggest opportunities ahead in the next 5 years. Technology is moving so fast that most people feel left behind. I suspect Matt is right, serious opportunity lies in breaking technology down simply to help the masses use it.\n\nFor example, let's say I asked someone to:\n\n- Take a popular meme format\n\n- Add some funny text\n\n- Then return that meme in a retro 8-bit style\n\nI suspect most people most people wouldn't know where to begin. But with today's tools, you don't need to be a Photoshop wizard or a coder. You just need to know how to _ask AI_. It can even help with the copy to make the meme even funnier.\n\n**Quick Guide: How to Meme in 8-Bit**\n\n1. **Pick a Meme Template**\n Start with a classic image, something recognizable like the \"I should do {insert idea here} cat.\"\n\n2. **Add Your Text**\n Decide on the caption. Keep it punchy and funny, something that goes well on a meme. If you don't know exactly what to add, share the meme format with the AI and then prompt it with something like \"Based on that meme format what would be some funny text to add? Here is what I am thinking _**{insert your ideas}**_. Now give me 3 ideas for text I could add to this meme.\n\n3. **Style the Output**\n Instead of manually editing, describe the style you want in plain English. For example: _\"Render this meme but as an 8-bit retro Mario-style pixel art meme.\"_\n\n4. **Share the Magic**\n What used to take hours of editing is now just a few sentences away.\n\nI typically use ChatGPT for this, but Gemini and Grok work too. Claude is great for the ideation part, though it doesn't have image generation yet.\n\nIt is clear we are entering a new era where natural language is becoming the de facto way to write software. You describe what you want in English (or any language), and the machine translates it into machine-readable instructions.\n\nThat means there's going to be _a lot of Alpha_ in simply knowing how to talk to the tools. The edge is no longer in writing code line by line when AI is getting exponentially better at doing so, it's in knowing how to break down an idea into clear prompts that unlock the power of the machine.\n\nThe future belongs to those who can bridge complex technology and everyday people. Those who can explain, guide, and make these tools useful will shape what comes next.\n\nExciting time to be building. I'm looking forward to working on ways to break down complex topics into accessible ones.\n\n9/17/25\n\nConor Jay Chepenik",
  "wordCount": 457,
  "readingTime": 2.107861635220126,
  "claps": 0,
  "voters": 0
}