{
  "id": "0d33c1d85193",
  "title": "Day 1209",
  "createdAt": "2025-07-14 01:40:01",
  "tags": [
    "ignore",
    "the",
    "bots",
    "glory-be-to-god",
    "our-father"
  ],
  "url": "https://chepenikconor.medium.com/day-1209-0d33c1d85193",
  "content": "# Day 1209\n\nLately, I've been reflecting on co-sleeping with my little girl and I'm grateful we do it. She's a snuggler just like her dad. My wife, not so much on the cuddle train. But watching my lil stacker drift alseep is pure comedy. That same smirk I have and her little wiggles. I'll note, my wife handles bedtime more often than I do, but getting to crash next to the people I love most? It's special.\n\nIt helps her too, I believe. Falling asleep sandwiched between Mom and Dad makes her feel secure, wrapped in love. Yeah, it gets rough sometimes, she fusses, kicks, the usual chaos a two year old brings, but overall she knows she's got us. We are very lucky to have family nearby so my wife and I can still have date nights, something I understand people far away from family don't have. It makes me want to raise my children to really understand the value of staying close by to those you love.\n\nI do get why some folks skip co-sleeping, it's not for everyone. But man nothing beats waking up next to my loved ones.\n\nPretty sure for millennia, co-sleeping was the norm. Only in our \"modern\" era did we flip the script. It's not black and white; both sides have pros. But when they are this tiny I believe co-sleeping's is the right thing to do. That way, they don't feel abandoned when they cry out in the night. Just pure, instinctive connection. Of course the question remains when will she decide it's time to sleep in her own bed most nights? Hopefully before 18 hahahahhaha.\n\nI'm so lucky to have a family. If you can start one, anon, I encourage you to do so. There is plenty of brain rot, psy-op, AI slop all over social media timelines telling you why you shouldn't. See below for a great example.\n\n![[https://x.com/iamgingertrash/status/1943376304017150209](https://x.com/iamgingertrash/status/1943376304017150209)](https://miro.medium.com/1*EuYVtTKGbbi8HD9yZXI2ug.png)\n\nIgnore these bots. It's so great having a family. It's the best thing I ever did and I thank God for allowing me to do so. Our Father was kind enough to make me a father. For that I am forever grateful.\n\nAmen.\n\n7/13/25\n\nConor Jay Chepenik",
  "wordCount": 370,
  "readingTime": 1.5962264150943395,
  "claps": 0,
  "voters": 0
}