{
  "id": "0e21a1617d96",
  "title": "Day 1373",
  "createdAt": "2025-12-24 15:58:52",
  "tags": [
    "blessed",
    "to",
    "be",
    "a",
    "parent"
  ],
  "url": "https://chepenikconor.medium.com/day-1373-0e21a1617d96",
  "content": "# Day 1373\n\nThe lion still feels like buns despite going to bed super early last night and taking a warm shower this morning. But after the shower, I got to see my son wake up and grin ear to ear. Watching my little man smile brings me a kind of joy that is hard to accurately describe with words. Little buddy is two months old today, and somehow it already feels like he's grown so much in the short time he's been alive outside his mother's womb.\n\nLately, I've been thinking a lot about what it actually means to be a good parent. Not perfect. Not calm all the time. Just present and intentional. I know the hard parts are coming. The tears. The frustration. The moments where he wants something he can't have and doesn't yet have the words, patience, or wiring to understand why. And I'm starting to realize that those moments aren't failures. They're part of the work.\n\nKids feel everything at full volume. Their brains are still under construction, and self-regulation is something they borrow from us before they can do it on their own. When they cry or melt down, it's usually not manipulation or being spoiled. It's their nervous system trying to make sense of the world. My job isn't to shut that down or rush it away. It's to hold the boundary and still stay close. \"No, not right now\" can coexist with \"I see how upset you are.\"\n\nLove doesn't disappear just because a rule stays firm. I want my children to know that their emotions are allowed. That frustration doesn't threaten connection. That anger doesn't cost them love. If they cry one day because they can't have the cookie before dinner, I hope I remember that letting them feel that disappointment is part of learning how to move through it. Easier said than done of course. My gosh how easy it is to blow up yourself sometimes after a long day...so I write this as a reminder to stay calm, stay nearby, and be the steady nervous system in the room. Not fixing it. Not shaming it. Just being there for my two little ones until the wave of frustration passes over them.\n\nThat's how kids learn that feelings are temporary. That they don't need to be afraid of them. That home is safe even when things feel hard. Of course, Sloan is already sneaking chocolate, dragging her stepping stool over like she's planning a heist. Catching her quietly eating Hershey's under the table tests every ounce of restraint I have. It's hard not to snap in those moments. We definitely have our hands full with her. But Ryder, the little man, is only two months old, smiling up at me like the world is still simple and good. One day it won't feel so simple for him. And when that day comes, I hope I'm the kind of Father who doesn't demand silence or obedience at the cost of emotional honesty. I want to raise children who feel deeply, know they are secure, and trust that even in their hardest moments, they are still loved unconditionally.\n\nThat must start now. With my presence. With more patience. With learning to sit with discomfort, mine included. And for today, it started with a smile, a tired dad, and the quiet understanding that this little human is teaching me just as much as I'll ever teach him.\n\n![The Lion & His Son (8-bit edition)](https://miro.medium.com/1*10jB0XS_cXUsKNh_sJan6w.png)\n\n12/24/25\n\nConor Jay Chepenik",
  "wordCount": 579,
  "readingTime": 2.384905660377359,
  "claps": 0,
  "voters": 0
}