{
  "id": "10075519ee28",
  "title": "Day 1189",
  "createdAt": "2025-06-24 03:01:44",
  "tags": [
    "life",
    "is",
    "short",
    "but",
    "incredible"
  ],
  "url": "https://chepenikconor.medium.com/day-1189-10075519ee28",
  "content": "# Day 1189\n\n![[https://x.com/BasedTorba/status/1937259621099667983](https://x.com/BasedTorba/status/1937259621099667983)](https://miro.medium.com/1*oaM2rgccEdBnph7Zrxd8tQ.png)\n\nMan, this is so true. What an important thing to remember when we're wasting time doing some BS we should not be doing. Like scrolling Twitter...which I literally just did for 45 minutes for no good reason. I guess I found this post, so in the end maybe there was a reason.\n\nWhat I was really doing is procrastinating. I didn't have anything to say. That's okay. My words will be gone. The servers these keystrokes reside on will be wiped at some point. I hope my family remembers me for a long time, but I couldn't name my great-great-grandfather and my great-great-grandchildren probably won't remember my first name either.\n\nBut I hope you're looking down from heaven smiling at me, Grandma Chepenik & Phelps :)\n\nI'm re-reading _Meditations_ by Mr. Aurelius right now, and some of it seems like s*** someone would write in a personal journal i.e. irrelevant to me (and it's exactly what that book is, if I understand it correctly). But some of it is super profound.\n\nSuch is life. Except the modern equivalent is posting some banger tweets... and then some incoherent ones lol.\n\nAnyways, I hear my daughter waking up from being put to sleep so I'm going to go get her and put her in our bed...Did that and now I'm ready to go to bed myself.\n\nSo I'll leave you with this, dear reader, but really this is more for myself:\n\nAccept the things you cannot change, embrace the things you can change and care enough about to do so, and try to spend less time scrolling brainrot algorithms because they make you do the exact opposite of this.\n\n![[https://x.com/ConorChepenik/status/1937345078843822343](https://x.com/ConorChepenik/status/1937345078843822343)](https://miro.medium.com/1*d8jEIWDc2K_Le7HvoudaCg.png)\n\n6/23/25\n\nConor Jay Chepenik",
  "wordCount": 288,
  "readingTime": 1.470125786163522,
  "claps": 0,
  "voters": 0
}