{
  "id": "1111daaa483e",
  "title": "Day 1253",
  "createdAt": "2025-08-27 03:53:08",
  "tags": [
    "you",
    "can",
    "just",
    "train",
    "ai"
  ],
  "url": "https://chepenikconor.medium.com/day-1253-1111daaa483e",
  "content": "# Day 1253\n\nGot member access to [Readmultiplex](http://readmultiplex.com) today and I started training an LLM on all my Medium data. There is an article on Multiplex about how to train an LLM on your X data that convinced me to sign up. However, I'm waiting for my X data to be sent to me so I decided why not use my Medium data. It took a lot of troubleshooting with AI, to talk to a local AI on my machine, which is both funny & meta, but so freaking cool. It is amazing how powerful these tools are and I'm constantly blown away by them.\n\n![Waiting for my model to finish training](https://miro.medium.com/1*O3G2rv8Cf7MxEVHF-clJ3g.png)\n\nWhile my model crunches away, let's talk Jevons Paradox. Every time I get something working, I have this \"holy crap\" moment where I realize I'm standing on the shoulders of some giant invisible robot. Literally, finely crafted sand & electrons computing 0s & 1s to make a human clap 😂\n\nIt's one of technology's best ironies: make something more efficient, and we don't conserve it, we binge on it. William Stanley Jevons noticed this with coal engines back in the 1800s. More efficient engines didn't reduce coal use. They made coal so useful that people burned way more of it.\n\nSound familiar? That's AI right now. Models keep getting faster, cheaper, and smarter. Instead of a small bump in use, we're seeing an avalanche. AI tutors for every student. Personalized medicine for every patient. Writing buddies for every wannabe Ayn Rand.\n\nThe paradox says AI won't just replace existing jobs, it'll create whole new ones we can't even picture yet. The abundance of cheap intelligence makes things economically viable that were once pure science fiction.\n\nSo here we are, staring at an infinite digital frontier. Equal parts thrilling and a little dizzying. Like opening the hood on your laptop and realizing you're basically holding the digital equivalent of a rocket engine.\n\nWhat you do with the engine is up to you. Stay curious, stay willing to learn, stay optimistic about the future and you will have an amazing life.\n\nI hoped to share some insights from my local chepGPT but training is taking awhile so more on that tomorrow. In the meantime, I will confirm I am so freaking excited for what the future has in store. Life is a blessing, deep gratitude to the Lord for giving me my life 🙏\n\n8/26/25\n\nConor Jay Chepenik",
  "wordCount": 400,
  "readingTime": 1.709433962264151,
  "claps": 0,
  "voters": 0
}