{
  "id": "12b9adfa5593",
  "title": "Day 1295",
  "createdAt": "2025-10-08 03:58:33",
  "tags": [
    "love"
  ],
  "url": "https://chepenikconor.medium.com/day-1295-12b9adfa5593",
  "content": "# Day 1295\n\nTo love something, is to labor for it. I mean just think about it. God, the Alpha & the Omega, literally sent his Son, Jesus Christ, down to earth to go through excruciating pain just so He could save humanity. I mean if that is not loving something I don't know what is. It's quite the paradox.\n\nTonight I was putting my daughter to sleep, growing so impatient. It took over an hour and all I wanted to do was go on a walk and listen to my podcasts. Why could this two year old not fall asleep quicker so Daddy can get in his 40 hours of Bitcoin Podcasts a week? #40hpw Welp, she finally did fall asleep and after my long walk I decided to read the intro to [GEB by Douglas Hofstadter](https://amzn.to/4qi3kqP). Interesting intro, but one line stood out to me in particular when he described working on something for 40 hours straight and the next sentence read something like \"That's love for you\". I don't even know if I paraphrased that exactly as it was written, but you my dear reader, should get the point.\n\nWe sacrifice for the things we love. I recall sitting in Sloan's bed tonight thinking what is wrong with me. This little girl is my everything. I would kill for her, I would sacrifice my own life if it meant saving hers. I love that girl more than anything else on this world and I tell her everyday that I thank God for bringing her into my life. And it is all true! I also pray \"Jesus Christ, Son of God, have mercy on me, a sinner\" because despite loving that girl with every fiber of my being I get annoyed because I can't go for a walk or play video games, or watch sports ball, or do whatever stupid s*** I want to do after I get her to sleep.\n\nMan does it feel good to write this out. To reflect how silly our brains can be. Silly might not even be the right word. Which leads me to think I should delete it rather than pontifacate on about why the word I articulated originally could have been replaced with a more accurate one. I guess it's to show - well that this is the Binmucker's Medium and I'll write whatever the hell I want because the most dear reader is myself - but also because we are fascinating creatures. Our minds work in weird ways and when you sit back and observe you see how stupid it can be, but also how brilliant it can be.\n\nOur most scarce asset on this planet is time. It's even scarcer than Bitcoin and only the Lord himself can give us more of it if he wishes. I can reflect and realize that one day when I'm much older I would give almost anything to go back in time and put my daughter to sleep again. Before I know it she will be a full grown human who no longer needs her Dada to put her to sleep. Yet, in the moments I was thinking about listening to a freaking podcast lol. Oh the human condition. Why must it take pain to learn these lessons. I guess I will give thanks that my \"painful\" lesson was some self reflection rather than a crucifixion.\n\nAnyways, it is late, but I am proud of myself. Proud that I had the foresight to remember no matter how much Bitcoin I stack, how many steps or podcasts I crush, that at the end of the day the things I cherish most in this world are my family. One day I will meet my creator when I pass on and I want to shake his hand and thank him for all the blessings he has given me.\n\n![If it weren't for God there is no way I could be proud of myself :)](https://miro.medium.com/1*ZPPSJNTpP_yUlEBeyqNwDg.png)\n\n10/7/25\n\nConor Jay Chepenik",
  "wordCount": 646,
  "readingTime": 2.637735849056604,
  "claps": 0,
  "voters": 0
}