{
  "id": "14e6cd77369e",
  "title": "Day 1286",
  "createdAt": "2025-09-29 03:59:30",
  "tags": [
    "lol"
  ],
  "url": "https://chepenikconor.medium.com/day-1286-14e6cd77369e",
  "content": "# Day 1286\n\n**You Can Just Learn Things From Other People**\n\n![[https://youtu.be/rIQ3t1ixUIE](https://youtu.be/rIQ3t1ixUIE)](https://miro.medium.com/1*HqJixUwoiruRwS7MTlL0gg.png)\n\nI watched this YouTube video today with a title that reminded of what a typical high-school football captain would tweet out from his burner account. Something like: F*CKMAX YOUR LIFE OR DIE TRYING. It worked. I clicked.\n\nThe comments were elite. The delivery was bang on. The core message was simple and right: stop living on borrowed approval. Stop outsourcing your choices to the herd. If your friends drain you, leave. If your relationship feels like a trap built from sunk costs, end it. If your job is grinding your spirit into dust, scheme your exit and learn on the fly. If you are stuck in your head, get back into your body and take action. That was the drumbeat of the entire video. Choose. Move. Own the consequences.\n\n![](https://miro.medium.com/1*j7jmHQDNt98icVvcIp0nkA.png)\n\nA Greek word sits under all of this. **Thumos**. Spirited will. Righteous fire. The part of you that rises to defend your values and demands to be the one who chooses. When thumos is weak, you wait. When thumos is awake, you decide.\n\nIt reminded me of one of my favorite books: Ayn Rand's _The Fountainhead._ If you have not read it, it's about Howard Roark who is an architect who refuses to trade his vision for applause. Peter Keating, one of Roark's college acquaintances, is his opposite. Keating is gifted at pleasing others and, in the process, hollows himself out.\n\nThere is a scene early on that lives rent-free in my head. Keating has two impressive paths in front of him. He can take a prestigious scholarship or a sought-after job at a fashionable firm. He corners Roark and begs for advice. Roark refuses to carry the weight for him. He says, \"If you want my advice, Peter, you have made a mistake by asking.\" Then he adds, \"Never ask people. Not about your work.\" He pushes the decision back across the table. What do you want. Not what will impress your mother (Peter is a Mama's boy). Not what the newspapers will praise. Not what will feel safe tonight and rotten tomorrow morning.\n\nKeating cannot stand that kind of mirror. He is hungry for permission, not truth. He chooses the path that flatters him in public. It looks like momentum. It is actually drift. Rand makes the point in her book with ruthless clarity. Every time Keating dodges a real choice, he must find a louder crowd to hide the echo.\n\nThe video I watched today is more or less the street version monologue of that scene. f your friend group leaves you feeling smaller, moonwalk out of it. If your partner's presence shrinks your spine, stop mistaking sunk cost for love. If your job turns you into a ghost, stop chanting security like a prayer and act. There is risk. There are consequences. There is also your life.\n\nRoark's rule is the adult version of F*ck-Max. You decide. You carry it. You learn. You adjust. Repeat. Stop waiting for the perfect time, act now.\n\nThe rant hammered a point I needed to hear again. Waiting is not patience. Waiting is sedation when it becomes your default. Waiting for your ex to come back. Waiting for a manager to notice you. Waiting for the market to crown you. Waiting turns you into a non-player character in your own story. You stop speaking first. You stop inviting anyone out. You stop shipping. You sit there and call it strategy. Now there are things that do demand patience, action, and discipline. Stacking sats is one of them. Holding through volatility takes conviction, not fumbling your bag at the bottom only to fomo back in at the top. That is not passive waiting, it is active endurance. That needs to be clarified so the simple point is understand, do not confuse waiting with strategy. Do not mistake patience for sedation. Do not seek validation from the outside. The only validation worth chasing in this life comes from within.\n\nIt's a bit like a Naval quote, that like the Fountainhead, lives rent free in my head. To paraphrase because I don't feel like finding the tweet or podcast he said it on is \"The only true test of life is did you get what you want out of it.\" Happiness is always fleeting on this fallen planet and if you want to attain it one must pass Naval's test.\n\nBack to Rand's novel, what makes me like Roark is that he refused to wait for permission. He would rather fail by his own lights than succeed on terms that require him to fake. That is not teenage rebellion. It is moral hygiene. If you outsource your choices, you outsource your responsibility for the results, and then you cannot learn. You can only blame.\n\n**Security Is Not What You Think**\n\nThe rant goes after a sacred cow: security. Benefits, bi-weekly paychecks, polite misery. The Youtuber was not anti insurance or anti planning, but rather anti worship of safety as a highest value. Men and women both need a baseline of stability. After that, life wants you awake. Security is not a cage you hide inside. Security is the confidence that you can act, adapt, and recover because you are the kind of person who chooses and learns. That is thumos turning into competence.\n\nKeating spends his life trying to buy security by performing versions of himself that others prefer. The bill comes due anyway. Roark buys growth by telling the truth about what he values, which looks risky at first and ends up being the only thing that compounds.\n\n**Practical Advice That Will Be Applied Differently Depending On What YOU Optimize For**\n\n1. **Audit your traps.** List the parts of your life that feel like they shrink you. Friends. Work. Habits. Geography. Cut out the ones that do. It goes back to my post yesterday on the power of subtraction.\n\n2. **Shift from outcomes to actions.** The rant had a great street-level example and lying his way into a bartending job was not the lesson. The lesson is speed to exposure. Get in the environment where the skill lives and let the feedback hit you. Then learn on the fly. That's how the guy in the video landed a bartending job with no experience.\n\n3. **Be careful with self-anesthesia.** Weed, infinite self-help, compulsive rumination, whatever your version is. If it turns effort into something foreign, it is not helping you think. It is helping you not feel. Roark thinks with his hands. He learns by doing. He is not allergic to quiet. He is allergic to fake work.\n\n4. **Do not outsource identity to love or hate.** The video leans into bravado and sometimes cheap shots. That sells. It is not a philosophy. Rand's point is cleaner. Rational egoism is the refusal to trade your mind for approval or resentment. Choose because it is right by your standards, not because it will shock the room.\n\nPhilosophy, in my opinion, is asking questions and really struggling to answer them as best as you can. Of course many different answers can be correct because language is imprecise. I like Rand's because she is not telling you to be loud. She is telling you to be exact about values. Roark's refusal to advise Keating is not coldness. It is respect. He treats Keating like a free mind. He will not steal his decision from him even if Keating is begging for confirmation to be an NPC. The scene repeats through the book in different forms. Keating keeps looking for a way to live without choosing. Roark keeps showing that creation is choice made visible in stone and steel.\n\n\"Never ask people. Not about your work.\" That line is not a ban on counsel. It is a ban on living by proxy. Get facts from anyone. Get standards from yourself.\n\nSo if you feel trapped, change one thing you control today. If the change hurts, good. Pain is information. If the change fails, better. Failure is data you own. Build on it.\n\nI will end today's Medium where the novel begins. Keating asks for advice about his life. Roark hands the question back. That is the move. Take your question back from the crowd. Answer it in your own words. Then put the answer into motion otherwise you are nothing more than an NPC thinkboi, and no one wants to be remembered as an NPC thinkboi.\n\n9/29/25\n\nConor Jay Chepenik",
  "wordCount": 1417,
  "readingTime": 5.730503144654088,
  "claps": 0,
  "voters": 0
}