{
  "id": "1911737841f8",
  "title": "Day 1055",
  "createdAt": "2025-02-10 03:59:15",
  "tags": [
    "fly-eagles-fly",
    "on-the-road",
    "to-victory",
    "super-bowl",
    "champions-2025"
  ],
  "url": "https://chepenikconor.medium.com/day-1055-1911737841f8",
  "content": "# Day 1055\n\nThe Eagles won the super bowl tonight, I had an amazing dinner with my Mum and I even crushed some sprints before Bed. Now I'll leave you guys with this essay which is a first draft for a Bitcoin news article I'm writing:\n\n**Coinbits App: Making Bitcoining Easy**\n\nMost people don't _get_ Bitcoin right away. It's not because they're dumb . It is because **money itself is a weird, broken system** that we're all just used to.\n\nDave was no exception. When he first encountered Bitcoin in 2013, he wasn't thinking about decentralization, censorship resistance, or the future of finance. He was just a guy getting paid for a web design gig , except instead of cash, he got an entire Bitcoin. At the time, it was worth about $600.\n\nLike most early adopters, he didn't _hodl_. The price jumped, he sold, and he walked away thinking he made a solid trade. Now? He laughs at himself for that mistake. But that wasn't the end of his Bitcoin story. It was just the prologue.\n\nToday, Dave is a VP at **[CoinbitsApp](https://coinbits.app/)**, a company on a mission to solve one of Bitcoin's biggest paradoxes: How do you make a censorship-resistant, decentralized protocol feel as easy as Venmo? While most of Silicon Valley chases walled gardens and surveillance capitalism, Coinbits is tackling Bitcoin's biggest usability problems without watering down its core principles. Their approach? **Human-first design**, built by a team with deep experience in gaming, VR, and touch interfaces.\n\n**From Touchscreens to Trustless Money**\n\nBefore diving into Bitcoin full-time, Dave spent years in Silicon Valley working on ways to make technology feel more _real_. He believed user interfaces should engage more than just thumbs and eyeballs. \"People say 'go touch grass' when you're too online, but what if digital spaces actually felt real?\" he says.\n\nThat obsession with intuitive design followed him into Bitcoin. By 2017, the crypto circus was in full swing with ICOs printing money out of thin air, centralized altcoins _cosplaying_ as decentralized, and Bitcoin locked in a civil war over its blocksize.\"Back then, being a Bitcoin maximalist was like defending a burning castle,\" Dave jokes. \"You needed irrational conviction.\" But as the smoke cleared, Bitcoin emerged as the only protocol able to offer sound money for the world. The rest? Well they evolved from innovation theater to memecoins. Which to be fair at least memecoins are honest about what they are.\n\n**Bitcoin's Usability Trap**\n\nBitcoin's greatest strength, its trustless, unbreakable architecture, is also what makes it intimidating for newcomers. Engineers built the plumbing but forgot the faucet. \"Most products get 90% finished by coders before anyone asks, 'Will a human actually use this?'\" Dave explains. The result? **People freeze.** They stress over unit bias (\"I can't afford a whole coin!\") or panic about losing their private keys.\n\nCoinbits is trying to fix this by removing _decision fatigue_. Instead of asking people to \"buy Bitcoin,\" it automates savings through roundups. Link your card, and your spare change automatically flows into Bitcoin: no charts, no market timing, no stress.\n\n\"You don't have to pick between $5 a week or $100 a month. Just live your life and watch your stack grow,\" says Dave. It's the **digital equivalent of a loose change jar**, except instead of fiat rotting in your sock drawer, it's stacking the hardest money in history.\n\n**The Custody Conundrum**\n\nBuying Bitcoin is easy. **Keeping it safe? That's where most people tap out.**\n\n\"Even tech-savvy folks struggle with hardware wallets,\" Dave groans. \"Try explaining seed phrases to someone who doesn't know how to copy and paste on a smartphone.\" That's why most people leave their Bitcoin on exchanges. Not because they want to, but because **self-custody still feels like defusing a bomb with a blindfold on for most who are not familiar with Bitcoin**.\n\nCoinbits is tackling this head-on. While Dave stays tight-lipped on specifics, he teases \"multisig solutions that go beyond today's options.\" Translation? **A way to make self-custody fool-proof without compromising security.** No cryptography PhD required.\n\n**Lightning, AI, and the Death of Ads**\n\nBeyond fixing Bitcoin's onboarding problems, Dave sees something bigger on the horizon: **Bitcoin obliterating the internet's broken economics.**\n\n\"The ad model is a zombie,\" he says. \"Why stalk users when Lightning lets them pay for content directly?\"\n\nImagine AI services charging per query instead of locking you into subscriptions. Imagine bloggers earning sats instead of selling your data to advertisers. When payments become _instant_ and _frictionless_, the internet doesn't need surveillance to function. \"When value flows peer-to-peer, surveillance capitalism dies,\" Dave argues.\n\n**No Magic, Just Momentum**\n\nCoinbits isn't trying to reinvent Bitcoin. They're just making it **easier to use. S**moother onboarding, smarter custody, and a relentless focus on frictionless UX.\n\n_\"Bitcoin's not 'too late' or 'too complicated' - that's just bad design talking,\"_ Dave says. His North Star? **Helping people realize they don't have to understand everything about Bitcoin to start stacking.**\n\nBecause Bitcoin adoption won't be driven by **maximalist sermons** or **technobabble**. It'll happen when someone **links their debit card, forgets about it, and months later realizes they own a slice of the hardest money in history.**\n\n_\"We're not here to make you a Bitcoin expert,\"_ Dave grins. _\"We're here to make you a Bitcoin owner.\"_\n\nAnd sometimes, **owning just a little bit is all it takes to fall all the way down the rabbit hole.**\n\n2/9/25\n\nConor Jay Chepenik",
  "wordCount": 910,
  "readingTime": 3.4339622641509435,
  "claps": 0,
  "voters": 0
}