{
  "id": "1928b47c27e2",
  "title": "Day 981",
  "createdAt": "2024-11-28 02:44:59",
  "tags": [
    "the-bitcoin-cricket-team",
    "sports",
    "bitcoin",
    "cricket",
    "low-time-preference"
  ],
  "url": "https://chepenikconor.medium.com/day-981-1928b47c27e2",
  "content": "# Day 981\n\n**Bowling for Bitcoin: How a Cricket Club Embraced Digital Gold**\n\nSports forge bonds, break boundaries, and unite people in ways that transcend words. Bitcoin, however, isn't like a sports team. It doesn't rely on teamwork in the traditional sense. It's permissionless - a decentralized system where anyone can join or leave freely, without gatekeepers. Yet, in Swan Valley, Western Australia, a cricket club is demonstrating that when Bitcoin's ethos meets cricket's spirit, the result is nothing short of extraordinary.\n\n\"We want to be the first Community Cricket Club that's been transformed into an international franchise all on the back of a Bitcoin standard\" noted Stan, one of the founders of the [Bitcoin Cricket Team](https://bitcoincricketteam.com/). \"Bitcoin has given so much to us, and we see this as a way to give back to the community\"\n\nCricket is deeply rooted in tradition, a game of subtlety and strategy that demands patience and long-term thinking. Players spend years perfecting their skills, and those who train consistently over time often outperform those looking for quick wins. In many ways, it mirrors Bitcoin. As Stan observed, cricket thrives on discipline and perseverance, much like Bitcoin rewards those who adopt a long-term perspective. Those who save in Bitcoin and hold it for the future fare far better than those who trade it in pursuit of short-term fiat gains. Both cricket and Bitcoin emphasize the value of commitment over fleeting opportunities.\n\nThis club, however, isn't just drawing parallels. They're living it. Players are paid in Bitcoin, transactions are settled on the Lightning Network, and the club operates on a Bitcoin-only standard. Stan made it clear this is the Bitcoin Cricket Team - not the Shitcoin Cricket Team.\n\nThe club, a decades-old community organization, had always been driven by volunteers and a love for the game. But Bitcoin offered them a chance to transcend their traditional roots. \"We're a small, traditional club,\" Stan said. \"But Bitcoin offered us a chance to do something bigger - not just for the club, but for the players and the community.\"\n\nThis year marks their first as the Bitcoin Cricket Team, and it's been a year of education and experimentation. \"We're onboarding players and teaching them the fundamentals of Bitcoin,\" Stan said. They partnered with Amber, a local Bitcoin company, to make the transition seamless. \"We're encouraging our players to adopt Bitcoin not just as payment, but as a philosophy. And to incentivize it, we've set our fiat prices higher than Bitcoin payments.\" The club has also committed to hodling every satoshi they earn. Stan noted that \"If Bitcoin becomes what we believe it will, this reserve could fund that growth.\"\n\nThe pairing of cricket and Bitcoin might seem unexpected, but to Stan, it's a perfect fit. Cricket is slow and strategic. Bitcoin's development is the same - it's about long-term thinking, not short-term gratification. The sport's patience-driven culture resonates with Bitcoin's proof-of-work ethos. In the same way one does not become a professional cricketer overnight, and Bitcoin's value doesn't emerge from nothing. Both require effort, conviction, and time.\n\nBut Stan and his team aren't just bringing Bitcoin into cricket. They're also introducing Bitcoiners to cricket. \"Cricket is such a tradition-rich sport. What better way to connect the old with the new?\" Stan asked.\n\nThe Bitcoin Cricket Team is building more than just a bridge between two worlds. They're laying the groundwork for a circular Bitcoin economy. \"We accept Bitcoin for match fees, beers, and fundraising,\" Stan said. \"We even pay our coach and players in Bitcoin.\"\n\nStan has a vision that extends beyond just the cricket team. He wants the Bitcoin Cricket Team to set an example by onboarding hundreds of people to Bitcoin and demonstrating its power. Stan believes that if they can achieve this, it could inspire other cricket teams around the world to follow suit.\n\nThe Bitcoin Cricket Team is not simply dreaming big - they are taking bold action. Rather than selling their Bitcoin, they are playing the long game, much like the strategy required in the sport of cricket.\n\nCricket and Bitcoin - one, a centuries-old game of patience and strategy; the other, a modern innovation rooted in freedom and resilience. Together, they're showing how tradition and technology can work in harmony.\n\n![](https://miro.medium.com/1*kgosbp-ZdTksfuf2wDcVHg.png)\n\n11/27/24\n\nConor Jay Chepenik",
  "wordCount": 724,
  "readingTime": 2.9320754716981132,
  "claps": 0,
  "voters": 0
}