{
  "id": "1ac2a2c74447",
  "title": "Day 1298",
  "createdAt": "2025-10-11 03:34:54",
  "tags": [
    "dont",
    "trade",
    "perps",
    "on",
    "hyperliquid"
  ],
  "url": "https://chepenikconor.medium.com/day-1298-1ac2a2c74447",
  "content": "# Day 1298\n\nCrazy day in the markets. Hahahahahaha. I still think we are going much higher (Bitcoin only doubtful on alts) before the end of the year.\n\n![[https://x.com/hodltarzan/status/1976794321199546642?s=42](https://x.com/hodltarzan/status/1976794321199546642?s=42)](https://miro.medium.com/1*v1mudKm0SmnTvfa5CGWGEw.png)\n\n![](https://miro.medium.com/1*e2QljSfnBVH9bDH7rPoL7A.png)\n\n![[https://x.com/ConorChepenik/status/1976847132113224006](https://x.com/ConorChepenik/status/1976847132113224006)](https://miro.medium.com/1*-gJJujp9qMQURgSygdu-Mg.png)\n\n![[https://x.com/ConorChepenik/status/1976847652177559820](https://x.com/ConorChepenik/status/1976847652177559820)](https://miro.medium.com/1*xo7d1LgX641QnGW4rMhqtg.png)\n\nIn other news, I watched a _Black Mirror_ episode tonight titled **\"Eulogy\"**. Even though it was a sad story, it hit me hard in a good way by reminding me why I love film.\n\nBack in undergrad I was film and media major. I believed in stories and I went into debt so I could _learn_ to tell them. It was worth it, because even in my job now which is Bitcoin related, telling stories is everything. But tonight's episode reminded me just _how powerful_ a story can be.\n\nThe tl;dw of the episode is a man with a blocked memory of an ex-girlfriend receives tech that lets him enter old photos, confront regrets, and reclaim lost emotional detail to deliver a eulogy he could never write. The episode is a gut-punch about memory, love, and letting go.\n\nLike I said, it was **sad, like really sad**. There's grief, longing, and a lot of regret from this dude who fumbled the love his life and spent 15 years sulking about it. But I found in it something else: a reminder to _live_, to not stay stuck in what we wish we had or did. Dwelling only makes a cage around the present.\n\nYes, too much TV is poison. But when stories touch the dark corners of your heart, you feel alive. You see what you've buried or ignored. You're reminded that life, though messy and painful, has meaning.\n\nLife is not a TV show, but sometimes, when the cinematography is right and the actors are bearing their souls, it sure feels like one. We become enthralled. We see ourselves in those frames.\n\nSo tonight, _Eulogy_ made me grateful for memory, for regret, but more for the chance to move. To tell my stories. To live.\n\nWas also a nice break from the little screen where people on Twitter are freaking out about this dip. Since most of my networth is in spot I felt pretty good. I even bought the dip and am enjoying 1–2 dollars of profit on my 100 dollar buy lol.\n\n![[https://x.com/ConorChepenik/status/1976852280340300007](https://x.com/ConorChepenik/status/1976852280340300007)](https://miro.medium.com/1*cFKIHb8LvZFrqT7fh-hs2g.png)\n\n10/10/25\n\nConor Jay Chepenik",
  "wordCount": 377,
  "readingTime": 2.2559748427672957,
  "claps": 0,
  "voters": 0
}