{
  "id": "1c65efb4f89d",
  "title": "Day 1380",
  "createdAt": "2026-01-01 02:25:51",
  "tags": [
    "new-year",
    "new-me",
    "jk"
  ],
  "url": "https://chepenikconor.medium.com/day-1380-1c65efb4f89d",
  "content": "# Day 1380\n\nLast Day of 2025 and the calendar year demands an audit. Not really, but it feels like the right thing to do now that December 31st has arrived. The culture expects a ledger of what one produced and what one will produce next. Though it feels a bit like this ritual treats life as a manufacturing process with annual quotas.\n\nI could comply, and maybe I will with some humble brags because who doesn't love flexing their Ws online. There's a list available, with projects shipped, milestones hit, & small victories in various arenas. But assembling it reveals something the goal-setting industry doesn't advertise: the outcomes rarely match the inputs.\n\nFor example, I did have \"publish a book\" on a list somewhere. Pretty sure I posted about it on X last year. Though what I pictured was a novel, something with chapters and narrative arc. What shipped was a Bitcoin coloring book for kids. The goal technically got checked, but the execution bore no resemblance to the vision. This is supposed to be a failure of planning, but it doesn't feel like one because [I am proud of my Bitcoin Coloring Book.](https://bitcoincoloring.com/)\n\nI also coached two flag football teams this year as well. One won a championship, the other took second. On January 1st, 2025, coaching wasn't a New Years Resolution. It just emerged because I got asked to do it and was told I would get paid 2 grand. So I gladly did it, and coaching was awesome! Do recommend if you get the chance anon and those young kids taught me the hilarious phrase \"Put the fries in the bag little bro\". Still makes me laugh hearing it today.\n\n![Put the fries in the bag lil bro](https://miro.medium.com/1*2NMHdidWTapfuQErboCJ9A.png)\n\nFinally, I had another child. That was 100 percent at the top of the list this year for accomplishments. But, this is the pattern the annual review can often obscure. The things that mattered weren't downstream of December/January declarations. They were downstream of showing up, repeatedly, to whatever was actually in front of me. The pressure to set 2026 targets implies one is not already in motion, that without stated objectives nothing happens. The classic \"this year wasn't my year, but just wait this next year I will fix all that\". The opposite is often true. Why start all your goals because the year on the calendar has changed? I was moving before I articulated direction and I'll keep moving after.\n\nGoals can impose artificial finish lines on processes that are already working. Writing every day isn't a goal for me. It's what I do because I'm a writer. Calling that an achievement misses the point; continuation isn't accomplishment, it's just a way for me to get better at something I already enjoy doing.\n\nHere's the real insight underneath the anti-goals posture: I can't control most of it. The year happened to me as much as I happened to it. The coloring book wasn't the novel. The flag football championships weren't planned. Getting a son was a blessing from God. The map rarely matched the territory, but the territory was beautiful anyways.\n\nPresence isn't a productivity hack. It's an admission that the audit is theater. The year didn't need a scorecard to happen, and neither does the next one...and yet here I am, keeping score. Until next year, my dear anon.\n\n![2026 is almost here](https://miro.medium.com/1*7_hiffZXxWjPP4ftk5qjeQ.png)\n\n12/31/25\n\nConor Jay Chepenik",
  "wordCount": 560,
  "readingTime": 2.4965408805031446,
  "claps": 0,
  "voters": 0
}