{
  "id": "1d17d172ea44",
  "title": "Day 997",
  "createdAt": "2024-12-14 03:21:48",
  "tags": [
    "social-media-strategy",
    "lol"
  ],
  "url": "https://chepenikconor.medium.com/day-997-1d17d172ea44",
  "content": "# Day 997\n\nI posted this on LinkedIn last week and it got over 100k views. It's funny that most of my LinkedIn content is just screen grabs from X(Twitter) that seem to do well on corporate social media.\n\n![[https://www.linkedin.com/posts/conorchepenik_two-ways-to-look-at-this-1-yes-bitcoin-activity-7270919953355096064-fJJI?utm_source=share&utm_medium=member_desktop](https://www.linkedin.com/posts/conorchepenik_two-ways-to-look-at-this-1-yes-bitcoin-activity-7270919953355096064-fJJI?utm_source=share&utm_medium=member_desktop)](https://miro.medium.com/1*xoZQzI43Y0GbOl364Dy6NQ.png)\n\n![](https://miro.medium.com/1*T3ay6mlGoR7eWozSLtsUMQ.png)\n\n**The lesson?** Engaging content that prompts comments has a significantly larger impact on algorithms than mere likes. Cross-posting from one platform to another can be a smart strategy for increasing visibility. It's gratifying to see your content reach a wide audience, but as I reflect, these lessons can seem somewhat superficial.\n\nLikes and views don't translate into tangible value in real life. You can't walk into a store and say, \"I'll take that ice cream, courtesy of my 100,000 views.\" Zaps on Nostr though might be a different story 👀  To be fair, most grocery stores don't accept bitcoin yet, but I could trade the BTC for dollars then go buy some ice cream.\n\nI'm bullish on the idea of sound money making social media better. Of opening up value 4 value tipping. It will change social media to incentivize more signal and less clickbait, engagement farming, bulls***. No one is zapping that garbage, but content that is great will be rewarded. I also want to remind myself to write because I like doing so. The likes, views, and other metrics are not that important. Most of us want to monetize ourself online, and I am all for it. I just want to see it done more with zaps than I do with getting enough eye balls to sell a product. Though if it was product I loved I would happily sell it.\n\nI guess that's the real lesson. If I do grow a big enough following don't shill bulls*** I wouldn't use. Only shill products I care about. Nothing against Datadog, they offer a great monitoring platform, but when I worked there I didn't feel passionate about selling it. If anything I thought it was kind of creepy how much data companies collect from us and how easy monitoring solutions make it. It wasn't until I found a job that allows me to sell BTC and BTC adjacent products I truly fell in love with my job. Makes sense. If you don't believe in the thing you are selling don't sell it.\n\nYea that's a better lesson than hAcKInG ThE AlGoRiThImS. Though it doesn't hurt to learn. Competitive advantages are great. No problems learning about them.\n\nAs I proofread my Medium tonight I realized that ending this with the former paragraph is an abrupt way to end this essay so instead I will end it with a recent tweet that cracked me. Here I go cross posting from other platforms again!\n\n![[https://x.com/BitPaine/status/1867666981970964856](https://x.com/BitPaine/status/1867666981970964856)](https://miro.medium.com/1*tETOL6duXhLeGMSDOf_7Ww.png)\n\n12/13/24\n\nConor Jay Chepenik",
  "wordCount": 455,
  "readingTime": 2.266981132075472,
  "claps": 0,
  "voters": 0
}