{
  "id": "238e175a4b8e",
  "title": "Day 980",
  "createdAt": "2024-11-27 04:31:12",
  "tags": [
    "let",
    "us",
    "get",
    "shit",
    "done"
  ],
  "url": "https://chepenikconor.medium.com/day-980-238e175a4b8e",
  "content": "# Day 980\n\nToday, as I drove from Southwest Florida to Northeast Florida, I listened to the President of Argentina, Javier Milei, chat with Lex Fridman.\n\n![[https://x.com/lexfridman/status/1858954286329458815](https://x.com/lexfridman/status/1858954286329458815)](https://miro.medium.com/1*0w-ycv4WSrkJyd9KNuPILQ.png)\n\nIt was a fascinating conversation, though admittedly, it started a bit slow. That might just be because I usually listen at 2x speed, and dropping to 1x speed for the sake of others felt like an eternity.\n\nOverall, I found myself agreeing with much of what Milei said. It amazed me how seamlessly AI tools translated the conversation from Spanish into English. These tools are becoming incredibly useful.\n\nOne of my favorite points from this interview was Milei's analogy: if you're stranded on an island with a million dollars, it does you no good. While he didn't explicitly say this, I'd add that if it's paper money, it might at least make decent kindling - but I digress. Milei went on to highlight how the previous government had been manipulating poverty statistics, noting that people might technically have \"money,\" but in many places, it's effectively worthless because the stores have no goods to sell.\n\nThis insight struck me: without a market, money is meaningless. It's such a simple yet profound truth. Too often, we confuse symbols for reality - the menu for the meal, the map for the territory, the objective for the outcome. Stop doing this. Let it be know that reminder is more for myself than it is for anyone else.\n\nI'm deeply grateful to live in a time where we have unparalleled access to brilliant thinkers and their ideas. This is a special era, full of both challenges and opportunities. What will be your verse in it?\n\nI'm tired from driving so I'll end this with some banger tweets I saw today.\n\n![[https://x.com/DonnieDarkened/status/1861559764322291744](https://x.com/DonnieDarkened/status/1861559764322291744)](https://miro.medium.com/1*03tDqC383wfMxte1A5o5jw.png)\n\n![[https://x.com/benln/status/1861469390136328497](https://x.com/benln/status/1861469390136328497)](https://miro.medium.com/0*iduCI0l-5seQvo1L)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/BrianRoemmele/status/1861568025214001617&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n11/26/24\n\nConor Jay Chepenik",
  "wordCount": 294,
  "readingTime": 1.659433962264151,
  "claps": 0,
  "voters": 0
}