{
  "id": "239ba014ee97",
  "title": "Day 1341",
  "createdAt": "2025-11-22 21:13:03",
  "tags": [
    "the",
    "placebo",
    "effect",
    "is",
    "real"
  ],
  "url": "https://chepenikconor.medium.com/day-1341-239ba014ee97",
  "content": "# Day 1341\n\nHere is a post I saw on X.com today: [https://x.com/White_Rabbit_OG/status/1991982168088698996](https://x.com/White_Rabbit_OG/status/1991982168088698996?s=20)\n\n> 1. In 1965, Rosenthal ran an experiment that many later tried to discredit because the results were inconvenient. Participants were told that certain people in the study were \"more gifted,\" even though they had been chosen at random. Within eight weeks, those \"gifted\" participants started acting as if they genuinely were superior, they made decisions faster, doubted themselves less, and their performance increased by almost a quarter.\n\n> 2. Years later, researchers in Zurich repeated the experiment on adults. One group was told they would \"perform better\" because they supposedly had a \"hidden cognitive resource.\" The tests were identical to the other group's, but within 40 minutes their brains began producing answers 89% faster. The researchers said: \"We didn't increase their abilities, we changed their expectations of themselves.\"\n\n> 3. One participant admitted he felt a clarity he hadn't experienced in years: \"I just thought I could, and then I could.\" Rosenthal insisted there was nothing mystical about it: people act not from their actual abilities, but from what they believe is possible for them. Give someone a version of the future that feels real, and the body begins to behave as if it has already happened.\n\n> 4. The darkest conclusion from the experiment: the Rosenthal effect works in reverse too. If someone is made to believe they are \"difficult,\" \"faulty,\" or \"a failure,\" the brain starts confirming that script, as if it were testing a hypothesis planted in childhood. Neuroscientists have shown that negative expectations from others slow neural transmission almost as much as chronic fatigue.\n\n> 5. At a Harvard conference, a psychologist said a line that made the room go silent: \"We become who others think we are, unless we realize in time that this voice isn't ours.\" He added that when a person changes not their motivation, but their forecast of themselves, the psyche reorganizes instantly, as if it receives a new operating instruction. Have you noticed that the biggest turning points in life happen right after you stop believing someone else's prediction of who you are? We may never cross paths again. Follow The White Rabbit.\n\nNow think about what that means. Improve your self talk anon! You are capable of so much you simply need to psy-op yourself into believing it. I am smart, wealthy, good looking, and capable of creating anything I want. I'm an excellent Husband, an elite Father, and a great writer.\n\nEveryday you wake up remind yourself you are elite. Soon enough you will be.\n\n![Type S***](https://miro.medium.com/1*mzTls9vvZB7rBvkDxRXELg.png)\n\n11/22/25\n\nConor Jay Chepenik",
  "wordCount": 429,
  "readingTime": 1.818867924528302,
  "claps": 0,
  "voters": 0
}