{
  "id": "24b995cdc02d",
  "title": "Day 1132",
  "createdAt": "2025-04-28 02:44:56",
  "tags": [
    "this",
    "one",
    "felt",
    "good",
    "to-write"
  ],
  "url": "https://chepenikconor.medium.com/day-1132-24b995cdc02d",
  "content": "# Day 1132\n\n![[https://x.com/saylor/status/1916476128673284289](https://x.com/saylor/status/1916476128673284289)](https://miro.medium.com/1*H9YcLShZ1vsdIZdhOJHSYQ.png)\n\nThe Federal Reserve is a private bank. The U.S Treasury has an account with them, but framing this as some benign checking account is like calling a heroin addiction a \"vitamin regimen.\"\n\nThe regional Fed banks are technically private corporations owned by member banks, but the Board of Governors is a federal agency. This duality seems intentional, creating a system where Wall Street and the government share a bed.\n\nThe Federal Reserve was created by Congress in 1913, but it should be ended here in 2025. No unelected cabal of bankers and bureaucrats should hold a monopoly on the lifeblood of an economy: money.\n\nA system where \"the bank\" gets to make money out of thin air and lend it with interest means the bank is always going to win. For anyone who is has played Monopoly this is obvious.\n\nWhen the Fed prints money, it doesn't magically appear in your bank account (except for 2020 when they tried this causing massive inflation). Usually money floods into financial markets, inflating stocks and real estate owned by asset holders while [eroding the purchasing power of people's paychecks.](https://wtfhappenedin1971.com/)\n\nThe \"interest\" the Fed charges is not just a fee; it's a systemic extraction mechanism. Every Treasury bond the Fed buys enriches bondholders (often foreign governments and hedge funds) while saddling taxpayers with [interest payments that now exceed $1 trillion annually.](https://www.cnbc.com/2024/09/12/interest-payments-on-the-national-debt-top-1-trillion-as-deficit-swells.html#:~:text=A%20view%20shows%20a%20bronze,U.S.%2C%20January%2020%2C%202023.&text=The%20U.S.%20government%20for%20the,the%20Treasury%20Department%20reported%20Thursday.)\n\nEnding the Fed in 2025? Good f****** luck. The institution is protected by layers of legal obfuscation, corporate lobbying, and sheer inertia. Abolishing it would require dismantling the entire architecture of modern finance.\n\nThe incentives are not there because pensions, mortgages, and global trade are all built on the premise of endless debt expansion. The political will does not exist. Politicians scream about Fed power but are junkies for deficit spending.\n\nI am all for exposing the lack of transparency and increasing accountability in these organizations. The Fed operates in the shadows, bailing out banks with trillions in \"emergency\" loans while Main Street gets crumbs.\n\nIts policies, quantitative easing, near-zero interest rates, even helicopter money are just reverse Robin Hood schemes, stealing from savers and workers to enrich the parasite class.\n\nWe should celebrate those who go out and create value. Who provide a good or service to the market that people value enough to trade their money for. It's one thing to make your money providing legit value to others.\n\nHowever, charging interest on fiat money isn't capitalism. It's state-sanctioned counterfeiting. The Fed isn't the 'beating heart' of free markets; it's crony capitalism's needle, jabbing banks with liquidity heroin in shadowy back alleys while the economy ODs on debt.\n\nBut there's an alternative: A system with fixed supply, no printing, no usury. A protocol, not a policy.\n\nMath over men. Code over cronies.\n\nBitcoin.\n\n![](https://miro.medium.com/1*3iD_1j8SINnyj97Z883m6A.png)\n\n![](https://miro.medium.com/1*UJTJUInACk9zAhH5UukpPQ.png)\n\n4/27/25\n\nConor Jay Chepenik",
  "wordCount": 470,
  "readingTime": 2.3235849056603772,
  "claps": 0,
  "voters": 0
}