{
  "id": "2b3c35747b6d",
  "title": "Day 1272",
  "createdAt": "2025-09-15 03:48:13",
  "tags": [
    "life",
    "is",
    "a-lot",
    "like",
    "golf"
  ],
  "url": "https://chepenikconor.medium.com/day-1272-2b3c35747b6d",
  "content": "# Day 1272\n\nI got to play golf with a friend today. The group ahead was moving like a loading bar stuck at 99%, and our round crept past five hours. I got a bit annoyed.\n\nLooking back though you know what the funny part is? The lesson didn't really hit me until I started writing this Medium. I was outside, with a buddy, playing a game I actually pay to play. Getting mad at fun is... not my sharpest club.\n\nWe both shot north of 100. One day we will break that infamous number, but today was not that day.\n\n**What I'm taking forward**\n\n- **Control the controllables.** My swing, breath, and attitude. Not the pace of the people in front of us.\n\n- **Gratitude over grumbling.** It's hard to be thankful and ticked at the same time. I pick thankful.\n\n- **Assume good reasons.** Maybe they're new, injured, or just having a day. Empathy keeps the round lighter.\n\n- **Scorecards don't track mood.** My friend will remember my company, not my front-nine math.\n\n**Next time, catch it on the course**\n\n- **One-shot rule:** If I'm still annoyed after the next shot, I shall reset with a deep breath before swinging again.\n\n- **Game within the game:** Pick a micro-goal each hole, fairway only, two-putt focus, or \"no hero shots.\" Take dead aim every shot.\n\n- **Gratitude cue:** Every tee box, name one thing I'm happy about. Trees count. So do dumb jokes.\n\n- **Pace mantra:** \"Their pace isn't my problem. My patience is my superpower.\"\n\nLife is short. Golf is apparently long. I'm grateful for every hole I get to play and next time, I plan to have the epiphany before the 18th hole, not after it.\n\n![A Bitcoin green.](https://miro.medium.com/1*9Zyde-CfgzdSj-OpGtFgPg.png)\n\n9/14/25\n\nConor Jay Chepenik",
  "wordCount": 288,
  "readingTime": 1.2867924528301886,
  "claps": 4,
  "voters": 1
}