{
  "id": "2bf291905701",
  "title": "Day 1162",
  "createdAt": "2025-05-28 01:22:27",
  "tags": [
    "write"
  ],
  "url": "https://chepenikconor.medium.com/day-1162-2bf291905701",
  "content": "# Day 1162\n\nI need to get better at doing things _for myself_. That's become taboo, apparently. Like it's selfish to have needs. Like if you're not bleeding for the \"greater good,\" you're some kind of deviant.\n\nWell, guess what?\n\n**F***** the greater good.\n\nIt's not real. It's a mirage, a mirage cooked up by bureaucrats and bootlickers who need a moral fig leaf for whatever new scam they're running this week. \"Oh, it's for the collective!\" Translation: _shut up and obey._\n\nThe \"greater good\" is a floating concept. It means **whatever the people in power say it means**. Today it's a war. Tomorrow it's a lockdown. Next week it's a climate tax on breathing. Oh, and don't forget to inject this mystery sauce into your bloodstream, it's \"for the greater good of Pfizer shareholders.\"™️\n\nA crime against humanity we all lived through.\n\nYou know what's chathartic though? Writing.\nNot for Substack followers. Not for Medium claps. Not even for likes on X or LinkedIn.\nBut just for me so I can look back as an old man and smile.\n\n> Be me\n Realize I can just write things\n Start writing every day\n Stack words like bricks\n Turn it into a side hustle\n No editors\n No overlords\n Just fingers on keys, thoughts to text\n Me and ChatGPT in the bunker of my mind\nSeriously though you can just write things\n\n![](https://miro.medium.com/1*LY8JZ2n8VTjN2yYoMkohAg.png)\n\nMassive respect to Ayn Rand, honestly. Not even for her philosophy in full (although I do vibe with Objectivism), but for the raw nerve it took to say:\n\"_No. You don't get to demand my life. You don't get to tell me self-sacrifice is noble while you're the one cashing the check\"_ and then going out and writing such incredibly beautiful novels that her art influenced millions of minds for the better.\n\nThe world is broken because too many people forgot that they matter. That they are not cogs. That they weren't born to serve some abstract blob of moral manipulation dressed up as \"community care.\"\n\nSomeone else's needs are **not** more important than yours.\nNot inherently. Not automatically.\n\nIf we ever want anyone's needs met, we better start by making sure _we're not hollowed-out wrecks ourselves._ Fix the world by fixing yourself is how I would describe objectivism's philosophy. It's how I interpreted it anyway. In Rand's own words:\n\n> \"Man - every man - is an end in himself, not the means to the ends of others.\"\n\nSo yeah. I'll keep writing.\nBecause it brings me joy.\nBecause it's mine.\nBecause every word I type is a message in a bottle, **** sent forward in time to remind me who I am, who I was, and what I can become.\n\n5/27/25\n\nConor Jay Chepenik",
  "wordCount": 454,
  "readingTime": 1.9132075471698113,
  "claps": 0,
  "voters": 0
}