{
  "id": "2eccd44faf7f",
  "title": "Day 1356",
  "createdAt": "2025-12-08 01:52:44",
  "tags": [
    "thank",
    "you",
    "god"
  ],
  "url": "https://chepenikconor.medium.com/day-1356-2eccd44faf7f",
  "content": "# Day 1356\n\n![Blessed Are Those Who Come In The Name Of The Lord](https://miro.medium.com/0*LXd8xgpDGIBTm9yc)\n\nI found the Bible on audio book and I've been listening to Genesis. I'm going to listen to the entire Bible on audio book. Nice being able to hear the word of the Lord while I walk, drive, run: [https://youtu.be/BqHPBky9uEQ](https://youtu.be/BqHPBky9uEQ)\n\n![Manifest it](https://miro.medium.com/1*XZl5v0hEnkbH1xvgQEZDCA.jpeg)\n\n![[https://x.com/PromptLLM/status/1997413516513341773](https://x.com/PromptLLM/status/1997413516513341773?s=20)](https://miro.medium.com/1*ohREp87hzd8AaJFH_cmnZw.png)\n\n![[https://x.com/psswordprotectd/status/1997466114927051181](https://x.com/psswordprotectd/status/1997466114927051181?s=20)](https://miro.medium.com/1*5zQt8GhRcuxb2bnCQdZIfQ.png)\n\nPlacebo, words, your thoughts, etc, are so powerful and most don't even realize it. We can manifest just about anything. I knew I would be a parent growing up. Shout out my parents for instilling in me why that's important and my kids will understand too. My bloodline will grow long, Lord willing, and I think Him everyday for the blessings He has given me. Being a parent really is the best thing you can experience.\n\nThe youth like to say _you can just do things_. Nike was on it first with _JUST DO IT._ So go out and do the things you know are good. Highlight the positive, speak in affirmations, raise your consciousness and improve this world we share. We are so lucky to be alive so let's make the most of it.\n\nOne way I plan to do this is to start speaking in positive affirmations. Be for something, rather than against everything. The hopeful shall inherit a better planet. Cheers anon.\n\n![iykyk](https://miro.medium.com/1*omZCkFLPyUi47CDvjgSelQ.png)\n\n12/7/25\n\nConor Jay Chepenik",
  "wordCount": 211,
  "readingTime": 1.6295597484276731,
  "claps": 0,
  "voters": 0
}