{
  "id": "307c89167fd6",
  "title": "Day 910",
  "createdAt": "2024-09-18 00:26:26",
  "tags": [
    "twitter",
    "is",
    "my",
    "crack",
    "pipe"
  ],
  "url": "https://chepenikconor.medium.com/day-910-307c89167fd6",
  "content": "# Day 910\n\nYou know, it's not rocket science, but it hits different when you realize that doing the hard stuff - be it sweating at dawn, wrestling with a book that makes your brain hurt in a good way, or actually giving a damn at work - makes you feel like a million bucks. Conversely, dive into the social media swamp, and you're left feeling like yesterday's leftover pizza - cold and slightly stale.\n\nX (formerly Twitter) is a double-edged sword for me. It's like my daily newspaper, but instead of ink, it's filled with digital drama. Some folks cling to traditional news like it's a life raft, but let's face it, today's news? It's all just propaganda dressed up for the left or the right. X is better because it's propaganda on steroids, thanks to the wild west of free speech. Which I am all for. The last thing we need is the government playing nanny with our words. The free market of ideas is the real judge, not some bureaucrat sipping on our tax dollars, playing censor. Erik Voorhees nailed it with his take:\n\n![[https://x.com/ErikVoorhees/status/1835019215381627309](https://x.com/ErikVoorhees/status/1835019215381627309)](https://miro.medium.com/1*BZQv8W0SPfkx6_2aIA1B1Q.png)\n\n![[https://x.com/ErikVoorhees/status/1835019215381627309](https://x.com/ErikVoorhees/status/1835019215381627309)](https://miro.medium.com/1*LXw2ukKV7cvYz9ACfsy3eA.png)\n\n\"The world isn't divided into left and right anymore, but into those who want to control you and those who want to be left alone.\"\n\nAs a proud, free-thinking American, I'm all for getting my propaganda from all angles. It's like a buffet of bias, seeing all sides sharpens my own perspective.\n\nThat said, I should be less of a digital couch potato and more of a content creator on X. It's my soapbox, not just a firehose of chaos. The algorithms on that platform are military grade. I'm not even kidding. They're like digital sirens, singing you into an endless scroll with promises of viral videos and the next big scandal. It's hard to put down the phone when you are scrolling.\n\nI catch myself grabbing for X like it's muscle memory - waiting in line, in the loo, or just when the boredom hits. It's like I'm stuck in a bad relationship with my phone, knowing it's toxic but going back for more.\n\nSo, here's my friendly reminder: Engage with the real world, not just the screen. Use X, don't let it use you. It's a tool, not your life sentence. Time to ditch the digital crack pipe and pick up something that actually upgrades me. Hard stuff now for a better me later.\n\nBANG BANG\n\n9/17/24\n\nConor Jay Chepenik",
  "wordCount": 410,
  "readingTime": 1.9305031446540881,
  "claps": 10,
  "voters": 1
}