{
  "id": "332352a3f915",
  "title": "Day 1071",
  "createdAt": "2025-02-26 02:50:43",
  "tags": [
    "have",
    "more",
    "kids",
    "they-are-our",
    "future"
  ],
  "url": "https://chepenikconor.medium.com/day-1071-332352a3f915",
  "content": "# Day 1071\n\nMore people should have kids. It's a rather simple message I hope to convey here on my 1071st day of writing, but it's an important one.\n\nWhat good is life without community? And what better community is there than your blood? Now I understand some people can't have kids, but if you have the ability to have them you should. Yes it's difficult at times, yes it forces you to grow up, and yes the love you experience for that child is unlike anything you've ever felt before.\n\nDon't overthink it, don't worry so much about how will I afford it, or is now the right time. If you have found the person you want to spend your life with it is the right time. If you haven't found that person say some prayers. Let me tell you something, the ROI on kids is so much higher than any dollars you might spend on them because not everything is a financial decision even though our society has become hyper financialized. You can't calculate the ROI of children in fiat because true love can't be purchased, but if it were a chart it would look like this one:\n\n![It's actually a perfect chart because kids are volatile, but over the long term the love, joy, and happiness they bring into your world only goes up](https://miro.medium.com/1*0gWHnZb_t22XjUvuS9cWvw.png)\n\nWhen you're on your deathbed you won't be thinking damn why didn't I save enough for that cool trip. No hopefully you'll be surrounded by your children and at peace that you spread your seed far enough for it to continue on.\n\nGod designed sex to feel good for a profound reason, reflecting the wisdom and humor of our divine Creator, who continually brings joy to my life through His intricate designs. As I laugh at the beauty of His creation, I'm reminded that nothing is more precious than the love I feel for my children; a love that resonates deeply in my heart and affirms their role as our greatest hope for a brighter future. It's truly beautiful to realize we are all God's children, cherished and guided by His care. I wish you, dear reader, peace, love, and happiness, but I also gently believe that, if you are able, bringing children into the world can bring immense fulfillment and if you are not pushing your DNA into the future through children, well I believe you will end up regretting that decision later. My 2 sats.\n\n2/25/25\n\nConor Jay Chepenik",
  "wordCount": 390,
  "readingTime": 1.671698113207547,
  "claps": 11,
  "voters": 1
}