{
  "id": "3b7a6926a044",
  "title": "Day 1073",
  "createdAt": "2025-02-28 02:38:32",
  "tags": [
    "firefish"
  ],
  "url": "https://chepenikconor.medium.com/day-1073-3b7a6926a044",
  "content": "# Day 1073\n\n**Firefish: Unlocking Bitcoin's Potential Through Non-Custodial Lending**\n\nIgor Neumann, co-founder of Firefish, is on a mission to change how Bitcoin holders use their digital assets. As Bitcoin continues to offer humanity the scarcest money we have ever seen, most people see it as a speculative asset or digital gold to hoard. While some Bitcoiners will never sell their truly finite money for central bank liabilities there are an infinite amount of, Firefish hopes to make it so you can still access fiat without having to sell. As Igor put it \"Never sell your Bitcoin, live off it.\" This philosophy drives their non-custodial lending platform, which lets users borrow against their Bitcoin, whether in euros or soon, USDC, without having to sell the sats and face a taxable event. It's a simple yet powerful idea gaining traction among Bitcoin enthusiasts and traditional finance players alike.\n\n![[https://firefish.io/](https://firefish.io/)](https://miro.medium.com/1*QtSjkbjBvGCxXGGdlkHH2A.png)\n\nFirefish operates as a marketplace where borrowers and lenders meet. Borrowers lock their Bitcoin directly on the blockchain using Bitcoin-native scripts, ensuring no one else controls their assets. \"Your Bitcoin is locked on-chain in what we call an escrow account,\" Neumann explains. \"It can only move back to you once you repay the loan or to a liquidator if you default.\" This setup eliminates the need for a custodian, aligning with Bitcoin's decentralized ethos.\n\nLenders, ranging from retail investors to potentially larger institutions, provide liquidity, either in fiat or stablecoins. The platform is designed to be straightforward, with standardized loan terms of 3, 6, 12, or 18 months. Interest rates are market-driven, typically ranging from 7% to 12% for euro loans over the past year and a half. \"We wanted to remove all kinds of challenges and make it easy for both borrowers and lenders,\" Neumann says. \"It's a peer-to-peer marketplace, so the rates are set by supply and demand.\"\n\nFirefish uses two oracles to manage risk. A payment oracle confirms whether a borrower has repaid their loan, relying on input from both parties. If there's a discrepancy, a resolution process ensures clarity - especially important for fiat transfers, which can be slow and prone to issues. To help users manage potential banking concerns, Firefish provides documentation that explains the source of funds without explicitly mentioning Bitcoin, simply stating that \"user A has taken a loan on Firefish platform with user B.\"\n\nA price oracle monitors Bitcoin's value to trigger liquidations if the loan-to-value (LTV) ratio hits 95%. The LTV ratio simply measures the loan amount compared to the value of the collateral so a 95% LTV means the loan amount equals 95% of the collateral value. \"If Bitcoin's price drops significantly, you'll get a couple of margin calls to add more collateral or you can actually repay your loan early,\" Neumann notes. \"But if the LTV reaches 95%, you get automatically liquidated.\" This protects lenders while giving borrowers flexibility.\n\nWhen it comes to liquidation, lenders have two options. Bitcoin-native users can choose to be their own liquidators, receiving the borrower's Bitcoin directly to their wallet along with a 5% liquidation fee. Alternatively, for users uncomfortable with handling Bitcoin, Firefish offers a liquidation service where they handle the process and return fiat to the lender. This \"Firefish liquidation\" option is particularly appealing to non-Bitcoin-native investors, like Neumann's mother, who might have free fiat but no Bitcoin wallet.\n\nFirefish's approach to collateral is deliberately conservative. Borrowers must post twice the value of the loan in Bitcoin, unlike other platforms that faced liquidation crises due to lower collateral requirements. \"We learned from the mistakes of others,\" Neumann says. \"With double collateralization, the risk is minimized for lenders, and borrowers can still benefit from Bitcoin's long-term appreciation.\"\n\nTake a borrower who took a loan a year ago when Bitcoin was at $50,000. Instead of selling their BTC, they borrowed against it. \"If they would sell it instead of taking a loan, you would lose let's say 50% upside,\" Neumann points out. \"It's a win-win actually for both parties.\" Lenders earn interest, and borrowers avoid capital gains taxes and the regret of selling too early.\n\nBuilding Firefish wasn't easy. \"The biggest hurdle was creating a seamless, non-custodial experience,\" Neumann admits. \"We had to build everything from scratch - there was no off-the-shelf solution for what we wanted to do.\" The team also had to navigate Europe's regulatory landscape, implementing KYC/AML procedures despite their personal reservations. \"We really hate KYC because we think it brings a lot more negative than actually the positives,\" Neumann confesses, \"but we have to do it unfortunately.\"\n\nThat compliance, while burdensome, serves dual purposes: meeting regulatory requirements and enabling traditional financial institutions to participate comfortably in the marketplace. \"I don't think any bank would be happy to fund your marketplace with liquidity if you say that you don't know anything about your users,\" he notes. This approach could ultimately benefit users by bringing in more liquidity and potentially lowering interest rates.\n\nCurrently, Firefish focuses primarily on euro transactions due to the complications with dollar transfers. \"Dollar transfers across the board are just an incredible pain,\" Neumann laments. \"You would need to use the Swift routing and it's expensive, the money always disappears somewhere.\" To expand their reach, Firefish is adding USDC support, which will simplify the process for international users and reduce reliance on traditional fiat currency rails.\n\nThe geographic scope of their services is also strategically organized: fiat transactions are enabled for European countries, while users from outside Europe will use stablecoins. For these crypto-to-crypto transactions, Neumann indicates the KYC process would be \"a little lighter\" while still maintaining compliance with emerging regulations like Europe's MiCA framework.\n\nLooking ahead, Firefish has ambitious plans beyond peer-to-peer loans. \"Our roadmap doesn't stop at this plain vanilla peer-to-peer loans,\" Neumann reveals. The team is exploring Bitcoin-backed mortgages, credit cards that use Bitcoin as a credit line without spending the Bitcoin itself, and even securitization of Bitcoin-backed loans to create tradable securities. \"We're bringing a new vector into traditional finance, connecting traditional finance with Bitcoin and leveraging Bitcoin as a great collateral,\" he explains.\n\nFor Neumann, the goal is to democratize access to financial services. \"Collateralization used to be predominantly a feature for either institutions or high net worth individuals who had the army of finance advisers behind them,\" he explains. \"Now with Bitcoin, it's very democratized. Anyone who's got Bitcoin can actually use it as wealthy people use their assets.\" When asked what he would ask Satoshi Nakamoto if given the chance, Neumann replies, \"I would ask him if he would endorse our protocol... I would really love to see some of the early coins being used as the collateral on our platform.\"\n\nFirefish represents both financial innovation and a shift in how people think about Bitcoin holdings. By encouraging Bitcoin holders to borrow rather than sell, they're fostering long-term ownership while offering lenders a low-risk entry point into the Bitcoin ecosystem. The platform introduces traditional finance to Bitcoin's benefits while maintaining the core values of non-custodial ownership and security.\n\nIn a world where central banks set interest rates and fractional reserve banking is the norm, Firefish stands out as a free-market alternative where interest rates are determined by genuine supply and demand between borrowers and lenders. As Bitcoin matures, platforms like Firefish are paving the way for a future where digital assets are not just an investment but an integral part of everyday finance.\n\n2/27/25\n\nConor Jay Chepenik",
  "wordCount": 1263,
  "readingTime": 4.966037735849056,
  "claps": 0,
  "voters": 0
}