{
  "id": "3fe76b06a216",
  "title": "Day 866",
  "createdAt": "2024-08-05 03:37:08",
  "tags": [
    "christ-is-king"
  ],
  "url": "https://chepenikconor.medium.com/day-866-3fe76b06a216",
  "content": "# Day 866\n\n![[https://x.com/DonnieDarkened/status/1820179458168365063](https://x.com/DonnieDarkened/status/1820179458168365063)](https://miro.medium.com/1*KpZs7mS-s8EePGp4GUIK5w.png)\n\nDonnie's words cut to the heart of the matter, revealing the devastating cycle of sin that can lead to a never-ending spiral of death and destruction. I, like many others, have been guilty of getting caught up in my own emotions and reactions, perpetuating the cycle without even realizing it. Donnie's message was a much-needed wake-up call on my Twitter feed, urging me to break free from my own sinful tendencies and instead choose to respond to situations with love, compassion, and understanding. It's not always easy, but it's the only way to truly break the cycle and create a more just and peaceful world. Who doesn't want that?\n\nThat said, I do believe that defending our loved ones is a fundamental human instinct, and there may be situations where standing up to protect them is necessary. However, it's crucial to distinguish between self-defense and senseless aggression. We should not just lash out and hurt someone because they're weaker or more vulnerable. That's not justice, that's just cowardice. We need to stand up for what's right, but we also need to do it with compassion and integrity.\n\nI heard a quote today that said there are three stages with your Father: first, you idolize him, then you demonize him, and finally, you humanize him. It made me incredibly emotional when I heard that. Let me repeat: first, you idolize your Father. I know I did as a kid, and for those who didn't have that privilege, I have a lot of sympathy - I feel lucky to have a good Dad. As you get older, you start to demonize your Dad, and I had my fair share of fights with him because, even though he only wanted the best for me, it's hard to understand that when you're a teenager who thinks they know everything. Then, you humanize him because being a parent is incredibly hard. I wouldn't trade it for anything in the world. Sloan is an amazing child, and she has changed my heart in ways that words can't accurately express. I only want what's best for her, and I'm sure we'll have our share of disagreements as we grow older together. It's a lot easier to humanize your Father once you've had the chance to see how hard it is to be a parent.\n\nWas my Dad perfect? No, he wasn't. But did he care deeply about me and my sisters? Absolutely - more than any Dad I know. I hope I can learn from his mistakes, take his great qualities, and become a great Dad for Sloan.\n\nAnyways, I'm just grateful. For my health, for a fantastic family, for being alive during a time where I have social media and the discernment to follow more accounts like Donnie to remind me the importance of Christ's teachings, and an ability as well as a desire to keep improving myself. God is good.\n\n![This meme does not reflect my personal experience, both my Dad and Grandpa were great to me, but I'm sharing it because it's a powerful idea that reflects well with the point made by Donnie](https://miro.medium.com/1*GbTDEuSqE7kQo1v2UEtkLw.png)\n\n8/4/24\n\nConor Jay Chepenik",
  "wordCount": 495,
  "readingTime": 2.2512578616352203,
  "claps": 7,
  "voters": 2
}