{
  "id": "40582c22d439",
  "title": "Day 982",
  "createdAt": "2024-11-29 02:12:28",
  "tags": [
    "thanksgiving"
  ],
  "url": "https://chepenikconor.medium.com/day-982-40582c22d439",
  "content": "# Day 982\n\nI have decided I am going to write and self publish a book. Something with very short chapters but a lot of them. It will be 121 chapters because that is a good number with each chapter being between ~1–5 pages. Short and sweet.\n\nThrough this book, I aim to explore and share ideas that matter deeply to me: why Bitcoin represents better money, the irreplaceable value of family, the way memes can ignite movements and spread ideas like wildfire, the crucial role of freedom-enabling technology, and strategies for finding clarity amidst the overwhelming noise of our digital age.\n\nIt will be a guide for those seeking truth, meaning, good memes, and tools for navigating the complexities of modern life - short and sweet, yet rich with insights. Here are some rough chapter ideas to get started.\n\n**1. Trust Your Gut**\n\nDeep down you know the correct thing to do, but often times we let our brain lie to us to justify doing the incorrect thing. Stop this. Lying to yourself is one of the worst forms of punishment out there.\n\n> \"The man who lies to himself and listens to his own lie comes to a point that he cannot distinguish the truth within him, or around him, and so loses all respect for himself and for others.\" - Fyodor Dostoevsky\n\nUnless you're truly a psychopath, you are equipped with a moral compass, a gift from our creator, that distinguishes right from wrong. However, life occasionally serves you a shit sandwich, and when it does, making the ethical choice can be as tough as choosing between a bed full of nails or a plate of poisoned caviar. In those awful moments of discomfort is when your true character is tested and defined. No matter what you pick pain is inevitable, so ask yourself how long do you want to live with that pain. A day or a lifetime? If you want to sleep good at night then you will do what you know is right.\n\n![](https://miro.medium.com/1*E8zh2_0IotsGe3GZWlYdjw.png)\n\n**2. Focus Is A Super Power**\n\nThanks to the internet, we now live in an age of endless entertainment. Platforms like YouTube upload a lifetime's worth of content every single day - at least, according to the quick Google search I just did. This means that even if you dedicated your entire life to watching YouTube videos without ads, breaks, or sleep, you'd be lucky to make it through a single day's uploads.\n\nThe sheer volume of available content is staggering, but it also creates a challenge: how do you stay focused when you're constantly surrounded by distractions?\n\n![](https://miro.medium.com/1*ql-sRE2gP88WHZmQbF8ySA.png)\n\n**Here are some Tips I Used To Help Me Focus**\n\n**Set Clear Priorities**\nDecide what's most important to you. Write down your top goals for the next day, and focus on tasks that align with those goals. While there's value in thinking long-term, all we truly have is the present. It makes more sense to focus and crush what you can do soon rather than getting lost in far-off plans. Commit to doing these every single day, no matter what. Writing things down is powerful. Building a streak is also powerful. Plus, it feels much better to mindlessly scroll through content after you've completed your day's tasks.\n\n**Practice Digital Minimalism**\nLimit the number of apps and platforms you use. Turning off notifications from all your apps, especially the social ones, is massive. I get why some people might keep notifications for messages and calls, but don't be afraid to use Focus Mode if you have an iPhone. Technology is designed to be as addictive as possible so companies can monetize your eyeballs via ads.\n\nBy creating intentional boundaries, you reduce the likelihood of getting trapped in an endless loop of content designed with military-grade psychological-operation tactics. These companies are massive, with quarterly earnings to meet. If you think they're not trying to squeeze every last penny out of you, you don't understand how publicly listed companies operate.\n\n**Create a Distraction-Free Zone**\nDesign your workspace to minimize distractions. Keep your phone in another room. Close unnecessary tabs and make sure your space is neat. The small things that make a big difference. Perfect is the enemy of good. Even if you do one thing every day it adds up and before you know it you will feel great working in your space. Do not underestimate compounding in both your personal space as you clean it up and in investing.\n\nThe internet offers incredible opportunities for learning and entertainment but it's up to you to decide how to spend your time. Focus on what truly matters and let the rest fade into the background. Easier said than done but it can still be done.\n\n**3. Money Must Be Permissionless For A Just Society**\n\nOne of Bitcoin's most powerful features is its ability to let individuals store and transfer wealth in a way that's nearly impossible to confiscate when properly secured. Like gold and cash, Bitcoin is permissionless - no one's approval is required to use it. Transferring value is as simple as sending bitcoin from your wallet to someone else's, much like handing over paper money or coins.\n\nWhile credit cards are convenient for most transactions, they come with trade-offs. With just a few clicks on a Mastercard or Visa server, your access can be revoked. This is the cost of convenience: carrying a credit card is easier than lugging around ten thousand dollars in cash or gold, and disputing fraudulent charges is straightforward. However, relying on centralized entities means accepting the risk of restrictions or surveillance on your transactions.\n\nHistory has shown that when centralized authorities are given the power to control money, they inevitably abuse it. From freezing the bank accounts of political dissidents to imposing capital controls, the temptation to weaponize financial systems against individuals or groups is too great to resist. This is not a hypothetical concern. It is a pattern repeated time and again by governments and corporations alike. When money is not permissionless, it becomes a tool for control, restricting freedoms and punishing those who fall out of favor with the powers that be.\n\nBitcoin bridges this gap, offering permissionless money with the convenience of digital transactions. With just twelve words, also known as a seed phrase, you can carry and send vast amounts of wealth in a permissionless manner. However, for those with a significant holdings, setting up a multi-signature wallet is an important step to safeguard against confiscation or a single point of failure. Such measures can provide Bitcoiners serious peace of mind.\n\nThat said, Bitcoin transactions are irreversible, which introduces a unique challenge. If you make a mistake or fall victim to fraud, there's no central authority to turn to for resolution. For those who value sovereignty and are willing to take on the responsibility of securing their savings independently, this trade-off can be worth it.\n\nUltimately, it's a choice: convenience with potential oversight and control from centralized entities, or full autonomy with the responsibilities that come with it. Bitcoin empowers you to be your own bank, but with that power comes the necessity of taking the right steps to protect your assets.\n\n![](https://miro.medium.com/0*a74EE__BvHY8dY3r)\n\nGood start to make this book into a real thing. I also looked up what I need to do to get published and getting an ISBN is actually not that bad.\n\nFinally: Happy Thanksgiving!!!! Had an amazing time with my family today.\n\n![](https://miro.medium.com/1*An-ZPX4KmMzYgeFSXzBynA.png)\n\nYou know I was reading some of my earlier posts and I constantly talk about how grateful I am. No wonder I am usually so happy! Life is better when you are grateful to be living. Frfr no cap. Life without gratitude is not very \"bussin\". As the kids, allegedly, say.\n\n11/28/24\n\nConor Jay Chepenik",
  "wordCount": 1301,
  "readingTime": 5.609433962264151,
  "claps": 0,
  "voters": 0
}