{
  "id": "4110f0594c3d",
  "title": "Day 1303",
  "createdAt": "2025-10-16 02:17:39",
  "tags": [
    "evolve-etfs",
    "bitcoin",
    "life",
    "on-a-bitcoin-standard",
    "is-much-better"
  ],
  "url": "https://chepenikconor.medium.com/day-1303-4110f0594c3d",
  "content": "# Day 1303\n\nGoing to use today to write a Bitcoinnews article about Evolve ETFs. I had a great conversation with their CIO Elliot.\n\n...\n\n**Evolve ETFs CIO on Bitcoin: \"We're Still Crushingly Early\"**\n\nIf you want the cleanest window into how Bitcoin moved from the edges of finance to the front page of Bloomberg tickers, talk to someone who's shipped products through all the awkward stages. Elliot Johnson has. As CIO and COO of Evolve ETFs, he filed for a Bitcoin ETF back in 2017, got told \"no,\" kept building, and then launched the Evolve Bitcoin ETF with his team (TSX: EBIT) in February 2021 making it Canada's second spot product holding real Bitcoin. In June 2025, Evolve added a 2x daily exposure fund (TSX: LBIT) for investors who like the accelerator pedal.\n\nIn the early days, buying Bitcoin meant wiring money to an unfamiliar exchange and praying you hadn't just \"donated to a phishing expedition,\" as Johnson jokes. Things have come a long way since then. Self-custody remains the gold standard for those who value personal sovereignty, but the reality is not everyone wants to manage private keys for millions in assets. For large institutions and high-net-worth investors, the ETF bridges that gap, offering secure, regulated exposure to Bitcoin through the same brokerage accounts they already trust, without sacrificing the asset's core appeal as sound, scarce money.\n\n_\"The friction of moving money from the TradFi system to an exchange, then off exchange if you take self-custody, is still a big departure from where most people are comfortable. ETFs solve that.\"_\n\n**From \"No\" in 2017 to Millions Trading Daily**\n\nEvolve filed its first Bitcoin ETF application when the Cboe (not even the CME) had just announced futures. Back then, Johnson's plan leaned on derivatives because spot wasn't on the menu. Four years later, Canada green-lit spot ETFs in 2021 and Evolve launched EBIT, which holds physical Bitcoin, eligible for TFSA and RRSP, so Canadians can buy Bitcoin exposure the same way they buy stocks and gold.\n\nThe difference has been night and day. \"Daily liquidity, proper market-making, and futures for hedging\" means the price you see in your brokerage account tracks real-time Bitcoin pricing, with creations and redemptions happening under the hood.\n\n_\"Market makers quote the exact real-time price all day. In many cases you're getting better execution than some exchanges because there's more participation.\"_\n\n**Why the Current Market Structure Feels Healthier**\n\nJohnson is no stranger to wild weekends on the chart. But he thinks Bitcoin's market design of 24/7 trading, no circuit breakers, and no central bank rescue, actually clears problems faster.\n\n_\"One of the under-appreciated features of Bitcoin is instant finality on changes in the market. Leverage gets wiped, it's over, and price can reset since there is no government stepping in. The fire happens, and it's done.\"_\n\nVolatility still exists, but the trend is toward lower realized swings as the spot base grows. That, in his view, is what invites larger asset owners in.\n\n**Does \"Paper Bitcoin\" Exist In These ETF Products?**\n\nTwitter loves a spicy rumor. Johnson's not taking the bait. Claims that spot ETFs are \"paper\" without in-kind are, as he puts it, _\"simply not true.\"_ He explains that _\"you still need to be an approved participant\"_ to create or redeem ETF units, and for anyone who wants self-custody, _\"the fastest path is still [to] sell your Bitcoin ETF, take the cash, [and] buy Bitcoin,\"_ then withdraw to a personal wallet. He adds, _\"It's always been real Bitcoin\"_ backing the funds, with \"one-to-one\" liquidity back to the market.\n\nWould in-kind make life nicer for certain institutions? Sure. But he notes it's not a magic pipe that sends ETF shares straight to your cold wallet.\n\n**Self-Custody vs. Regulated Custody: Pick Your Reasons**\n\nJohnson's been through the rites of passage. In 2017, he bought coins on a Canadian exchange and learned the \"not your keys, not your coins\" lesson during the Bitcoin Cash fork.\n\n_\"I emailed after the fork and got the essence of: not your keys, not your coins, not your fork.\"_\n\nHe respects the real need for self-custody, especially in crisis zones or under capital controls. But he also points out that once your stack gets large, sleeping well can mean using regulated infrastructure with heavy oversight.\n\n_\"Trusting yourself isn't always easier than trusting a regulated entity. Our custodian is heavily regulated and audited. The level of scrutiny is higher because Bitcoin is a bearer asset.\"_\n\nHis forecast is balanced: the future isn't all ETFs or all hardware wallets. It's choice. Like gold, many investors will hold exposure through financial products, and others will self-custody for sovereignty or mobility. Both matter.\n\n**Forks: What Would an ETF Do?**\n\nETFs actually plan for forks. It's in the documents.\n\n_\"Every prospectus has a fork section. If a fork has viability and monetary value, the plan is to sell it and buy more Bitcoin for the fund. If your custodian doesn't support the chain, you don't really 'have' the asset. Infrastructure maturity matters here.\"_\n\nCould another big fork happen? Sure. Would it play out like 2017? Many have doubts, given how much capital and infrastructure now anchor Bitcoin. The vast majority of ETF providers would instantly sell the weaker fork and use it to buy real bitcoin.\n\n**Adoption: The Snowball Is Just Starting to Roll**\n\nHere's Johnson's headline: there's still an ocean of capital on zero.\n\n_\"We're still crushingly early. Most big asset owners, pensions, institutions, [etc] have no allocation. Even here in Canada, only one of the six major banks lets advisers use Bitcoin ETFs on a discretionary basis, and that's limited.\"_\n\nWhat moves the needle? Bigger market cap, deeper dollar liquidity, and less volatility. As more coins get tucked away by long-term holders, new adoption pushes price, which grows capacity for even larger allocators. Rinse, repeat.\n\nThe culture shift is real, too.\n\n_\"It's not odd anymore to see Bitcoin on CNBC and Bloomberg. You see dollar, S&P 500, gold, Bitcoin, oil. It's just there. The Overton window moved.\"_\n\nBitcoin is no longer something you only heard about from your fringe friend on a cypherpunk forum. It's in the financial headlines, on prime-time TV, and discussed daily by mainstream investors and the new wave of Bitcoin podcasters with massive audiences. The conversation has gone mainstream, even if the adoption curve still has miles to go.\n\n**A Small Easter Egg for the Bitcoin History Nerds**\n\nJohnson's favorite bit of Bitcoin lore: the difficulty retarget is every 2016 blocks. The inverse of Executive Order 6102, which seized Americans' gold in 1933.\n\n_\"Given the genesis block, I think Satoshi chose that number on purpose.\"_\n\nFile under: reasons Bitcoiners smile at random block heights.\n\n**Where Evolve Fits In**\n\n- **Evolve Bitcoin ETF (TSX: EBIT)**: Launched February 19, 2021. Holds physical Bitcoin. Simple exposure, TFSA/RRSP eligible, standard brokerage access.\n\n- **Evolve Levered Bitcoin ETF (TSX: LBIT):** Introduced in June 2025, LBIT targets twice the daily performance of Bitcoin. It's built for investors who understand the risks of leverage and want amplified exposure, with Gemini serving as custodian.\n\nTogether, the two funds serve distinct audiences: those seeking straightforward Bitcoin exposure without the operational hurdles of self-custody, and those comfortable with higher volatility in pursuit of greater upside. Both reinforce Evolve's mission, to make Bitcoin investing accessible, transparent, and institutionally secure.\n\n**The Next 12–18 Months**\n\nEveryone on Bitcoin Twitter (and Nostr) is wondering what shape this cycle will take. Johnson's base case: it won't mirror the past.\n\n_\"The year after this one has historically been hard. I'm not sure it will be. A more constructive 2026 would be a huge green light for adoption.\"_\n\nAnd that slide he shows advisers, the one comparing the price of an average house in fiat currency versus Bitcoin over time, might be the most persuasive visual in his entire deck.\n\n_\"I kind of think I don't need any other slides,\" Johnson jokes._\n\n![A Meme Showing Homes Priced In Bitcoin](https://miro.medium.com/0*SGA2tYXLYxA9Kx20)\n\nIt's a simple illustration of a profound shift. As the years pass, the dollar price of a home climbs higher, while the Bitcoin price trends lower. You don't need a PhD in economics to understand what that means.\n\nJohnson says he doesn't yet denominate his daily life in Bitcoin because too much still happens in fiat, but he admits to occasionally running a \"mental balance sheet\" in sats. It's a familiar pattern among Bitcoiners. Few are measuring cups of coffee or fast food in sats, but when it comes to the bigger things like a home, a car, a mortgage, well life starts to look increasingly deflationary when viewed through the lens of sound money. Over time, it becomes less about Bitcoin's price and more about what one Bitcoin can buy.\n\nThat's the quiet psychological shift taking root beneath the charts, one slide at a time.\n\n**Final Word: Get Off Zero**\n\nBitcoin was one of the few things the retail crowd beat Wall Street to, but now the institutions are here. Understandably, some cypherpunks don't like this, but it was inevitable with a permissionless form of money.\n\n_\"Adoption begets adoption. The direction of travel is clear. We're winning friends every day.\"_\n\nFor Johnson, Bitcoin ETFs aren't a substitute for self-custody, they're an on-ramp. A way for institutions, advisors, and everyday investors to gain secure, regulated exposure without friction or fear.\n\nCanadian investors who want Bitcoin in the same account as their stocks and bonds can turn to EBIT. Those seeking amplified exposure can look to LBIT, Evolve's 2x daily Bitcoin ETF, built for investors who understand the volatility that comes with leverage.\n\nBitcoin's story has shifted from speculation to infrastructure, from questions of _if_ to questions of _how much_. Or as Elliot Johnson puts it,\n\n_\"The water's warm. Get in the pool. We're having a good time in here.\"_\n\nFrom rejected filings to billions in traded volume, Evolve's journey mirrors Bitcoin's own: persistent, transparent, and still just getting started.\n\n10/15/25\n\nConor Jay Chepenik",
  "wordCount": 1666,
  "readingTime": 6.486792452830189,
  "claps": 0,
  "voters": 0
}