{
  "id": "41d901bfb1db",
  "title": "Day 1065",
  "createdAt": "2025-02-20 03:29:15",
  "tags": [
    "simple",
    "yet",
    "profound",
    "life",
    "advice"
  ],
  "url": "https://chepenikconor.medium.com/day-1065-41d901bfb1db",
  "content": "# Day 1065\n\nThe below is [a tweet from Eric S Raymond](https://x.com/esrtweet/status/1892358797282181332) that I thought was so profound it was worth writing about today.\n\n> I have a new favorite quote.\n\n> My favorite quote used to be one from Marcus Aurelius: \"The object in life is not to be with the majority, but to avoid finding oneself in the ranks of the insane.\"\n\n> My new favorite is this: \"Every lie we tell incurs a debt to the truth. Sooner or later that debt is paid.\"\n\n> The second quote is from a documentary about the Chernobyl disaster, and is attributed to a Russian scientist named Valery Legasov. The scientist is real but the quote is probably fictional.\n\n> No matter. It expresses something important. Lies (especially the lies you tell yourself) alienate you from reality, and sooner or later that's going to come back around and bite you on the ass.\n\n> Next time I post some kind of damned fact or damned thought, and it makes you angry, remember that I live my life by these quotes.\n\n> I'd prefer the Marcus Aurelius quote on my tombstone, I think. My new favorite might create a misleading impression about my character.\n\nThe hard truth up front is called a hard truth for a reason, but it's so much better than getting caught in a lie. Do yourself a favor and tell the hard truths.\n\nI also like the Aurelius quote since it reminds me of this meme:\n\n![](https://miro.medium.com/1*LmCh3CoblqzW_hEX44Jezw.png)\n\nIn conclusion, the best way to improve the world is to improve yourself. Sometimes leading a horse to water will result in the horse telling you to GFY, but it's better to do so and be honest about it than to lie and deal with the ramifications later. The bill always comes due and if you think you can outsmart reality and mother nature... good luck.\n\n2/19/25\n\nConor Jay Chepenik",
  "wordCount": 311,
  "readingTime": 1.3735849056603773,
  "claps": 0,
  "voters": 0
}