{
  "id": "43683373cc83",
  "title": "Day 1184",
  "createdAt": "2025-06-19 02:30:44",
  "tags": [
    "life",
    "is",
    "better",
    "with",
    "friends"
  ],
  "url": "https://chepenikconor.medium.com/day-1184-43683373cc83",
  "content": "# Day 1184\n\nMan the sleep I got last night was top notch. I don't usually go to bed early, but when I do oh my gosh it is fantastic!!!\n\n![](https://miro.medium.com/0*VoE5aGNe8GIG9vVP)\n\nWent on a triple date tonight. Honestly, it was delightful and I should do this more often.\n\nThere's something special about everyone hanging out together but also breaking off a bit , women chatting with women, bros hanging with bros. Me and my slimes slipped outside for a cigar while the ladies stayed inside and talked. Then we all regrouped and talked some more. Chill, balanced, and hilarious. Also guilt-free because no one's left out.\n\nLife really is better with people. I forget that sometimes caught in the endless scroll, stuck in my own head, chronically online. But tonight reminded me: real connection is irreplaceable. We're meant to meet, laugh, share air with people we like.\n\nI'm grateful. Grateful to celebrate a friend's birthday with people I love. Grateful my dad watched Sloan. Grateful I didn't drink. Not because I'm a saint but I just know myself and I'm more a \"let's get drunk or not at all\" kind of guy. Plus, I worked out with my dad earlier and didn't want to wreck my gains.\n\nI'll conclude today's post by noting I went down a rabbit hole today:\n\n![[https://thegreattaking.com](https://thegreattaking.com/)](https://miro.medium.com/1*CLh1hppvhSSBSxbR_JF_Uw.png)\n\nBut this rabbit hole is for another day. It's a dark thing to unpack but the TL;DR securities don't grant ownership like we thought they did. Really shouldn't be surprised considering we live in a fiat system starved of collateral, but it doesn't make it right.\n\nGot Bitcoin?\n\n6/18/25\n\nConor Jay Chepenik",
  "wordCount": 271,
  "readingTime": 1.4059748427672956,
  "claps": 0,
  "voters": 0
}