{
  "id": "4598f2190076",
  "title": "Day 1307",
  "createdAt": "2025-10-20 03:34:31",
  "tags": [
    "focus",
    "on",
    "the",
    "good",
    "anon"
  ],
  "url": "https://chepenikconor.medium.com/day-1307-4598f2190076",
  "content": "# Day 1307\n\nFellas, we got to talk. Bang bang. The future looks bright. There is no second best, cryptocurrency that is.\n\nIt's amazing how the content you consume becomes a strange loop in your head. One that plays over and over. So if you are watching a two faced, lying, power hungry communist spewing a bunch of b.s about how wealthy people are ruining our country and they need to be taxed, well guess what, you will become a vapid low life. To the commies credit, at least they have the charm to inspire a bunch of losers so they can gain political power.\n\nAnyways, I didn't mean to drift off into politics, everyone's favorite topic, but I bring this up because you need to be watching better content. Learning from the people who have hope for the future. Positivity maxing. NEVER DOOM! We are living through some of the most exciting times. If you want to direct your energy towards eliminating private property, PLEASE DON'T! It's the base layer of functioning society. Without it everything will go to hell because there is no incentive to work hard.\n\nBut if you prefer to be angry direct your anger to those who acquire wealth playing zero sum games rather than those who play win-win games. For example, Amazon is how I bought those steel plates and the letter/number set to imprint on the steel I wrote about yesterday. Jeff Bezos, love or the hate guy, has provided an insane amount of value to people all over the world. I'm not saying Amazon is perfect, but I am saying I was in Whole Foods today buying great groceries, and I've ordered a ton of stuff on Amazon that has made my life better. It's pretty hard to deny the value Amazon has added to the lives of so many people and as a result Bezos got wealthy.\n\nYou know who has not made my life better? The I.R.S, the Fed, 99.9% of politicians in D.C treating the American people like tax cattle. Direct your anger at those people if you must because their wealth was not acquired providing value to others. It was acquired stealing from people. Point, blank, PERIOD.\n\nIt's not rocket science my guys. But if you want to practice rocket science then start watching some Elon Musk videos I guess. Everyone has different passions and that's great. What's super important is that you watch stuff that excites and inspires you. Let me show you something:\n\n![[https://makerworld.com/en/makerlab/printMonMaker](https://makerworld.com/en/makerlab/printMonMaker)](https://miro.medium.com/1*nI1NlX2YzzAls_ZGx4UNuw.png)\n\nI was able to make a 3D print Bitcoin chair I could print because of technology. I'm not 3D print guru who knows how to design CAD files manually, but I sure can copy and paste a photo and that's all I had to do with the modern software out there. Is that not insane?!\n\n![[https://x.com/ConorChepenik/status/1980091674115383624](https://x.com/ConorChepenik/status/1980091674115383624)](https://miro.medium.com/1*IrA2XceGjs6CJAWS0dBeHA.png)\n\n![[https://x.com/SeekingAnon/status/1980100051172000135](https://x.com/SeekingAnon/status/1980100051172000135)](https://miro.medium.com/1*oHtMeEqZbYidTd3yZQezow.png)\n\nIt is such an amazing time to be alive if you can focus your attention on the people innovating, inspiring, and leading the change for a better world. Sure watching people complain is where our attention naturally wants to go, but don't let your human nature guide you down the wrong path. Just because we have a tendency to stare at the bad (see rubbernecking when driving) doesn't mean you can't change that tendency if you use your will power. We are living through amazing times. Direct your energy to the amazing things that excite you and I promise you will have an incredible life.\n\nCan't be grateful and upset at the same time. Shout out my college football coach for teaching me that one.\n\nLet's ride.\n\n10/19/25\n\nConor Jay Chepenik",
  "wordCount": 603,
  "readingTime": 2.8254716981132075,
  "claps": 0,
  "voters": 0
}