{
  "id": "4c1dda4fce45",
  "title": "Day 1097",
  "createdAt": "2025-03-24 01:48:43",
  "tags": [
    "building",
    "bitcoin",
    "backyards",
    "osmo",
    "bitcoinnews"
  ],
  "url": "https://chepenikconor.medium.com/day-1097-4c1dda4fce45",
  "content": "# Day 1097\n\nMan it's been a busy weekend improving my backyard with my Father-in-law. A great one though and I'm so lucky to have George down here who is a talented builder. Feels great to use my hands and body. However, I also like to use my brain and I will use it to complete an article for Bitcoinnews. So here is that article:\n\n**Osmo: The Bitcoin-Powered Neo Bank Bringing Financial Freedom to Latin America**\n\nWith a mission to empower the unbanked and revolutionize financial access, Piero Coen founded Osmo to bridge millions of Latin Americans into the modern economy. In 2012, he first heard about Bitcoin and like many at the time, he dismissed it. \"I thought it was a scam,\" he admits candidly. But by 2015, while living in the UK, Coen's perspective shifted dramatically when he faced the frustrating barriers of traditional finance.\n\n\"I wanted to invest my money,\" Coen explains, \"but I realized if I wanted to buy stocks, I needed to become an accredited investor at the time and prove that I had a net worth of over a million pounds.\" Despite studying business at Babson College in the US, he found himself locked out of investment opportunities by regulatory hurdles. \"I thought this is ridiculous... why do I need to take a course so that a government that's not even my government will allow me to use my own money however I want?\"\n\nThis experience led him to Bitcoin, which Coinbase had just made available in the UK. But the real turning point came in 2018, when political upheaval forced Coen into exile from his native Nicaragua to Guatemala.\n\n\"As I learned more about Bitcoin, I was like, oh my God, this is freedom money. It's money dictators can't take away from you,\" Coen says passionately. \"It's uncensorable, global, works 24/7, doesn't know borders, but most importantly, it's money that dictators can't f*** with.\"\n\n**The Problem: Financial Services for the Few**\n\nComing from a family deeply involved in the remittance sector in Central America, Coen understood how broken the financial system was. \"Still 70% of the population in Latin America is either unbanked or underbanked, meaning they have to deal exclusively with cash,\" he points out.\n\nWhat struck him was the disconnect between digital communication and digital money: \"As Latin Americans, we're more connected than ever to the world. We speak with our family members instantly and for free using WhatsApp... but sending money has not changed in the last 40 years.\"\n\nIn a world where video calls are commonplace, why does moving money remain as slow as it was in the 1990s? This question became the foundation for Osmo.\n\n**The Solution: A Lightning-Powered Alternative to Banks**\n\nAfter attending the 2022 Bitcoin Conference in Miami and hearing Jack Mallers speak about the Lightning Network, Coen had his epiphany: \"You can settle with any partner across the world in real time over the Lightning Network. That really changed everything.\"\n\nOsmo began as a Bitcoin exchange but quickly evolved into something much more comprehensive. Today, it functions as a full-fledged neo bank where anyone can open an account in minutes - without needing a traditional bank account first.\n\n\"You can open an account in less than a minute whether you have a bank account or not,\" Coen explains. \"We make banking accessible to all Latinos.\"\n\nThe platform offers multiple services:\n\n- Accounts in Bitcoin, USDC, USDT, US dollars, Guatemalan quetzales, and Costa Rican colones\n\n- Lightning and on-chain Bitcoin transactions\n\n- Automatic currency conversion between fiat and Bitcoin\n\n- Cross-border payments to bank accounts worldwide\n\n- Cash deposits and withdrawals at 23,000 retail locations across Latin America\n\n- Bitcoin-backed loans\n\n- Virtual US bank accounts for receiving payments from America\n\nAnd coming soon: a MasterCard debit card that will eliminate the need to off-ramp to a bank entirely.\n\n**The Barber's Bike: A Real-World Success Story**\n\nOne of the most compelling examples of Osmo's impact comes directly from Coen's personal barber. \"About 10 months ago, he said to me, 'Listen man, I need to sell some Bitcoin. My moto is in the shop,'\" Coen recounts.\n\nAs an at-home delivery barber, the motorcycle was essential to his livelihood. \"Without my moto, I can't work,\" he told Coen. Instead of letting him sell his Bitcoin, Coen offered him the opportunity to be the first user of Osmo's Bitcoin-backed loan program.\n\n\"He needed about $100 worth of a loan, and he had over $200 worth of Bitcoin. He posted it in his account as collateral, got the loan, got his moto back, and in less than 10 days, he had already paid us back,\" Coen explains.\n\nIn Latin America, traditional credit is either unavailable to the unbanked or comes with predatory interest rates - \"the cheapest ones are 30% a month,\" according to Coen. Osmo's loans, charging 18–21% annually, provide life-changing financial flexibility without forcing users to sell their Bitcoin.\n\n**Cross-Border Payments at Lightning Speed**\n\nThrough partnerships with companies like Strike, Osmo has revolutionized international money transfers.\n\n\"If I want to send money from Guatemala to Mexico, which usually in the traditional banking system would take three to five business days and cost an arm and a leg - about 50 bucks to send and about 15 to receive - with Osmo, I can send money to any Mexican bank account in less than 10 seconds,\" Coen explains.\n\nThe magic happens behind the scenes: Osmo converts fiat to Bitcoin, sends it over the Lightning Network to a partner in Mexico, who then converts it to pesos and deposits it in the recipient's bank account.\n\n\"The recipient just receives the money in their bank account. They don't need to know anything about Bitcoin, they don't need to know anything about Osmo,\" says Coen. \"It works like magic... it flabbergasts me every time I see it happen.\"\n\n**Connecting Latin America to the Global Economy**\n\nOsmo's latest innovation? Giving users virtual US bank accounts.\n\n\"Now not only are we banking the unbanked in Latin America, but we're also connecting them to the US financial system,\" Coen explains. He offers the example of a Guatemalan photographer hired by an American couple for their destination wedding. Previously, there was no easy way for the Americans to pay the photographer - no Venmo, PayPal, or Cash App. Now, with a virtual US bank account, \"the photographer can just send them his bank details, and the couple can send a local Zelle or wire transfer.\"\n\n**Building for Bitcoin Adoption**\n\nWhile these services may sound similar to other fintech solutions, the key difference is Osmo's foundation on Bitcoin and Lightning. This approach not only makes cross-border transactions faster and cheaper but also introduces people to Bitcoin in practical ways.\n\nCoen describes one such avenue through gaming: \"We have an integration with Thunder Games... and that is a huge favorite for a bunch of people, especially in developing countries.\" By playing games, users earn small amounts of Bitcoin - \"a thousand sats is roughly a dollar, and that might not seem like a lot, but a dollar gets you pretty far in Latin America.\"\n\nAs Coen puts it, \"People might not be ready to buy Bitcoin, but I see so many people that are playing THNDR games and earning some sats.\"\n\n**The Vision: Beyond Banking**\n\nIf Coen could ask Satoshi Nakamoto one question, it wouldn't be about the technology. \"I think it'd be fascinating to know the why behind it,\" he says. \"Obviously yeah, money is f*****, but what comes after? What is the vision that you have? All right, we fix the money, and then what does the world look like in your eyes?\"\n\nWith Osmo, Coen isn't waiting for that answer: he is actively building it. By delivering modern borderless banking services powered by Bitcoin, he's creating a future where financial inclusion isn't just a buzzword but a reality for millions across Latin America.\n\nAs smartphone penetration exceeds 95% throughout the region, the technology to transform financial services is already in people's hands. Osmo is simply unlocking its potential.",
  "wordCount": 1350,
  "readingTime": 5.09433962264151,
  "claps": 0,
  "voters": 0
}