{
  "id": "4d86cc2bc2e1",
  "title": "Day 1124",
  "createdAt": "2025-04-20 02:24:13",
  "tags": [
    "bitcoin",
    "fiat",
    "entropy",
    "diabetic",
    "tech"
  ],
  "url": "https://chepenikconor.medium.com/day-1124-4d86cc2bc2e1",
  "content": "# Day 1124\n\n![[https://youtu.be/lInEKU8hV6Y](https://youtu.be/lInEKU8hV6Y)](https://miro.medium.com/1*hQj3JPMN6wgsk-ig91gtZg.png)\n\nMicheal Saylor gave an awesome analogy on a [recent podcast](https://youtu.be/lInEKU8hV6Y) about how Bitcoin is digital energy. He explained that Bitcoin stores economic energy: your time, your labor, your life force. Without Bitcoin every company is essentially a Type 1 diabetic. And that tracks. If you work and earn, but the system lacks the \"insulin\" to deliver that value to your future self, then what good is it?\n\nOf course, it's not a perfect analogy. But the core truth holds: the energy's there in theory, yet inflation blocks it from reaching your goals, starving your time of meaning. The problem with storing value in fiat is that it leaks. Inflation eats it. Central banks dilute it. It's like trying to carry water in a bucket riddled with holes. Bitcoin, on the other hand, is like a sealed thermos for value, mathematically scarce, incorruptible, and immune to the decay of arbitrary money printing.\n\nBitcoin is a machine that fights entropy, the universal force of disorder. In physics, entropy causes systems to break down over time. Fiat currencies are high-entropy systems: broken money, chaotic, unpredictable, constantly manipulated. They degrade the trust and stability required for civilization to function. Which is ironic, because fiat is basically one big game of \"trust me, bro.\" Bitcoin flips that script. It's governed by unchangeable code and a finite supply. A system of perfect order, running 24/7 like a cold, silent engine pushing back against monetary chaos. Bitcoin sucks up disorder and creates financial clarity acting like a digital gravity well for truth.\n\nFor someone who hasn't studied what money actually is, this might sound abstract. But the core idea is simple: Bitcoin gives you a way to store your time and energy without it being stolen. It's a vault that doesn't rust, a property that doesn't erode, a signal in a world full of noise. When you realize that money is just stored human action, the residue of what you've chosen to spend your life on, it becomes insane to trust that value to a system designed to decay. Or better yet, to straight-up steal from you.\n\nIt's a harsh truth to face; that printing money pickpockets everyone who uses that same money as a savings account. It's why the line between saving and investing has become so blurred. So, in short: while no analogy is perfect, I love Saylor's framing. A business not on a Bitcoin standard is basically a Type 1 diabetic. And that really makes you think... what diabetic with any will to live would refuse insulin?\n\nIn other news, I used ChatGPT to help me figure out some wiring today, and it worked perfectly. I now have a sprinkler system in my backyard that I can control from an app. While I do have some security concerns with all the IoT and networking required for many smart home devices, I have to admit it feels incredibly satisfying to have a working sprinkler system that I don't need to turn on and off manually. I love technology.\n\n![[https://x.com/ConorChepenik/status/1913723863365562476](https://x.com/ConorChepenik/status/1913723863365562476)](https://miro.medium.com/1*YGlCYpreuq6c5nuzJrqynA.png)\n\n4/19/25\n\nConor Jay Chepenik",
  "wordCount": 511,
  "readingTime": 2.3116352201257864,
  "claps": 0,
  "voters": 0
}