{
  "id": "52c43f90756d",
  "title": "Day 143",
  "createdAt": "2022-08-12 17:59:52",
  "tags": [
    "straw-man-fallacy",
    "fiat",
    "bitcoin",
    "incentives",
    "crêpes"
  ],
  "url": "https://chepenikconor.medium.com/day-143-52c43f90756d",
  "content": "# Day 143\n\nI've moved my second Bitcoin Magazine article to my google drive and will continue to flesh out ideas until I'm ready to submit the first draft to the editor over there. However, I'd like to continue fleshing out ideas so I get a better idea what I want to add. At this point the article will definitely be about incentives and I'm eager to think through some [straw man fallacies](https://www.youtube.com/watch?v=hfil34ayaEU) people might rebuttal my points with.\n\nPeople will buy bitcoin to increase/protect their purchasing power.\n\nStraw man argument - Bitcoin is too volatile for the masses to adopt it. I'd argue that volatility is to be expected in any emerging market being priced for the first time. Fiat might not seem volatile on the face because 1 dollar in your bank account still says 1 dollar, but the purchasing power of that dollar has been debased over 99% since the inception of the central bank. 1 bitcoin = 1 bitcoin and unlike dollars is mathematically programmed to increase in purchasing power as fiat continues to be printed out of thin air.\n\nCompanies will use bitcoin to avoid fees from visa/mastercard/amex/etc\n\nStraw man argument - Well bitcoin takes too long to confirm while visa/mastercard is near instant. I'd say the lightning network can take care of this. Also middlemen like Strike are working on things that will use the Bitcoin rails, but be just as fast as visa/mastercard. Over time people will accept both and use other companies as middlemen when they aren't willing to wait 10 minutes~ for the UTXO to be added and confirmed in a block by the network.\n\nGovernments will adopt Bitcoin as the network continues to grow\n\nStraw man argument - Actually they will ban it and Bitcoin will die. China tried that in 2020 and the U.S scooped up all that hashrate. Bitcoin miners go to the places where they can be confident in their private property rights and also access cheap energy. Bitcoin miners will flee hostile countries and true bitcoin holders will continue to accumulate in authoritarian regimes because they understand the government doesn't want capital fleeing because they are planning to debase their own currency. As the countries that adopt bitcoin as legal tender thrive it will encourage others to do the same rather than fight it.\n\nBitcoin can disincentivize government violence because it makes it harder to steal from the citizens of the country.\n\nStraw man argument - You can't stop a violent government from enacting violence. I'd say true, but you can store your wealth in a 12 word seed phrase you memorized and leave said country. Doing so with large amounts of cash, gold, or bank accounts that you worry might be frozen are a legit reason many people don't flee their countries. Now with Bitcoin they can flee and as they leave the government will have no idea they have their wealth safely stored in their head.\n\nBitcoin can help build out more green energy and create an abundant amount of cheap energy for the world.\n\nStraw man argument - Bitcoin uses too much energy is boiling the ocean. I'd tell them to read Alex Epstein's fossil future and notice how they have been brought up to have an anti-human mindset. I'm all about a human flourishing agenda where people can access cheap energy. Energy is what powers the machines that make life in the modern world so amazing. We should be using more energy not less. This chart truly blew my mind when I first saw it.\n\n![](https://miro.medium.com/0*dLtLqWX0i0euSnZJ)\n\nFossil fuels use has dramatically brought down climate related deaths. We need more fossil fuel use to help humanity flourish not less.\n\nSolid start. Feels good to think through some of what the naysayers might strawman my argument with and elaborate on my points. Writing is an amazing thing. Try it out anon ;)\n\nGot crepes this morning with my girlfriend. I very much enjoy crepes and the place we went was delicious. After tip though 2 crepes, a mocha coffee, and an iced tea cost me 40 bucks. I don't blame the restaurant. They have to get by and make money. I just think it becomes more apparent by the day fiat is rapidly hyperinflating. It could ugly in the future and I hope many people can discover the life boat that is BTC before fiat currencies collapses. We are privileged to have the best fiat currency in the U.S.A, but that is like being the best looking pile of shit. It is not saying much.\n\n8/12/22\n\nConor Jay Chepenik",
  "wordCount": 764,
  "readingTime": 3.0830188679245283,
  "claps": 0,
  "voters": 0
}