{
  "id": "55173404fb9b",
  "title": "Day 1389",
  "createdAt": "2026-01-10 04:58:20",
  "tags": [
    "perspective",
    "is",
    "important"
  ],
  "url": "https://chepenikconor.medium.com/day-1389-55173404fb9b",
  "content": "# Day 1389\n\nHad my daughter's birthday party tonight. It was awesome. Nice hanging with other dads who have small children. Wild how fast it flies and that my first born is 3. Really does feel like yesterday I was in our Cambridge apartment watching my wife give birth to her. Insane that the lady I love managed to have a home birth for our first.\n\nOne of the dads who was at the party is from Ukraine. He was talking about fleeing a warzone with his pregnant wife. He mentioned that his Grandpa used to tell stories of how bad fighting in war was, and how he never expected to deal with those same realities. Then one morning he woke up and bombs were going off outside his window.\n\nTalk about perspective. I'm grateful America has two big oceans, but imagine one day you see fighter jets and bombs dropping. A terrifying prospect. Something I pray I never have to experience. Outside of losing your home and everything inside it, imagine your life and those you love at risk. And for what? So some banker can get rich financing the war, or worse, the rebuild?\n\nPutin is by no means someone I look up to, but I remember seeing a video of him talking about how this war is not with him but with our leadership, who keeps selling out our people for their own interests and pet projects. Sure, some of that might be propaganda, but there is truth in there. War is a racket that enriches politicians, the military industrial complex, and the financiers. It destroys families, life, private property. All of it.\n\nAs I sit here typing on my nice laptop with a fancy keyboard and mouse and a nice monitor, I can't help but think how lucky I am. I don't have to deal with bombs dropping. I have plenty of food, hot water, and AC. Life is good. Despite all the flaws of our modern world, I'm blessed more than I can imagine. I appreciate my friend for showing me that perspective matters. Hug your kids. Your loved ones. Those you cherish. Life can be hard, but someone always has it worse.\n\n1/9/26\n\nConor Jay Chepenik",
  "wordCount": 371,
  "readingTime": 1.4,
  "claps": 0,
  "voters": 0
}