{
  "id": "55dc11350747",
  "title": "Day 1370",
  "createdAt": "2025-12-22 01:48:53",
  "tags": [
    "stay-frosty"
  ],
  "url": "https://chepenikconor.medium.com/day-1370-55dc11350747",
  "content": "# Day 1370\n\n[Came across this document](https://documents2.theblackvault.com/documents/osd/16-f-1727.pdf) which details some of the Psy-ops the U.S military runs. It was a [dense doc so I ran it through NotebookLM](https://notebooklm.google.com/notebook/93e2312e-ae54-4a1b-95e7-fae746410a62) for a quick analysis. Step one to seeing through the psy-ops is being aware of them. Step two is reading the source materials (or in my case asking an LLM for the most crucial insights).\n\n**THE PSYOP DEEP DIVE: How to Lose Friends and Influence Nations (on a Budget)**\n\n**The \"Don't Shoot, Just Talk\" Doctrine**\n\nWelcome to the latest edition of _Unredacted Logic_. Today, we're peeling back the layers of a 330-page fever dream from the Department of Defense: the Joint Psychological Operations Task Force (JPOTF) Master Training Guide. Released via FOIA after a decade in the dark, this manual is essentially the military's \"How-To\" guide for winning a fight by talking the other guy into hitting himself. Or, as they put it, \"precluding the need to employ combat forces.\"\n\nHere are the 7 most high-signal parts of this manual, analyzed for those of us who prefer our propaganda with a side of irony.\n\n**1. The Mission: Gaslighting as a Strategic Asset**\n\nThe manual defines PSYOP as the planned conveyance of information to influence foreign audiences' \"emotions, motives, objective reasoning, and ultimately behavior.\" It's heartening to know the Pentagon thinks we have \"objective reasoning\" to begin with. The military isn't just trying to win hearts and minds; they're trying to reprogram the OS. It's essentially a 330-page manual on how to be a professional \"Influencer,\" but instead of selling FitTea, you're selling \"Not Overthrowing the Current Regime.\"\n\n**2. The EC-130 COMMANDO SOLO: The Flying Podcast of Doom**\n\nOne of the specialized assets listed is the EC-130 COMMANDO SOLO, an aircraft equipped for \"airborne broadcasting of radio and television signals.\" Imagine being in a remote conflict zone, and the sky itself starts broadcasting a mid-tier local news report or a very aggressive podcast. This is the ultimate \"unsolicited advice.\" It's basically the military equivalent of that one neighbor who won't stop talking over the fence, except the fence is at 20,000 feet and the neighbor has Hellfire missiles.\n\n**3. The \"20% Rule\": Setting the Bar for Mind Control**\n\nUnder \"Standards\" for recommending actions, the manual states a successful operation is one where \"20 percent of target audience exhibits behavior in accordance with JFC's desires.\" If a marketing firm told you they could only get 20% of people to stop throwing rocks at them, you'd fire them. But in the world of high-stakes military influence, a one-in-five success rate is a \"Standard.\" It's basically the military admitting that 80% of the time, the target audience is just staring at the leaflets thinking, \"This would make toilet paper.\"\n\n**4. Target Audience Analysis: Stereotyping as a Science**\n\nThe guide requires a thorough analysis of the target's culture, religion, and \"National Character,\" which is categorized as \"Open and adaptable,\" \"Careful and moderate,\" or \"Closed and rigid.\" The military is trying to use spreadsheets to quantify the \"vibes\" of entire nations. \"Sir, we've analyzed the enemy. They're 'Careful and Moderate' with a hint of 'Indifferent.'\" It sounds less like a war plan and more like the world's most judgmental dating app profile.\n\n**5. \"Deeds vs. Words\": The Humanitarian Bribe**\n\nThe manual highlights the importance of Civil Affairs (CA), noting that \"CA activities can contribute significantly to the overall success of PSYOP activities (deeds versus words).\" This is the military version of \"I'm not a regular army, I'm a cool army.\" They're building a school, but the school is actually a giant billboard for the concept of stability. It's the humanitarian equivalent of a \"free gift with purchase,\" where the purchase is your soul.\n\n**6. The Bureaucracy of a \"Low-Cost\" Operation**\n\nPSYOP is touted as a \"low cost, high impact\" tool. To achieve this \"low cost\" impact, you only need: a Task Force Commander, a Chief of Staff, a Chaplain, a Judge Advocate, and six specialized staff sections (J1 through J6) managing everything from \"mortuary affairs\" to \"frequency management.\" It takes a village to manipulate a village. If this is \"low cost,\" I'd hate to see the Pentagon's \"splurge\" category.\n\n**7. The \"Intentionally Blank\" PSYOP**\n\nThe manual contains numerous pages marked **(INTENTIONALLY BLANK)**. In a document dedicated to filling people's heads with specific \"themes and symbols,\" leaving pages blank is the ultimate power move. Is it a mistake? Or is it a psychological test to see if we'll try to read between the lines that don't exist? It's the most successful operation in the book: I've spent more time thinking about the blank pages than the section on \"Airborne Broadcast Transmitters.\"\n\n**The Analogical Closer**\n\nThink of the Joint Psychological Operations Task Force as a world-class corporate marketing team sent to a convention where everyone hates their product. While the Infantry is the security team clearing the aisles, the JPOTF is the guy in the booth handing out free pens and trying to convince you that the product isn't \"Explosive Ordnance,\" it's actually \"Rapid Urban Redevelopment.\"\n\nStay skeptical, stay reasoned, and if you see a C-130 circling your house broadcasting a Top 40 countdown, maybe close your windows and put some tinfoil around your bedroom walls.\n\nI'm no military expert, but I can see why some make the case that if we are actually in World War 3, there is very little difference between civilian & soldier and much of the battle is happening online. Reminds me of this 4chan banger from 2022:\n\n![I guess the moral of the story is keep shitposting?](https://miro.medium.com/1*ofDO3cOanIoyCVi6B6rncw.png)\n\nOr maybe the moral of the story is focus locally. Stop paying so much attention to B.S that you can't control. Spend less time thinking globally (or being on the internet) and more time focusing locally :)\n\nCheers anon!❤\n\n12/21/25\n\nConor Jay Chepenik",
  "wordCount": 970,
  "readingTime": 3.8603773584905663,
  "claps": 0,
  "voters": 0
}