{
  "id": "57454d9f5760",
  "title": "Day 946",
  "createdAt": "2024-10-24 03:59:34",
  "tags": [
    "i-love-bitcoin-yes-i-do"
  ],
  "url": "https://chepenikconor.medium.com/day-946-57454d9f5760",
  "content": "# Day 946\n\n![](https://miro.medium.com/0*QQRyFcKdpke-z2uN)\n\nThis equation represents the Bitcoin supply formula, which explains how the total supply of Bitcoin is limited to 21 million coins. Let me break it down in a way that a 5th grader can understand (thank you for your help on this chatGPT):\n\n- **Σ (the big E symbol)**: This is a math symbol called \"Sigma,\" and it means \"add things up.\" We're going to sum up some numbers.\n\n- **210,000**: This is the number of \"blocks\" in one cycle. A new Bitcoin block gets added every ~10 minutes.\n\n- **50 / (2^i)**: This part tells us how many Bitcoins get created at each stage. Bitcoin's reward halves every 210,000 blocks (which takes about 4 years).\n\n- At the start (when i=0), miners get **50 Bitcoins** per block.\n\n- After the first 210,000 blocks (i=1), the reward becomes **25 Bitcoins** (because 50 ÷ 2 = 25).\n\n- After another 210,000 blocks (i=2), the reward becomes **12.5 Bitcoins** (because 25 ÷ 2 = 12.5).\n\n- And it keeps going, halving every 4 years.\n\n- **32**: This tells us to keep halving the reward up to i=32. Since we start counting from i=0, this actually gives us 33 total periods. Well over 90% of the Bitcoin supply has already been mined (it's late 2024 at the time of this writing), and future block rewards will become increasingly small as we progress through the remaining halving cycles.\n\nPutting it all together The equation is saying:\n\n1. Start with **50 Bitcoins** per block (i=0).\n\n2. Mine **210,000 blocks** and reduce the reward by half after every 210,000 blocks.\n\n3. Repeat this halving until i=32 (giving us 33 total periods) which will take until approximately 2140.\n\n4. **Add up all the Bitcoins** from each halving, and you get a maximum of **21 million Bitcoins** that will ever exist. It's really 20.99999 *a lot of 9s* to be exact.\n\nThis equation shows that Bitcoin has a fixed supply - meaning no one can create more than 21 million Bitcoins. It's like having only 21 million golden tickets that will ever exist, so people value them a lot. Except a bunch of these golden tickets have been lost. In this case the golden tickets are just a public/private key pair that allows you to send value to anyone in the world if they have a public/private key pair (bitcoin wallet) they control. The Bitcoin network uses bitcoin as it's currency. It's the most fair, honest, and truthful form of money humanity has ever seen. No fiat. No decrees. Just the cold hard Truth of mathematics.\n\nIt's worth noting that as the block rewards decrease over time, miners will increasingly rely on transaction fees to sustain the network. When users send Bitcoin transactions, they include a small fee that goes to miners. As Bitcoin becomes more valuable and widely used, these transaction fees should provide sufficient incentive for miners to continue securing the network even after the block rewards become minimal.\n\n![](https://miro.medium.com/0*DjdifcKLMLX9Y9YZ)\n\nAmazing. Fix the money; fix the world.\n\n10/23/24\n\nConor Jay Chepenik",
  "wordCount": 494,
  "readingTime": 2.2474842767295597,
  "claps": 0,
  "voters": 0
}