{
  "id": "576c339cf143",
  "title": "Day 1024",
  "createdAt": "2025-01-10 02:36:45",
  "tags": [
    "seedor",
    "secure",
    "your",
    "bitcoin",
    "private-keys"
  ],
  "url": "https://chepenikconor.medium.com/day-1024-576c339cf143",
  "content": "# Day 1024\n\n**From Birth Certificates to Bitcoin: How Seedor Is Revolutionizing Seed Phrase Security**\n\nWhen Chris, a mechanical engineer specializing in aerospace and material sciences, lost his birth certificate in a devastating flood in Germany, he learned firsthand the fragility of paper documents. Years later this experience would help shape his approach to one of Bitcoin's most critical challenges: securing private keys.\n\n\"It was really a pain to get my birth certificate back,\" Chris recalls. \"I had to go to the office with my mom as a witness because she had to prove that I came out of her. Without it, they would not have supplied me with a new birth certificate.\"\n\nPain is often the best teacher. Many people don't think about how to properly secure your crucial documents until a disaster happens and you lose them. This personal brush with document vulnerability, combined with his engineering background, led Chris to co-found Seedor with a fellow engineer. Their mission? Creating the most robust and user-friendly Bitcoin seed phrase backup solution possible.\n\nIt's clear they believe in the excellence of German engineering. The Seedor Safe, their flagship product, is quite the metal backup solution. It's a precisely engineered device that addresses numerous security and usability concerns that other products in the market overlook.\n\n\"I wanted to have a backup that if somebody finds it, they do not have to go on the internet to figure out how it works,\" Chris explains. \"There should not be a cipher or anything like that, keep it simple.\"\n\nThe design priorities reflect deep thought about real-world usage scenarios:\n\n- Small enough to hide using a cordless drill hole in a wall\n\n- Individual discs for each word, preventing total loss from a single mistake\n\n- Space for 40 discs to include additional information like derivation paths\n\n- Full-length seed words to avoid confusion with similar-looking letters\n\n- Matching metals between discs and capsule to prevent galvanic corrosion\n\n- Hexagonal pins to prevent disc rotation without adhesives\n\nWhile Chris acknowledges that people can create DIY solutions from hardware store materials, he points out the limitations: \"With 3D printed types, they always break apart after like 12 words because these extruded lines aren't as tough. That's why we invested in proper TPE (thermoplastic elastomers) injection molded parts.\"\n\nThe company's attention to detail extends to their embossing system: \"Because different letters have different surface areas, you have to hit some of them more often than once. With our tool, you can lift it up and look and put it down and will hit the exact same spot again.\"\n\n![The Seedor Safe toolkit: A precision-engineered set of tools for securing your private keys](https://miro.medium.com/1*tmLGia1436AehA4Kq6ahjg.png)\n\nOne innovative feature of Seedor is that it subdivides into a system of smaller parts, which serves multiple security purposes. \"With a plate, I have to take out an angle grinder, I really have to go to town on it to destroy it,\" Chris notes. \"With these individual discs, I can throw them in different bodies of water or different trash cans, and this backup will never be put back together.\"\n\nThis modularity also enables secure international travel: \"I've traveled with parts of these capsules... I'm not going to risk TSA looking for it and wanting to find the seed all in one place.\"\n\nOf course being in a quickly growing business does not come without challenges. Despite being in business for four years, Seedor consistently faces a positive challenge: keeping up with demand. \"This is the fourth year we are in business, and despite manufacturing ever larger quantities, we still manage to run out of stock regularly,\" Chris admits. \"I'm not yet at the stage where we worry about competition since I can barely serve my existing customers.\"\n\nBeyond secure storage solutions, Chris is expanding into another crucial aspect of Bitcoin security through his venture Bitsurance: an insurance product for self-custodied Bitcoin. \"I want to solve the $5 wrench attack problem,\" he explains, referring to scenarios where physical threats of violence force people to give up their Bitcoin to a malicious actor.\n\nChris's vision for Bitcoin's future remains firmly rooted in education and accessibility. When asked how he'd like his contribution to Bitcoin's history to be remembered, he responds: \"I would like that in the inevitable uprising people will remember that I was one of the guys that didn't keep Bitcoin a secret and that I tried to convince as many as I could.\"\n\nThe success of Seedor demonstrates a growing recognition among Bitcoiners that proper backup solutions are essential for long-term security. Bitcoin is long term wealth. Those who hold it for many years have done incredibly well in the past and those who hold it today for the long term expect to see the same result. As Bitcoin continues its journey toward becoming the most sound global money the world has ever seen it would be a shame to lose your keys and make this absolutley scarce asset even more scarce. As Chris poignantly notes, \"There have been four or five million Bitcoins lost forever, and my goal is to stop that.\" Unlike birth certificates, you can't get your Mom to vouch for you to recover a pair of lost private keys - no matter how convincingly she might testify that they came from you. Companies like Seedor are ensuring that Bitcoiners have the tools they need to truly be their own bank.\n\nYou can learn more about Seedor on their [website](https://www.seedor.io/) and [X(Twitter)](https://x.com/seedor_io)\n\n1/9/25\n\nConor Jay Chepenik",
  "wordCount": 903,
  "readingTime": 3.607547169811321,
  "claps": 0,
  "voters": 0
}