{
  "id": "61bdd9c6904a",
  "title": "Day 979",
  "createdAt": "2024-11-26 02:09:06",
  "tags": [
    "you",
    "are",
    "a",
    "beast",
    "act-like-it"
  ],
  "url": "https://chepenikconor.medium.com/day-979-61bdd9c6904a",
  "content": "# Day 979\n\n![](https://miro.medium.com/1*9RrREsEahaNlLXtAbY28Rg.jpeg)\n\nToday I ran 4 miles after a long weekend of drinking. Man it felt so good...when I finished the run. The actual run itself was quite challenging but I could feel God during my run. I spoke to him, prayed to him, and asked him for the strength to finish the 4 miles and he delivered because he is all powerful.\n\nIt's amazing the simple lesson you learn about life while running: all great things you accomplish will come after grinding really hard. If you want to truly feel good about yourself there are no free lunches. There is a great quote which I sadly can't remember who said it, or the exact wording, but to paraphrase \"Anything the market gives you for free it will take back and then some.\" It's why most people who win the lottery go broke. Building wealth is hard, and if you skip the hard part you likely won't be able to keep the wealth.\n\nIt really was amazing to get in a flow state, music bumping, yelling things out, screaming, feeling like an animal as I ran today. It felt great honestly. Eckhart Tolle had a quote I loved which is \"Realize deeply that the present moment is all you ever have.\" Exercise gets you in that state to realize you only have right now. You can try to district yourself with music, podcasts, friends who run with you, but the reality is the exercise is constantly reminding you about your limits which include being stuck in the present moment.\n\nRuns are a great time for prayer if you ask me. I love the primal instincts that come from exercising hard. After all we are just animals, but the most based ones made in God's image.\n\nKeep grinding anon, it will be worth it as you look back on a life well lived.\n\n11/25/24\n\nConor Jay Chepenik",
  "wordCount": 316,
  "readingTime": 1.3924528301886792,
  "claps": 4,
  "voters": 1
}