{
  "id": "6d1e83fc34e7",
  "title": "Day 873",
  "createdAt": "2024-08-12 02:26:00",
  "tags": [
    "resistance-money"
  ],
  "url": "https://chepenikconor.medium.com/day-873-6d1e83fc34e7",
  "content": "# Day 873\n\n**Philosophy & Bitcoin: A Conversation with Professor Bradley Rettler**\n\nWhat do Plato and Bitcoin have in common? Both get easier to understand when you study philosophy. Jokes aside, in a world rife with Bitcoin misinformation, [Dr. Bradley Rettler](https://twitter.com/rettlerb) offers a refreshing voice of reason. As co-author of \"Resistance Money\" and Director of the [University of Wyoming Bitcoin Research Institute](https://www.uwyo.edu/philrelig/bitcoin/index.html), Rettler is on a mission to demystify the often-misunderstood digital asset.\n\n![UW Where the Bitcoin Research Institue is Located](https://miro.medium.com/1*9TWxrw60cahREfBAFT31eA.png)\n\nIn a recent conversation with Bitcoinnews, Rettler explored the world of Bitcoin, discussing its potential, challenges, and the difficulties of conducting research in this space. His approach? Using philosophy to ask better questions and think more clearly about Bitcoin.\n\nWhen asked about the biggest challenges facing Bitcoin, Rettler's response was unexpected. Instead of listing technical problems or regulatory hurdles, he paused, broke down the question, and responded with more questions. This wasn't avoiding the issue; it was philosophy in action.\n\n\"Bitcoin doesn't have to overcome any hurdles. Bitcoin's going to be fine,\" Rettler confidently stated. But he didn't stop there. He split the question into smaller parts: Is the Bitcoin software working well? Are enough people using the Bitcoin network? How is the U.S. dealing with Bitcoin?\n\nThis method of breaking complex issues into smaller, more manageable parts and examining each closely is a key part of philosophical thinking. Rettler believes it's crucial for truly understanding Bitcoin.\n\n\"Philosophy is important for understanding Bitcoin because it helps us step back and question our assumptions,\" Rettler explains. \"It's easy to get caught up in the excitement or negativity surrounding Bitcoin, but philosophy helps us cut through the noise and get to what really matters.\"\n\nThis philosophical approach is central to the University of Wyoming Bitcoin Research Institute, which Rettler leads. The institute aims to produce carefully reviewed academic research on Bitcoin, helping to better understand the digital asset and its effects on society. By encouraging critical thinking and thorough investigation, the institute hopes to improve Bitcoin research and offer a more complete understanding of this complex topic.\n\nRettler's approach to Bitcoin research is particularly interesting because it combines insights from many different fields. In \"Resistance Money,\" a book about how Bitcoin can be used to resist financial oppression, Rettler and his co-authors argue that Bitcoin touches on many areas, including economics, computer science, law, and environmental studies. Philosophy, with its ability to bring together ideas from various fields, is well-suited to provide a comprehensive understanding of Bitcoin.\n\nOne of the biggest obstacles to Bitcoin adoption, according to Rettler, is education. \"The more people know about Bitcoin, the more positive they tend to feel about it,\" he says, mentioning [The Nakamoto Project](https://www.thenakamotoproject.org/). This recent study found that people who understand Bitcoin better are more likely to view it favorably. This finding is important, given how much incorrect information about Bitcoin appears in mainstream media.\n\nRettler's book, \"Resistance Money,\" co-authored with [Andrew M. Bailey](https://twitter.com/resistancemoney) and [Craig Warmke](https://twitter.com/craigwarmke), aims to provide a new way of thinking about Bitcoin that challenges readers' existing views. \"It's hard to rethink something you already have an opinion about,\" he notes. By offering a fresh perspective, the book hopes to encourage readers to reconsider their stance on Bitcoin, looking at its potential as a tool for financial freedom and empowerment.\n\n![[https://www.resistance.money/](https://www.resistance.money/)](https://miro.medium.com/1*mqfNBgcyshvhTb7kBbKYoQ.png)\n\nThe conversation also touched on the challenges of conducting research in the Bitcoin space. Rettler notes that there's a lack of reliable sources, making it difficult for journalists to find trustworthy information. This is where the Bitcoin Research Institute comes in - an initiative aimed at providing objective, well-researched insights on Bitcoin. The institute's goal is to become a trusted resource for academics, journalists, and policymakers seeking to understand the complexities of Bitcoin.\n\nInterestingly, Rettler's journey into Bitcoin research highlights the potential career risks for academics in this field. Despite being a tenured professor, he acknowledges that there's still a stigma associated with Bitcoin research in academia. This underscores the need for more rigorous, peer-reviewed research in the field to legitimize it as a serious area of study.\n\nAs we concluded our conversation, I was struck by the importance of philosophy in understanding Bitcoin. Rettler's approach, which emphasizes critical thinking and rigorous inquiry, is a breath of fresh air in a space often dominated by hype and speculation. By applying philosophical principles to the study of Bitcoin, we can gain a deeper understanding of this complex phenomenon and its implications for society.\n\nThe intersection of philosophy and Bitcoin is not just an academic exercise. It has real-world implications for how we understand money, value, and financial systems. As Bitcoin continues to evolve and reshape our financial landscape, the need for philosophical inquiry becomes ever more crucial. Rettler and his colleagues are at the forefront of this important work, helping to bridge the gap between technical understanding and broader societal implications of Bitcoin.\n\nIf you're interested in supporting this mission and want to see more academic research on Bitcoin, consider donating to the University of Wyoming Bitcoin Research Institute [here](https://www.givecampus.com/campaigns/49172/donations/new).\n\n8/11/24\n\nConor Jay Chepenik",
  "wordCount": 843,
  "readingTime": 3.5644654088050314,
  "claps": 0,
  "voters": 0
}