{
  "id": "6d2ec8b7be03",
  "title": "Day 1122",
  "createdAt": "2025-04-18 03:16:11",
  "tags": [
    "kek"
  ],
  "url": "https://chepenikconor.medium.com/day-1122-6d2ec8b7be03",
  "content": "# Day 1122\n\nThat face you make when you open X(Twitter) to do something then get distracted by something on the timeline. I'm sure this applies to just about every social media out there 😂\n\n![Happens too often](https://miro.medium.com/1*5s5Ar8PDK9Qdh9vfv-XLVg.png)\n\nWhen you open the app and do what you meant to do.\n\n![](https://miro.medium.com/1*TGu-6hzUAvCgRpc13ocOnA.png)\n\nIt's the eyes man. Amazing how much you can discern from the eyes.\n\nLuckily, I was able to do what I wanted and wrote an X thread I'm proud of which is below:\n\nHere are some predictions for technology that will have incredible impacts moving forward. Three non‑consensus ideas you'll want on your radar\n\nLLMs need bodies - cheap ones\n\n- I'm told by the models that text‑only learning is hitting a wall\n\n- Plugging models into $50 toy robots closes the loop: word ➜ action ➜ feedback\n\n- Expect an \"iPhone moment\" for dime‑a‑dozen bots\n\nTo get smarter, AIs must bump into the coffee table like the rest of us.\n\nUltra‑cheap desalination = desert forests\n\n- Solar + membranes push water cost ↓ 10×\n\n- Pipe that water inland, plant trees, clouds follow\n\n- A surprise positive climate feedback kicks in\n\nPrivate companies might green the Sahara faster than climate alarmists can glue themselves to the highway and hold up traffic.\n\n\"Protocol nations\" vs. passports\n\n- Crypto (Bitcoin) treasuries + AI courts = cloud‑based governments?\n\n- Remote workers already vote with their feet (and VPNs)\n\n- Mid‑size states risk being out‑competed by code\n\nNot hard to imagine citizenship becoming an app subscription where if you have enough sats you can get in to just about any country.\n\nTimes are changing. The future isn't what most expect it's weirder, more beautiful, and emerges from the edges.\n\n![](https://miro.medium.com/0*THZs-hNSZtBH6oKb)\n\n4/17/25\n\nConor Jay Chepenik",
  "wordCount": 277,
  "readingTime": 1.5952830188679246,
  "claps": 0,
  "voters": 0
}