{
  "id": "74fe8103605f",
  "title": "Day 876",
  "createdAt": "2024-08-14 21:14:40",
  "tags": [
    "ai",
    "grok",
    "politics",
    "bitcoin",
    "alligators"
  ],
  "url": "https://chepenikconor.medium.com/day-876-74fe8103605f",
  "content": "# Day 876\n\nX/Twitter just had a huge upgrade to their Grok AI model and now it can make images. Pretty impressive the quality and I love that they don't censor you when you ask to make a political figure.\n\n![](https://miro.medium.com/1*9ICaMiv0r-j8PqNhr3uDVg.png)\n\n![](https://miro.medium.com/1*J-RmQLGQ7uqP6Hr7D-wAzg.png)\n\n![](https://miro.medium.com/1*WvOfnHCxM4MilTgX3oucBg.png)\n\nI asked the AI to generate me 3 images of each Presidential candidate wrestling an Alligator. I think it confused RFK Jr with his Dad and Kamala does not look much like the actual Kamala but still amazing what this technology can do.\n\nIn other news I asked the AI in my [SaylorScope.com](https://www.saylorscope.com/) application to generate me a prediction for the annual appreciation of BTC and this is what it said. Maybe I'm not bullish enough lmao.\n\n![](https://miro.medium.com/1*8YHJOgHjdHdjUawC1_KFzA.png)\n\n![](https://miro.medium.com/1*1hVUav2k8bvMXgGYZ03UrA.png)\n\nNow, I'm fully aware that a 150% annual return isn't exactly what you'd call 'sustainable' in the long term, but let's not get too caught up in the details. Over the next five years? It's not just possible; I would argue it's probable.\n\nWhy, you might wonder? Because the big guns, the institutions, have finally rolled into town. They're not here to play the short squeeze or to chase the next pump and dump. No, they're here to pump our bags, mine included, with the kind of long-term commitment that many traders simply do not have.\n\nUnlike the day traders and the 'paper hands' out there, who are more interested in flipping Bitcoin for a quick buck, these institutions are in for the marathon, not the sprint. They're here to buy, hold, and watch the value soar. So, if you're asking for my take, I'm feeling more bullish on the orange coin than a bull in a china shop.\n\n![swan.com/conorchepenik](https://miro.medium.com/1*DovaKaO7xmxSfhYulfvmVQ.png)\n\nStay humble, stack sats, zoom out. Not financial advice of course, but I'm wagering my savings that doing that will result in an early retirement where I can work on whatever it is I want to work on.\n\n8/14/24\n\nConor Jay Chepenik",
  "wordCount": 318,
  "readingTime": 2.15,
  "claps": 0,
  "voters": 0
}