{
  "id": "77220b90217d",
  "title": "Day 1020",
  "createdAt": "2025-01-05 22:42:06",
  "tags": [
    "pareto-principle"
  ],
  "url": "https://chepenikconor.medium.com/day-1020-77220b90217d",
  "content": "# Day 1020\n\nOn the road headed back home to Florida after a long stay in the tri-state. Had the pleasure of hanging with some friends last night in NYC and going to a comedy club. I have no desire to live in New York City, but man do I enjoy visiting. It's like that one friend you can only handle in small doses. You love the energy, but you also like being able to leave it behind.\n\n![Black Velvet, Minstim, Gabagool, & Ze Binmucker](https://miro.medium.com/1*foOU5ddFhHO4q12zJmpXuw.png)\n\nThe comedy show was a blast. There's just something electric about live comedy. The unpredictability, the rawness, the sheer bravery of it. We saw about seven comics, and suprisingly, no one bombed. That's rare when you have multiple comics doing 5 minutes. Comedy can a brutal gig; you're one awkward pause away from existential dread. Then again, what job isn't hard these days? Maybe a lighthouse keeper? But even then that must be lonely sitting in a tower all day by yourself. Probably easier now since we all have smart phones and 24/7 access to entertainment.\n\nI digress. On the drive back home I cracked open my daily chapter of _Zero to One_ by Peter Thiel. He dives into the Pareto Principle, the idea that 20% of the effort produces 80% of the results. It's a concept I've heard before, but Thiel framed it in a way that hit me fresh. One example of this rule I always liked is clothing: 20% of your wardrobe gets 80% of the wear. That's my sign to purge some of the clothes I've been hoarding all these years despite never wearing them.\n\nThiel points out in the book that most people don't think in the pareto principle or power laws. Instead, we are taught in school and through common wisdom that we must diversify everything because it feels safe. But playing it safe often means playing it small. If you want outsized results, you've got to concentrate your bets. You can't become an elite writer if you're splitting your time equally between writing, stand-up comedy, music, YouTube, and chef school. You might become a jack of all trades if you are practicing a bunch of different things, but you are guaranteed to not become elite at any of them.\n\nThe reminder to focus really hit home for me today. The 80/20 rule isn't just some productivity hack; it's a way to see where the real value lies. 20% of the work I do will drive 80% of the results. So why not double down on that 20% and let the rest, the noise, the filler, the stuff we convince ourselves is \"productive\", fall by the wayside?\n\nIf I can zero in on the work that really matters, the stuff that moves the needle, I'll be way better off.\n\nSimple advice, harder to implement than it seems.\n\n1/5/25\n\nConor Jay Chepenik",
  "wordCount": 476,
  "readingTime": 1.9962264150943396,
  "claps": 0,
  "voters": 0
}