{
  "id": "781329021d10",
  "title": "Day 1154",
  "createdAt": "2025-05-20 01:48:54",
  "tags": [
    "you",
    "can",
    "just",
    "do",
    "things"
  ],
  "url": "https://chepenikconor.medium.com/day-1154-781329021d10",
  "content": "# Day 1154\n\nI'm going to go hard on this children's coloring book until it's a thing. I need to will this into existence.\n\nSo for the front cover I think this is nearing completion:\n\n![](https://miro.medium.com/1*-I5Hco9zsmoRhtIS5rPEPQ.png)\n\nI got a good start with all those pictures yesterday, but to make it even more educational I want to do one big word on the top then at the bottom I want to have a sentence. This way the book can be for a wider range of children.\n\n## ✅ Final List of 21 Words with Captions\n\n1. **Block**\n _\"Blocks are how Bitcoin keeps track of time and transactions.\"_\n\n2. **Chain**\n _\"When blocks are linked together, they form the blockchain!\"_\n\n3. **Wallet**\n _\"A wallet keeps your Bitcoin safe - just like a piggy bank keeps coins.\"_\n\n4. **Key**\n _\"Bitcoin private keys are like secret passwords that only you should know.\"_\n\n5. **Mine**\n _\"Miners help secure Bitcoin and earn coins by solving puzzles.\"_\n\n6. **Hodl**\n _\"HODL means holding your Bitcoin tight, even when prices bounce around.\"_\n\n7. **Save**\n _\"Saving helps you prepare for the future - Bitcoin makes saving strong!\"_\n\n8. **Secure**\n _\"Bitcoin is secured by computers all over the world.\"_\n\n9. **Node**\n _\"A node helps check the rules and keeps Bitcoin honest.\"_\n\n10. **Verify**\n _\"Don't trust, verify yourself!\"_\n\n11. **Trade**\n _\"Bitcoin lets you trade with anyone, anywhere, anytime.\"_\n\n12. **Value**\n _\"Bitcoin has value because it's limited and people believe in it.\"_\n\n13. **Limited**\n _\"Only 21 million Bitcoin will ever exist - that's what makes it rare!\"_\n\n14. **Treasure**\n _\"Bitcoin is like treasure you can't dig up - but you can earn and save it.\"_\n\n15. **Freedom**\n _\"Bitcoin helps people stay free by giving them control of their money.\"_\n\n16. **Energy**\n _\"Bitcoin helps turn energy into money - even from trash, water, or sun!\"_\n\n17. **Code**\n _\"Bitcoin runs on open code that anyone can check!\"_\n\n18. **Truth**\n _\"Bitcoin is honest money. It can't lie, cheat, or play favorites.\"_\n\n19. **Global**\n _\"Bitcoin works all over the world, no matter where you are.\"_\n\n20. **Moon** _(merged with Rocket)_\n _\"People say Bitcoin is going to the moon - that means it's going up!\"_\n\n21. **Satoshi**\n _\"Satoshi invented Bitcoin - but nobody knows who they are!\"_\n\nHere are some of the new image drafts\n\n![](https://miro.medium.com/1*WxpNL9aS8XLTcoM0LdGB0A.png)\n\n![](https://miro.medium.com/1*ucbPDnThHU8v8TLiuw1WOw.png)\n\n![](https://miro.medium.com/1*0gUJRF6WSG5byv7grovy4w.png)\n\n![](https://miro.medium.com/1*00G3rzz30hE2wNQ89Hi3jw.png)\n\n![](https://miro.medium.com/1*1qWK6bR3bZFNJ5-VnHoYYg.png)\n\nSolid progress. Tomorrow we make even more progress.\n\n5/19/25\n\nConor Jay Chepenik",
  "wordCount": 364,
  "readingTime": 2.3235849056603772,
  "claps": 0,
  "voters": 0
}