{
  "id": "787f093bbfdf",
  "title": "Day 924",
  "createdAt": "2024-10-02 01:13:41",
  "tags": [
    "what",
    "a",
    "time",
    "to-be",
    "alive"
  ],
  "url": "https://chepenikconor.medium.com/day-924-787f093bbfdf",
  "content": "# Day 924\n\nWell, October 1st certainly has been a wild day. Iran decided to start the party with a literal bang, launching missiles towards Israel like they were handing out party favors. It's like a high-stakes game of chess, but instead of pawns, they're using high-tech weaponry. The whole world is sitting around, holding its breath, like a bunch of party-goers waiting for the cake to arrive. Jokes aside, I pray we can get some peace because I don't want to see World War III kick off when so many countries have nuclear weapons.\n\n![[https://x.com/CensoredMen/status/1841160838662475903](https://x.com/CensoredMen/status/1841160838662475903)](https://miro.medium.com/1*LyoxIQui7xaNxMBVlPtaEQ.png)\n\nIn the midst of all this, the port workers in the U.S. decided to go on strike. It's like they said, \"Hey, if the world's going to be in chaos, let's add a little more spice to it.\" Now, it's not just a labor issue; it's like adding a massive traffic jam to a battlefield. No container moves without their say-so.\n\n![[https://x.com/TomFitton/status/1841278304961081476](https://x.com/TomFitton/status/1841278304961081476)](https://miro.medium.com/1*T9XssHjXL3_3chzXK5XrAw.png)\n\nNot sure this is true. I did see other sources saying they want a 77% raise, which is a lot. This was the first post I saw noting they were offered 50%. I also saw the longshoreman are demanding no automation as well as the raise, which is like trying to stop the future from happening. But hey, when an opportunity to cripple the country or force a raise for everyone presents itself, well we know where the longshoremen stand.\n\nAnd in the midst of this economic chess game, political figures, in what seems like an attempt to keep the absurdity dial at 11, have begun arguing against voter ID requirements. It's as if they've read the script for today and thought, \"Well, if we're throwing logic to the wind, why not make voting as secure as leaving your front door unlocked?\" This isn't just a policy suggestion; it's like suggesting we host elections in a way that makes \"The Purge\" seem overly bureaucratic.\n\n![[https://x.com/elonmusk/status/1841007685224788079](https://x.com/elonmusk/status/1841007685224788079)](https://miro.medium.com/1*otoXKR_z4guDO8ryLkXo3w.png)\n\nSo here we are, with missiles flying around like party balloons, ports at a standstill, and the very concept of voter ID under fire. It's like watching a war epic, a drama about labor rights, and a political thriller, all mashed up into one crazy October's first day.\n\nThis confluence of events might make one wonder if Earth just decided to test humanity's multitasking abilities. From geopolitical tensions that could make your hair turn white, to labor disputes that remind us of how the world runs on logistics, right down to the fundamental debate on how we ensure the integrity of democracy, it's quite the show.\n\nHopefully October 2nd is more chill. LOL.\n\n10/1/24\n\nConor Jay Chepenik",
  "wordCount": 440,
  "readingTime": 2.2103773584905664,
  "claps": 0,
  "voters": 0
}