{
  "id": "7d961d68f064",
  "title": "Day 1104",
  "createdAt": "2025-03-30 14:52:56",
  "tags": [
    "unseen-finance",
    "el-salvador",
    "imf",
    "debt",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-1104-7d961d68f064",
  "content": "# Day 1104\n\n**The Bitcoin Insider Who Saw the Slime and Stayed Anonymous**\n\nImagine spending over four decades swimming in the swamp of global finance, IMF, central banks, multinational development banks, regulators, and emerging not with a fat pension and a golf club membership, but with a [Substack](https://substack.com/@unseenfinance21) and a Bitcoin wallet. Meet Unseen Finance, a self-described \"ex-insider who has seen the slime at the bottom of the global finance swamp.\" His bio hints at a career spanning the International Monetary Fund, ministries of finance, and risk management, all while dodging the spotlight with a cloak of anonymity. Why? \"I've seen too much,\" he says simply.\n\nBitcoin News caught up with Unseen, virtually of course, since confidentiality is non-negotiable when you've rubbed elbows with governments and multinational programs dealing in high finance across the globe. What we got was a nuanced and sobering take on Bitcoin, El Salvador, the IMF, and the absurdity of the financial systems he once helped run.\n\n**The IMF: Bad Guy or Fall Guy?**\n\nThose who have looked into the International Monetary Fund love to paint the IMF as the Darth Vader of finance, [strangling nations with debt so they can control them](https://youtube.com/shorts/C7ZWDXdwVdw). But [Unseen Finance](https://x.com/UnseenFinance) offers nuance: \"IMF doesn't approach these countries,\" he insists. \"Countries come to the IMF when they have deep problems.\" Governments, he suggests, often dig their own graves by overspending and avoiding tough reforms. \"They'd rather make it look like they're forced, versus their own political loss.\"\n\nTo be fair, some observers argue the IMF intentionally seeks out dictators and despotic regimes, lending to leaders who won't face accountability from their citizens. Indeed, books like _Confessions of an Economic Hitman_ by John Perkins detail instances where leaders who refused such loans mysteriously disappeared or faced severe consequences. Yet Unseen correctly points out the situation isn't always black and white. Sovereign countries have agency, and accepting an IMF loan inherently comes with stringent conditions and expectations. Ultimately, nations should only enter such agreements if they fully intend to meet their obligations.\n\n**El Salvador's Bitcoin Experiment: A Complex Reality**\n\nIn September 2021, El Salvador made global headlines by adopting Bitcoin as legal tender, a move celebrated by Bitcoin enthusiasts worldwide. Yet, as Unseen points out, reality has not been straightforward.\n\nThe Good:\n\nTourism surged, notably in areas like El Zonte - \"Bitcoin Beach\" - attracting international attention and investment. Grassroots efforts, like the educational initiative My First Bitcoin, spread financial literacy. Additionally, the Salvadoran government's [Bitcoin holdings](https://bitcoin.gob.sv/) saw impressive gains during market rallies, with their value more than doubling by December 2024, providing significant paper profits.\n\nVisitors and residents alike report a palpable sense of optimism in El Salvador. This newfound hope stems from two major transformations: the innovative Bitcoin adoption and President Bukele's dramatic security reforms. Under his administration, El Salvador has transformed from having one of the world's highest murder rates to becoming one of Latin America's safest countries.\n\nA shift that Unseen Finance acknowledges as the foundation for any economic progress: \"The first kind of major shift for El Salvador's economy and population was when Bukele came in and he cut down on the crime and criminals. If you don't do that in any country, how can you have economic growth, how can you have prosperity, how can you have personal freedoms?\"\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/TheRabbitHole84/status/1896731691479437810&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe Bad:\n\nDespite optimistic government initiatives like the Chivo Wallet and a $30 Bitcoin incentive, adoption among citizens remained stubbornly low. Many Salvadorans reverted to traditional currencies shortly after initial trials. Critics argue Bitcoin's volatility created economic uncertainty, complicating fiscal planning and stability. Relations with international financial institutions, particularly the IMF, became strained due to concerns over financial risk and governance.\n\nThe Ugly:\n\nBy December 2024, El Salvador faced significant policy reversals. As part of securing a critical $1.4 billion IMF loan, the government agreed to reduce Bitcoin purchases, removed mandatory merchant acceptance, stopped accepting tax payments in Bitcoin, and wound down involvement in the Chivo Wallet. According to Unseen, these reversals represented a reality check against the initial enthusiastic hype surrounding Bitcoin adoption.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/DeItaone/status/1869758417432363059&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n**Crime Crackdown: The True Economic Catalyst?**\n\nIt's important to note Unseen Finance is a Bitcoiner who is rooting for the country to succeed and as noted earlier he credits El Salvador's economic improvements not primarily to just adopting Bitcoin, but also to President Nayib Bukele's crackdown on crime. \"You can't have economic growth unless individuals have their own safety,\" he emphasizes. While Bitcoin played a supportive role, the country's underlying economic issues persist, evident in its modest GDP growth, ranking near the bottom in Central America.\n\n![[https://www.voronoiapp.com/economy/Guyana-is-the-Richest-Country-in-Latin-America--3260](https://www.voronoiapp.com/economy/Guyana-is-the-Richest-Country-in-Latin-America--3260)](https://miro.medium.com/0*ttJVdSurIE5JLils)\n\n**Debt, War, and the Fiat Cheat Code**\n\nAddressing broader financial implications, Unseen points out that fiat currency empowers governments to overspend irresponsibly. \"Governments feel they can do many things, good and bad, because they have access to money,\" he explains. Transitioning to a Bitcoin standard, he cautiously suggests, might make governmental actions more transparent and potentially reduce conflict. The reason being is if governments had to tax their people directly to fund wars, rather than print money causing inflation, you'd probably see fewer bombs dropped.\n\n**Escaping the KYC/AML Nightmare**\n\nWhat turned this finance veteran into a Bitcoiner? The oppressive regulatory frameworks, anti-money laundering (AML) and Know Your Customer (KYC) laws, left him disillusioned. \"You go to your bank with a couple hundred dollars, and they want blood,\" he laments. Meanwhile, high-level corruption often went unchecked.The hypocrisy is disgusting. It's why Unseen is passionate about showing the individual what Bitcoin offers: an escape. A self-sovereign financial instrument that sidesteps bureaucratic control.\n\n**Grassroots Adoption Over Icons**\n\nThere is no denying ETFs, corporations, and [Uncle Sam embracing Bitcoin](https://x.com/BitcoinNewsCom/status/1897817006344180022) will make the fiat price of Bitcoin go up overtime. However, for Unseen, real Bitcoin adoption happens bottom-up. \"We don't want Bitcoin gods, icons, influencers,\" he insists. \"We need normal people trying to put it into practice.\" He advocates grassroots adoption, like artists selling their work for sats or communities learning about Bitcoin through local initiatives. While institutions may impact the price, the freedom Bitcoin offers must ultimately be claimed by sovereign individuals themselves.\n\nIf Unseen could speak with Bitcoin's mysterious creator, Satoshi Nakamoto, he would ask: \"What was that flash that hit you?\" Fascinated by innovation, he wonders about that moment of inspiration that led to Bitcoin's creation.\n\n**The Takeaway**\n\nUnseen Finance doesn't peddle hopium. The financial world is messy, corrupt, hypocritical, and often outdated. Bitcoin isn't a magic fix but offers a practical, grassroots alternative to the conventional system.\n\n\"We need broad access and just common sense to people, you know, bottom up, that they can understand the benefits and start to get involved in it,\" he explains. This grassroots approach builds \"over time, the understanding, the utilization, the access to it, that will create this kind of parallel ecosystem in Bitcoin.\"\n\nHis message to Bitcoiners is clear: \"We don't want Bitcoin gods, icons, influencers.\" Instead, he advocates for \"normal, common people who are trying to put it into practice, to really use it and build this ground-up ecosystem that's very broad.\" Only when Bitcoin adoption becomes \"more strong and diverse and broad\" does it start \"to become a real competitor\" to traditional finance.\n\nWhile institutional adoption may drive up Bitcoin's price, Unseen believes true freedom comes from individual sovereignty and widespread grassroots implementation.\n\n3/30/25\n\nConor Jay Chepenik",
  "wordCount": 1224,
  "readingTime": 4.818867924528302,
  "claps": 0,
  "voters": 0
}