{
  "id": "818b166dfc3f",
  "title": "Day 1035",
  "createdAt": "2025-01-21 03:24:13",
  "tags": [
    "trump",
    "bitcoin",
    "wine",
    "flavored",
    "chips"
  ],
  "url": "https://chepenikconor.medium.com/day-1035-818b166dfc3f",
  "content": "# Day 1035\n\n![[https://x.com/ConorChepenik/status/1881388307772588449](https://x.com/ConorChepenik/status/1881388307772588449)](https://miro.medium.com/1*R2J5DLbV1LNmNFzAnWueCg.png)\n\n![[https://x.com/ConorChepenik/status/1881474996666868082](https://x.com/ConorChepenik/status/1881474996666868082)](https://miro.medium.com/1*ZAqrTdWvt1cwphQkoHlzFw.png)\n\n**Great Monday!** Trump was inaugurated safely, which is a relief after last summer's near-miss with a sniper who apparently thought \"Make America Great Again\" meant with him in the White House permanently. After clocking out of work, I dragged my ladies to the grocery store. Fresh Market, because I fancy myself a bit of a gourmet and Whole Foods is twice the driving distance from my house. But then, I found something that made me question the sanity of snack food executives: sparkling wine-flavored chips. Who in their right mind green-lit this? It's like they asked, \"What do rich people love besides truffles?\" and some genius in marketing replied, \"Sparkling wine!\"\n\nI mean, I'm curious, but not curious enough to buy a bag. This is the same company that knocked it out of the park with truffle-flavored chips, so maybe they're just on a flavor rollercoaster. One minute they're the chip flavor Mozart, the next they're just a one-hit wonder trying to cash in on the next big thing. I can picture the meeting now: \"Well, what else do rich people like besides truffles?\" \"Oh, I know, sparkling wine!\" \"Brilliant! We've found our next blockbuster chip!\" Let's hope their next brainstorm isn't caviar-flavored popcorn.\n\nAfter loading up on essentials, I headed over to my Mom's for dinner with just Sloan, giving the Mama some \"me\" time. We had nachos, steak, and donuts, a real feast while we watched the national championship game. It was a tight game at first, but Sloan needed her sleep, so I had to take her home at halftime. When I checked the score later, it was a blowout, so congrats to Ohio State for taking down Notre Dame. Michigan last year, Ohio State this year, winning it all in D1 college football. I imagine the rivalry game next year will be quite the matchup.\n\nAnyhow, I'm glad to see Trump back in office. No politician's going to save you, but some will screw you less, and Trump seems like he cares about the ideals of America much more than the previous guy. It's kind of funny to see the man shitcoining, but most people must shitcoin to see Bitcoin is completely different. I include myself on this list. I'm confident Bitcoin will be the trojan horse, and as Trump cozies up to crypto, he will inadvertently bring back sound money and generational wealth, not just for the elite but for all Americans.\n\nSo cheers to a bright orange future in America :)\n\n![](https://miro.medium.com/1*lKzd-1yOz5lC4P6qYeEcgw.png)\n\n1/20/25\n\nConor Jay Chepenik",
  "wordCount": 429,
  "readingTime": 2.168867924528302,
  "claps": 0,
  "voters": 0
}