{
  "id": "83f3395894ce",
  "title": "Day 1378",
  "createdAt": "2025-12-30 01:59:32",
  "tags": [
    "avant-garde",
    "essay",
    "but",
    "not",
    "really"
  ],
  "url": "https://chepenikconor.medium.com/day-1378-83f3395894ce",
  "content": "# Day 1378\n\n![A deer picture I took earlier](https://miro.medium.com/1*nyvguCeJauRUAP7AeVhrOw.jpeg)\n\n![Jarvis enhance my deer picture](https://miro.medium.com/1*bA8RHfOICzywWiQ5fXI8qA.png)\n\nA little bit of this and a little bit of that. A little bit of brainrot and a little bit of AI slop. I log onto Twitter (now known as X) and my brain goes plop. Digital fentanyl, dopamine on top. Scroll scroll scroll, when does it stop? The algorithm a fiend, the content machine pristine, serving me scenes I've never seen but somehow need, or so the feed would have me believe.\n\nIt's kind of like a car crash in the sense I know I need to just get on with my business but it's so tempting to look. Don't hold up traffic. Don't delay what needs doing. But you know. Just one quick glance. I'm on the highway. Or my toilet. Bored anyways so a peek! A treat! A little digital sweet for the meat computer between my ears that fears silence and reveres the endless scroll, the bottomless bowl, the infinite hole.\n\nFifteen minutes later I'm asking myself why I'm watching a how-to video for making useless 3D prints that are fun but not something I need. Planted a seed. Now I need a new 3D printer, even though the one I currently have is perfectly capable, because you know IT COULD BE MORE POWERFUL! Thanks dopamine train running off the rails into the terrain of my remaining attention span.\n\nSpeaking of things I actually need: today I went to the store after getting the kids to sleep to buy diapers, Body Armors, and Zyns. The holy trinity of modern fatherhood. On the way back it was so windy a tree blew over and took down a power line. I saw the line on fire. Kind of crazy. Sparks in the dark. Made my drive home ten minutes longer since I had to hit a 180 and take the long way home. Thank God for the snow so the fire didn't get far.\n\nHonestly it was fine. I was enjoying a good podcast and it's nice to escape my in-laws' house. This place is great but there aren't many sidewalks and it's cold so I've been cooped up inside for most of this trip. Earlier around 4pm I basically forced myself outside because I NEEDED sunlight. My body was begging. Pleading. Screaming for photons. Walked along the road and in the woods next to me, I ran into these beautiful deer just standing there watching me like I was the wildlife. Sometimes you need an algo break so you remember deer exist. These creatures who have never seen a TikTok and are doing just fine, hell more than fine. Well then again they don't have modern plumbing so it must suck to s*** in the woods all the time. But then again they probably don't know any difference and when I pee I like to go in my own backyard because it's freeing.\n\nAnyways, I digress since that is enough about going to the bathroom. I get home and the wifi is out. Thank you weak tree that took out the power line. So naturally I can't watch Rogue One on the big screen tv downstairs like I wanted now that I've finished Andor. Rogue One being where Andor ends, chronologically. My payoff for a hard days work of *checks notes* clicking buttons on a computer. I have been denied by weather, by a tree, by wind, by the universe saying not tonight buddy, not tonight. Guess I'll just resume the [fascinating podcast](https://youtu.be/7GFKB0oKd9A) I was listening to earlier today once this daily reflection has been reflected.\n\nSo I hotspot this device (my laptop) to type this out. Incredible how dependent we've become on signals we can't see. Wifi is nuts and you can literally see people through walls with it. But few know that. Few care. Most just want the slop to load. Faraday for the paranoid, drywall for the rest of us.\n\nWe take Wifi for granted so we can get our slop. Bright side: the outage helped me focus. Finished an article for Bitcoin News. But still, how privileged are we? For all the chaos, the spoils are absurd because God is good. We aren't making souls with modern tech, but we're making things that would look like magic to anyone from a century ago.\n\nUntil tomorrow anon and hopefully the Wifi comes back so I can work. I guess if it doesn't I'll have to go to a coffee shop.\n\n12/29/25\n\nConor Jay Chepenik",
  "wordCount": 744,
  "readingTime": 3.190880503144654,
  "claps": 0,
  "voters": 0
}