{
  "id": "874c78890475",
  "title": "Day 1117",
  "createdAt": "2025-04-13 03:06:15",
  "tags": [
    "a-book"
  ],
  "url": "https://chepenikconor.medium.com/day-1117-874c78890475",
  "content": "# Day 1117\n\nI've been sitting with this quiet pressure for weeks now. Not stress, something different. A _pull_. A need to gather what I've learned from the short time I have been on this planet and pour it into something that will hopefully last beyond my lifetime.\n\nAt first, I thought it might be another Bitcoin book. After all, I've written hundreds of articles, threads, and essays on the topic. I could stitch them together, tidy them up, and call it a day. But honestly? That's not it. That's not what's haunting me.\n\nThe world doesn't need another Bitcoin book.\n\nThe world already has plenty of GREAT Bitcoin books.\n\nWhat it needs, what _I_ need, is something more personal. Something rooted in flesh and blood. Something I can hand to my kids, or maybe to anyone who's trying to raise theirs with a clear head and a strong heart in an age of lies and noise.\n\nEven though this isn't a book about Bitcoin, I've come to realize it might still pass through it. Just as it passes through fatherhood, through the weight of responsibility, through the lessons that come with choosing a different path. It's shaped by the daily effort to live with intention in a world that often rewards distraction and discourages truth.\n\nThat's where the idea for _121 Questions for My Children_ came from. Not because I have all the answers but because I don't. And I don't think that's the point. What I hope to offer are the right questions. The kind worth sitting with. The kind that stay with you.\n\nI guess step 1 is find the best 121 questions I can ask. This book is not meant to be a manifesto. It's not a guide with steps to follow. It's more like a trail map: fragmented, imperfect, but drawn from experience. A record of someone trying to live consciously in a time when it's easier to go numb. And maybe, one day, a companion for my kids as they chart their own course.\n\nSo that's the shape of it right now. Still forming. Still uncertain in places. But it's starting to feel like the right direction.\n\n4/12/25\n\nConor Jay Chepenik",
  "wordCount": 366,
  "readingTime": 1.381132075471698,
  "claps": 1,
  "voters": 1
}