{
  "id": "886b1d7cd551",
  "title": "Day 1245",
  "createdAt": "2025-08-19 03:09:14",
  "tags": [
    "you",
    "can",
    "just",
    "vlog",
    "things"
  ],
  "url": "https://chepenikconor.medium.com/day-1245-886b1d7cd551",
  "content": "# Day 1245\n\n![Sales for The Bitcoin Coloring Book so far](https://miro.medium.com/1*4DbAtUtPJapLVaxTHbNOOg.png)\n\nI've officially sold **five copies** of _The Bitcoin Coloring Book_. From what I've heard, a few more are waiting to ship before they show up in my dashboard. To anyone who has bought one, thank you, from the bottom of my heart. It means a lot.\n\nIt might not sound like much, but to me it's massive. There's something incredibly empowering about creating something from scratch and watching people actually buy it. I had to market it myself. I even recorded a [vlog on Nostr yesterday,](https://primal.net/e/nevent1qqs2dw4uuhj2xw62w2qtjl7dqcymyu7m5k43gt2c3rwvsduwpqme8wchz0sff) and got a boost when American Hodl renoted it. For a Bitcoin OG to share my work? That felt pretty special.\n\n![[https://primal.net/e/nevent1qqs2dw4uuhj2xw62w2qtjl7dqcymyu7m5k43gt2c3rwvsduwpqme8wchz0sff](https://primal.net/e/nevent1qqs2dw4uuhj2xw62w2qtjl7dqcymyu7m5k43gt2c3rwvsduwpqme8wchz0sff)](https://miro.medium.com/1*cHvM8RuYUDhOaqpSn3Je-Q.png)\n\nI'm proud of this project. Glory be to God for giving me the skills to make it, the brain to dream it up, and the fingers (plus a little LLM help) to bring it across the finish line.\n\nNo, $22 and change won't feed my family yet. But that's not the point. The point is I made something, saw it through, and shared it with the world. That feels real. That feels entrepreneurial.\n\nGlory be to God for giving me the skills to make it, the brain to create it, and the fingers and wits to leverage an LLM to help me perfect it.\n\nNow I just need to get better about spending less time scrolling on X and more time building things that matter. I've had a lot of ideas on Medium these past couple years. I've been somewhat of an ideas guy and to actually be an action guy feels unreal.\n\nIf you'd like a copy for your kids (or your inner kid), you can grab one on [Amazon](https://amzn.to/3JliZEI), or download it for free at [bitcoincoloring.com](https://bitcoincoloring.com).\n\nHere is to more doing and less lolligagging (though I do think lolligagging has its value at times so you can come up with great ideas). Just need to find that nice balance :)\n\n8/18/25\n\nConor Jay Chepenik",
  "wordCount": 325,
  "readingTime": 1.609748427672956,
  "claps": 0,
  "voters": 0
}