{
  "id": "8d79beb579f4",
  "title": "Day 1129",
  "createdAt": "2025-04-25 03:25:58",
  "tags": [
    "ai"
  ],
  "url": "https://chepenikconor.medium.com/day-1129-8d79beb579f4",
  "content": "# Day 1129\n\n**Chapter 3: How Do You Use AI To Write Without Creating AI Slop?**\n\nFirst and foremost say _please_ and _thank you_.\n\nNo, really. It matters.\n\nThere's a growing body of thought (hat tip to @BrianRoemmele) that politeness and clarity in AI prompting don't just make you a better human but they actually improve model outputs.\n\n![](https://miro.medium.com/0*ekSy2JmyDTafdY1A)\n\nWhy? Because AI models are mirrors. They reflect and remix the data they're trained on. That includes tone, structure, vocabulary, even emotional intent.\n\nIf we feed these models vague prompts, lazy tone, and broken phrasing, we'll get back exactly what we put in: slop.\n\nBut if we feed them well-crafted, thoughtful prompts with the right intent? We start raising the baseline not just for ourselves but for everyone who uses these models.\n\nIt's like raising a digital child:\n\n- Be kind\n\n- Be clear\n\n- Be specific\n\n- Be respectful\n\n- Have good intentions :)\n\nThe better we treat these tools, the better they treat us.\n\nHere are some of my Favorite High-Quality AI Prompts for Writers:\n\nPrompt 1: Clarity Refinement\n\n\"Can you take this idea and make it clearer, more structured, and more engaging for a general audience? Keep my tone but improve the flow. Thank you chatGPT.\"\n\nUse when: You've written something half-baked and want polish without losing your voice.\n\nPrompt 2: Emotional Calibration\n\n\"Here's something I wrote. Help me strengthen the emotional impact without becoming cheesy. Keep it real, keep it grounded. Thank you chatGPT.\"\n\nUse when: You want to move people but avoid cringe.\n\nPrompt 3: Teach Like I'm 5, Then Teach Like I'm a PhD\n\n\"Explain this concept to a 5-year-old. Then explain it to someone with a PhD in the field. I want to see both ends of the clarity spectrum. Thank you chatGPT.\"\n\nUse when: You're learning something deep and want to really grok it.\n\nPrompt 4: Unearth the Hidden Thread\n\n\"Here's something I'm writing {insert your writing} *could be an essay, a chapter, a post*. What's the quiet truth beneath the surface? What idea am I circling but not quite naming? Where's the spark that wants to break through? Thank you chatGPT.\"\n\nUse when: You feel like the piece _wants_ to say something more but it's not quite there yet. This is not for rewriting. It is about listening for what's whispering underneath.\n\nPrompt 5: Turn This Into a Hook Magnet\n\n\"Here's a post/thread/article that matters to me. Help me shape it into something people want to share, save, or quote to their friends. Where can I sharpen the hook, tighten the punchlines, or add a sentence that makes people _feel seen_? Thank you chatGPT.\"\n\nUse when: You've got something meaningful and you want it to go viral on social media by adding a great hook.\n\nAI isn't a threat to good writing. _Sloppy prompting is._\n\nUsed well, AI can become your best editor and make _you_ a better editor in the process. It won't erase your voice if you have one, it'll sharpen it. It'll challenge it.\n\nThe future of human-AI writing is symbiotic. Our intentions, our tone, and our clarity; all of it becomes part of the output. It's not magic. It's pattern recognition. The better our patterns, the better the feedback loop.\n\nSo speak clearly. Speak kindly. Speak with purpose.\n\nBecause the models are learning.\n\nAnd so are we.\n\n![](https://miro.medium.com/0*bnXFRieB8n1LFQqd)\n\n4/24/25\n\nConor Jay Chepenik",
  "wordCount": 562,
  "readingTime": 2.5040880503144654,
  "claps": 0,
  "voters": 0
}