{
  "id": "8dbef3882975",
  "title": "Day 956",
  "createdAt": "2024-11-02 18:34:14",
  "tags": [
    "vote"
  ],
  "url": "https://chepenikconor.medium.com/day-956-8dbef3882975",
  "content": "# Day 956\n\n![[https://x.com/ConorChepenik/status/1852753154091208734](https://x.com/ConorChepenik/status/1852753154091208734)](https://miro.medium.com/1*VuBcuZupcvvaE_EX1nvT8Q.png)\n\nToday I went and cast my ballot for Donald Trump & JD Vance to become President & Vice President. As noted in my tweet it's the first time I've ever voted in a presidential election. No candidate is perfect and I do not consider myself a Democrat or a Republican.\n\nI am someone who wants to see less government spending, secure borders, and lower taxes. I want to see the Department of Justice stop being weaponized. I'd like for the government to be friendly toward Bitcoin and remove capital gains tax on it because it's just money - or at least start by removing it for smaller transactions so I can buy a coffee with Bitcoin without being coerced into calculating the seven cents in tax I owe.\n\nI wish to see Ross Ulbricht granted freedom and an end to unnecessary wars and censorship. I believe in utilizing our natural resources to usher in an era of abundance for America. I have faith that leaders like Elon Musk, Ron Paul, Howard Lutnick, Robert F. Kennedy Jr., Tulsi Gabbard, and others on Team Trump can help address the deep-state and swamp issues that plague Washington, D.C.\n\nI watched the entire three-hour podcast featuring both Trump and J.D. Vance on Joe Rogan's show. In contrast, Kamala Harris declined to participate unless Joe came to her and limited the conversation to one hour. This, in my view, reflects a lack of commitment to engaging with the American people. It surprises me that some believe she would make a good President, but then again, all that the legacy media does is mislead and gaslights for the Democrats.\n\nI went to my local library to cast my vote to make America great. I am proud to do so and believe that Trump will help stop wars around the world, bring about greater prosperity and abundance for the American people, and foster unity rather than division. Now, some on the left might be thinking, \"What do you mean Trump will bring unity?\" I ask you to honestly consider these questions if you had this thought:\n\n- Did Trump call everyone who votes for Biden garbage?\n\n- Did Trump compare Biden or Harris rallies to Nazi rallies?\n\n- Did anyone attempt to assassinate the Democratic candidate?\n\n- Did Russia attack Ukraine or did Hamas attack Israel when Trump was President?\n\n- Did Trump have [50+ senior intelligence agency officials](https://www.politico.com/f/?id=00000175-4393-d7aa-af77-579f9b330000) claim information on his son's laptop was Russian disinformation right before an election when it turned out that everything on said laptop was indeed real?\n\n- Did Trump refuse to go after Hillary Clinton once he was President because he thought it would be bad for the country, even though he could have done so?\n\n- Does Biden or Harris plan on freeing Ross Ulbricht?\n\nI encourage all my fellow Americans to step outside of their biases when they think about these questions. That is no small task, and for the record, I acknowledge that I myself have plenty of biases, which I try to understand and improve upon when new facts present themselves to me. None of us are perfect, and that is okay. However, if you think about it from first principles, there is a strong case to be made that one side is pushing divisive rhetoric much harder than the other. There is no excuse for a sitting President to disparage half of America by calling them garbage; it's disheartening and sad. Even if you vote for Kamala Harris, I don't hate you or think you are garbage. For all its flaws, I think it's a beautiful thing that we have the right to vote, and it would be silly to hate someone for voting differently from me.\n\n![[https://x.com/bennyjohnson/status/1851443521259004067](https://x.com/bennyjohnson/status/1851443521259004067)](https://miro.medium.com/1*IVaPStNeiys7AmZzyLM_Zg.png)\n\nHowever, I will proudly voice my opinion and explain why I think the way I do. There is no doubt in my mind that Trump will be a better President than Kamala solely based on the people he is going to surround himself with. He also won't disparage those who voted for his opponent, as Biden did with fellow Americans who voted for Trump.\n\n![[https://x.com/BowTiedRanger/status/1852004705506836792](https://x.com/BowTiedRanger/status/1852004705506836792)](https://miro.medium.com/1*yrcD22NRaYBkL2GzqfLrMA.png)\n\nAnon accounts might do some disparaging, but as a President you should be above that. Thus, I am proud to cast my first vote for Donald Trump. No politician is a savior, but a bad one can cause serious harm to this country. I don't want vaccines mandated for my family, nor do I want an administration that censors free speech or raises taxes that are already high. That's why I voted the way I did, and I hope you will get out and vote for the candidate you believe will bring about a better America.\n\n![[https://x.com/oldbooksguy/status/1852734356214939936](https://x.com/oldbooksguy/status/1852734356214939936)](https://miro.medium.com/1*5LPfTYvd6AElt41-olqWfA.png)\n\n![[https://x.com/smubpublius/status/1852737879379959871](https://x.com/smubpublius/status/1852737879379959871)](https://miro.medium.com/1*oAp83qlm5LFLw4Ye2lDF-A.png)\n\n![[https://x.com/apparentlysteve/status/1852709932186894753](https://x.com/apparentlysteve/status/1852709932186894753)](https://miro.medium.com/1*czPJu78d_P4GGfuzrG_-NQ.png)\n\nAlso vote for the party that won't kill IG squirrels. I'm not saying the Democrats in DC caused this, no that was the Democrats in NY.\n\n11/2/24\n\nConor Jay Chepenik",
  "wordCount": 810,
  "readingTime": 4.006603773584906,
  "claps": 3,
  "voters": 1
}