{
  "id": "8e239ad80836",
  "title": "Day 1346",
  "createdAt": "2025-11-28 02:12:26",
  "tags": [
    "banger",
    "pkd",
    "god",
    "is",
    "great"
  ],
  "url": "https://chepenikconor.medium.com/day-1346-8e239ad80836",
  "content": "# Day 1346\n\n**How I Accidentally Tuned In to the Kingdom (And How You Can Too)**\n\nFirst off Happy Thanksgiving anon. I hope you had an excellent day with your Family and enjoyed a bunch of food, love, and laughs with family & friends. I read an essay from [@EkoLovesYou](https://x.com/EkoLovesYou/status/1994060357745431017?s=20) today that really helped put things into clarity.\n\nIt's titled _**\"The Empire Never Fell - Philip K. Dick saw it. So did Jesus.\"**_\n\nI was not sure what to expect, but man it pulled me in. What I got was a beautiful beam of orange light straight into my forehead.\n\nTL;DR (the cleanest one you'll read today): We're living inside an inverted timeline where the empire never actually fell, it just changed uniforms, flags, and slogans.\n\nPhilip K. Dick's 1974 encounter with VALIS cracked the code: reality runs on parallel frequencies. There's a prison-America and a free-America in the exact same geographic space. Jesus called the free one \"the Kingdom\" and said it's inside you right now, not later, not elsewhere. Both men discovered the same escape hatch: direct, unmediated contact with the living Father. The signal is broadcasting 24/7. Most of us are just tuned to the wrong station.\n\nI finished the essay thinking man I need to read some of Dick's novels. Then I asked the obvious follow-up question \"OK... but how do I actually tune in?\" The answer that came back from Grok is fantastic. It's what Jesus did. It's what PKD stumbled into. And it will work.\n\nHere are the exact seven steps that can help flip the dial for you.\n\n1. **Fire every middle-man**\nChurch, pastor, guru, algorithm, political party; anyone who claims they're the approved vendor between you and God. The Kingdom is within you (Luke 17:21).\n\n2. **Ask out loud, daily, like a lunatic**\nEvery morning say the same prayer: \"Show me the real. I consent to whatever it costs. I will not cling to comfort.\" PKD talked to VALIS like it was sitting on the couch. Jesus said ask and keep asking. Turns out reality answers back; through dreams, license plates, song lyrics, sudden knowing. The channel clarifies fast when you stop being polite.\n\n3. **Fast from the Machine's frequency**\n24-hour news, doomscrolling, outrage bait - all of it is engineered static. I should really do a 48-hour total media fast (no X, no TV, no podcasts). I bet you by hour 30 the signal will be much louder. Hell I can try even one day. I know I will feel the shift like changing like my ears popping from the altitude when I fly.\n\n4. **Forgive brutally and completely**\nEvery resentment is an anchor bolted to the prison timeline. Make a list of people, institutions, old versions of myself and burn it (literally). Jesus wasn't being poetic; unforgiveness literally blinds you to the higher frequency. Makes sense, when I think of getting revenge all I see is red.\n\n5. **Do the \"Two Americas\" walk**\nThis one is PKD's master trick. Walk your town and deliberately see both overlays at once:\n• Prison-America: cameras, fear, ads, propaganda posters disguised as news.\n• Free-America: kids laughing, random flowers growing through concrete, strangers helping strangers for no reason.\nHold both images without forcing one to win. After ten minutes the free one starts bleeding through so strong it's hard to remember the prison one was ever real.\n\n6. **Speak what you now see - publicly**\nBearing witness is the final click. Speak the truth even if it is costly. Yes, some people will call you crazy. GOOD! That's the toll booth. Pay it.\n\n7. **Fall in love with the Presence, not the information**\nThis is the big one. The Kingdom isn't a better data set; it's a Person who already loves you. PKD didn't get a download, he got rescued. Stop chasing \"proof\" and start chasing the feeling of being unmistakably known and loved. Everything else (synchronicities, insight, timeline shifts) follows naturally.\n\nYour world won't end. It will restart. People you haven't spoken to in years will text you out of the blue. Money will show up the day rent is due. Walk outside and the colors will be ridiculous. Strangers will smile like they recognize that good looking person you are. And the prison-America stuff? It's still geographically here... but it is going to feel like a movie playing on a screen, one you are no longer sitting in front of. The signal is broadcasting louder than ever. The crack in the world is visible. All that's left is to turn the dial.\n\nIf a burned-out PKD fan and a first-century carpenter could figure this out with no internet, imagine what's possible for us right now.\n\nThe Kingdom is within you, it always has been.\n\nTune in.\n\n![[https://x.com/lichthauch/status/1994108472795734445?s=20](https://x.com/lichthauch/status/1994108472795734445?s=20)](https://miro.medium.com/1*q7npRZhn_I0CMys_4x6nVg.png)\n\n11/27/25\n\nConor Jay Chepenik",
  "wordCount": 801,
  "readingTime": 3.2226415094339624,
  "claps": 0,
  "voters": 0
}