{
  "id": "9143b6fba2df",
  "title": "Day 920",
  "createdAt": "2024-09-28 03:01:41",
  "tags": [
    "war",
    "is",
    "not",
    "peace",
    "war-sucks"
  ],
  "url": "https://chepenikconor.medium.com/day-920-9143b6fba2df",
  "content": "# Day 920\n\nAdding this feature into Github would be clutch.\n\n![](https://miro.medium.com/1*DUWmV_vk6el1cmekGG_LvA.png)\n\nTonight, as I lay my child to sleep, the warmth and peace of that moment stood in stark contrast to the world's harsh realities. After dragging myself from the comfort of bed to commit to my daily writing and coding challenge, I stumbled upon a post on X that truly saddened me.\n\n![[https://x.com/ErikVoorhees/status/1839779427171086752](https://x.com/ErikVoorhees/status/1839779427171086752)](https://miro.medium.com/1*FfpX9CpVuI8L-w7YP7RySA.png)\n\nEric's observations on the perils of collectivism, fueled by state power and the human inclination towards centralized control, resonate deeply with me. This reflects the stark disparity I've noticed between keyboard warriors advocating for conflict, comfortably detached from the visceral realities of war, and the individuals on the ground who face the dire consequences of these decisions.\n\nThe algorithms on social media are of course designed to engage by evoking strong emotions, and tonight they served me a grim reminder of the ongoing conflicts, where \"Ukraine must win this war!\" is a common refrain among those who risk nothing. Meanwhile, others face the daily atrocities of conflict - a stark antithesis to the serene moment I shared with my child.\n\nWar, in its essence, is demonic, satanic, utterly evil. There are no true victors in war, just victims of violence perpetuated by ordinary men at the behest of leaders who would never face the battle themselves. This system, where kleptocrats orchestrate conflicts, feels like a grotesque racket.\n\nIn spite of the bleakness, I cling to the belief that goodness will triumph in the end. There has to be some semblance of cosmic balance, a karmic justice, whether it manifests in this life or the next. This evening, my prayer was for peace, for a world where existence blossoms instead of being ripped apart by needless devastation.\n\nIn truth, war serves no one - not even those who accumulate wealth from it, for they pay a steep price with their humanity. We, as a species, are destined for greater achievements than this endless cycle of conflict. For the sake of the future, for the children we tuck into bed with love, we must aspire to something far better.\n\nWhen considering global leaders, like Putin, amidst all the Western media's portrayals, one undeniable fact remains: he is a father, just like many leaders. This simple truth could be our most significant safeguard against the threat of nuclear war. Parenthood means a personal investment in the world's future, urging these leaders to think twice about the legacy they leave for their children, perhaps pausing before initiating irreversible ruin. The common thread of parenthood might quietly yet profoundly influence away from war.\n\nThis is also why I lean towards supporting Trump over Kamala Harris. While recognizing no politician is our savior or without fault, Trump's role as a father might steer him towards avoiding war, reflecting a personal stake in peace. It's disheartening to witness the Democrats, once champions of anti-war sentiments, now seemingly adopting a pro-war stance.\n\n9/27/24\n\nConor Jay Chepenik",
  "wordCount": 492,
  "readingTime": 2.239937106918239,
  "claps": 0,
  "voters": 0
}