{
  "id": "934e1b29463a",
  "title": "Day 909",
  "createdAt": "2024-09-16 23:37:05",
  "tags": [
    "adulting",
    "bills",
    "bs",
    "life",
    "humor-helps"
  ],
  "url": "https://chepenikconor.medium.com/day-909-934e1b29463a",
  "content": "# Day 909\n\n![](https://miro.medium.com/1*_UX4lQND_TQY5RLQNOquUg.png)\n\nMan, adulting is ass sometimes. Apologies for the crude language, but boy oh boy can it be draining dealing with the shit adults have to deal with. Let me give you an example - insurance. It's common wisdom that you must have it! At least among most adults. Yet do you know how annoying it is to pay for something that you MIGHT need to use? If you've paid for insurance, then yes, you do.\n\nWhen I was in middle school, no one was teaching me about insurance. You just have to figure that shit out on your own. Electricity bills, water bills, sewage bills, property taxes - man, the list goes on. You can't wipe your ass or sneeze as an adult without someone going, \"Hey, that'll be 7 dollars and 90 cents.\" I joke because that's how life should be. Don't let adulthood steal your childlike joy.\n\nI have a great life and things afforded to me that kings could only dream of. Seriously, I get air conditioning, a fridge to keep my food from going bad, entertainment 24/7/365 to make sure I'm entertained - thanks to YouTube and my iPhone. As much as I do get annoyed with the big boy responsibilities that have been bestowed upon me for being a functioning member of society, I am also grateful. It's just odd - having both amazing things afforded to me and also being annoyed with many of the issues most adults in America face.\n\nI want to homeschool my kid precisely so I can teach them valuable life skills and critical thinking. The current education system often focuses on standardized testing and rote memorization, which doesn't always translate to real-world skills. I believe in teaching financial literacy, emotional intelligence, and practical problem-solving. That said, I don't solely blame teachers - they're often working within constraints and trying their best to manage large classes with diverse needs. My hope is that advancements in technology, including AI, can help personalize education and make it more engaging and relevant.\n\nAnyway, this will be my last paragraph for the day. I did a 24-hour fast, and I could break it now, but I'll break it tomorrow. Proud of myself. I like doing hard shit when I decide to do it myself. I hate doing hard shit when someone else is coercing me into doing it. Like property taxes. WTF ARE THOSE!\n\nI should stop typing before I go on another rant about why it's ridiculous we have to pay the state money for living in a dwelling. As if income, inheritance, sales, and all the other damn taxes out there aren't enough. Anyway, I'm stopping now. Peace, jokes, & love. See you tomorrow, anon.\n\n9/16/24\n\nConor Jay Chepenik",
  "wordCount": 462,
  "readingTime": 1.9433962264150944,
  "claps": 17,
  "voters": 1
}