{
  "id": "96bfc4194b3d",
  "title": "Day 1190",
  "createdAt": "2025-06-25 03:22:13",
  "tags": [
    "walking",
    "bitcoin",
    "get",
    "active",
    "rules-not-rulers"
  ],
  "url": "https://chepenikconor.medium.com/day-1190-96bfc4194b3d",
  "content": "# Day 1190\n\n![DUVALLLLLLLLLL](https://miro.medium.com/1*R0T-_wxallyWfX6ADcYnPA.png)\n\nI walked four miles today. Not on a treadmill, not alone. With my slime. Side by side, out in the real world. And something about that made me think clearer.\n\nPeople treat exercise like it's this discipline you have to summon from thin air and it sure feels like that sometimes. But there's an easier way: make a plan with someone. Just say, \"Want to walk?\" Or lift, run, whatever. The trick isn't motivation. The trick is making sure someone else is showing up so you can't bail.\n\nBut that's just the surface.\n\nWhat I really love about working out with a friend is not just the accountability, it's the unspoken ritual of shared presence. Jokes that don't land anywhere else. The rhythm of conversation that only finds its groove after mile two. The easy silence that never feels awkward. You're moving your body, but also tending to the part of you that craves being _with_ someone.\n\nThere's a kind of trust that gets built, brick by brick, on walks like that. And it sticks around longer than the soreness in your legs.\n\n![Me Walking With My Slime](https://miro.medium.com/1*oDgyLG3v-DdcTqsYo0s0ew.png)\n\nAnyway. We walked. We talked. And at one point, I had this odd little thought:\n\nWhy does holding a couple hundred bucks in cash feel like wealth, but seeing the same number in your bank app feels like water you can't cup?\n\nSame amount. Different feeling. There's something there.\n\nI think it has to do with how we're wired. You hold cash and your senses activate. It's real. It crinkles. It takes up space in your wallet. Your brain logs it as **_mine_.** Tangible. Contained. Graspable.\n\nBut numbers on a screen? They're barely real. You don't see them until you need them. And when you do, they're already spoken for...rent, subscriptions, that thing you forgot you signed up for. It does not even feel like your holding money as you watch it evaporate towards bills.\n\nWe evolved around things we could hold. Food. Tools. Fire. Safety was tactile. Wealth was stored in places you could guard with your body. Now it floats in databases and server farms. It's efficient, but it doesn't feel _true_ to our nervous system.\n\nEven Bitcoin - a tool I love and believe in - wrestles with this. It's digital, invisible, cold to the touch. If your brain struggles to feel a bank balance is real, it'll need help seeing sats as sacred.\n\nThat's why stuff like Opendimes, satscards, cash type bitcoin products,\n\n![like this picture](https://miro.medium.com/1*x3oQQ0ID3rC5gAHAUMXvMA.png)\n\neven steel backups matter. Not just for security, but because they _bridge the psychological gap_. They let you hold a key to something powerful. And that matters more than we admit.\n\n![](https://miro.medium.com/1*0Ru2kVOxziYTdfBQ_DtedQ.png)\n\nBitcoin might live in code, but it's not some abstract ghost. It's physical _and_ ethereal. It moves across continents in seconds, yet it's grounded in real math, real energy, real consensus.\n\nYou might not feel the electrons, but they are doing the (proof of) work. You might not hear the blocks clicking into place, but they are. If you want to hear them go to [mempool.space](http://mempool.space) turn on your computer's volume and wait for a block to confirm.\n\nThe math is real. The incentives are real. And more and more, the understanding is becoming real too.\n\n6/24/25\n\nConor Jay Chepenik",
  "wordCount": 543,
  "readingTime": 2.7490566037735853,
  "claps": 0,
  "voters": 0
}