{
  "id": "9b55a3f66a54",
  "title": "Day 1339",
  "createdAt": "2025-11-21 01:54:46",
  "tags": [
    "golf",
    "warm-baths",
    "all",
    "you",
    "need"
  ],
  "url": "https://chepenikconor.medium.com/day-1339-9b55a3f66a54",
  "content": "# Day 1339\n\n![Type s*** ima be on when BTC is at 10 million dollars a coin](https://miro.medium.com/1*gg9EAnZdfU39j3MS1iZTZA.png)\n\nPlayed 18 holes this morning at a country club and now I definitely want a membership. I'll have to wait for Bitcoin to climb a bit higher over the next ten years, but man, it felt amazing to be out there and consider my membership manifested. We walked all 18, which was great, even if the November sun in Florida absolutely cooked me. Still grateful I can play year round because I live in the sunshine state. Golf is such a fun sport, and I can feel real improvement. Short game still needs a lot of work, but that will come.\n\nOne day I'd love to take my clients out on the course. Working from home in Bitcoin is truly a blessing, but having a second spot would be nice. Or a third spot as they say. For now, both my first and second spot are just my house so I really need a third spot.\n\nIn other news, I cooked another AI dish tonight with a little help from chatGPT: steak udon noodle bowls. Turned out pretty solid. Highly recommend using AI for recipe support.\n\nAnd while scrolling afterward, I came across some really helpful healing advice on X. **Exact Recipe for the Warm Alkaline Bath Below:**\n\n**What you'll need -**\n\n- 1 cup baking soda (regular aluminum-free baking soda, like Arm & Hammer)\n\n- 1 cup sea salt (unrefined sea salt is ideal - Dead Sea, Mediterranean, Celtic, or plain kosher/sea salt; avoid iodized table salt)\n\n- **Optional:** +1 cup magnesium chloride flakes (not Epsom salt - look for \"magnesium bath flakes\" online or in health stores)\n\n**Step-by-step:**\n\n1. Fill your bathtub with hot water - as hot as you can comfortably handle (100–104°F / 38–40°C works best).\n\n2. Add the 1 cup baking soda and 1 cup sea salt directly into the water.\n\n3. If using, add the magnesium chloride flakes.\n\n4. Swirl the water to dissolve everything fully.\n\n5. Soak for 15–20 minutes (avoid going past 20–25 minutes).\n\n6. Get out slowly, pat dry, and drink water afterward.\n\n**Tips from the original post:**\n\n- Do this 2–3 times a week (daily if tolerated).\n\n- No soap or shampoo - it's purely therapeutic.\n\n- You can take a quick cool rinse afterward if you feel any residue.\n\nThat's literally it, costs pennies and takes almost no prep. A simple home version of the old alkaline mineral baths used in European and Soviet clinics. Going to take one tomorrow.\n\nEnjoy.\n\n11/20/25\n\nConor Jay Chepenik",
  "wordCount": 408,
  "readingTime": 1.739622641509434,
  "claps": 0,
  "voters": 0
}