{
  "id": "9ba239284ffd",
  "title": "Day 1270",
  "createdAt": "2025-09-13 03:59:37",
  "tags": [
    "we",
    "are",
    "going",
    "to",
    "win"
  ],
  "url": "https://chepenikconor.medium.com/day-1270-9ba239284ffd",
  "content": "# Day 1270\n\n![Art Deco Satoshi Nakamoto](https://miro.medium.com/1*4uTmCyJ95foO4sZKrKNaxw.png)\n\nNever underestimate the power of the human spirit to overcome darkness. To break free from the chains that very powerful, spiritual, and demonic forces would like to see brought about. You are special. One of a kind, with a soul bestowed upon your flesh and blood, that our Creator gave you. We are a gift in this universe and I pray that whoever reads these words is reminded of the inner greatness we all have, the very thing that makes you a unique being that has never existed before and will never exist exactly as you are now.\n\nDo **not** give into the darkness. Do **not** submit to the fear. **Do rise up and embrace that inner greatness our glorious God has blessed each of us with.** We are living through historic times. Maybe every generation feels that way. We all have main character energy because we can only experience life through our own perspective. GOOD. Use it. We are all going to die but we were put here for a purpose. Don't waste your life dwelling on the negatives that you can't control.\n\nOne of my good friends texted me today \"None of it matters\" and it saddened me for a moment. Hard not to feel that way at times. But it does matter. It matters greatly.\n\nI cracked a joke and told him it's time to start making babies. He realized I was correct. That what he really meant is his job doesn't matter. A fancy title and a big salary aren't the key to lasting happiness. No it's the connections you make. The friends you build. The family you create. That's what matters and I am proud of you Bom for so quickly realizing that.\n\nI like to think my jokes also helped. Humor is one of the best forms of medicine in the darkness. He asked me to hang my quote in the louvre that helped him see the light so I had chatGPT do so:\n\n![It's time to start mucking bin](https://miro.medium.com/1*YlAbSKSYFuhY4ho3e7MBiA.png)\n\nLife is a blessing and God I pray that you help me lead a good life that would make you proud.\n\n![We will win, FAITH!](https://miro.medium.com/1*rD_yyBpV1VCPqj4nH9hrAQ.png)\n\n9/12/25\n\nConor Jay Chepenik",
  "wordCount": 357,
  "readingTime": 1.8971698113207547,
  "claps": 0,
  "voters": 0
}