{
  "id": "9be3445ce05b",
  "title": "Day 1220",
  "createdAt": "2025-07-25 03:54:36",
  "tags": [
    "screw",
    "the",
    "federal",
    "reserve",
    "thieves"
  ],
  "url": "https://chepenikconor.medium.com/day-1220-9be3445ce05b",
  "content": "# Day 1220\n\n![[https://x.com/ConorChepenik/status/1948576285443125319](https://x.com/ConorChepenik/status/1948576285443125319)](https://miro.medium.com/1*4AKI1M50GYc4Y9Sp1Advvg.png)\n\n![](https://miro.medium.com/1*UXT1h1tVB7z28dcprmkKLw.png)\n\nToday I want to pull back the curtain on Chapter 1 of G. Edward Griffin's \"The Creature from Jekyll Island\" since I just read it tonight. Forget everything you think you know about banking, unless you're already Bitcoiner and understand we have a fiat based ponzi scheme system, because this story reads less like financial history and more like an undercover detective novel.\n\nYou see, for years, we've been told that understanding money is, well, complicated. Like it requires a special degree in advanced sorcery or something. Turns out, that's precisely the \"grand illusion\" these money magicians wanted us to believe, because if you don't understand the rules, you can't see the game being played.\n\nThe whole saga kicks off in November 1910. Not in a bustling Congressional hearing room, mind you, but with a highly secretive gathering on Jekyll Island, Georgia. Picture it: the titans of American finance, the Morgans, the Rockefellers, the Warburgs, the Rothschilds, all sneaking out of New York on a private train car \"under cover of darkness\". They were \"as secretive - indeed, as furtive - as any conspirator,\" as one of the participants, Frank Vanderlip, later admitted. Senator Aldrich even \"pledged all participants to secrecy\". Why all the cloak-and-dagger? Because if the public knew what they were planning, their scheme would have \"no chance of passage by Congress\".\n\nTheir mission? To forge what the book calls a \"banking cartel\". Their common enemy wasn't a foreign power, or even a rival nation. No, their true adversary was competition. They were facing a boom in smaller banks, especially out West, which was eating into the New York giants' market share. Plus, industries were actually financing their own growth from profits, making them less dependent on bank loans. And let's not forget the constant threat of bank runs, the inconvenient truth that under fractional-reserve banking, banks simply don't have enough cash to meet all their depositors' demands at once. This was a threat to their profits and control.\n\nSo, these financial masterminds laid out five core objectives for their new system:\n\n- **Stop the pesky competition** from new banks.\n\n- Obtain a government franchise to **create money out of nothing**. Yes, you heard that right: out of nothing.\n\n- **Control all bank reserves** to protect the more reckless banks from runs. Because why should their gambling habits be their problem alone?\n\n- Here's the kicker: **Shift the inevitable losses from their private banking operations onto the taxpayers**. It's a neat trick, if you can pull it off.\n\n- And finally, the cherry on top: **Convince Congress and the public that this whole elaborate scheme was actually designed to \"protect the public\"**.\n\nProtecting the public was a lie, but to sell this audacious plan, they opted for a brilliant piece of psychological marketing. They avoided scary terms like \"cartel\" or \"central bank\". Instead, they chose the incredibly dull, yet official-sounding, **\"Federal Reserve System\"**. It sounds so federal, so reserved, so utterly benign. To make it seem less like a power grab by Wall Street, they included regional branches to give the \"impression that there would be no concentration of power\". Pure camouflage, perfectly executed.\n\nPaul Warburg, a partner in Kuhn, Loeb & Company and a representative of the Rothschild banking dynasty, was the \"mastermind\" and \"father of the system\". He pushed for an \"elastic money supply\" based on corporate IOUs, not gold. His public writings, the book notes, were essentially \"eyewash for the public\", designed to hide the cartel's true nature.\n\nBut occasionally, the truth slipped out. Senator Aldrich, once the Federal Reserve Act passed, quite brazenly boasted: \"Now we are able to **dominate the bank reserves of the entire country**\". A. Barton Hepburn of Chase National Bank also let the cat out of the bag, stating that the measure would \"make all incorporated banks together joint owners of a central dominating power\". If that's not a cartel, then the word has lost all meaning notes Griffin correctly.\n\nSo, how has this \"Creature\", supposedly designed to \"stabilize our economy\", actually performed? Well, since its inception, it has presided over the crashes of 1921 and 1929, the Great Depression, numerous recessions, and a **1000% inflation** that obliterated 90% of the dollar's purchasing power by 1990. Not really a stabilizing influence, more like a monetary roller coaster designed to pick pockets.\n\nAs Anthony Sutton, a former Research Fellow at the Hoover Institution, keenly observed, the Federal Reserve System is simply a **\"legal private monopoly of the money supply operated for the benefit of the few under the guise of protecting and promoting the public interest\"**. He called it a \"bloodless revolution\". Kind of like what Bitcoin will be, but in a better way. The former revolution destroyed the middle class, hollowed out our industrial base, and centralized power. The latter will do the opposite.\n\nSo to summarize this first chapter, we are brought to the first reason we should abolish the Federal Reserve: It is \"incapable of accomplishing its stated objectives\" because, as we've seen, those were never its true objectives to begin with. It's like having a fire department whose _actual_ goal is to sell insurance to people whose houses just mysteriously caught fire, then charging them for the water. The declared purpose is one thing; the real mission is something else entirely.\n\n7/24/25\n\nConor Jay Chepenik",
  "wordCount": 889,
  "readingTime": 3.7380503144654087,
  "claps": 0,
  "voters": 0
}