{
  "id": "9f3aa3f79145",
  "title": "Day 1335",
  "createdAt": "2025-11-16 23:01:21",
  "tags": [
    "listen",
    "to",
    "the",
    "inner",
    "child"
  ],
  "url": "https://chepenikconor.medium.com/day-1335-9f3aa3f79145",
  "content": "# Day 1335\n\nStarted my day with a solid 3 mile run. Felt amazing to get it done early. I went shirtless to let the sun hit my skin and I swear it flips something in both the brain & body. Sunlight feels is medicine. A shame to see so many people afraid of it.\n\nAfter that I went to see Predator Badlands in theaters. I love going to the movies. Nothing beats a big screen when you want to just sink into a story for a couple hours. The movie was a blast. Pure fun, action packed, and somehow both sweet and vicious at the same time. They walked a really fine line with the tone and nailed it.\n\nThe final scene definitely made me wonder if they are planning more. I do hope they make a second one. I won't spoil the movie, but solid joke at the end of the film.\n\nI also read another chapter of [Magical Child](https://www.amazon.com/Magical-Child-Joseph-Chilton-Pearce/dp/0452267897) which talked about primary perceptions, known to many as extrasensory perception (ESP). It got me thinking about how much is lost from artificial stimulus, i.e computers, and our modern conditioning. Pierce basically argues that kids are born plugged into a wider field of awareness. They pick up on things adults don't, not because they're magical, but because nothing has shut the system down yet. Then society gets to work sanding those senses off. School trains kids to ignore their gut. Screens eat their attention. Adults tell them to stop \"imagining things\" until the imagination dries up. By the time someone is a teenager, the only perceptions they trust are the ones you can measure in a lab or put on a spreadsheet. Everything else gets filed under weird, woo-woo, or nonsense.\n\nBut Pearce's point is that these early senses aren't extra. They're primary. They're the original operating system. They help you feel the world instead of just think about it. And most people lose them because nobody shows them how to keep that channel open.\n\n**Three ways to bring them back based on some quick research I did with AI**\n\n1. **Spend more time in direct experience instead of mediated experience**\nTurn off the phone. Go outside. Let your senses recalibrate to something real. The nervous system wakes up fast when it's no longer drowning in artificial stimulation.\n\n2. **Follow your first signals before your second thoughts smother them**\nPrimary perception shows up as a quick, quiet knowing. Most people ignore it because they've been trained to overthink everything. Try acting on the first clean signal and see where it leads.\n\n3. **Do things that rekindle child-like attention**\nDraw. Play. Build something with your hands. Move your body in ways that aren't about exercise but curiosity. Children explore without a script. That's why their perceptions stay open. You can train that back.\n\nMy own senses tell me to enter a state of play more often. Easier said than done, but that seems right. When you enter the flow-state, when you fall in love with the moment, when you have more fun with life not only do you trust your gut more, but you start to \"feel things\" you never would otherwise. There is more to this world than just what we can percieve with our standard senses. That I am convinced of.\n\n![People Emit Their True Colors You Just Need To Open Your Mind If You Want To See Them](https://miro.medium.com/1*c_7PMkRPQc8MRVGaeI3Y-w.png)\n\n11/16/25\n\nConor Jay Chepenik",
  "wordCount": 557,
  "readingTime": 2.3018867924528306,
  "claps": 0,
  "voters": 0
}