{
  "id": "9f9a2df52748",
  "title": "Day 1350",
  "createdAt": "2025-12-02 02:37:12",
  "tags": [
    "starting",
    "december",
    "off",
    "right"
  ],
  "url": "https://chepenikconor.medium.com/day-1350-9f9a2df52748",
  "content": "# Day 1350\n\nI made a song to describe my Monday:\n\n**[Verse 1]**\n Put the kid to bed, lights low, all sweet\n Then I blink once... I'm the one fallin' asleep\n Jolt up like \"damn,\" gotta climb out again\n Medium ain't gonna write itself with this pen\n Momma in the hallway, arms crossed - oh boy\n 'Cause Dad 3D-printed Bitcoin Bs like toys\n \"Don't put 'em on the mantel!\" why babe, why?\n \"Because plastic clutter makes my soul wanna die.\"\n\n**[Hook]**\n Rash-cream rhapsody, toothpaste on the wall\n Turn around two seconds, she destroyin' it all\n Kids are chaos, kids are magic, kids are full-time smoke\n Hardest thing you'll ever do - GOOD, that ain't a joke\n I'm exhausted, barely lookin' at the screen right now\n Energy down bad, alp ain't helpin' me out\n But we livin', we laughin', we surviving this scene\n Whole house smells like toddler and a tube of rash cream\n\n**[Verse 2]**\n Two-year-old wild like a Category 5\n Rash cream in her hair like she moisturized\n Now she glidin' through the house like a minty ghost\n Toothpaste fingerprints on every surface we own\n Meanwhile Dad printing Bitcoin Bs like art\n Think I got carried away - printed 36 parts\n Momma lookin' at the shelf like \"I swear to God...\"\n I'm just tryin' to orange-pill the whole dang squad\n\n**[Bridge]**\n This ain't a meltdown, this is parenthood glory\n Every day a brand-new WTF story\n Laugh through the madness 'cause the madness won't quit\n Someday I'll sleep... maybe... I guess... a lil' bit\n\n**[Hook]**\n Rash-cream rhapsody, toothpaste on the wall\n Turn around two seconds, she destroyin' it all\n Kids are chaos, kids are magic, kids are full-time smoke\n Hardest thing you'll ever do - GOOD, that ain't a joke\n I'm exhausted, barely lookin' at the screen right now\n Energy down bad, alp ain't helpin' me out\n But we livin', we laughin', we surviving this scene\n Whole house smells like toddler and a tube of rash cream\n\n**[Outro]**\n So here I am, half-awake, still writin'\n Life is a circus and the toddlers are the titans\n But I wouldn't trade a moment, not for anything...\n Even if my whole house smells like Desitin cream.\n\n![It's actually quite a bop. Listen to it here: [https://x.com/ConorChepenik/status/1995680131810295887](https://x.com/ConorChepenik/status/1995680131810295887?s=20)](https://miro.medium.com/1*_y1xLsELaHh1KZuhymu3WQ.png)\n\nYes Sloan really did grab Ryder's cradle crap cream and spread it all over her fingers right after I took the toothpaste from her. I can't even be mad this child is so smart, but my gosh... How she finds a way to get into everything is beyond me. I've got a child prodigy on my hands but it's not easy raising a prodigy 😂 .\n\nUntil tomorrow anon :)\n\n12/1/25\n\nConor Jay Chepenik",
  "wordCount": 445,
  "readingTime": 1.879245283018868,
  "claps": 0,
  "voters": 0
}