{
  "id": "a654b7ae4487",
  "title": "Day 892",
  "createdAt": "2024-08-30 23:09:55",
  "tags": [
    "taxes",
    "politics",
    "money"
  ],
  "url": "https://chepenikconor.medium.com/day-892-a654b7ae4487",
  "content": "# Day 892\n\n**How to Cook Up Economic Chaos By Taxing the Untaxable**\n\n![Unrealized capital gains tax because the government knows how to spend YOUR money better than you do](https://miro.medium.com/1*KG9jDuCUweluwZlSUCNJ-w.png)\n\nKamala Harris has been tossed into the proverbial economic frying pan for her sizzling new proposal to tax unrealized gains. Now, unlike those legacy corporate media journalists who might as well be on the payroll for how they spread regime-friendly tales, I'm here to flip the script - and maybe flip a few burgers on this heat. Why, you ask? Because when it comes to bad ideas, mockery isn't just fun; it's a civic duty, enshrined by the Founding Fathers in the First Amendment, right next to the right to bear arms and complain about taxes.\n\n![[https://x.com/CWingUexkull/status/1829351456392003952](https://x.com/CWingUexkull/status/1829351456392003952)](https://miro.medium.com/1*2OHc-X2uawnTindM9iFsAw.png)\n\nFirst, let's tackle the \"it's only for the ultra-rich\" argument, the steel man of taxing unrealized capital gains. Ah, the timeless \"eat the rich\" playbook, now with more bureaucratic seasoning. Here's the scoop on tax trends: they're like those neon leg warmers from the '80s; what's haute couture for the rich today will be everyone's wardrobe malfunction tomorrow. Recall the income tax? It started as a whisper among the wealthy, now it's the echo in every working Joe's pay stub. So when they claim, \"Just for the $100 million club, so hush, peasant,\" what they're actually saying is, \"Wait your turn, the taxman cometh for thee.\"\n\nNow, let's slice into the core of this economic monstrosity: the taxation of unrealized gains. Picture this: you plant a garden, dreaming of fresh salads, and before a single tomato blushes red, here comes the government with a tax invoice for your hypothetical harvest. \"But the salad isn't even tossed yet!\" you cry. \"Tough luck,\" replies the taxman, \"We're in the business of taxing what-ifs now.\" It's akin to billing someone for a blockbuster they haven't seen, just because they own a TV.\n\nLet's keep going and wal(t)z, pun intended Mr. VP, where the dance floor vibrates to \"We're All Equal, But Some Are More Taxable Than Others.\" Communism dangles the carrot of utopia, where everyone's equally in the dumps, save for the elite with their plush dachas. Taxing unrealized gains? That's communism with a few more dance steps, offering a glimpse into a future where \"You'll own nothing, yet we'll tax you as if you own everything.\" And wokeness, the darling of the ball, champions equality until it's time to split the bill, then suddenly, it's all about taxing according to \"ability,\" which really means \"who's easiest to shake down.\"\n\nWhen you're dissecting a defective idea, it's essential to consider every counterpoint, like the one suggesting property taxes are the twin sibling of unrealized capital gains tax: \"Isn't property tax just the same?\" some might quip. Here's where the dance gets dizzying. Sure, property taxes do kind of tax unrealized gains, provided you're flexible with your logic. But let's unravel this further - if you're perpetually taxed for merely possessing something, do you ever truly own it? It's like buying a book but paying a fee every year to keep it on your shelf. The existence of one absurd tax isn't a green light for another. If anything, property taxes should be the opening act in the circus of \"Economic Policies That Should Have Left Town Ages Ago.\" Why stop our reform at unrealized gains? Let's revolutionize the whole tax system. If our goal is equity, let's not just spread around bad ideas like confetti; let's sweep them away entirely.\n\n![[https://x.com/Bubblebathgirl/status/1828802352465518846](https://x.com/Bubblebathgirl/status/1828802352465518846)](https://miro.medium.com/1*zOW_TduuX9Y0uYdofAUioQ.png)\n\nIf Kamala and her cadre of economic theorists get their way, we'll soon see them taxing the potential royalties from my unwritten novels or the speculative worth of my future brainwaves. In this brave new world where even the hypothetical can be taxed, the sky isn't the limit; it's just the beginning. Here, the taxman doesn't just dream in color; he taxes in dreams, and the only thing more infinite than the universe might just be the breadth of his imagination for taxation.\n\n![[https://x.com/PinkBeachGirl1/status/1828808096782622939](https://x.com/PinkBeachGirl1/status/1828808096782622939)](https://miro.medium.com/1*zYOVJNdccO5rMeAcjBMoug.png)\n\nSo as we teeter on the edge of an economic policy that could transform our aspirations into tax liabilities, do not just watch from the sidelines: become an active player. Educate yourself beyond the headlines, debate fiercely in every forum, vote with your future in mind, and support policies that foster growth, not fantasy taxes. Let's rally together, using our voices, votes, and wit to ensure our economic future isn't just another taxable dream. Stand up, speak out, and let's champion ambition over absurdity!\n\n8/30/24\n\nConor Jay Chepenik",
  "wordCount": 739,
  "readingTime": 3.488679245283019,
  "claps": 0,
  "voters": 0
}