{
  "id": "a75943a41375",
  "title": "Day 949",
  "createdAt": "2024-10-27 01:00:19",
  "tags": [
    "printing",
    "politics"
  ],
  "url": "https://chepenikconor.medium.com/day-949-a75943a41375",
  "content": "# Day 949\n\nI've been organizing my new office space, and man, does it feel good to finally get things in order. It's astounding how much stuff accumulates over the years, so much clutter! Grateful I had a whole month to move my stuff because transferring everything even a short distance takes forever.\n\nToday, I tried to 3D print a toy gun all at once. Out of 13 pieces, 11 printed just fine, but two of the longer parts messed up and turned into quite the plastic spaghetti monster. Hahaha! Luckily, I can just reprint the two rogue files that didn't cooperate.\n\n![](https://miro.medium.com/1*v5fYVmEtvYJtLeS-8OhUIw.png)\n\nWhat else? Finished _Inventing Bitcoin_ by Yan Pritzker today. Spent some quality one-on-one time with my daughter while my fiancée went to see a movie with my sister. I also cooked some delicious steak on my new grill - grateful my stepdad bought that fine piece of equipment. I'm quickly becoming a steak grilling maximalist!\n\nSolid Saturday overall. Oh yeah, and I ran into a guy on my walk home who chatted my ear off. It was actually nice to talk with him. We definitely have different views of the world, but that's okay. I tried to explain why Bitcoin is different from all other cryptocurrencies (he brought up the topic). He was also urging us to go and vote, which I am planning on doing, though I doubt he'd be thrilled with my choice of candidate. It was ironic because this guy made some excellent points about _1984_ and how we're obsessed with Big Brother - our phones. He liked my joke about us willingly putting Big Brother into our pockets - that's the one thing Orwell didn't predict. The ironic part is, I'd bet the legacy media's gaslighting has convinced him that Trump is the next Hitler. It's saddening because the very propaganda we're subjected to is exactly what Orwell warned us about. Sure, Trump is a flawed human being, but he's not Hitler - not even close. Calling him that only escalates tensions and definitely played a role in why there have been multiple assassination attempts on his life.\n\nAnyhow, politics is always a spicy subject to dive into with people. I am for freedom. For the Constitution. For secure borders. For fixing the money and making America a prosperous nation. For fewer taxes. For being pro-Bitcoin because that'll fix the money. For less war. For removing all the poison in our food like artificial dyes, seed oils, and other stuff that's illegal in most other countries. For no more censorship. Honestly, if the Democrats were about the things they're supposed to be for - like anti-war, freedom of speech, small businesses - I would gladly vote Dem. But they aren't. The party has been infected with this mind virus that prevents many from facing their cognitive dissonance. Not saying that was the individual I was talking to, but I got the feeling he thought Trump was this supreme fascist and what's crazy is there wasn't one word about how Kamala is going to fix things. Didn't even mention Kamala just bad mouthed Trump.\n\nI wanted to ask some more questions because it's good to be exposed to people who think different from me. That's crucial so I don't just get fed stuff from the echo chambers. However, I'm about policies and ideas, not just attacking the other side. I must mention the latest [pod between Rogan and Trump](https://youtu.be/hBMoPUAeLnY) was great. It really made me rethink what I knew about Tariffs. Quite an effective weapon if wielded correctly. Also, if Trump were to remove the federal income tax, man, that would be so based.\n\nAnyhow, until tomorrow anon. Grateful to be in the United States where people can talk shit about the politicians and politics because we have freedom of speech. Not something we should ever take for granted.\n\n10/26/24\n\nConor Jay Chepenik",
  "wordCount": 651,
  "readingTime": 2.656603773584906,
  "claps": 0,
  "voters": 0
}