{
  "id": "a76861389d06",
  "title": "Day 1391",
  "createdAt": "2026-01-12 02:39:49",
  "tags": [
    "lo-fi",
    "compounding",
    "money",
    "is",
    "the-exhaust-fumes"
  ],
  "url": "https://chepenikconor.medium.com/day-1391-a76861389d06",
  "content": "# Day 1391\n\n![[https://www.youtube.com/watch?v=MESEj-Mw3VI&t=5010s](https://www.youtube.com/watch?v=MESEj-Mw3VI&t=5010s)](https://miro.medium.com/1*iqv0W5Zx6F7wdEWqzVRXjg.png)\n\n**My LoFi Bet Is Stop Thinking & Start Posting**\n\nI made a second LoFi video today. Not because I have a distribution strategy. Not because I ran the numbers. Because I keep thinking about a crude term I keep hearing online: retardmaxxing.\n\nRetardmaxxing is the act of stopping all consequence-calculation and [Leroy Jenkins-ing into something](https://youtu.be/mLyOj_QD4a4). Yes, a million things could go wrong. But think about what could go right. You could change your life.\n\nHere's my logic:\n\nSome guy made roughly one million dollars off a fireplace video. A fireplace. Crackling wood and ambient heat for ten hours. That's it. That video is still generating revenue while he sleeps. One video made him around one million dollars. Why can't I do the same with LoFi?\n\nI read an [X article](https://x.com/vasuman/status/2009664478095294498) that described money as the exhaust, not the engine. What the author meant is simple but uncomfortable: when you fixate on money, you start optimizing for safety instead of growth. You choose what looks sensible over what feels alive. You pass on opportunities that could change your trajectory because they do not come with a clean paycheck attached. Little by little, you trade upside for comfort, until one day you look up and realize you have spent a decade protecting a life that never really expanded.\n\nThe alternative is to build something that compounds. Skills. Networks. Products. Systems. You name it. Things that keep working when you're not. LoFi fits that mold for me personally.\n\nIf I post a LoFi video every day this year, here's what happens: I get better at making them. Not marginally better. Significantly better. The 300th track will not resemble the first. I will have internalized what works, what resonates, what feels right. That knowledge compounds.\n\nI'll have a collection. Not a scattered handful, but a catalog. A library. An actual body of work that didn't exist before I started.\n\nWorst case: nobody cares. The algorithm ignores me. The videos sit quietly with double-digit views. So what? Now I have 365 LoFi tracks I can play in the background while I work. That's not nothing. That's actually quite a lot of great white noise to focus on the next thing.\n\nBest case: one track catches. The compound effect kicks in. I've built something that generates passive income while I do other things. A side hustle that exists because I stopped thinking and started posting.\n\nThe difference between these outcomes is not luck. It's volume. The fireplace guy didn't make one video and hope. At least I doubt it, but if he was a one hit wonder, respect. My guess though is he probably made dozens of ambient videos on other channels before he found that one hit.\n\nMost people never get to best case because they never get through the volume required to get there. They're too busy calculating, optimizing, waiting for the perfect moment.\n\nRetardmaxxing might be a crude term, but in today's noise filled environment maybe it is the antidote we've all been looking for. It's the acknowledgment that the perfect moment is a lie you tell yourself so you never have to risk failure.\n\nI'm not **just** chasing money with this. I'm building something that compounds. The money, if it comes, will be the exhaust!\n\nDay two of posting LoFi. 363 to go.\n\n1/11/26\n\nConor Jay Chepenik",
  "wordCount": 560,
  "readingTime": 2.3132075471698115,
  "claps": 0,
  "voters": 0
}