{
  "id": "afca180684f7",
  "title": "Day 1364",
  "createdAt": "2025-12-15 21:52:28",
  "tags": [
    "getting",
    "better",
    "everyday",
    "small-habits-big-change",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/day-1364-afca180684f7",
  "content": "# Day 1364\n\nCrushed a run today in sub-32 degree weather, partly to sweat out the past few days of indulgence, partly because my body needed it. Honestly, it felt incredible. The only thing that suffered were my hands, which would have been frozen by the end if I had not tucked them into my hoodie pouch and ran awkardly. Needless to say my pace was above 10 minutes but I still got a 2.5 mile mountain run in so I consider it a success.\n\nI have written plenty in these Medium posts about how grateful I am to work from home, and that has not changed. But there is something deeply right about moving your body, something no standing desk or productivity hack can replace. Sitting in front of a screen all day simply is not what we humans were built for.\n\nLately I have been sneaking in ten pushups here and there throughout the day. Nothing heroic. Just enough to remind myself that I am not a piece of furniture.\n\nReturn to movement. Especially in the winter, when the cold gives you every excuse to stay inside and stay still. Build the small habits. Stack them. Life gets noticeably better when your body remembers it is alive.\n\nDo it long enough and, sure, maybe one day you end up with a corner office. That's great. But if I'm honest, the corner office has never really been the goal. Those are mostly just rooms for sitting, staring at screens, and making calls.\n\nWhat feels more interesting is something else entirely. A big, open warehouse. A basketball court. A sauna. A real gym. Space to move, think, build. Space that reflects how I actually want to live, not how one is supposed to 'work'.\n\nI know that in ten years or less I'll have the capital to build something like that. Which means the real work is starting now. Taking care of the body. Building the habits. Letting the vision take shape long before it exists in the physical world.\n\nFor now, it's still pretty fun to use AI to drop myself into a slick NYC corner office. That image is just a symbol. The movement, the discipline, and the daily reps, that's the part that will actually allow me to manifest said desire.\n\n![When BTC hits 10 million a coin, there will be signs](https://miro.medium.com/1*Ei6fULHPVNFEJU0NnYofyQ.png)\n\n12/15/25\n\nConor Jay Chepenik",
  "wordCount": 388,
  "readingTime": 1.6641509433962263,
  "claps": 0,
  "voters": 0
}