{
  "id": "b4faf4670f2f",
  "title": "Day 1388",
  "createdAt": "2026-01-09 02:34:53",
  "tags": [
    "the",
    "good",
    "old",
    "days"
  ],
  "url": "https://chepenikconor.medium.com/day-1388-b4faf4670f2f",
  "content": "# Day 1388\n\n![How it feels when you get in the flow state of writing](https://miro.medium.com/0*GbQK98FCido14YAV.gif)\n\nThis is how I felt writing last night.\n\n![When you got nothing to say](https://miro.medium.com/0*01Z8XegBz6r8n6ZC.jpeg)\n\nThis is how I feel writing right now. Sloan won't go to sleep. I spent over an hour trying to put her to bed and nothing. So I'm sitting here with a headache, tired, and ready to call it a night because the night time walk I was looking forward to taking, well that's not going to happen after all. At least Sloan is enjoying her magnetic maze toy next to me.\n\nMan makes plans and God laughs. Such is life, but you know what...it's a good thing I just spent an hour last night hashing out how important it is to appreciate the time you have with children, even when you don't want to deal with the challenges that can come with it at times. Before I realize it Sloan will be an adult. She'll be ready to take on the world and leave my home. I hope I can convince my kids to stay nearby. Or better yet they have their own desire to do so. But regardless, she will grow up soon enough and go start her own family.\n\nI'll yearn for these days when I put her to bed. When she was small and relied on me for most things. I'm reminded of this meme:\n\n![The good old days](https://miro.medium.com/0*hi2YZZKOV4uaEgzj.jpg)\n\nThe beautiful thing is I know I'm in them now. So I just gave Sloan a kiss on her forehead and smiled as she played with her magnet toy. What a blessing kids are. If you're on the fence anon, I highly recommend hopping off and joining the side that involves these little miracles. No one wants to be on their death bed surrounded by random medical professionals they don't know. Children fix that.\n\n1/8/26\n\nConor Jay Chepenik",
  "wordCount": 297,
  "readingTime": 1.670754716981132,
  "claps": 0,
  "voters": 0
}