{
  "id": "b61a7e8412f6",
  "title": "Day 1279",
  "createdAt": "2025-09-22 03:00:19",
  "tags": [
    "sunday-funday"
  ],
  "url": "https://chepenikconor.medium.com/day-1279-b61a7e8412f6",
  "content": "# Day 1279\n\nI need to start writing these Mediums before I put my child to sleep. I keep falling asleep every time I tuck in my daughter. Now I'm groggy and don't have much to say.\n\nGod is good. Had a great Sunday. Took my little one to a coffee shop earlier today to get a coffee and watch the game. We followed up the coffee ship by visiting an antique store. Then my Dad and Sister came over for dinner and I cooked them steak. I got in a nice workout with my Dad before we ate. Even got ice cream with my little one afterwards.\n\nOh yeah, and the Eagles and Jags both won today, which always triggers some primal satisfaction in my lizard brain. In the grand scheme of things, NFL scores rank somewhere between \"what my neighbor had for breakfast\" and \"the current price of platinum\" in terms of life impact, but logic has never stopped me from caring about grown men in tight pants chasing a leather egg around a field.\n\nI'll admit I'm a certified sportsball enjoyer. That said, I've sworn off jerseys after a tweet ruined them forever by pointing out the obvious: paying $150 to become a walking advertisement for another man's personal brand is peak consumer stockholm syndrome. Picture explaining this to an alien: \"Yes, I purchased this polyester shirt with HURTS emblazoned across it because I respect his spiral-throwing abilities, and now I parade his surname through Target like I'm his unpaid marketing intern.\"\n\nKids get a pass, they're still workshopping their identity and genuinely believe they might throw touchdowns someday. But watching a 45-year-old accountant named Gary strut around Home Depot in another man's jersey? That's just weaponized fandom. I'd rather show up to games in a bathrobe than cosplay as someone else's employee at this point in my life.\n\n![[https://www.instagram.com/p/DO4HgArkc-rVgDHbkCwuH_kYJGK75ErPBToTek0/?img_index=2](https://www.instagram.com/p/DO4HgArkc-rVgDHbkCwuH_kYJGK75ErPBToTek0/?img_index=2)](https://miro.medium.com/1*rOtcOblmOmnK2vta_incBg.png)\n\n9/21/25\n\nConor Jay Chepenik",
  "wordCount": 318,
  "readingTime": 1.4,
  "claps": 0,
  "voters": 0
}