{
  "id": "bae865f4b0f3",
  "title": "Day 1387",
  "createdAt": "2026-01-08 04:38:03",
  "tags": [
    "banger-alert"
  ],
  "url": "https://chepenikconor.medium.com/day-1387-bae865f4b0f3",
  "content": "# Day 1387\n\nAs I sat down to write tonight, I was reminded of Sisyphus and his boulder. Which is funny because I don't think Sisyphus got the choice to do something. So maybe a terrible analogy to make here. Also pushing a massive boulder is way more painful than writing everyday. Or is it? I mean staring at a blank canvas and having to figure out what to put there...NOT EASY. But being an artist aside it's way easier than the physical labor of forcing a massive rock up a hill for the rest of your life. So no, writing everyday is actually a blessing, a worthwhile burden I'm glad I have decided to do.\n\nOne of the things I missed most about being in Jax is the ability to walk around easily. Which is not what Jax is known for because it's actually massive and in some places not great for walking at all. But in my spot I'm able to walk easily and there are a lot of sidewalks. In rural New Jersey, where my in-laws live it's not really designed for walking. There are not sidewalks around where they live so you have to watch out for cars more. Also the freezing cold doesn't help one's desire to get outside.\n\nSo tonight I walked. Went from averaging under 5k steps a day these past three weeks to over 15k tonight. Which can be kind of a gay thing to measure. Not gay in one's sexual orientation, but gay in the this is ridiculous type sense. Probably could have used ridiculous there in the first place, but sometimes I enjoy writing in a stream of consciousness type fashion on a digital medium. You know when you write with your hands on paper, if you mess up, well it's a lot harder to fix. Which is beautiful in a way. A sense of permanence. Whereas digital stuff is a lot more transitory. One wrong move on a server and if that file isn't backed up GOODBYE! See ya later alligator.\n\nOn my walks I enjoy listening to podcasts. Like having two Uncs in my ear discussing life. Espousing wisdoms I need to hear. Wisdoms I wouldn't get from my friends or family necessarily because they don't have the same interest about the thing I want to learn about. There is only so much time to learn right? So it's pretty amazing to think that because of the visceral digital world, I can just enjoy a convo from two people who I otherwise would never get the chance to hear.\n\nMany good points in the podcast I enjoyed. One that stuck with me was about how different the writing in the past was. Today everything is more summarized. Bulleted. Designed for an audience with a much shorter attention span. A post on X went viral recently of a Dad talking about how he only wants to spend 10 minutes with his kids a day. His desire was to \"work\" so he could get wealthy. I'm summarizing a long tweet very crudely and don't mean to make this guy sound like an ass, although his post kind of made him sound like one. My point is that in a way I get it. Yet, the podcast I listened to was such a good reminder of how much bullshit we do because we are chasing some vain goal.\n\nHonestly, I got the Dad's point. There are many times I'm having to deal with some stuff because of kids I don't want to deal with. Yes, I'd rather be \"working\" aka monitoring the situation on Twitter, rather than changing a diaper. But at the end of the day, even if I was doing legit work and making money, none of that is anywhere near as important as being a good Dad to my children.\n\nSo back to the point on writing, digital space has made it so much easier to synthesize, summarize, be a jack of all trades about everything. It actually makes it very hard to focus on one thing and really go deep because my feed is filled with Bitcoin breaking news, war breaking news, tutorials on Claude code to get rich, random memes, and so much other stuff that I do enjoy looking at, but don't need to see. I know I'm not alone in that either. Sure someone else's feed might be different, but it's really just a bunch of noise designed to keep our attention.\n\nIt makes me reflect on what matters. That was another excellent point in the podcast. One of the men had done ayahuasca and talked about believing they were dead. All he could think about was the people he loved and would they be okay. I'm not going to lie I like material things. I'd love to trade my Jeep Cherokee in for a Toyota Tundra. Get a larger TV. A brand new guest house, so I could have in-laws over more easily. A sweet studio in New York for when I visit. An actual 100% gold Casio watch.\n\nBut those things won't bring me everlasting joy. They won't help me feel fully satiated in a way only my Lord & Savior Jesus Christ can with His everlasting Grace. No those are temporary items that bring temporary joy. What actually matters while we are here in meatspace is that deep kind of love you build with, well those you love.\n\nGood gosh that sounds so simple and cliche. Yet, isn't that the beauty of life. K.I.S.S... keep it simple stupid lol. So much truth in that acronym. You know mid writing this my daughter woke up and I had to put her back to sleep. And I loved every second of it. I told her how proud I was of her, how I know she is going to accomplish amazing things in her life, how my heart will forever be grateful to God for Him giving me such amazing kids. I meant every word I said to her.\n\nI pray that Father who is struggling to want to spend time with his kids, realizes that time spent with his kids is one of the greatest blessings on earth. I don't blame him at all for wanting to get wealthy or for struggling with that urge to focus on other things because it seems more important. I've been in that place myself and can't say much more other than I'm grateful for insights I can garner from strangers on the internet.\n\nAlso curious how books in the future will be written. Hopefully not full of AI slop. Hahahaha I just imagine kids 200 years from now being like yeah you need to read old books, and the old books are just like \"Life isn't just about spending ten minutes with your kids - it's about learning to love all those little moments. Kids are bold. Brave. Curious. The best. Don't ever forget that because before you know it, life won't just be over - you'll be facing divine judgment.\" Which yeah, that's true. But man we don't need AI to optimize, synthesize, and enhance every insight we have. Sometimes it's nice to hear what a human actually thinks without running all their thoughts through the LLM. Something I am guilty of myself.\n\nSo anon, the final insight of this piece I hope to leave you with is we are all sinners. Guilty of different sins. It doesn't mean that we should be proud of our amazing humility, no it means we should realize the error of our ways and pray for God's Grace to continually help ourselves and those around us. Even if they happen to be random internet strangers we don't know, but we believe they could use a prayer.\n\n![Rise above](https://miro.medium.com/1*fVwN25Z9iGTXmqaj67X_Tg.png)\n\n![How I'm moving being back home in DUVAAAAAAAAL](https://miro.medium.com/1*3uA4Je-yAlt87_KSgXnn6Q.png)\n\n1/7/26\n\nConor Jay Chepenik",
  "wordCount": 1302,
  "readingTime": 5.296540880503145,
  "claps": 0,
  "voters": 0
}