{
  "id": "bb33d148f79e",
  "title": "Day 915",
  "createdAt": "2024-09-23 01:31:03",
  "tags": [
    "my",
    "brain",
    "just",
    "be",
    "thinking"
  ],
  "url": "https://chepenikconor.medium.com/day-915-bb33d148f79e",
  "content": "# Day 915\n\nSunday Funday.\n\nSeems like every time a celebrity hits the delete button on their X posts, it just inadvertently flashes a neon sign saying, 'Look what I'm hiding!'...with all the buzz around Diddy this digital cleanup spree does smell suspicious. The Streisand Effect in action.\n\nYou've got to wonder, in this age where nothing truly disappears from the internet, how long does X really hang onto those ghost tweets? Even after you've supposedly wiped them from existence, are they just lurking in some digital shadow, waiting to jump back into the spotlight?\n\n![[https://x.com/Heatherc_77/status/1837986015635796126](https://x.com/Heatherc_77/status/1837986015635796126)](https://miro.medium.com/1*-9AguhbUG2w1YAfANLnbEg.png)\n\n![[https://x.com/ConorChepenik/status/1838009073482010654](https://x.com/ConorChepenik/status/1838009073482010654)](https://miro.medium.com/1*wx44vk60-uE_rn63azxKbQ.png)\n\n![[https://x.com/ConorChepenik/status/1837650858164580753](https://x.com/ConorChepenik/status/1837650858164580753)](https://miro.medium.com/1*l0INZXi9cuYxmcnB8oR_kw.png)\n\n![[https://youtu.be/OW7TH2U4hps](https://youtu.be/OW7TH2U4hps)](https://miro.medium.com/1*xEtjmFB7p-I934_ZXzXQVg.png)\n\nAmerica is a great place. A chosen Nation under God. I use to have to pledge to its flag growing up. That pledge wasn't just words; it felt like a promise, a collective dream. Manifest Destiny, they said, painting a picture of a nation destined to stretch from sea to shining sea, a beacon of hope perched on a hill for all to see. There's something magnetic about the USA, with its blend of cultures, its relentless pursuit of innovation, and its unyielding spirit. Yes, I love the USA - it's not just great; it's a grand, ongoing saga of what it means to strive for something bigger than oneself.\n\n![](https://miro.medium.com/1*4QrbMRGJ00ldc89YHiIQ-w.png)\n\n9/22/24\n\nConor Jay Chepenik",
  "wordCount": 208,
  "readingTime": 1.6182389937106918,
  "claps": 0,
  "voters": 0
}