{
  "id": "bedc668e6928",
  "title": "Day 1283",
  "createdAt": "2025-09-26 03:57:18",
  "tags": [
    "bitcoin",
    "bidets",
    "and",
    "3d-printers",
    "top-three-life-hacks"
  ],
  "url": "https://chepenikconor.medium.com/day-1283-bedc668e6928",
  "content": "# Day 1283\n\n_3 Things That Have Changed My Life For The Better_\n\nBidets, 3D printers, and Bitcoin. I wish I'd discovered all three sooner. Bidets have been around for ages, but we're still early on 3D printers and Bitcoin. Now that I use them, I can't imagine life without them. Smearing feces around with dry paper? Brutal. Public bathrooms are fine in a pinch, but my at home the bidet reigns supreme, and they're cheap on Amazon, so if you want a cleaner experience and own a toilet, you have no excuses. Trust me (or better yet verify for yourself) once you try it you won't go back.\n\n3D printers are also superpowers. You go from idea to physical object in less time than it takes most people to doomscroll on the pot. I've printed locks, shelves, laptop stands and of course, some toy guns for fun. It's crazy what we can already build, and this tech is only getting better. I look forward to one day buying a metal 3D printer when it no longer costs an arm and a leg because deflation makes the tech better, cheaper, and way easier to mass produce.\n\nAnd then, last but not least, there's Bitcoin. Money that can't be debased or frozen. The price appreciation is nice, but that's just a reflection of its deeper qualities: permissionless, non-debaseable money that actually respects your time and work. Holding Bitcoin feels empowering in a way fiat never could. It has given me so much hope for the future in a time where it feels like that is desperately lacking. Or maybe that's just the doomscrolling? Hard to tell sometimes.\n\nLately I've been thinking I should spend more time on things I love and less time scrolling. I just got the new iPhone, and while the camera is sick, I've already lost hours to mindless feedslop. Might be time for another Twitter detox. That said, check out this tweet I posted today of a video zooming in and out with the new camera. It was a beautiful sunset.\n\n![[https://x.com/ConorChepenik/status/1971356479166066860](https://x.com/ConorChepenik/status/1971356479166066860)](https://miro.medium.com/1*eomjcUFYYBWc_OM85P8E9w.png)\n\n9/25/25\n\nConor Jay Chepenik",
  "wordCount": 348,
  "readingTime": 1.5132075471698112,
  "claps": 0,
  "voters": 0
}