{
  "id": "c78fc0499070",
  "title": "Day 1126",
  "createdAt": "2025-04-22 19:19:22",
  "tags": [
    "bitrefill",
    "bitcoin",
    "bitcoinnews"
  ],
  "url": "https://chepenikconor.medium.com/day-1126-c78fc0499070",
  "content": "# Day 1126\n\nWrote this yesterday and forgot to post it on Medium, but rest assured anon I did write this on the 21st.\n\n**Ten Years Building Bitcoin's Everyday Economy: Inside Bitrefill with Sergej Kotliar**\n\nTen years in Bitcoin can feel like an eternity just ask Sergej Kotliar, Founder and CEO of Bitrefill, who recently celebrated a decade of turning Bitcoin into something you can actually use in your everyday life.\n\n\"We started Bitrefill back in 2014,\" Sergej reflects, thinking back to the early excitement around Bitcoin. \"The promise of internet money as a workaround to how cumbersome money was online motivated me. Imagine sending money as easily as sending an email. That's still the vision driving us today.\"\n\nBitrefill has evolved from a straightforward crypto gift card provider into a full-fledged e-commerce powerhouse, allowing Bitcoiners to buy gift cards, eSIMs, mobile top-ups, and even prepaid debit cards. From Netflix binges and Uber rides to topping up your phone in the middle of nowhere, Bitrefill supports more than 10,000 brands and over 900 phone carriers in more than 170 countries.\n\n![**You can check out all the products and services they offer at [https://www.bitrefill.com/](https://www.bitrefill.com/)**](https://miro.medium.com/0*i8AciXHUmH80MLPV)\n\nOne challenge Sergej has navigated successfully is steering clear of hype-driven pitfalls. \"We've always been a little bit better at building actual usage than at building hype,\" he explains. Instead of chasing every altcoin trend or speculative frenzy, Bitrefill has focused on the real-world, day-to-day use of crypto.\n\n\"The biggest challenge has always been finding the actual users of Bitcoin, not investors, but the ones who really want to use Bitcoin in their everyday lives,\" he emphasizes. Bitrefill, he says proudly, has become the starting point for many users looking to spend Bitcoin seamlessly. \"I think that people that use Bitcoin transactionally and are looking to buy something with their coins, for them very often their customer journey starts with Bitrefill.\"\n\nSergej isn't shy about critiquing popular Bitcoin memes either. One particularly notable example is the \"two S-curves\" chart suggesting Bitcoin first serves as a store of value, then as a medium of exchange. \"It's maybe my least favorite chart,\" Sergej laughs. \"I asked the creators, and they admitted, 'I made it up.' Like okay, it was definitely not a technical basis.\n\n![[https://www.linkedin.com/posts/coryklippsten_bitcoin-activity-7183926380450004992-YRT9/](https://www.linkedin.com/posts/coryklippsten_bitcoin-activity-7183926380450004992-YRT9/)](https://miro.medium.com/0*BaFO9tRZabp9QEhS)\n\nWhile the chart lacks empirical data, notably missing any values on the y-axis, it does visualize a conceptual framework that many in the Bitcoin community find compelling. The illustration suggests a natural progression where Bitcoin's adoption follows two sequential S-curves: first establishing itself as a store of value (the yellow curve peaking around 2029), followed by widespread adoption as a medium of exchange (the green curve peaking around 2037). Despite its speculative nature, some argue this visualization effectively communicates the potential evolutionary path that many Bitcoiners envision, even if it wasn't created with rigorous technical analysis.\n\nWhat makes the Bitcoin ecosystem truly remarkable though is that builders like Sergej and his team at Bitrefill aren't waiting for theoretical adoption curves to play out. They're actively accelerating them. By creating practical solutions for everyday Bitcoin transactions now, Bitrefill is working towards pulling that \"medium of exchange\" S-curve forward, demonstrating that Bitcoin's utility doesn't have to follow a delayed timeline where store of value comes first.\n\nIndeed, Sergej sees a more nuanced reality: Bitcoin serves different purposes for different people, simultaneously. \"There's different people that use Bitcoin for different things, and some want to invest in it and some use it as a tool,\" Sergej clarifies. \"You can't say that one of them is better than the other... it just is. Different people will use the same thing and they engage in the same market with different purposes.\"\n\nThe Bitrefill philosophy is simple: practicality over hype. \"Selling Bitcoin to people is clearly a much bigger business than letting people shop with Bitcoin,\" Sergej acknowledges candidly. Yet Bitrefill stands proudly as a market leader by volume for transactional Bitcoin use. When YouTube travelers share their global adventures \"living on Bitcoin,\" it's Bitrefill powering most of those purchases.\n\n\"If you watch these YouTubers 'I spent a month traveling the world living on Bitcoin,' there's been quite a few of those... a good chunk of it, you know we can argue if it's 50 or 80 [percent], but like a good chunk of their Bitcoin usage ends up paying with Bitrefill,\" he notes with pride.\n\nAnd Bitrefill is not done innovating. Recently, they introduced the Bitrefill reloadable Visa card in Europe, designed for ease of use. \"It's a regulated product, you need to have an account and go through KYC and all of that, but once you have it, it's a very simple straightforward no bulls***m you send in your Bitcoin, Lightning works, and then you can just go and blip and pay, and then you don't have to think about anything,\" Sergej explains.\n\n![[https://x.com/bitrefill/header_photo](https://x.com/bitrefill/header_photo)](https://miro.medium.com/0*u8ukVX4kQqSiZ1Q1)\n\nTo promote it, they've even been hiring people specifically to travel around Europe spending Bitcoin and documenting the journey. \"We put up these ads and we hire someone and then we record them having the best day of their life spending money,\" he says. While acknowledging it's partly a marketing stunt, he adds, \"Paying some of our customers instead to spend the day having a blast and then record it and make content is a better choice than traditional advertising.\"\n\n![[https://x.com/bitrefill/status/1909246589337510000](https://x.com/bitrefill/status/1909246589337510000)](https://miro.medium.com/0*wZ8d_LqoyCpdNQAL)\n\nBut Sergej has his eyes firmly on an even more futuristic horizon: a world where robots pay each other seamlessly. \"We've built an online monetary system that discriminates against bots because they're usually associated with fraud,\" Sergej notes. \"But soon, we'll rely on AI to shop automatically for us. Having a fraud-free online payment method like Bitcoin could revolutionize how robotic agents transact.\"\n\n\"In a world where everybody has a bunch of agents being robotic secretaries and so on, and given the fact that online commerce is currently designed specifically to keep out robots... I think there's a big opportunity there,\" he explains. \"Having an online payment method that is fraud-free should in theory be very useful for a world in which shopping happens automatically, for example, or how a robot will pay other robots.\"\n\nThe intersection of how AI will leverage Bitcoin is a fascinating rabbit hole and discussion that is playing out in real time. Sergej recommends [Daniel Suarez's novel \"Daemon\"](https://www.amazon.com/DAEMON-Daemon-Daniel-Suarez/dp/0451228731) for those intrigued by the potential (and risks) of AI-driven transactions. \"There's tremendous opportunity here,\" he teases, \"and it's definitely something we're actively exploring at Bitrefill.\"\n\nAsked what he'd ask Satoshi Nakamoto if given the chance, Sergej pauses briefly. \"I would ask him to tell me the story of how he left the space,\" he finally answers. Given Sergej's decade-long journey with Bitrefill, his curiosity about Bitcoin's creator's departure feels particularly fitting.\n\nTen years is a long time in Bitcoin, but clearly, Sergej Kotliar and Bitrefill are just getting started.\n\n4/21/25\n\nConor Jay Chepenik",
  "wordCount": 1142,
  "readingTime": 5.0094339622641515,
  "claps": 0,
  "voters": 0
}