{
  "id": "c7e8119ba92a",
  "title": "Day 1030",
  "createdAt": "2025-01-16 23:45:40",
  "tags": [
    "memes",
    "make",
    "millions",
    "of",
    "dollars"
  ],
  "url": "https://chepenikconor.medium.com/day-1030-c7e8119ba92a",
  "content": "# Day 1030\n\nI stopped taking a shirtless photo of myself every morning. Sure, it would've been cool to stitch together a montage after 365 days to track my progress, but I didn't like starting my day by grabbing my phone. My job already has me staring at a screen for eight hours a day, and I willingly tack on more time watching YouTube, scrolling through Nostr and X, and texting friends. I don't need another habit adding to my screen time.\n\nOn a different note, I coached flag football for the first time today. It was fun and challenging. Trying to get ~20 young children to focus is no small feat. I had to laugh when the kids kept saying \"cap.\" I guess I'm getting older, but I at least know cap means \"that is not true\" so maybe not that old. Then again, it's only 10:30, and I'm ready for bed, so maybe I am getting quite old.\n\nWrapping this daily reflection up, I need to start brainstorming for my book. Getting six-pack abs isn't my top priority right now. I'm healthy and plan to stay that way, but I'm not about to obsess over abs just to make a montage. Writing a kick-ass book packed with memes? Now that's the real priority I have for 2025.\n\nHere's the idea: 121 questions. Each question is a chapter, and I'll be answering them with my own limited knowledge of how this world works. Half the challenge is coming up with good questions. The other half will be making quality memes to go into the chapter. If I can do this well the writing should flow easily.\n\nI've just signed [memelord.tech](https://t.co/xeki3RxqBV) to help with the memes. I also ordered this book to see what a well done book about memes will look like.\n\n![](https://miro.medium.com/1*PbcuWN0Tf8J4-5AxdWp0-A.png)\n\nI'll finish this with a question I would like to start the book with.\n\nWhy Should You Become A Parent?\n\n1/15/25\n\nConor Jay Chepenik",
  "wordCount": 328,
  "readingTime": 1.4377358490566037,
  "claps": 1,
  "voters": 1
}