{
  "id": "ccb9af6ce248",
  "title": "Day 77",
  "createdAt": "2022-06-07 21:45:31",
  "tags": [
    "kinsey",
    "money",
    "sick",
    "bitcoin",
    "finding-the-light"
  ],
  "url": "https://chepenikconor.medium.com/day-77-ccb9af6ce248",
  "content": "# Day 77\n\nWhatever damn variant of Covid I got is doing me real dirty. Saline water (which is literally just salt and filtered water) has been helping a lot when I gargle. I got some decent sleep last night but I just feel drained beyond belief. Barely did anyone work at my job today because I just did not feel up to it. Not a great excuse but some days are like that.\n\nEnded up coming across this picture on Twitter and it resonated with the post I made yesterday. Truly wild how much of an influence these people had on gender ideology. The more I learn the more I'm convinced we need to bring Judeo-Christian values back to the masses of America. That said the best way to do this is to start from within. Learning to love yourself I'm still convinced is the best way to lead people to the light.\n\n![](https://miro.medium.com/1*9jmZJixj9Pjp0f6UZiMq3g.jpeg)\n\nPeople are better off when they have a solid set of values that show them how to treat others. We should absolutely accept people for who they are, but to force your ideology down someone else's throat is blatantly wrong. This goes for both Christians and members of the LGBTQ+ community. I want to see a world where people can happily coexist and interact with those they wish to interact with. This doesn't mean excluding or segregating people from stores. It just means finding circles you resonate with. When people do this they stop trying to convince others to think like them because they are assured good will win. On both sides too. With 8 billion people inhabiting the planet it is nearly impossible to know what floats everyone's boats and it's guaranteed to make many upset if we impose top-down controls. As always this change needs to come from the bottom up. Everyone is better off when they can find groups of good people they resonate with.\n\nIt really was sad seeing governments implement mandates these past 3 years, which effectively brought back segregation. Didn't think it would be implemented in my life when I read about segregation in history class during high school. Sure enough, medical segregation was a thing for a little. I do admit this round of covid has been much more brutal than I anticipated, but it doesn't justify forcing a 💉  card for entry into a restaurant. People need to be able to make the choices that best suit them. For the high-risk individuals, they should figure out what works for them. Having governments impose top-down controls to solve the challenges worked horribly and I pray we don't see them try to implement something like that again. Freedom is not free! End rant.\n\nToday Senator Lummis announced her new bi-partisan bill for Bitcoin. She named Eth a commodity which I don't necessarily agree with, but whatever. Not going to die on that hill and I'm grateful she put in something that if your bitcoin transaction is less than $200 dollars no capital gains tax. Medium of Exchange here we come. Here is an [article](https://bitcoinmagazine.com/business/heres-whats-in-senator-lummis-bitcoin-bill) outlining what is in the bill. I tell ya some wild price action which I don't have a clue as to why, but it is an important reminder to get long, DCA, and chill. Don't trade an asset that is getting monetized for the first time. Look at this shit lmfao.\n\n![](https://miro.medium.com/0*QCW4QqLJR7Snnt4X)\n\nSome wild P.A, but the more you learn the more comfortable you feel just stacking sats and chilling. Final news of the day, almost done with my Bitcoin magazine article WHOOP WHOOP. Hopefully, they accept it. Fingers crossed.\n\n6/7/22\n\nConor Jay Chepenik",
  "wordCount": 611,
  "readingTime": 2.688993710691824,
  "claps": 0,
  "voters": 0
}