{
  "id": "cf94128cf2bd",
  "title": "Day 85",
  "createdAt": "2022-06-16 01:40:07",
  "tags": [
    "coinbase",
    "bitcoin",
    "trading",
    "gold",
    "central-banks"
  ],
  "url": "https://chepenikconor.medium.com/day-85-cf94128cf2bd",
  "content": "# Day 85\n\nHey woah 75 BIPS from the big daddy central bank today. Maybe the taming inflation gang is serious about getting inflation under control after running wild in 2020 & 2021 printing trillions. Got a good feeling though about bitcoin. This is a good time (not financial advice) to stack some cheap corn. Need to see these exchanges offering paper bitcoin blow up so people can't keep rehypothecating the corn. If we get another fractional reserve banking system under a Bitcoin standard we will have lost the plot. The beauty is we don't have to rely on 12 unelected officials to plan the price of money because Bitcoin is programmatic and the network is just going to keep reducing the amount of bitcoins rewarded to miners by half every four years. Tired of markets pumping and crashing based on expectations of what the Federal Reserve does. I'm hopeful for a programmatic central bank replacing the Fed.\n\nHad a great time at my stand-up comedy class last night. Doing Comedy is so much fun and I need to start going to random open mics after I do my 5 minute set for the final class. I'm sure it is easier to do stand up in front of people who are in your corner and actively helping you get better vs an actual open mic crowd. That said it still feels good to make a room of people laugh. Excited to get some live practice at an open mic one day to really perfect my craft.\n\nCoinbase laid off 18% of their staff today. I wish they would focus on Bitcoin rather than helping A16Z dump shitcoins on retail, but incentives are everything. If you base your entire business model on trading fees it makes sense you help a16z dump on retail. I will say Coinbase is the original platform I used to buy my first sats so I will always appreciate them for that. I hope they figure out a way to promote bitcoin in the future and figure out a business model that works for them. Trading likely will not cut it as more platforms like Strike, Robinhood, and Gemini (To name a few there are many more) offer much cheaper options.\n\nFinally, I had a fascinating convo with my buddy Q tonight about how influencers are taking over marketing. Many influencers will be able to commend more money in this creator economy than traditional cable networks charged businesses to advertise in the past. Partly due to inflation and partly due to social media allowing people to garner massive audiences. It's an exciting world ahead and I will remember to be open-minded as the world continues to change rapidly. Let's end the post with some hopium because I love this pic of Gold trading during hyperinflation in Weimar Germany. I think bitcoin will act the same way in the coming years.\n\n![](https://miro.medium.com/1*tKnI4VEWPJfApdQT5pDJ7w.jpeg)\n\nI love you bitcoin and I love you Anon. Stay safe out there because the Fed might brake something in the financial markets and hopefully bitcoin will serve as a life boat for the plebs.\n\n6/15/22\n\nConor Jay Chepenik",
  "wordCount": 523,
  "readingTime": 2.1735849056603773,
  "claps": 14,
  "voters": 1
}