{
  "id": "d811f51ad524",
  "title": "Day 1115",
  "createdAt": "2025-04-11 01:05:48",
  "tags": [
    "pepe",
    "is",
    "my",
    "favorite",
    "meme"
  ],
  "url": "https://chepenikconor.medium.com/day-1115-d811f51ad524",
  "content": "# Day 1115\n\nYou know sometimes I will scroll down on my Medium profile and just see all the days I've written in descending order. It is wild to see how little time we have on this planet. On day 10,485 I'm going to look back and think damn I am getting old. Hahahahhaha I have no idea why I picked that number, but it's kind of funny. One day I might have to ping Medium's dev team and be like \"ok look I will pay you guys to scrape all the day's I've written, I just need everything in a big JSON file.\" LOL.\n\nMaybe not...I don't know I probably should start scraping (or copying and pasting) now. It would be good to save this stuff myself instead of freeloading on their servers. I don't want to see Medium go out of business, but I also don't think it's wise to trust all my data to a third party. Not very Bitcoiner like.\n\nAnyhow, even if everything was deleted tomorrow I would live. Writing everyday has been tremendous for my own life. It's allowed me to make money from my written words. That's crazy. Think about it, people have paid me in actual money (both bitcoin & fiat) for my thoughts. Not a crazy amount, but still pretty cool to consider.\n\nAnyways, I now want to go ask an LLM how to scrape this website for all the days I've written but if I can't figure it out myself maybe I'll spend the coming weeks doing a lot of copying and pasting manually.\n\nOn the bright side I have crushed my goals this week. Read everyday, 2/3 articles submitted, with the third almost done and ready to be submitted tomorrow. I'll do a workout in the AM to make it 5/5 days worked out. I did a great date night with my wife last night. So yea proud of myself for writing out what I needed to get done this week. It feels good and I'm ready to enjoy the weekend knowing I earned it.\n\nOh yeah and I also did a X/Twitter thread today featuring every NESCAC mascot as Pepe :)\n\n![[https://x.com/ConorChepenik/status/1910433862792208408](https://x.com/ConorChepenik/status/1910433862792208408)](https://miro.medium.com/1*JPLjqQknlfZArjXNe74LCQ.png)\n\n4/10/25\n\nConor Jay Chepenik",
  "wordCount": 366,
  "readingTime": 1.581132075471698,
  "claps": 0,
  "voters": 0
}