{
  "id": "d9df5a161469",
  "title": "Day 1228",
  "createdAt": "2025-08-02 03:32:16",
  "tags": [
    "bet",
    "getter",
    "dvery",
    "eay",
    "lol"
  ],
  "url": "https://chepenikconor.medium.com/day-1228-d9df5a161469",
  "content": "# Day 1228\n\nIt is time for a social media detox. Just deleted Twitter from my phone, and while doing so, I discovered they have a Face ID requirement feature so you can lock any app on your phone behind your Face ID. That's genuinely brilliant on Apple's part. I need to add Face ID protection to all my financial apps, social profiles, gmail, everything that's important really...better safe than sorry.\n\nI had to visit the DMV today and dropped about $95 USDeezys for a two-year registration sticker. No wonder most people can't stand dealing with government services. Of all the things they supposedly provide, why does a simple sticker cost so much? Absolutely riduclous if you ask me.\n\nDuring the visit, the DMV clerk asked to hold my phone to verify my insurance. I obliged because she clearly just needed to see the insurance info, and she handed it right back. That said, I could have been more cautious and offered to email the information instead, but I wanted to get in and out quickly. DMVs are usually quite brutal. Still, the experience reinforced why locking everything behind Face ID makes sense because it's always better to enjoy peace of mind doing so will bring about!\n\nThis week off from work has been exactly what I needed. I'm actually excited to get back into the trenches on Monday, but having some real vacation time felt incredible. Played golf with my buddy Travis today, enjoyed great food, and just relaxed.\n\nNow I need to get disciplined for the next two months. My baby boy will be here soon, and this boy- dad-to-be needs to train for a half marathon.\n\nHere's what I am committing to doing this month:\n\n- **Run 40 miles** - Building that endurance base\n\n- **Complete a 72-hour fast** - Mental and physical discipline\n\n- **Take a week-long Twitter break** - Digital wellness\n\nIf I can nail these three goals, I'll consider this month a success. Time to get after it :D\n\n8/1/25\n\nConor Jay Chepenik",
  "wordCount": 340,
  "readingTime": 1.2830188679245282,
  "claps": 0,
  "voters": 0
}