{
  "id": "dc6b99601999",
  "title": "Day 1014",
  "createdAt": "2024-12-31 03:58:47",
  "tags": [
    "exercise",
    "if",
    "you",
    "want",
    "happiness"
  ],
  "url": "https://chepenikconor.medium.com/day-1014-dc6b99601999",
  "content": "# Day 1014\n\nToday I noted this after a run. I was shooting from the hip and don't know why I felt the need to share this, but I'm glad I did.\n\n![](https://miro.medium.com/1*6P-GxHamfioAhWGZzr7LFQ.png)\n\nAt the end of the run I put on a nice soundcloud remix of Power by Kanye West and just started cooking. Full on sprint down a mountain channeling every ounce of energy I had left. Needless to say, I felt powerful.\n\nMusic has that effect when you use it right. It can light a fire inside you, push you to conquer challenges, and inspire you to become a better version of yourself. But music can also work the other way. It can lower your energy, your motivation, your vibrations. It really depends on the music and the moment. To be fair, some rap is trash, but other rap? It's pure poetry. The key is curating wisely.\n\nEither way, exercising felt incredible today. Moving my body, getting my blood pumping. There's something primal about it.\n\nI've also been thinking about this shirtless pic posting thing and I'm torn. I don't want to chase attention or come across as vain. I also value privacy, so I'm wary of posting something like that on social media for everyone to see my bathroom and where I'm located that day. One idea I've been thinking about is working in silence . Building something quietly, so taking that shirtless pic everyday, but here's the twist: I'd wait 365 days, turning it into a time lapse after I have transformed my body. It'd be less about showing off and more about showing growth. A reward for the discipline it took to get there.\n\nWith New Year's literally tomorrow, I guess I need to make a decision soon. Big 2025. Let's f****** eat.\n\n12/30/24\n\nConor Jay Chepenik",
  "wordCount": 301,
  "readingTime": 1.3358490566037735,
  "claps": 0,
  "voters": 0
}