{
  "id": "dc72138f37c3",
  "title": "Day 1050",
  "createdAt": "2025-02-05 01:46:58",
  "tags": [
    "football",
    "fasting",
    "flag-football",
    "fun-day"
  ],
  "url": "https://chepenikconor.medium.com/day-1050-dc72138f37c3",
  "content": "# Day 1050\n\n![My day summed up in a picture](https://miro.medium.com/1*7FV6gum20Lo8YvrRKAV_Sw.png)\n\n**Today was long but great.** Productive workday, coached flag football, then had an energizing chat with someone from Coinbits about simplifying Bitcoin for everyone.\n\nWork remains chaotic (startup life, right?), but I'm grateful to help people secure their Bitcoin. It's a privilege I don't take lightly, even when tickets pile up. Bitcoin's potential to fix broken systems keeps me charged and being on the front lines of this space as an employee is something many want but few get to do so the fact I get to do it makes me feel incredibly grateful.\n\nFlag football today was quite the rollercoaster. We started horribly: kids grumbling, passes intercepted, and I second-guessed my gutsy 4th-down call at our 5-yard line that backfired. Then magic: down 14–0, we squeezed in a touchdown and 2-point conversion before halftime. Second half? Lockdown defense. When the other team repeated our 4th-down mistake at _their_ 5-yard line, we seized the chance for an easy TD. Final score 21–14. I know it's just elementary school flag football, but seeing those kids rally from disaster? Well that's why coaches do it and it was so fun watching the kids come back to secure a dub. Gratifying.\n\nFinally, I had a nice call. It's been great getting to interview founders and Bitcoiners about their businesses as my side gig for Bitcoinnews. Today's conversation was extra cool as I got to chat with someone building cool apps and focusing keenly on making the way people interact with Bitcoin easier.\n\nIt's an important thing to consider since Bitcoin is an open decentralized protocol anyone can use. I know Bitcoin can fix many of the issues with money, but also people get stuff wrong and get overhyped. Holding private keys, is key, but it's also an easy way to get rekkt if you don't know what you're doing. So long winded way of saying I enjoyed the convo, I look forward to writing an article about Coinbits now that I've interviewed Dave, and I'm glad to see more people working on solutions to make Bitcoin easier to use.\n\nI'll finish today's Medium by noting my fast is going well. Tomorrow is the last day and I'm looking forward to some eggs, bacon, and maybe even a little(lot) of Coffee Thursday morning hahaha.\n\n![[https://x.com/ConorChepenik/status/1886877243407769849](https://x.com/ConorChepenik/status/1886877243407769849)](https://miro.medium.com/1*EwB2b3UdOKy-wGyRm9VLWA.png)\n\n2/4/25\n\nConor Jay Chepenik",
  "wordCount": 392,
  "readingTime": 1.8625786163522011,
  "claps": 0,
  "voters": 0
}