{
  "id": "debe2e1a5d9d",
  "title": "Day 904",
  "createdAt": "2024-09-12 01:59:40",
  "tags": [],
  "url": "https://chepenikconor.medium.com/day-904-debe2e1a5d9d",
  "content": "# Day 904\n\nToday is 9/11 which is a tragic day in the history of The United States of America. I feel for the people who lost loved ones. I was 4 at the time and I was lucky enough to not have lost family during that attack. Hard to imagine your loved ones getting murdered at work from an airplane crashing into their building. That's such a wild sentence to type - it's what happened though. A lot of people literally got murdered for going to work that day in New York.\n\n![[https://x.com/NSmolenski/status/1833925218043396368](https://x.com/NSmolenski/status/1833925218043396368)](https://miro.medium.com/1*E2MleKJ56fGCnel-TnnYCQ.png)\n\nI also think the response to 9/11 with the patriot act is disgusting. Two wrongs don't make a right. The patriot act is some of the most unpatriotic legislation ever passed. It has been a disaster and I'm sad that it was the aftermath of 9/11. I asked Grok to summarize some of the bad parts about the patriot act and here is what it generated.\n\n- **Privacy and Surveillance Concerns**: Critics argue that the Act significantly expanded the government's surveillance capabilities, often at the expense of individual privacy. Provisions like Section 215, which allowed for the collection of \"any tangible things\" (including business records) deemed relevant to a terrorism investigation, were seen as overly broad. The use of National Security Letters (NSLs), which come with gag orders preventing recipients from disclosing the inquiry, has also been criticized for lacking judicial oversight and infringing on free speech.\n\n- **Civil Liberties**: Many believe the Act undermines civil liberties. For instance, the provision for indefinite detentions of immigrants, the expanded use of roving wiretaps without specifying the place or person with enough particularity, and the potential for abuse in \"sneak and peek\" warrants (where notice of search can be delayed) have all been points of contention.\n\n- **Lack of Judicial Oversight**: The Act reduced the checks and balances in place by allowing surveillance and searches with less judicial review than previously required. Critics argue this opens the door for misuse, as the threshold for initiating surveillance was lowered to relevance to an ongoing investigation rather than probable cause of criminal activity.\n\n- **Effectiveness vs. Rights Trade-off**: There's debate over whether the Patriot Act has been effective in preventing terrorism versus the cost to civil liberties. Some argue that while it might have made certain investigative processes more efficient, it hasn't clearly demonstrated proportional benefits in terms of security, especially when weighed against the erosion of privacy rights.\n\n- **Legislative Process**: The speed with which the Patriot Act was passed led to concerns that many legislators did not fully read or understand the implications of the legislation. This haste, critics argue, resulted in a law that was reactive rather than reflective, potentially setting dangerous precedents for future legislation.\n\n- **Public Perception and Misuse**: There have been instances where the powers granted by the Act were allegedly misused or stretched beyond their intended use, like in cases not directly related to terrorism, which fuels the criticism regarding its broadness and potential for abuse.\n\n- **Cultural Impact**: On platforms like X and in broader public discourse, the Patriot Act is often cited as a symbol of government overreach post-9/11. The sentiment shared by many users reflects a belief that it was an overreaction, trading essential liberties for an illusion of security.\n\nI would share in this sentiment. It's disgusting how politicians use tragedies to justify their constitutional violations. We can do better America and I know we will.Here is a meme video I saw today: [https://x.com/WAIFU_WATCHERS/status/1833832384296526336](https://x.com/WAIFU_WATCHERS/status/1833832384296526336)\n\nSometimes the only thing you can do during a tragedy is laugh. Seriously, sometimes crying is not enough. Humor helps heal deep wounds. While it's hard to take the WaifuWatchers guy seriously, because well if you watch the video you will see why. He does an amazing job using humor to expose people to ideas that otherwise no one would even consider listening to. I didn't believe someone bought insurance 2 months before the attack and included terrorism provisions in the insurance contract so I googled it, and sure enough someone did.\n\n![[https://casetext.com/case/world-trade-center-props-llc-v-travelers-indmty-co](https://casetext.com/case/world-trade-center-props-llc-v-travelers-indmty-co)](https://miro.medium.com/1*NJYWihi8FHjGPxICaCYIYw.png)\n\nThere are a lot of dark forces in the world who will gladly profit from tragedy. Humanity can and will do better: God has a plan. I trust in his guidance, especially after I learn things that make me question many deeply held beliefs.\n\n9/11/24\n\nConor Jay Chepenik",
  "wordCount": 718,
  "readingTime": 3.092767295597484,
  "claps": 0,
  "voters": 0
}