{
  "id": "e21f7488c892",
  "title": "Day 1181",
  "createdAt": "2025-06-16 01:32:43",
  "tags": [
    "bitcoinnewsdotcom",
    "article",
    "lets",
    "get",
    "it"
  ],
  "url": "https://chepenikconor.medium.com/day-1181-e21f7488c892",
  "content": "# Day 1181\n\n**Building Bitcoin's Payment Layer: Moritz Kaminski on Creating Alby**\n\nMoritz Kaminski didn't set out to start a company. He just wanted Bitcoin to work better on the internet, but back in 2019, standing at the Lightning Conference in Munich, something clicked. \"There was this super enthusiastic crowd of people who were super excited about building on Bitcoin and not just talking theory,\" he recalls. That energy was contagious. A research analyst at the time, Kaminski started contributing to an open-source project called Alby. A few years later, he co-founded the company.\n\nIf you've used [@getAlby](https://x.com/getAlby), you've probably interacted with their popular browser extension, a bridge between Bitcoin wallets and the web. But under the hood, Alby has become something more ambitious: an open-source toolkit for Lightning payments, app integrations, and self-custody. All aimed at making Bitcoin simpler to use and easier to build with.\n\n![[https://getalby.com/](https://getalby.com/)](https://miro.medium.com/1*0ub0X7OYfoo6ILkLyHpsjw.png)\n\n**The Problem with \"10-Minute Money\"**\n\nMoritz Kaminski's motivation is straightforward: \"We want to be able to send Bitcoin as freely as they would distribute information across the internet.\"\n\nIf you've ever tried to buy a burger and fries with an on-chain Bitcoin transaction, you'll understand the problem. Ten-minute block times don't cut it for point-of-sale transactions. No one wants to order fast food and wait ten minutes at a cash register for the transaction to confirm. Lightning changes that equation completely. The instant settlement transforms Bitcoin from digital gold into actual spending money.\n\nSo Alby started with the basics: \"We started off with the browser extension sort of as a bridge,\" Kaminski explains. But it quickly grew into something bigger. Today, they offer a full suite of Lightning tools:\n\n**Alby Hub**: a self-custodial Lightning wallet that \"really nicely pairs with the browser extension\"\n\n**Alby SDKs and APIs**: letting developers add Lightning payments with minimal friction\n\n**NWC (Nostr Wallet Connect):** \"an open protocol that lets users connect any wallet to any app\"\n\nImportantly, everything's modular. \"All our products work nicely with each other but you don't need them to work with each other,\" Kaminski emphasizes. \"You can connect another lightning wallet to the Alby browser extension...but you don't need to have Alby hub per se.\"\n\nThis approach reflects a core philosophy: \"We basically give users this freedom and control that they want.\"\n\n**Lightning Isn't Easy, But It Can Be**\n\nBuilding on Lightning is powerful, but not always user-friendly. Kaminski acknowledges this head-on: \"Lightning currently is a key enabling technology but it's also sometimes quite complex to use this technology. It's very powerful but not always easy to work with or explain to our users.\"\n\nRather than trying to solve complexity at the protocol level, Alby takes a pragmatic approach. \"We use proven reliable tech to deliver a better user experience,\" he says.\n\nThis user-first mentality extends beyond just wallet interfaces. The team obsesses over removing friction from the payment flow. \"We are living in a digital environment so why do we need to scan QR codes? Why do we need to copy paste some strings?\" Kaminski asks. \"It's all now possible digitally through some clicks and the UX there is a lot better.\"\n\n**Network Effects and No Lock-In**\n\nOne of the biggest challenges for any payments company is achieving network effects. Alby's solution? Make everything interoperable from day one.\n\n\"Developers that integrate our SDKs, there is no lock in effect because we are championing open standards like Nostr wallet connect,\" Kaminski explains. This means \"developers can build zero custody apps, never taking custody of users' funds, while still being able to onboard users with any lightning wallet quickly.\"'\n\nThe result is a Lightning ecosystem that's \"extremely modular\" rather than proprietary. It's the opposite of the walled garden approach that dominates much of big tech.\n\n**Nostr, Cashu, and the Future of Scaling**\n\nAlby has been at the center of Lightning's most playful frontier: Nostr. If you've zapped someone sats for a meme, you've likely seen Alby's integration in action.\n\nBut Kaminski sees protocols like Nostr, Cashu, and ARK as more than just experiments. \"I think they are actually complimentary. A lot of them build on lightning and use that as an underlying payment layer basically to ensure interoperability across each other.\"\n\nAlby is already experimenting with these new protocols. \"You can already today use a cashu mint as a funding source for your Alby Hub wallet,\" he notes. \"This also could then basically be easily extended to an ARK backend, to a spark backend for example.\"\n\nLooking ahead, Kaminski is optimistic about rapid innovation: \"I'm pretty sure in 6 months from now we will see a very different product than we see today which is certainly even easier to use.\"\n\n**Bitcoin Meets AI: The Agent Economy**\n\nWhere things get really exciting is the intersection of Lightning and artificial intelligence. Kaminski believes AI agents transacting with each other could dwarf human-to-human payments. \"I don't know if it's actually comparable to real world peer-to-peer payments between humans. Once we have agents paying each other I assume it's going to be a totally different scale and volume of payments.\"\n\nLightning is \"uniquely positioned as an extremely efficient payment network that allows micropayments across the globe, digital onboarding at extremely low fees,\" making it perfect for machine-to-machine transactions.\n\nAlby is already building for this future. Their newest product, [LNFly](https://lnfly.albylabs.com/), \"enables every Bitcoiner to build their own Bitcoin app without any line of code. It's really optimized for single prompt Bitcoin app development.\"\n\nThink of it as Replit for Lightning. \"You will find lotteries, you find all kinds of different fun apps there, games,\" Kaminski says. The goal is democratizing app creation: \"Give users easy to use tools to build apps and then we will find these use cases that will explode in the future.\"\n\n![[https://lnfly.albylabs.com/](https://lnfly.albylabs.com/)](https://miro.medium.com/1*_3gtuZV8vT9yMOy4TCBSdg.png)\n\nFor developers, Alby offers Model Context Protocol (MCP) integration, making it \"extremely easy now to connect your Alby Hub to your chat agent through this open protocol called Nostr wallet connect.\"\n\n**The Community-First Approach**\n\nDespite all the technical innovation, Kaminski keeps coming back to one thing: the community. \"I always like to point out the importance of our users as key enabler for Alby,\" he says. \"Due to them we can basically work on what we're working on today. They support us with feedback, they support us with contributions to our tools.\"\n\nThis is not just corporate speak. Alby's entire business model depends on keeping users happy while maintaining open standards. \"It's ultimately because of them we are where we are today and that's incredibly cool... basically that we can keep working on and making Alby better every day.\"\n\n**A Question for Satoshi**\n\nWhen asked what he'd want to know from Bitcoin's mysterious creator, Kaminski has a surprisingly practical question: \"Should we redenominate Bitcoin?\" He'd love to hear Satoshi's thoughts on the sats versus bits debate that many Bitcoiners have been discussing on X after Jack Dorsey tweeted about it.\n\n![[https://x.com/jack/status/1924121538485178658](https://x.com/jack/status/1924121538485178658)](https://miro.medium.com/1*zt5ievjfsIy2ceTxIZNMWA.png)\n\nIt's the kind of question that shows how far Bitcoin has come. We're no longer debating whether it works, we're debating the best way to price a cup of coffee.\n\nAnd there's something poetic about the uncertainty. While sats seems to have become the standard, would someone humble enough to create a revolutionary monetary system and then walk away from a million unmoved bitcoins really want the smallest unit named after him? Or would he prefer something else entirely?\n\nWe will probably never know, but the fact that we're even asking shows Bitcoin has moved far beyond its creator's control...exactly as intended.\n\n**Building the Future, One Payment at a Time**\n\nAlby isn't trying to own the Lightning stack. They're trying to open it up and make it easier for everyone to build with Bitcoin. In Kaminski's vision, \"we need to think about compelling Bitcoin payment use cases\" because \"if the use case itself is compelling enough then users are willing to do this additional step in the onboarding.\"\n\nThe result is a company that's simultaneously building infrastructure and enabling creativity. Whether you're zapping memes on Nostr, building no-code Bitcoin apps, or just trying to buy lunch with Lightning, Alby is probably part of the stack making it possible.\n\nAnd that might be the best endorsement of all: building tools so good that people use them without even knowing it.\n\n_Learn more at getalby.com or experience Lightning payments firsthand on Nostr. When you zap someone you might be using Alby's technology without even realizing it._\n\n6/15/25\n\nConor Jay Chepenik",
  "wordCount": 1424,
  "readingTime": 5.923584905660377,
  "claps": 0,
  "voters": 0
}