{
  "id": "e2526f1f9760",
  "title": "Day 1284",
  "createdAt": "2025-09-27 03:59:44",
  "tags": [
    "future",
    "looks",
    "bright"
  ],
  "url": "https://chepenikconor.medium.com/day-1284-e2526f1f9760",
  "content": "# Day 1284\n\nGosh it feels good to make progress on something. Especially when it's something you have been procrastinating on. I did that today with a guest post. It's amazing what a good walk will do. I finally figured out how to get done what I need and feel proud of the piece. You know one other hack I figured out today? Asking AI to be unforgivable (or unforgivably honest). Man does it help cut out the slop when prompting an LLM.\n\nTry it yourself. One good example to test it on is your posture. Here is what it gave me to help correct mine:\n\n> 10-Minute Daily Posture Routine\n\n> 1. Neck / Head (2 minutes)\n\n> Chin Tucks (Wall or Floor) - 2 sets of 10 reps\n• Why: Fixes forward head posture (\"tech neck\"). Strengthens deep neck flexors.\n• How:\n1. Stand with your back and head against a wall.\n2. Without tilting your head up or down, pull your chin straight back (like making a double chin).\n3. Hold for 3 seconds, then relax.\n• Cues: Imagine sliding your head back, not nodding.\n• Common mistake: Don't tilt your head up; your nose shouldn't point to the ceiling.\n\n> ⸻\n\n> 2. Shoulders / Upper Back (4 minutes)\n\n> Wall Angels - 2 sets of 8 reps\n• Why: Opens your chest, strengthens upper back, reinforces scapula control.\n• How:\n1. Stand with back, head, and butt against a wall.\n2. Start with elbows at 90°, arms pressed against the wall.\n3. Slowly raise arms overhead like making a snow angel, keeping arms as close to the wall as possible.\n4. Lower back down.\n• Cues: Think \"ribs down, lower back flat.\"\n• Common mistake: Don't flare your ribs or arch your back - this cheats the movement.\n\n> Band Pull-Aparts (or Towel Pull-Aparts) - 2 sets of 15 reps\n• Why: Strengthens rhomboids and rear delts, counteracts slouch.\n• How:\n1. Hold a resistance band (or towel if no band) at chest level with straight arms.\n2. Pull arms apart until band touches your chest.\n3. Slowly return.\n• Cues: Squeeze shoulder blades together at the end.\n• Common mistake: Don't shrug your shoulders - keep them down.\n\n> ⸻\n\n> 3. Hips / Core (4 minutes)\n\n> Couch Stretch - 1 min per side\n• Why: Opens up tight hip flexors that cause anterior pelvic tilt.\n• How:\n1. Kneel with one knee on the ground, shin vertical against a couch or wall, other foot forward like a lunge.\n2. Push hips forward gently, keeping chest tall.\n3. Hold 1 min each side.\n• Cues: Squeeze your glute on the back leg to deepen the stretch.\n• Common mistake: Don't arch your lower back - keep ribs down.\n\n> Dead Bugs - 2 sets of 10 reps per side\n• Why: Trains abs to stabilize pelvis, fixes lower back arch.\n• How:\n1. Lie on your back, arms straight up, knees bent at 90°.\n2. Slowly extend your right leg and left arm while keeping your lower back pressed into the floor.\n3. Return, then switch sides.\n• Cues: Back stays glued to the floor the entire time.\n• Common mistake: Don't rush - slow and controlled.\n\n> ⸻\n\n> Summary\n• 2 min: Chin tucks\n• 4 min: Wall angels + band pull-aparts\n• 4 min: Couch stretch + dead bugs\n\n> Do this daily. After 3 weeks, you'll look taller in the mirror and your shoulders won't cave forward. After 3–6 months, this becomes your natural stance.\n\n> ⸻\n\n> Direct final answer:\nHere's a 10-minute daily posture routine:\n1. Chin tucks (2x10) - fix forward head.\n2. Wall angels (2x8) - open chest, strengthen upper back.\n3. Band pull-aparts (2x15) - fight rounded shoulders.\n4. Couch stretch (1 min per side) - loosen hip flexors.\n5. Dead bugs (2x10/side) - build core stability.\n\n> Stick to this daily and you'll reprogram your posture in months.\n\n![Bitcoin Building](https://miro.medium.com/0*5DoKQuN56fDXmhqr.png)\n\nBullish on the future.\n\n9/26/25\n\nConor Jay Chepenik",
  "wordCount": 661,
  "readingTime": 2.6943396226415097,
  "claps": 0,
  "voters": 0
}