{
  "id": "e59b0884a0fc",
  "title": "Day 1223",
  "createdAt": "2025-07-28 03:59:25",
  "tags": [
    "golf",
    "children"
  ],
  "url": "https://chepenikconor.medium.com/day-1223-e59b0884a0fc",
  "content": "# Day 1223\n\nMan, I really enjoy golf. Had the privilege of playing 18 today in the scorching heat, and even with sweat pouring and shots flying sideways, it's such a fun sport. The crazy thing is, all it takes is one pure shot and you're hooked. You want that feeling again. Add in good company, a bit of nature, and maybe a beer or a cigar (neither of which improve your game, but still), and it's hard not to enjoy your time on the links.\n\nAlso went to church this morning and breakfast after with the family. The lesson from church today was pray and be persistent in your prayers. Sometimes God will answer them, but he won't necessarily do so on your own timeline or in the way you expected him to answer your prayers. Naturally, at breakfast I prayed I break 100. I did not break 100 today, but I did have a good bit of pars and bogies on the 18 holes which felt good. I am far from a scratch golfer, but it feels fantastic to make progress at the sport which can be unforgiving at times.\n\nAfter golf I got home from the links, I spent some quality time with my family. Spoke to my unborn son and told him we would do cool stuff like learn about Bitcoin, AI, and sports. I'm so excited to play some rounds of golf with him one day. It will be great as well to see Sloan have a sibling. It's funny because I could feel Ryder kicking in his Mom's belly when I talked to him. It's so special to experience that. Children are such a blessing, especially when you experience your own child kicking at the sound of your voice.\n\nAnyways, I finally finished an interview article I needed to do for [Bitcoinnews](http://bitcoinnews.com) today which felt good because I've been procrastinating, but forced a deadline on myself to finish it before the weekend. I don't know why I procrastinate sometimes, but shoutout to myself for forcing a random deadline on myself by telling me editor I would have it over by X time. It worked.\n\n7/27/25\n\nConor Jay Chepenik",
  "wordCount": 363,
  "readingTime": 1.369811320754717,
  "claps": 0,
  "voters": 0
}