{
  "id": "e5d98cdf4018",
  "title": "Day 1299",
  "createdAt": "2025-10-12 03:59:24",
  "tags": [
    "im",
    "bullish",
    "on",
    "the",
    "future"
  ],
  "url": "https://chepenikconor.medium.com/day-1299-e5d98cdf4018",
  "content": "Day 1299\n\n![Something I came across today](https://miro.medium.com/1*mlGL77VJJ3avD52GrO4Plw@2x.jpeg)\n\nI would immediately smash buy about 10 million dollars of Bitcoin and then I'd smash buy another 20 million of STRC (or another one of Saylor's new securities) and enjoy the ~10% it kicks off every year. I'd pay off all my debts and purchase two sweet new cars.\n\nI'd travel to El Salvador and then probably purchase a large van I could drive across the country and hit all 48 states by driving. Might buy a plane ticket to visit Alaska and Hawaii.\n\nI'd then look to start a movie theater in Jacksonville and also rent a dope office and turn it in my dream podcast lounge studio and hire a bunch of my friends to work with me. That might be a large warehouse I renovate exactly to my needs or a dope office. Heck, maybe both hahahah.\n\nMy passion would be talking with as many cool people as I possibly could. My hobbies would include golf, taking my sweet new cars to the track, podcasting, and watching movies. Also, spending large amounts of time with my family and homeschooling them. I would definitely put an incredible movie theater in my warehouse and show my kids the classics (Pacific Rim). I'd also look more into 3D printing and hire the best and brightest people I could to help me learn the latest AI and software tools out there.\n\nI already have an amazing family but I'd make it bigger and I'd get Paige everything she needs to feel better about birth. I'm talking multiple prenatal massages, the best doula money could buy and literally anything else she'd ask for. Might even hire a world class chef to cook us our meals and make a nice home gym and hire the best instructors for what we are learning that day. Also a red light studio and an amazing sauna.\n\nClothes wise, well I like my clothes. I guess I'd probably buy more cotton, silk, and other fine materials. Less plastic although I do like Nike dri-fit clothes even though I recognize polyester is far inferior to natural linens. Maybe get a dope apple watch and an all gold Casio watch custom made.\n\nDoing this exercise I've realized I already have the most important thing: my family. Man how blessed am I. Yes I mean the one I've chosen and created, but also the one God gifted me which I didn't choose.\n\nThis was a cool exercise. It's such an amazing time to be alive I need to be operating from an abundance mindset more often. The world is only getting better, and boomer slop propaganda wants you to think otherwise but think about. Do you have food, hot water, air conditioning, a car? Then you are better off than 99.9% of people throughout history. Stop complaining. Start creating!\n\nBANG BANG\n\n10/11/25\n\nConor Jay Chepenik",
  "wordCount": 478,
  "readingTime": 2.0037735849056606,
  "claps": 0,
  "voters": 0
}