{
  "id": "e7992fd96b6a",
  "title": "Day 1375",
  "createdAt": "2025-12-26 18:43:50",
  "tags": [
    "absolute",
    "power",
    "corrupts",
    "absolutely",
    "everytime"
  ],
  "url": "https://chepenikconor.medium.com/day-1375-e7992fd96b6a",
  "content": "# Day 1375\n\n**Reflections on Power, Hypocrisy, and True Governance**\n\nLast night, as I lay in bed struggling to sleep, a persistent thought kept resurfacing. Now of course I'd be remiss if I didn't note that thinking deeply is a double-edged sword. It can lead to profound insights and also incredible trouble when one over thinks. But without thought, one does not spark great ideas. Plus I couldn't sleep and I'm not one to just cease thinking completely so my mind fixated on a timeless paradox: the people best suited to lead are often those who desire power the least. True leaders are reluctant, focused on service rather than self-aggrandizement. Yet those who crave authority, willing to do whatever it takes to seize and hold it, frequently end up in charge.\n\nThis is the annoying reality of power dynamics. I see this firsthand in my own life as the head of my household. Leading a family isn't easy because it demands consistency, patience, and self-awareness. It's tempting to fall into hypocrisy: telling my kids to limit screen time while I scroll endlessly or claim to be \"working.\" Hypocrisy erodes trust faster than anything else. So I write this as a personal reminder: lead by example. Actions speak louder than decrees. I must model the behavior I expect, rather than rely on authority alone, if I want my kids to follow my lead when I'm not there to enforce it.\n\nOn a national level, this paradox intensifies. In a democracy, elections reward ambition and short-term \"band-aid\" fixes rather than 1st principle solutions that would be painful, but would actually fix the issue. This is because those politicians often prioritize the next election cycle over long-term stewardship. A monarchy, by contrast, incentivizes rulers to think generationally: their legacy is tied to their children's future and the stability of their realm. I'm not advocating a return to kingship, but the argument holds merit. Kings do seem to have a massive incentive to avoid alienating the people they rule because doing so would make it much harder for their Prince to assume their role of King one day.\n\nThus, I can't help but wonder what if government returned to its core purpose? As the Declaration of Independence states, its role is to secure life, liberty, and the pursuit of happiness (which I like to interpret as simply protecting private property). Everything else from education, healthcare, infrastructure, etc should default to voluntary, market-driven solutions. Roads? Communities can fund them collectively or through private enterprise, as they did historically before modern bureaucracies. Pollution? If a company harms life, liberty, or property (including public spaces owned by \"We the People\"), government must prosecute aggressively under the law.\n\nI believe what caused these thoughts to fill my mind where a direct result of what I've seen happening on X(Twitter) with Vivek Ramaswamy. His posts around Christmas time, this year and last, have been a huge failure from the perspective of most Americans. Especially the ones who feel a deep sense of loyalty and respect for this blessed Nation our ancestors helped build.\n\nI heard Vivek speak in New Hampshire in fall 2023, and his message resonated because he was championing classical liberal ideals that built America's success: limited government, free markets, individual liberty. Yet later scrutiny of his business history, particularly his role in Roivant Sciences and the failed Alzheimer's drug trials, raised doubts. Some critics allege hype created by his Mom, who is a Doctor from my understanding, around a repurposed drug led to an inflated IPO, with Ramaswamy cashing out before failure, leaving investors short. While he expressed regret over the outcome, the episode highlights how power and wealth can attract opportunists who will gladly screw over others to make a buck for themselves. It is important to note these are public allegations; Ramaswamy has defended his actions as legitimate biotech risk-taking. However, from an outsider looking in it does leave a bad taste in my mouth and I must admit I looked much more fondly on the man 2 years ago, than I do currently. Now he wants to be Governor of Ohio, and while I don't live there and won't be voting in their election, I hope that Casey Putsch wins the republican nominee:\n\n![[https://x.com/White_Amercan/status/2002387992510439577?s=20](https://x.com/White_Amercan/status/2002387992510439577?s=20)](https://miro.medium.com/1*9kQTyf_3ko-qT4faFILMZg.png)\n\nUltimately, partisan bickering feels futile. Like choosing which fist punches you. I do not care if it's the right or left hand, I simply do not wish to be punched. Both major parties often expand government beyond its legitimate bounds. I want a system where leaders protect life, liberty, & property: nothing more. Transparency must be the rule: government operates in the open, with minimal secrecy (tightly controlled for national security).\n\nNow of course I am watching to see what happens in Florida's upcoming gubernatorial race, candidates like Byron Donalds (Trump-endorsed) and James Fishback (a newer contender emphasizing affordability and anti-corporate influence) are emerging. Fishback has shifted his positions publicly which I can respect, but only time will reveal authenticity. At the moment I resonate more with Fishback but know that politicians aren't saviors.\n\nSo I will focus on what I control: my family, my values, my vote. I'll support those who shrink government and safeguard private property. A shout-out to Governor [DeSantis for pushing hard](https://x.com/profstonge/status/1962478042971844879?s=20) on the proposal to eliminate property taxes on homesteaded primary residences, while continuing to tax investment properties or corporations like Blackstone that are buying up Florida homes to rent them out to families. No one should pay perpetual \"rent\" to the state on the home they actually live in. While I dislike any taxes, if someone treats a home more as an investment than a place to live, the case for taxing it makes more sense to me.\n\nTo conclude: true leadership is reluctant, principled, and exemplary. Power should be wielded by the capable, not the ambitious. Until that actually happens, We The People must remain vigilant, for those who actively seek power are often the very opposite of these qualities.\n\nAnd again, who cares if it is the right hand or the left hand of the same body that delivers the blow? Either way, the citizen suffers. When the state oversteps, it falls to We the People to rise, to assert our sovereignty, and to push back. If we do not, the erosion of liberty will only accelerate, and the future will be darker still.\n\n12/26/25\n\nConor Jay Chepenik",
  "wordCount": 1076,
  "readingTime": 4.260377358490566,
  "claps": 0,
  "voters": 0
}