{
  "id": "e8ed9182efbb",
  "title": "Day 1032",
  "createdAt": "2025-01-18 04:57:14",
  "tags": [
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-1032-e8ed9182efbb",
  "content": "# Day 1032\n\n![[https://x.com/ScottAdamsSays/status/1880241008409211259](https://x.com/ScottAdamsSays/status/1880241008409211259)](https://miro.medium.com/1*HG5dVfiVAHCBrWN1lKx5Jg.png)\n\nGood reminder to think twice about charts that give you sticker shock. Sure, it makes sense that in an online world, alcohol isn't as necessary as a social lubricant. But there are plenty of variables at play.\n\nFor one, inflation has squeezed Gen Z harder than past generations. The internet also changed things. Between memes, cat videos, and endless scrolling, it gave us both distraction and information. A lot of noise, but enough signal if you know where to listen. Health trends, wellness gurus, and that one friend who won't shut up about keto (_respect_) have all shaped how people think. The wise adapt. The stubborn double down.\n\nSo what is better competition or collaboration? 'Tis a good question. Most of the time, collaboration wins. But sometimes, competition is exactly what's needed. I wouldn't watch a football game if both teams were working together for a tie. That's not a game, that is a group project.\n\nBut when it comes to something like AI, I'd much rather see open-source innovation. Humanity building one of our most important technologies should be done together. Open. Transparent. Not controlled by a handful of big corporations. Not governed by politicians who barely understand it. And absolutely not in some unholy alliance between government and mega-corporations.\n\nNo...it should be driven forward by _**we the people**._ Built in the spirit of the MIT License. Free. Open. Unstoppable. Boom!\n\nI like open source software that helps humanity. It's why I like Bitcoin and Nostr so much. Protocols for people instead of decrees disguised as laws (_aka_ protocols) imposed by people.\n\n![Truth For The World](https://miro.medium.com/1*bGswPZQ_ixayebBCULN92Q.png)\n\nSee some signal below.\n\n![Not bad](https://miro.medium.com/1*THRF4PUox9Y0SIIvlap1wA.png)\n\n1/17/25\n\nConor Jay Chepenik",
  "wordCount": 275,
  "readingTime": 1.5877358490566038,
  "claps": 0,
  "voters": 0
}