{
  "id": "ebebe0179cca",
  "title": "Day 1089",
  "createdAt": "2025-03-15 19:42:57",
  "tags": [
    "bitcoin-jungle",
    "costa-rica",
    "circular-econonomy",
    "peer-to-peer",
    "electronic-cash-system"
  ],
  "url": "https://chepenikconor.medium.com/day-1089-ebebe0179cca",
  "content": "# Day 1089\n\n**Bitcoin Jungle: Turning Costa Rica Into A Bitcoin Haven**\n\nWhen Richard Scotford moved to Costa Rica in 2018, he had no idea he would become a key figure in a thriving Bitcoin economy. A longtime Bitcoin holder who initially saw it through the lens of speculation, Scotford's journey led him to embrace Bitcoin's deeper purpose and spearhead Bitcoin Jungle - a grassroots movement bringing real-world Bitcoin adoption to Costa Rica.\n\n![Bitcoin Circular Economies Creates Holistic Value for Bitcoiners](https://miro.medium.com/1*Y0otViCbvbVgCG-oZPyG1g.png)\n\nBitcoin Jungle is inspired by Bitcoin Beach in El Salvador but uniquely adapted to Costa Rica's economic landscape. Unlike El Salvador, where Bitcoin was positioned as a tool for financial inclusion, Costa Rica already has a fairly stable banking system. The real issue? The friction of moving money. Expats, business owners, and tourists struggle with high fees, banking red tape, and slow transactions. Bitcoin helped solve a lot of these problems.\n\n**The Birth of Bitcoin Jungle**\n\nScotford and his team launched Bitcoin Jungle in late 2021 with a simple goal: get Bitcoin into people's hands and make it usable. However, there was one challenge - he had no technical background. Determined to create a circular Bitcoin economy, Scotford networked aggressively. He attended the first Adopting Bitcoin conference in El Salvador, approaching strangers with his vision:\n\n\"I was just walking around trying to find people who could help me make this economy, going up to random people saying 'Hey, what can you do? We're trying to make a circular economy in Costa Rica, can you help us?' They all thought I was crazy.\"\n\nThe breakthrough came when he turned to Bitcoin Twitter. [Nicolas Burtey](https://x.com/nicolasburtey) from Galoy encouraged him to create a wallet, and developer [Lee Salminen](https://x.com/leesalminen) forked the Bitcoin Beach wallet for their project.\n\n\"Within two weeks of Adopting Bitcoin, Lee forked the Galoy Bitcoin Beach wallet, which took Galoy by surprise. Even though they made their wallet to be forked if necessary, I don't think they were expecting people to do it so fast and, I'd like to say, so well. They were like, 'Okay, cool, who are these guys doing this?'\"\n\nFinally Bitcoin Jungle had its own working wallet, surprising even the Galoy team with the speed of execution.\n\n**Grassroots Adoption: One Vendor at a Time**\n\nHow do you build a Bitcoin economy from scratch? Scotford's answer was simple: start at the farmers' markets.\n\n\"We were like, okay, we're going to get all the bespoke niche market sellers who are in this area. We have all these beautiful farmers markets, and we decided to approach these people first,\" Scotford explained.\n\nHis team took a strategic approach, targeting market gatekeepers first.\n\n\"If you want to talk to every individual person, it's really difficult. But if you can talk to the person who is the owner of the market, and then they can introduce you to their market stores, you're already halfway there.\"\n\nGoing stall by stall, they pitched Bitcoin's advantages - no bank fees and better payment options. But adoption didn't happen overnight, so Bitcoin Jungle initially offered a safety net - vendors could cash out at the end of the day.\n\n\"We would say to the vendors, 'Look, accept Bitcoin, and at the end of the day, if you don't want to keep the Bitcoin, we'll buy it off you,'\" Scotford recalled. \"When we first started, maybe 30–40% of the vendors were cashing up every day or at the weekends. Lee would be walking around with big fistfuls of money, cashing out vendors.\"\n\nBut over time, something shifted - they started keeping their Bitcoin.\n\n\"Eventually, the vendors started to learn themselves that, 'Oh, actually it's better to keep it.' They would then pay for their tables in the markets using Bitcoin. They thought, 'Well, I don't want to keep this Bitcoin, I don't really know what to do with it, but I can pay for my table.' So there, the circular economy starts to happen.\"\n\nToday, Bitcoin Jungle runs with minimal intervention, and Scotford takes pride in their reliability.\n\n\"When you come here to Costa Rica, what we really pride ourselves on is that if someone says they accept Bitcoin, 99% of the time, if they're part of Bitcoin Jungle, they will 100% accept Bitcoin and you will have a fluid experience with it.\"\n\n![[https://x.com/BitcoinJungleCR/status/1807836398692553093](https://x.com/BitcoinJungleCR/status/1807836398692553093) By Mid-summer 2024 over 380 locations in Costa Rica accepted Bitcoin](https://miro.medium.com/1*H71pVtoqdFk4NWuDeMpSlg.png)\n\n**The Bitcoin Jungle Wallet and Real Usage**\n\n[Bitcoin Jungle](https://www.bitcoinjungle.app/) is an open source community project built on the Bitcoin Lightning Network. Acting as a community bank, the project processes a large number of transactions daily. To encourage proper security practices, Scotford's team alerts their peers, reminding users to move their Bitcoin to cold storage.\n\n\"If you've got too much Bitcoin on your wallet, we send you a message telling you to move it to cold storage,\" he explained. For larger businesses, they even offer hands-on assistance to secure funds properly.\n\nUnlike the HODL-only philosophy that many Bitcoiners advocate, Bitcoin Jungle encourages spending.\n\n\"Michael Saylor says don't spend your Bitcoin. We say the opposite,\" Scotford laughed. \"We're the antithesis of that. You need to spend it.\"\n\n**Bitcoin Jungle's Unique Approach to Costa Rica**\n\nBitcoin Jungle isn't just another Bitcoin adoption effort; it's tailored to Costa Rica's economy. The wallet operates in Costa Rican colónes, making transactions feel familiar to residents while ensuring tourists and expats can still interact easily. The team has also introduced low-fee Bitcoin ATMs, point-of-sale integrations, and partnerships that allow users to pay in Bitcoin while the recipient receives local currency.\n\nA major breakthrough came when Francis Pouliot from Bull Bitcoin joined forces with Bitcoin Jungle, bringing his expertise in banking infrastructure to the project. This collaboration enabled seamless Bitcoin payments that integrate directly with Costa Rica's financial system, allowing users to pay anyone, even businesses that don't directly accept Bitcoin, while the recipient receives funds in colónes or dollars.\n\n\"I can go to a hardware store, order steel for my new basketball court, pay in Bitcoin, and the store gets dollars,\" Scotford said. \"For a non-tech guy like me, it's magical.\"\n\n**Why Aren't There More Bitcoin Jungles?**\n\nScotford sees an opportunity for more localized Bitcoin economies.\n\n\"There should be a Bitcoin Harbor, a Bitcoin Mountain, a Bitcoin Driveway,\" he joked. \"But instead of waiting for permission or corporate funding, people need to take action themselves.\"\n\nHe emphasizes that building a circular Bitcoin economy doesn't require deep pockets.\n\n\"I probably gave away $600 worth of Bitcoin when we started - just $3 here, $4 there - to get people using it.\"\n\n**The Future of Bitcoin Jungle**\n\nBitcoin Jungle continues to grow, recently hosting events like the [Bitcoin Freedom Festival](https://www.bitcoinfreedomfestival.com/about) and integrating Bitcoin into community projects, including a school where tuition can be paid in Bitcoin.\n\n\"The institutions have come in, but the grassroots projects haven't caught up,\" Scotford observed. \"It's time for people to stop sitting on their hands and start building.\"\n\nBitcoin is permissionless, no one has to wait for approval to start using it. Bitcoin Jungle proves that with vision and persistence, anyone can build a thriving Bitcoin economy, one market stall at a time.\n\n![Get the latest from Bitcoin Jungle: follow them on X (Twitter): [https://x.com/BitcoinJungleCR](https://x.com/BitcoinJungleCR)](https://miro.medium.com/1*QMB7Z3JS5a18mhr3D0LoHQ.png)\n\n3/15/25\n\nConor Jay Chepenik",
  "wordCount": 1177,
  "readingTime": 4.991509433962264,
  "claps": 0,
  "voters": 0
}