{
  "id": "eefbba8fc9ef",
  "title": "Day 1337",
  "createdAt": "2025-11-19 04:25:13",
  "tags": [
    "my",
    "two",
    "sats"
  ],
  "url": "https://chepenikconor.medium.com/day-1337-eefbba8fc9ef",
  "content": "# Day 1337\n\n![The Sota Bio Tuner on Amazon [https://amzn.to/4po2F5P](https://amzn.to/4po2F5P)](https://miro.medium.com/1*idL1DIP9aFpJscRuwLDp0Q.png)\n\nI have been doing the CES for awhile and it feels great. This interaction on twitter did make me wonder how would I track this. So naturally I vibe coded an app:\n\n![The era of personal software is upon us](https://miro.medium.com/1*tvOrr3IMgcxuUd8aA4PL4w.png)\n\n![I even made a dashboard](https://miro.medium.com/1*JHkc_pUb2LKZbMbb5UVpmg.png)\n\n![Plus a little JSON and CSV export actionXD](https://miro.medium.com/1*knnBQxXLgAiw6A-RRglbhA.png)\n\nNow think about anything you can come up with you want to test? Is this perfect. Of course not. BUT THE POSSIBILITIES!!!! It has never been easier to build now that AI exists and I can't wait to see people, myself included, build software the brings value to others. Not through rage bait and tl slop. No: through making things people love including personal software for yourself. It has never been easier to test things out and try new ideas in the free marketplace of the internet.\n\nI used Cursor as my IDE to build this web app & Grok to help me brainstorm the prompt. I would also recommend checking out Google's new AI Studio. Very fun to play with!\n\n![[https://aistudio.google.com/apps/bundled/voxel_toy_box?showPreview=true&showAssistant=true](https://aistudio.google.com/apps/bundled/voxel_toy_box?showPreview=true&showAssistant=true)](https://miro.medium.com/1*Jr861IQ2XUva9nj8zHf04Q.png)\n\n![Two Eagles](https://miro.medium.com/1*l29oj72vYjqxHHRBBIzhNw.png)\n\nGoogle cooked with their new AI Studio. What a lucky time to be alive! Bullish on bitcoin and AI (NFA, my actual advice is please study Bitcoin and enjoy messing around with AI tools). Build personal software for yourself that brings a smile to your face. Play win-win games instead of zero sum ones. You will be happier.\n\n11/18/25\n\nConor Jay Chepenik",
  "wordCount": 218,
  "readingTime": 1.7726415094339623,
  "claps": 0,
  "voters": 0
}