{
  "id": "efff22b995b9",
  "title": "Day 1377",
  "createdAt": "2025-12-29 01:08:27",
  "tags": [
    "fraud",
    "is",
    "bad"
  ],
  "url": "https://chepenikconor.medium.com/day-1377-efff22b995b9",
  "content": "# Day 1377\n\n![[https://x.com/i/trending/2005425975606006092](https://x.com/i/trending/2005425975606006092)](https://miro.medium.com/1*c4dkhhXiu9OaAXeTaJlNhQ.png)\n\nTwitter's been absolutely blowing up over this massive daycare fraud scandal getting exposed in Minnesota. It's insane that a random 23-year-old independent journalist, Nick Shirley, is the one who uncovered it by going out and filming these empty \"daycare\" buildings raking in millions of taxpayer dollars, while Fox, CNN, ABC, and the rest of the legacy media outlets completely missed it or ignored it.\n\nOn one hand, I'm not even surprised anymore. But on the other, what the actual f*** are we doing man? Seriously, why are we paying any taxes at all? People need to be rotting in jail over this. Politicians who enabled this fraud should be shaking in their boots that their doors are going to get kicked down in the middle of the night to face charges. If convicted in court they should serve their time. Instead, the current administration is just slow-rolling investigations. And there is no way that this is a contained things which stops in Minnesota. This kind of fraud is happening all over the country without a doubt. I'm sure some states are better than others, but still... Makes a lot of sense why Elon was not succesful with DOGE. A complete waste of his time honestly.\n\nIt is absolutely embarrassing that our tax dollars are going into enabling war, fraud, and corrupt kickbacks. \"bUt MuH rOaDs\".... If a law abiding citizen is late on their taxes the IRS is breathing down your neck. But commit daycare fraud in Minnesota and the Feds just look the other way? This is exactly what I was talking about the other day in my Medium piece: I don't care if it's the right hand or the left hand of the same damn body punching me in the face, I don't want to get punched at all. Breath...\n\nI know that at the end of the day, there will be divine judgment. No reason to spike my cortisol over things I can't control. Good on this kid for exposing the truth. It will all come to light eventually, and people will face the consequences for their actions.\n\nIf not in this life, they will in the next. Of course it is easy to type out don't spike my cortisol over this, but man practicing that is a lot harder lol. Sad to see. I'm not going to write more paragraphs about how fiat money enables this, and Bitcoin fixes this, but yes both those statements are true.\n\n12/28/25\n\nConor Jay Chepenik",
  "wordCount": 420,
  "readingTime": 1.7849056603773585,
  "claps": 0,
  "voters": 0
}