{
  "id": "f01a4a7b17b2",
  "title": "Day 1268",
  "createdAt": "2025-09-11 02:20:28",
  "tags": [
    "only",
    "jesus",
    "can",
    "save",
    "your-soul"
  ],
  "url": "https://chepenikconor.medium.com/day-1268-f01a4a7b17b2",
  "content": "# Day 1268\n\nWhat a sad day for the world. So much needless violence in 2025. It feels as if humanity is growing numb to it. May Charlie Kirk and the others who have been recently murdered rest in peace. What pains me the most is that Charlie had young children. The thought of his kids growing up without a Dad breaks my heart. And to think that one day those kids will likely watch a video of their Dad being murdered is so sickening. I pray, My Dear Lord Jesus Christ, for Charlie's safe passage to heaven and for his family to remain strong and make it through these trying times. I really can't even begin to fathom what they must be feeling right now. The thought of my own 2 year old having to cope with her Dad getting murdered just doesn't compute. No child should have to go through that and I pray, Dear Lord, that you watch over those kids.\n\nViolence begets violence. I don't want to see blood on the streets. I'd like to live peacefully and harmounisly with the people of this world, but I fear many will lose sight of Jesus Christ's teaching. It's easy to tell others to turn the other cheek. To pray for your enemies. I know that if someone ever hurt my family I don't think I'd be able to contain my rage, my bloodlust for revenge. I pray it never comes to that. I pray Jesus that there is peace, I pray my enemies look within their soul and realize violence is not the answer, but I also pray you give me the strength to protect my own family and the ones I love from the evil present in this world.\n\n![[https://x.com/DonnieDarkened/status/1965892014630993952](https://x.com/DonnieDarkened/status/1965892014630993952)](https://miro.medium.com/1*8A8XZcdMDf3rSPyfdF4rjA.png)\n\n![[https://x.com/charliekirk11/status/802991026822676480](https://x.com/charliekirk11/status/802991026822676480)](https://miro.medium.com/1*5Lhd6fcrKC8sguMlmCsqYQ.png)\n\nLord I don't know what comes next. You gave us free will and humanity has done some dark things with it. Yet, we've also done some beautiful things. I pray that you don't let this tragedy fill our hearts with anger and sorrow. Rather that we may use it to left up others. To learn and grow from this tragic day.\n\n9/10/25\n\nConor Jay Chepenik",
  "wordCount": 357,
  "readingTime": 1.730503144654088,
  "claps": 0,
  "voters": 0
}