{
  "id": "f6354aa9f4c0",
  "title": "Day 1039",
  "createdAt": "2025-01-25 04:46:55",
  "tags": [
    "bitcoin",
    "only",
    "homie",
    "verify",
    "yourself"
  ],
  "url": "https://chepenikconor.medium.com/day-1039-f6354aa9f4c0",
  "content": "# Day 1039\n\n![[https://x.com/scottmelker/status/1882832347776823569](https://x.com/scottmelker/status/1882832347776823569)](https://miro.medium.com/1*y9UbHU-A0PWPeTDkfkBnNg.png)\n\n![[https://x.com/dotkrueger/status/1882962293312422030](https://x.com/dotkrueger/status/1882962293312422030)](https://miro.medium.com/1*VwBhI-P-1pfMNIDLQcqnRA.png)\n\nI saw this situation unfold on Xitter and it left me with mixed feelings. On one hand, I can understand the temptation. It's not right to rug people, but also when you buy a literal meme coin what did you expect? LoL.\n\nI'm not certain if Fred actually made the millions that some claim. It's clear he did launch a shitcoin, and he subsequently deleted the tweets promoting his token on pump.fun. The whole scenario is quite messy and serves as a stark reminder of why sticking with Bitcoin might be the wiser choice. Unless you want to gamble. In which case knock yourself out; just understand gambling always comes with the possibility of losing everything you bet.\n\nIt's easy to criticize from the sidelines, but the lure of easy money is powerful. If you build a large following I can understand why someone would \"rug pull\" them on a memecoin, but it's wrong, especially when you know better. I like to think I would never betray my followers in this way, but I'm reminded of a well-known biblical sentiment: let the one without sin be the first to cast a stone.\n\nBitcoin only. Life is better that way. It was great hearing [this podcast](https://youtu.be/nIYWq2mS9Tk) today on the same day as seeing this sab 121 rip memecoin rug pull. Erik shared his experience of leaving Coinbase early on when he realized that most people were in it to make money, not to change money for the better. It's a story worth hearing, I certainly enjoyed it anyways.\n\nBitcoin is money. Everything else in the cryptocurrency space is cap.\n\n1/24/25\n\nConor Jay Chepenik",
  "wordCount": 275,
  "readingTime": 1.421069182389937,
  "claps": 0,
  "voters": 0
}