{
  "id": "fedb0a8a4a37",
  "title": "Day 1227",
  "createdAt": "2025-08-01 02:57:03",
  "tags": [
    "bitcoinnews",
    "crowdhealth"
  ],
  "url": "https://chepenikconor.medium.com/day-1227-fedb0a8a4a37",
  "content": "# Day 1227\n\n**How CrowdHealth Is Dismantling Medical Fiat**\n\nMost Americans don't realize their health insurance is broken...until they need to use it.\n\nAndy Schoonover, CEO of [Crowdhealth](https://www.joincrowdhealth.com/?referral_code=GQRENX), found this out the hard way when his one-year-old daughter needed a routine 15-minute procedure to repair a hole in her eardrum. The hospital billed $8,000. His Affordable Care Act insurance, costing $1,200/month, refused to pay, calling it \"medically unnecessary.\"\n\n\"I went through two rounds of appeals,\" Schoonover said. \"And they were still like, 'Nope, we're not paying for it.' That's when I just said, 'Screw this. I'm not doing health insurance. This is such a scam.'\"\n\n\"I went back to my wife and was like, 'So we don't have health insurance anymore,'\" he said. \"And she's like, 'Say what? Excuse me?'\" This would lead to the beginning of something entirely new.\n\n**The Cash Price Epiphany**\n\nSchoonover discovered what many only learn after getting burned: paying cash gets you better healthcare at a fraction of the cost. The same procedure that was billed at $8,000? \"If I would've paid cash,\" he said, \"it probably would've been like $2,000, maybe less.\"\n\nThat moment was, as he calls it, the \"genesis block\" of CrowdHealth: a decentralized, community-driven alternative to health insurance where members fund one another's medical expenses directly.\n\nThe mission? Cut out bloated insurance bureaucracies and bring back price transparency and personal responsibility.\n\n**Orange-Pilling Healthcare**\n\nAs a Bitcoiner since 2021 with 80% of his liquid assets in Bitcoin, Schoonover saw an opportunity to align CrowdHealth with the ethos of sound money.\n\n\"Jimmy Song is a buddy of mine,\" he said. \"He was like, 'Instead of a big fiat pool on the backend, why not a Bitcoin pool?'\"\n\nRegulatory constraints ruled out pooled Bitcoin funds, for now, but CrowdHealth found a clever workaround. Bitcoin members contribute the full $140 monthly, even if only $75 is needed. The difference is automatically deposited into their Fold account.\n\n![[https://www.joincrowdhealth.com/fold](https://www.joincrowdhealth.com/fold)](https://miro.medium.com/1*rlEHjxfz_zXQHfnc1LTL8Q.png)\n\n\"It's a great way to stack,\" Schoonover said. \"Ultimately, we're trying to create enough scale within our Bitcoin community so that all the transactions can be done over Lightning.\"\n\nHis vision? Replace the dollar as the medium of exchange in the largest industry on the planet: healthcare.\n\n\"If we can do that,\" he said, \"that goes a long way toward displacing the dollar.\"\n\n**A Bitcoin Healthcare Circle**\n\nWith 12,000 members (and over 15,000 helped), CrowdHealth is quickly gaining traction. A quarter of its user base are Bitcoiners. The backend Lightning infrastructure is already built. Bitcoin-friendly doctors are reaching out to get paid in sats. Even one of the ten largest hospital systems in the U.S. has shown interest in accepting Bitcoin.\n\n\"If I can get patients who want to pay in Bitcoin, doctors who want to receive in Bitcoin, and the infrastructure in place, then I think we've got something really special,\" Schoonover said.\n\n**Better Prices. Better Behavior. Better Outcomes.**\n\nThe platform's numbers are hard to ignore. For medical bills over $2,500, members pay about 50% less than they would through traditional insurance.\n\n\"Imagine our healthcare system if all the prices were slashed by 50%,\" Schoonover said. \"That's a $2.5 trillion impact. That's $2.5 trillion going back into people's pockets, people who could be buying Bitcoin.\"\n\nAnd it's not just about saving money. Like Bitcoin, CrowdHealth incentivizes sovereignty, not just financially, but physically.\n\n\"When you're personally responsible for your own stuff, your behavior starts changing,\" he said. \"I see this with Bitcoiners. They take better care of themselves.\"\n\nCrowdHealth even rewards members who stay metabolically healthy. Members with fasting insulin under 5 or low visceral fat receive a 10% discount, with plans for that to rise to 20% next year.\n\nThey also don't accept smokers or those over 260 pounds. \"We want people who are opting out of the system and taking responsibility,\" Schoonover notes. \"50% of our babies in April were born at home. The national average is 1.8%. That tells you the type of people we serve.\"\n\n**Brian's Story: A Million-Dollar Test**\n\nTo skeptics, Schoonover offers real-world results, like Brian, a CrowdHealth member who accidentally shot himself with a .44 Magnum while fishing in bear country (Montana). The bullet traveled through his calf, thigh, and chest.\n\nHe was airlifted to a hospital two hours away, placed in a coma, and hit with a million-dollar bill. CrowdHealth negotiated it down to somewhere between $200,000–$250,000 and the community funded it.\n\n\"I get to tell that story now,\" Schoonover said. \"I'm not excited Brian went through that. I'm excited that CrowdHealth was his ally, not his enemy.\"\n\n**Why Bitcoiners Should Care**\n\nDespite the philosophical overlap, many Bitcoiners still cling to traditional insurance. Schoonover doesn't get it.\n\n\"If you're okay with leaving fiat,\" he asks, \"why are you still afraid to leave fiat healthcare?\"\n\nTo him, the parallels are clear. Both systems are opaque, centralized, and built to extract. Both can deny access, dictate choices, and delay help when it matters most.\n\n\"They can say, 'We're not paying for that.' And that means you don't get it,\" Schoonover explains. \"That's more control than the dollar ever had. At least with money, you can choose how to spend it. But when it comes to health insurance, they can block care entirely. That affects your body, your time, and your life.\"\n\nFor a community that prides itself on personal responsibility and opting out of broken systems, it's a contradiction worth examining.\n\n**Building Sovereignty in a Broken System**\n\nWith subsidies and Medicaid support expected to tighten, millions will be searching for alternatives. CrowdHealth is ready.\n\nThe platform is expanding community groups. From Bitcoiners to carnivores, faith-based families, and more. The idea is simple: shared values increase generosity and accountability.\n\n\"We want people who are metabolically healthy, who are raising babies, who are living active lives,\" Schoonover said. \"Not people whose chronic conditions cost 5x more because of bad lifestyle choices.\"\n\nThe top CrowdHealth expenses aren't chronic illnesses, they're sports injuries and pregnancies. That's a good sign.\n\n\"We want people to thrive. I want my customers at 80 years old out back playing whiffle ball with their grandkids,\" Schoonover said. \"I want them to live hard and die fast, not suffer a slow, expensive decline.\"\n\nThat's the vision: not just lower premiums or faster payments, but a healthcare system that actually makes you healthier.\n\n**A Decentralized Alternative Worth Stacking**\n\nCrowdHealth is not health insurance. It's a parallel system where members fund each other directly, based on shared values and mutual trust. That trust is the foundation, not bureaucracy, not claims departments, not fine print.\n\nBitcoin doesn't rely on trust. It relies on code and consensus. But what unites both systems is the desire to escape manipulation and reclaim control.\n\nThe dollar system is broken. So is healthcare. CrowdHealth offers a path out of both.\n\nAnd here's the question Schoonover wants every Bitcoiner to ask:\n\n**\"What keeps you from decentralizing your healthcare?\"**\n\nIf you've already orange-pilled your savings, maybe it's time to do the same with your care.\n\nStill unsure? Tweet your questions to [@JoinCrowdHealth](https://twitter.com/JoinCrowdHealth). The community is real. The results are real. And the future of healthcare just might be, too.\n\n_Disclaimer: The Author of this post is a happy Crowdhealth customer_\n\n—\n\nToday's Medium is an almost ready draft of a Bitcoinnews interview article I'm writing. Was a great end of July. Got dinner with my Grandpa to celebrate his birthday and enjoyed some PTO. Feels good to have a week to myself. Grateful!\n\n:)\n\n7/31/25\n\nConor Jay Chepenik",
  "wordCount": 1255,
  "readingTime": 4.935849056603773,
  "claps": 0,
  "voters": 0
}