{
  "id": "0149ac6bd240",
  "title": "Day 592",
  "createdAt": "2023-11-05 01:26:58",
  "tags": [
    "thriving",
    "excited",
    "humanity",
    "hope",
    "ai"
  ],
  "url": "https://chepenikconor.medium.com/day-592-0149ac6bd240",
  "content": "# Day 592\n\nToday I went on a 5 mile run around Downtown Jacksonville. I ran 2 miles, walked 1 mile, then finished with another 2 miles. I'm also doing a fast today and not eating anything until tomorrow. Fasting has so many health benefits. I'm grateful that Russel Okung introduced me to the importance of fasting with his [journey](https://www.okungfast.com/). Kudos to him for going 40 days without food. A truly remarkable feet.\n\nPeriodic fasting helps lower inflammation, improve insulin sensitivity, and promote autophagy, the process where cells recycle waste material. Fasting gives my digestive system a break and helps my body heal and rejuvenate on a cellular level. I always feel energized and clear-headed when I'm fasting.\n\nCombining fasting with exercise like my run today is a great way to maximize the benefits. I'm thankful I learned about the power of fasting and how it can transform your health. It also excites me when I get to break the fast.\n\nToday's experience ties into an important article I want to rework about progress in the world. Despite the prevalence of dystopian narratives, the world is improving by many measures. However, knowledge alone can breed arrogance if not tempered with humility. As pioneering statistician Hans Rosling revealed, our preconceived notions often eclipse reality. Embracing humility helps us challenge assumptions and accept new perspectives.\n\n![](https://miro.medium.com/0*-awv6YG4vXtV9kld.png)\n\nGreat to see poverty falling almost everywhere in the world. I'm not sure why Latin America and the Caribbean are rising, maybe exta broken money? (All fiat is broken but some more than others) Overall though the trend is down significantly which is amazing.\n\n![](https://miro.medium.com/0*9G7Gq6Y01kxqdRSA.jpg)\n\nThis chart is also incredible. Everyone who is a decent person can agree that less kids dying is a great thing! I believe this line will continue to trend down over the coming decades. If anyone is wondering where I found these charts from I do recommend reading the below article.\n\n> [**Evidence of Abundance: Debunking Dystopian Myths**](https://www.diamandis.com/blog/scaling-abundance-series-17)\n\nAll this data shows promising declines in extreme poverty and child mortality, buoyed by technological innovation. Yet while progress is real, challenges exist. Maintaining a nuanced outlook that acknowledges both progress and continued problems is crucial. We must look beyond pessimism and engage in continual learning and unlearning. Statistics alone don't tell the whole story; fostering dialogue and deeper understanding matters. As I continue writing, I want to highlight other evidence of progress while encouraging thoughtful discussion that transcends the numbers. My goal is to counter unbridled pessimism with cautious optimism and nuance.\n\nSpeaking of technology innovation:\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/rowancheung/status/1720821342600388798%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nTl;DR\n\nElon Musk and xAI have unveiled Grōk, a new chatbot that aims to rival ChatGPT. Key features of Grōk include real-time access to information on platform 𝕏, which is especially beneficial for obtaining breaking news. Unlike many chatbots, Grōk is engineered to exhibit humor in its responses, aligning with Musk's vision of combatting 'WokeGPT'. Once fully released post-beta, Grōk will be available to all X Premium+ subscribers. It boasts a 25,000 character context window, a quick screen refresh response speed, and a \"live\" search engine focusing on 𝕏 for context. Additional features such as API, image and audio recognition are in the pipeline, and a version of Grōk is planned to run natively in Tesla vehicles using local compute power. The chatbot will only be accessible through X's new Premium Plus plan, requiring even verified account holders to upgrade for access. The integration of real-time information and humor, along with other planned features, positions Grōk as a formidable competitor to ChatGPT.\n\nI'm not going to lie this thread made me drop a little under 200 bucks to get access to Grōk when this is released. ChatGPT with access to all of Twitter. I can not think of a more amazing tool that makes me bullish on humanity. One of the biggest challenges with social media is sifting through all the noise and having AI to help with that is huge. We are living through amazing times and I can't wait to start testing Grōk\n\n![How I imagine Grok would look (except he would have legs) if he were a person](https://miro.medium.com/1*lfyitXfl3VsI20USmfv0Kg.png)\n\n11/4/23\n\nConor Jay Chepenik",
  "wordCount": 684,
  "readingTime": 3.1311320754716983,
  "claps": 0,
  "voters": 0
}