{
  "id": "01eaf5259720",
  "title": "Day 650",
  "createdAt": "2024-01-02 05:09:05",
  "tags": [
    "religion",
    "christianity",
    "the-bible",
    "martin-luther",
    "95-theses"
  ],
  "url": "https://chepenikconor.medium.com/day-650-01eaf5259720",
  "content": "# Day 650\n\nToday I ran 2 miles, worked on a new Bitcoin article for the Common Sense Movement, and read the book of revelations from the Bible for my daily chapter. God blessed me with an opportunity to have a great chat with my Grandfather Tommy about religion after my reading. This was pretty cool because tonight before I read we celebrated the 30 year anniversary of my Grandparents being married. (My Mom's Dad, Jay, died when she was 3 so Tommy has been my Grandfather on my Mom's side for my entire life)\n\nTommy and I delved into the intriguing narrative of Martin Luther's 95 Theses and the ensuing tumult it caused. We explored various religious doctrines and the inappropriateness of monetizing salvation. The Bible itself underscores that access to God is universal and shouldn't be restricted. For the uninitiated, on October 31, 1517, Martin Luther, a German monk and theology professor, purportedly affixed his 95 Theses to the door of the Castle Church in Wittenberg, Germany. The historical accuracy of this act is debated among scholars, but the impact of his theses, which spread swiftly across Europe, is indisputable.\n\nAt that time, the Catholic Church was marketing indulgences, claimed to lessen sin's punishment. Luther vehemently opposed this, condemning it as corrupt and misleading to the faithful. He contended that salvation is attained through faith alone (sola fide), independent of monetary contributions or ecclesiastical mediation. His 95 Theses methodically challenged indulgences and other practices he viewed as antithetical to Scripture.\n\nThe invention of the printing press, then a novel technology, facilitated the swift spread of Luther's theses across Europe, resonating with many disillusioned by the Church's corruption and affluence.\n\nThe Catholic Church, predictably, did not welcome Luther's criticisms. In 1521, Pope Leo X excommunicated him, and he was branded an outlaw by Holy Roman Emperor Charles V at the Diet of Worms. Nevertheless, by then, his ideas had already secured substantial influence.\n\nLuther's 95 Theses represented a formidable stance against corruption and a plea for the purification and reform of Christian life and doctrine. His staunch advocacy for Scripture as the supreme authority and his teachings on salvation and faith profoundly transformed much of Christian tradition for the better. This perspective is shared by both my grandfather and myself. Altough the Catholic Church might beg to differ! 😂\n\nRaised within the Catholic tradition, I've long maintained that the specific denomination of Christianity one adheres to holds little significance. I'd venture even further to assert that there is, in fact, one singular Divine Entity. The Christian God, the Muslim God, the Jewish God - all these representations within monotheistic faiths, I believe, are merely different facets of the same supreme Being. This perspective, though it might diverge from orthodox views, resonates deeply with me. I understand that some devout individuals may not align with this notion, and that's perfectly alright. Ultimately, what's paramount is the personal connection one cultivates with the Divine. Fostering a genuine, heartfelt relationship with God, as I see it, is the cornerstone. Once that bond is established and nurtured, everything else in life tends to align harmoniously.\n\n![](https://miro.medium.com/0*N1PbyJAuB3Vu-axe)\n\n1/1/24\n\nConor Jay Chepenik\n\nP.S I came across this after writing and had to add it because it shows despire Martin's best efforts the Catholic church is still corrupt.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/FromKulak/status/1741874472020222024%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>",
  "wordCount": 550,
  "readingTime": 2.2754716981132077,
  "claps": 0,
  "voters": 0
}