{
  "id": "081276e289b3",
  "title": "Day 575",
  "createdAt": "2023-10-19 01:22:38",
  "tags": [
    "airplanes",
    "flying",
    "modern-technology",
    "atomic-habits",
    "growth"
  ],
  "url": "https://chepenikconor.medium.com/day-575-081276e289b3",
  "content": "# Day 575\n\n![](https://miro.medium.com/0*8GnwhB0aF5oLv5wz)\n\nReturned to Jacksonville today with my family, safe and sound. The marvel of flight never ceases to amaze me. It's incredible to think that just over a century ago, the Wright brothers, Orville and Wilbur, took to the skies in their pioneering aircraft, the Wright Flyer, on December 17, 1903, in Kitty Hawk, North Carolina. Fast forward to today, and air travel has connected every corner of the globe, enabling journeys that once took weeks to be completed in mere hours.\n\nDuring my flight home, I immersed myself in 'Atomic Habits', covering another 100 pages. The book is truly enlightening. While I often grapple with the desire to accomplish so much in limited time, it underscores the power of dedicating just 2 minutes daily to kickstart any endeavor. By consistently committing that small amount of time, it invariably leads to longer, more productive sessions.\n\nTaking that lesson to heart, I've decided to dedicate at least 2 minutes daily towards my interests. Case in point, I began reading the introduction and preamble of the constitution tonight, and I'm already eager to delve deeper. It's fascinating how such a simple approach can be so transformative.\n\nAnother principle from the book, which seems so obvious but is so often overlooked, is making the environment conducive to good habits. For instance, if you want to read more, having a book within easy reach, like on your bedside table, can be a visual reminder and make it more likely for you to pick it up.\n\nThink through your habits anon, it will pay off! I'll leave you with these two things. One of my favorite quotes from the book \"You do not rise to the level of your goals. You fall to the level of your systems.\" Also a post I made on Nostr today which was inspired by the book.\n\n![](https://miro.medium.com/1*NN1gTRfHBnQODmbWkoIRqg.png)\n\n10/18/23\n\nConor Jay Chepenik",
  "wordCount": 312,
  "readingTime": 1.560691823899371,
  "claps": 0,
  "voters": 0
}