{
  "id": "08ea1eb0865a",
  "title": "Day 654",
  "createdAt": "2024-01-06 04:11:24",
  "tags": [
    "exercise",
    "life",
    "challenges",
    "overcoming",
    "god"
  ],
  "url": "https://chepenikconor.medium.com/day-654-08ea1eb0865a",
  "content": "# Day 654\n\n![](https://miro.medium.com/0*LkD96FXqbfEDl7hj)\n\nAfter having some challenging conversations with my partner last night we made incredible strides in our relationship. I won't be \"spilling the ☕️ \" but let's just say we came out the other side a much stronger couple. I have a child with this woman and making sure my daughter sees parents who are madly in love is important. Often times doing the challenging thing is what will lead to the best outcome.\n\nThis seems so counterintuitive at first but makes sense when you think about it. It's like trying to rock a six-pack while being a couch potato munching on crisps - ain't gonna happen, mate. You gotta grind if you wanna shine.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ZackStrength/status/1743465698607661147%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI like this tweet because it shows that it is not rocket science to get in shape. I'll add that it feels good to exercise. Yes some parts suck but it provides a natural high for your body & brain.\n\nHumans are meant to move. It's weird that we get paid money to write emails and stare at screens. Not advocating we stop doing that because there are many ways to make lots of money clicking buttons and playing on computers. Just pointing out if you don't exercise you will end up miserable.\n\nLife is hard so choose the hard path that is more rewarding. In my personal experience that is the best way to live. If you are unsure what that path is then pray. God is good.\n\n1/5/24\n\nConor Jay Chepenik",
  "wordCount": 250,
  "readingTime": 1.1433962264150943,
  "claps": 9,
  "voters": 4
}