{
  "id": "0a9ed2a89b9b",
  "title": "Day 1139",
  "createdAt": "2025-05-05 03:58:05",
  "tags": [
    "heaven",
    "god",
    "fatherhood",
    "scripture",
    "ai"
  ],
  "url": "https://chepenikconor.medium.com/day-1139-0a9ed2a89b9b",
  "content": "# Day 1139\n\nTwo podcasts I listened to recently reminded me of the profound importance of a father leading his household. This was a deeply meaningful insight.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FBIsJaGivBkE%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DBIsJaGivBkE&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FBIsJaGivBkE%2Fhqdefault.jpg&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FFOBbWBQtljQ%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DFOBbWBQtljQ&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FFOBbWBQtljQ%2Fhqdefault.jpg&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nBoth guests were God-fearing men whose wisdom I greatly appreciated. One thing in particular that stood out to me is when Matt Walsh shared that he regularly gets on his knees in prayer, allowing his family to see him seeking the Lord. What a beautiful reminder that even the leader of the home humbly answers to our Heavenly Father.\n\nInspired by this, I did the same today. After hearing his words, I knelt in prayer, and my daughter Sloan joined me. Together, we asked God to heal Momma, who has been feeling nauseous while growing a newborn baby.\n\nIt was a beautiful moment. Glory be to God.\n\n_\"Likewise, ye husbands, dwell with them according to knowledge, giving honour unto the wife, as unto the weaker vessel, and as being heirs together of the grace of life; that your prayers be not hindered.\"_ - **1 Peter 3:7 (KJV)**\n\n_\"Train up a child in the way he should go: and when he is old, he will not depart from it.\"_ - **Proverbs 22:6 (KJV)**\n\nOne really unique aspect of AI is you can ask it for scripture and it will return the one you need based on your prompt. Of course, opening the Bible myself is something I should do more often. Yet, it is helpful that I can open ChatGPT to find Scripture related to my situation.\n\n![As a child I would always image heaven to be orange cloud.](https://miro.medium.com/1*5ZCAudnudb6hxo63ihRidQ.png)\n\n5/4/25\n\nConor Jay Chepenik",
  "wordCount": 257,
  "readingTime": 1.169811320754717,
  "claps": 7,
  "voters": 1
}