{
  "id": "120e84f35d57",
  "title": "Day 886",
  "createdAt": "2024-08-25 02:02:19",
  "tags": [
    "adopting-bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-886-120e84f35d57",
  "content": "# Day 886\n\n**Adopting Bitcoin: El Salvador's Premiere Bitcoin Conference**\n\n![](https://miro.medium.com/1*ekbwFxFhHL1ZFbRdHVgw9g.png)\n\nIn the heart of El Salvador, a nation that made history by adopting Bitcoin as legal tender, an unexpected annual gathering has become a beacon for Bitcoin enthusiasts and innovators worldwide. The Adopting Bitcoin conference, now in its fourth year, stands as a testament to the power of grassroots movements and open-source collaboration in the cryptocurrency space.\n\nWhat started as a one-time event in November 2021, just two months after El Salvador's groundbreaking Bitcoin law, has evolved into an annual pilgrimage for the most dedicated members of the Bitcoin community. The conference, organized by Galoy, a company developing open-source Bitcoin banking infrastructure, was initially conceived as a way to support El Salvador's bold move and educate locals about Bitcoin.\n\n\"We had no intention of turning this into a recurring conference,\" explains Kemal, one of the organizers. \"But the feedback was so overwhelming. People were convinced there would be a second edition.\"\n\nOrganizing an international conference in El Salvador was no small feat. Initially, the country's reputation as the \"murder capital of the world\" and the global COVID-19 pandemic presented significant hurdles. However, these challenges inadvertently created a powerful filtering mechanism.\n\n\"It's only a very special breed of people that go through so many hoops to make this travel,\" the organizer notes. \"It contributes to the quality of the attendees and speakers.\"\n\nRemarkably, El Salvador has undergone a dramatic transformation since then. The country has done a complete 180, evolving from one of the most dangerous nations to now being considered one of the safest places in the world.\n\nDespite the initial obstacles, the first conference attracted 700 attendees. By 2022, that number had grown to over 1,000, with the event expanding to multiple tracks. This growth parallels El Salvador's own journey, from a nation grappling with security issues to a burgeoning hub for Bitcoin innovation and adoption.\n\nAdopting Bitcoin has become more than just a conference; it's an incubator for groundbreaking ideas in the Bitcoin space. Several significant projects made their debut or gained traction at the event:\n\n- Fedimint, a community custody solution\n- Ark, a new second-layer scaling solution\n- Cashu, an electronic cash system\n\nThe conference's open call for participation and its non-profit nature have created an environment where \"rough jewels become visible to the ecosystem,\" as the organizer puts it.\n\nCentral to the conference's ethos is the promotion of open-source development. Galoy's commitment to open-source solutions has enabled other communities, like Bitcoin Jungle in Costa Rica, to fork their software and create localized Bitcoin banking solutions.\n\n\"We're in the process of fighting against the Fiat Empire,\" Kemal explains. \"It's just not the time to try to protect your piece of the pie. We have to grow the pie, and open source is one way to grow it.\"\n\nAs Adopting Bitcoin prepares for its fourth edition, it continues to be a crucial nexus for education, innovation, and collaboration in the Bitcoin space. The conference's impact extends far beyond its annual gathering, fostering year-round development and adoption initiatives.\n\nFor those passionate about Bitcoin's potential to transform economies and empower individuals, Adopting Bitcoin remains an essential event on the calendar. It's not just a conference; it's a glimpse into the future of money and a testament to the power of community-driven innovation.\n\nIf you are interested in attending you can get tickets here: [Adopting Bitcoin 2024 - High-signal Bitcoin conference for builders](https://sv24.adoptingbitcoin.org/)\n\n8/24/24\n\nConor Jay Chepenik",
  "wordCount": 584,
  "readingTime": 2.4037735849056605,
  "claps": 1,
  "voters": 1
}