{
  "id": "131f632c8c45",
  "title": "Day 513",
  "createdAt": "2023-08-18 01:15:57",
  "tags": [
    "incentives"
  ],
  "url": "https://chepenikconor.medium.com/day-513-131f632c8c45",
  "content": "# Day 513\n\n![](https://miro.medium.com/1*6vaanJvz_vUthq_wYyi7yw.png)\n\nThe powers-that-be don't want regular people to have hope. So we must hold onto hope -the thing they fear the most. When ordinary citizens wake up and see brightness on the horizon, the kleptocrats tremble.\n\nWhile democracy has merit as the least-worst system, it's worth acknowledging a force with even greater potency than our ballots: our economic choices. Politics is downstream of economics.\n\nExercising your agency by directing your financial resources (and time) is the genuine catalyst for wielding positive influence in the world. There is so much opportunity out there waiting to be seized. Have hope!\n\n> [**Home Team | PBD Podcast | Ep. 295**](https://www.youtube.com/live/GNCP0du-41g?feature=share)\n\nThis podcast reminded me that the future is bright. Business models will need to change for many companies. PBD was an insurance guy and now has a massive podcast which you can tell he genuinely enjoys doing. Which is amazing because as a viewer you enjoy it and get to hear fair analysis from a variety of perspectives. It feels good to be reminded that people voting with their wallets can cause corporations to change how they do things.\n\nRecently, I lost my AirPods so today I ran with no music. Just thought. Throughout the run, I spent much more time noticing the buildings around me. It was refreshing.\n\nWhile I still prefer listening to music or podcasts during runs, it's nice to be reminded that our brain processes immense amounts of information. When you free up some of that processing power, it gets redirected to other observations.\n\nMy final thought for day 513 of daily writing: Incentives drive behavior, so align your incentives with your goals. Reflect on what you truly want, then organize your life to incentivize yourself to pursue those aims.\n\n8/17/23\n\nConor Jay Chepenik",
  "wordCount": 317,
  "readingTime": 1.3962264150943395,
  "claps": 0,
  "voters": 0
}