{
  "id": "138b960c36ec",
  "title": "Day 62",
  "createdAt": "2022-05-23 17:15:22",
  "tags": [
    "bitcoin",
    "white-paper",
    "war",
    "fiat",
    "credit-creation"
  ],
  "url": "https://chepenikconor.medium.com/day-62-138b960c36ec",
  "content": "# Day 62\n\nWanted to share the article I've been working on for Bitcoin Magazine here. This is before any edits (if the article even gets selected). Thus, it might change between now and publication, but I'm proud of the work that went into making it and I hope it provides value to you anon.\n\n**Choose Your White Paper Wisely**\n\nHumans are derivatives of other humans. Initially, we learn how to act based on our parent's behavior and as we get older we develop critical thinking skills and parrot the talking points of others that resonate with us. That is why choosing what you fill your mind with has never been more important. As humanity continues down the information technology revolution we need people focused on building new systems that prioritize love, liberty, freedom, and fairness. I worry that our current system is filled with people trying to impose top-down controls or figure out how to go viral.\n\nBlaming people for wanting to go viral is a lousy argument. \"Show me the incentives and I'll show you the outcome\" - Charlie Munger. Some people with large online followings provide legitimate value, but the majority post half-truths in an effort to make their followers trust them. Not many influencers showcase their struggles because nobody wants to buy a product from someone who is miserable. Influencers need to sell the idea you can have a life like theirs if you buy their course, product, or whatever else they might be peddling. It takes a lot of curating to fill a social media feed with people who provide real value. If you don't put in this time upfront your feed will be filled with products that are like altcoins: cheap knock-offs. Charlie might be wrong about Bitcoin, but he was spot on about incentives. Social media companies want to keep people scrolling on their platforms so they can monetize our attention. Thus, when you ask kids what they want to be when they grow up the majority will say a social media celebrity rather than a scientist, firefighter, astronaut, engineer, or any other profession that benefits society.\n\nSo when did everything become so perverse that children are more eager to show off their life online rather than find a job that benefits society? It is impossible to pin this to an exact moment, but I'd argue it all started when the Bank of England decided to monopolize credit to fund their war efforts. This type of top-down control was the first form of quantitative easing and the inception of the credit-based fiat system or \"The Original Sin\" as Saifedean calls it. Credit is never as good as gold, but when a Bank acts like its credit is the result is devastating. The incentives that came out of this have made the fiat system a truly sinister one. This quote from Saifedean Ammous on The Lex Fridman Podcast is a perfect example of what happens when the entity with the biggest stick starts asking for value without returning the favor. \"I call it the fiat white paper - you know in Bitcoin we have the white paper - the fiat white paper was that the Bank of England announced to all of its banks and post offices: from now on, you should not make payment in gold, and you should take payment in gold, and you should encourage all of your customers to turn in all of their gold and give them paper instead.\"\n\nAccording to Meriam-Webster finance is \"to raise or provide funds or capital\" Under Keynesian economics, finance is how the Bank of England used credit to spend money it did not have. As Saifedean so elegantly points out in _The Fiat Standard_ only ⅓ of the English population subscribed to their Government's war bonds. Rather than stopping the war the Bank of England gave their 2 top officials a line of credit and had them buy the remaining ⅔ of the bonds. Rather than provide actual value, the Bank used its monopoly on money to fund itself and continue fighting a war that its citizens clearly did not have an appetite for. This type of top-down control has had lasting impacts and has resulted in a lot of parasites gaining wealth without providing value.\n\n![](https://miro.medium.com/0*fBN1aeJCUix5vqTs)\n\nAs most people reading this publication know another white paper was released in 2008 that cut out parasitic middlemen. A white paper that wasn't based on credit, but required providing value in the form of energy in order to obtain this new currency. This system required no third parties and allowed people to trade in a peer-to-peer fashion without a middleman butting in to take a cut. The incentives of this network called Bitcoin are so beautifully aligned that the longer the network exists the more secure it becomes. A truly incredible feat of engineering that has the power to completely undermine the current system of parasites and credit expansion. The fiat system has given rise to pointless wars and made saving one's value impossible without investing. Satoshi Nakamoto gave us a way out of this was some open-source software.\n\nUnder a Bitcoin standard, it would be very difficult to make money without providing real value. If you take away the incentives of aligning yourself next to powerful government officials the world would be a better place. No more backroom handshakes because no matter how much power or wealth one acquires one can not change the rules of the Bitcoin network. Many will have to make a choice in the coming years about how they want to store their value. One system mines new currency via credit expansion while the other requires hardware and energy to do so. One system lets parasites thrive while the other just has rules that can not be changed. Even those who are lucky enough to reside in a wealthy nation still see their purchasing power destroyed in slow motion via inflation. If Bitcoin is not adopted globally humanity could end up in a never-ending cycle of war since the only foreseeable way to keep the fiat system propped up is through constant growth. Constant growth is not always attainable and fiscal stimulus is like crack. The first hit is fantastic, but then you need more to experience the same result. When everything starts to unwind and the system looks unstable the logical conclusion under a fiat standard seems to be to start a war. Fiat corrupts people over time. It's not a gradual corruption, but it's a slow and steady one like the decline of the dollar. Fiat is so corrupting that House Majority Leader, Steny Hoyer, declared the United States is at war with Russia. There was no vote of Congress to declare war. Seems that when you have been in the fiat system for so long you forget that other people expect you to play by the rules. I found this to be a perfect example of what a corrupt system does to those in it.\n\n![](https://miro.medium.com/0*eEaVPggeK54jTH1e)\n\nBitcoin does the opposite to people. Recently, I found out my girlfriend was pregnant. The first thought that popped into my head upon hearing this was \"Thank god for Bitcoin\". I know this sounds insane, but if there was no way to opt-out of the rotting fiat system I would be horrified to bring life into this world. The second thought that popped into my head was \"Wow I'm really going to be a Dad, I can't wait to give my child a good life and raise them to be a good person\". Bitcoin taught me that low-time preference activities are what lead to a fulfilling life. As far as I can tell there is nothing more low-time preference than having children. Tons of uncertainty in the world and the only thing that seems to be guaranteed is Bitcoin adding blocks roughly every ten minutes. If there was not an alternative to our current fiat system I'm pretty confident I would have opted for my partner to get an abortion. I'm not a math expert but I can tell that 30 trillion dollars of debt is so much money that even servicing the interest payment will be a massive challenge. Paying off the principal is starting to seem like a pipe dream as governments continue to run deficits and spend money they don't have. When you really dig into the math it seems apparent why the House Majority leader is calling for war. They want a way to refinance their debt! Screw public opinion or the thousands of problems the United States has in its own country, Politicians want war with Russia. War is not the answer to the United States' problems, and it is more important than ever to adopt a system that doesn't always lead back to war.\n\n![](https://miro.medium.com/0*gOg6UpGVNNMgzNrS)\n\nThe incentives to go to war under the fiat system are powerful right now. Rand Paul was ostracized for delaying a 40 billion dollar package, which we don't currently have without borrowing, to Ukraine. According to NBC News, \"Paul, a libertarian who often opposes U.S. intervention abroad, said he wanted language inserted into the bill, without a vote, that would have an inspector general scrutinize the new spending.\" The reader can decide why the U.S Government would be so against letting an inspector General monitor where the money goes. My guess is because it is a lot harder to launder money when someone is overseeing how it gets spent. The more our Government pushes for war instead of diplomacy the more it becomes clear the game is rigged. You don't usually see republicans and democrats on the same page, but there was a big bipartisan push to give Ukraine 40 billion and the bill got pushed through Despite Paul's effort to get some oversight into how the funds will be spent. Imagine playing a football game and right after your team scored the winning touchdown the Referee decided to change the rules of the game which results in your team losing. Now imagine doing the right thing your whole life, saving, paying taxes, helping out the local community, and right before retirement the government prints trillions of dollars and changes the game. At first, this might seem great as your assets skyrocket. When reality sets in shortly after and inflation decimates people's on paper purchasing power things get ugly. I've personally witnessed fiat make people bitter, resentful, and perilous. I've also witnessed myself and others become more patient, loving, and happy as a result of Bitcoin. Bitcoin saved the life of my unborn child and I imagine it can save many the lives of many others.\n\nThere is no pleasure in watching those who do the right things get upset because the system that promised them a better life ended up decimating their purchasing power. It's not easy to tie the second and third-order consequences of printing money back to quantitative easing but it is clear that as money is devalued everyone suffers in the long run. When I learned about hyperinflation in The Weimar Republic there were not any examples of people helping their neighbors and saving money. Instead, people were spending their money immediately knowing that it would be worth less the next day. It got so bad people ended up using their paper money to make arts and crafts because they couldn't buy anything unless they had a wheel barrel full of cash. Germany experienced such challenging times that the Nazis were able to rise to power after the collapse of the Weimar Republic. Luckily, no more empires need to fall into authoritarian regimes thanks to an anonymous shadowy super-coder who fused the hardest form of money the world has ever seen. I doubt even Satoshi could've realized how integrated this would become with the human condition. Knowing I can store my value in something with an incredibly high probability of securing my value over time gives me hope. Savers are punished in the fiat system for trying to afford themselves a better life. Most people don't even realize they are being punished because the devaluation of the currency happens slowly. These past two years helped wake a lot of people up but there is still much work to be done. It is a brutal experience purchasing gas that costs twice as much as it did a few short years ago. Walking around the grocery store is also a drag since the meat I want to buy costs me 50% more. It was Bitcoin that helped me discover the two main exports of the U.S are dollars and defense as a service. Realizing money can be backed by open-source software rather than violence felt like an ego death that results after a psychedelic experience. Having rules rather than rulers to guarantee the game doesn't change is an important thing. The only people who wouldn't agree with this are the Rulers who enrich themselves at the expense of everyone else. Bitcoin can eliminate authoritarian regimes if it gets adopted by enough people because under a Bitcoin standard the incentives to treat citizens like cattle crumble.\n\nOut of the 8 billion people in the world, many still don't understand the game is rigged. Legacy finance is filled with all sorts of fancy terms because if the majority understood how it operated they wouldn't participate. Unfortunately many will have to get burned to see the light. Like most people, speculation is what attracted me to Bitcoin in 2017. I dabbled in all sorts of cryptocurrencies and it took getting burned badly to realize \"there is no second best crypto\". There is also no substitute for Proof of Work. Not in real life and not in cyberspace. While it was painful getting blown up in altcoins it was also an incredible lesson. The Bitcoin rabbit hole goes so deep that you could get seven P.H.Ds and still not have studied as long as someone who truly understands the way Bitcoin impacts every part of human life. One thing that always made me personally bullish is how Bitcoiners start evangelizing other people. It is a perfect bottom-up system. Think about the network effect that takes hold for apps. I'll use Uber as an example. You go out to the bar with a friend and when you guys are done partying someone says, \"Hey let's call a taxi to get home\". You tell them \"screw that there is a better way, we can Uber\". You show them the app, its ease of use, and by the time the Uber arrives, they are so impressed that they download Uber on their phone. Word of mouth spreads fast and now Uber is worth over 40 billion dollars despite not owning any taxis. Now think about this example but with money. A good that isn't supposed to be consumed itself, but one that is supposed to store your value over time. A good you use to purchase other goods you actually want to consume.\n\n![](https://miro.medium.com/0*8sz_8dgN2Q8EUhAT)\n\nLegacy players like Charlie Munger and Warren Buffet attack Bitcoin because they are incentivized to prop up the fiat system that allowed them to become some of the wealthiest people in the world. They do not want others to realize how fragile and reliant the fiat system is on everyday citizens continuing to take out loans and rely on credit. Personally, I'm not sure credit is even the issue. The problem stems from the fact there is always a lender of last resort in the Federal Reserve. Since they can create an infinite amount of money in the form of credit the risk for commercial Banks lending money is almost none. Credit only works when the one doing the crediting can lose everything they lent. Bailing out the Banks in 2008 was a horrible move because it stopped the free market from doing its job. (It also led to the invention of Bitcoin so maybe there was a silver lining) By taking away the part of lending that gives both the lender and borrower a true incentive to make sure the loan is reasonable it inevitably results in a lot of malinvestment. We are reaching a point where Banks will lend to almost anyone because no matter the outcome they end up okay. When you buy a home via a mortgage the Bank is mining new fiat. They don't give you the fiat they worked to acquire. They take capital from customers who have deposited money and lend it out to earn a yield. The fractional reserve banking system is unstable and what props it up is having a Federal Reserve that has signaled in the past we are willing to step in and be a buyer of last resort. Thus, the Bank is free to lend out large sums of money without facing any opportunity cost for doing so. If the borrower defaults the bank gets to take the house, car, or any other asset you might have bought with the loan. Hard to believe Banks would be so willing to lend money if they didn't have a lender of last resort ready to bail them out as they did in 2008.\n\n![](https://miro.medium.com/0*OwZllHDTONP9qMcT)\n\nOn the other hand, the borrower has to work his whole life to get enough money to back pay the loan plus interest. It makes no sense why the Bank gets to lend money without an opportunity cost but the borrower has to face many opportunity costs in order to acquire the same type of money. The fiat white paper will have you leveraged up to the teeth trying to afford basic necessities like a home or car. Keynesian economics has led us to the point that you can even finance a 15$ pizza now. It is a tragedy that inflation has decimated people's purchasing power, but financing food is not the way to solve the problem. Luckily, there is another white paper that doesn't lead to everything becoming financialized.\n\n![](https://miro.medium.com/0*TPpds40FmbGIWkp5)\n\nThe Bitcoin white paper will help you sleep at night knowing new coins will only be given to those who followed the rules. One system can create an infinite amount of money while the other is capped at 21 million. Pick your white paper wisely: your life's value depends on it. For those not living in a western society, I imagine I don't have to explain the unjustness of our current system. The U.S has been exporting our inflation globally for quite some time now and we are reaching a point where it has gotten so bad even people in the United States are starting to feel the inflation. Ignorance might be bliss in some situations but once you see how broken the fiat system has become it is clear that we need a new one. It is never too late to opt out. The masses hold the power, most just don't realize it.\n\n![](https://miro.medium.com/0*9bvxDLt9xKe94oya)\n\nUltimately, I have no problem with lending money. The problem is lending money when you didn't have to sacrifice anything to get that money in the first place. It can not be understated how the ability to issue money at will without an opportunity cost for doing so has caused tons of parasites to thrive and massive amounts of capital to be wasted. All people, organizations, and governments are prone to human error. The free market does a good job correcting these errors, but when Central Banks step in and impose top-down controls that prevent the free market from doing its job the worse these human errors become. Under a Bitcoin Standard, the world will be a better place because people will have to provide actual value in order to be lent money. Getting a line of credit from someone who has no opportunity cost makes the lender and borrower less concerned with the outcome. Under a Bitcoin standard both the lender and borrower would have much more to lose and a larger incentive to be productive with the money rather than parasitic. Any decent person is more concerned about paying a loan to a friend or family member back than a random Bank that is lending out money that is not technically their own money. There has been a lot of manipulation and financial jargon to keep people ignorant of the problems within the fiat system. Luckily, top-down controls only work when you can incentivize people to enforce your will. History has shown us wars stop when the money either runs out or becomes worthless. Bitcoin is built from the bottom up because the incentives of the network get people to participate via their own free will. No one knows exactly how the future plays out, but if you follow the incentives it seems the outcome will be in favor of Bitcoin.\n\n**Sources**\n\n_ABC News_, ABC News Network, [https://abcnews.go.com/Politics/senate-passes-40-billion-aid-ukraine-bill-heads/story?id=84835587](https://abcnews.go.com/Politics/senate-passes-40-billion-aid-ukraine-bill-heads/story?id=84835587)\n\nAmmous, Saifedean. _The Fiat Standard: The Debt Slavery Alternative to Human Civilization_. The Saif House, 2021.\n\nCuofano, Gennaro, and About The Author Gennaro Cuofano Gennaro is the creator of FourWeekMBA which reached over a million business students. \"Network Effects in a Nutshell.\" _FourWeekMBA_, 22 Mar. 2022, [https://fourweekmba.com/network-effects/.](https://fourweekmba.com/network-effects/.)\n\n\"House Democratic Majority Leader Steny Hoyer (D-MD): 'We're at War!\".\" [https://youtu.be/yA6PXKYis2U.](https://youtu.be/yA6PXKYis2U.)\n\n\"Igniting the Holocaust - Facing History and Ourselves: Burning Money: Hyperinflation in the Weimar Republic.\" _LibGuides_, [https://library.randolphschool.net/c.php?g=237930&p=1581974](https://library.randolphschool.net/c.php?g=237930&p=1581974).\n\nLitquidity. \"Financing a Pizza over 6 Weeks: Down Bad or Savvy Cash Flow Management??? Pic.twitter.com/obeebk9pnw.\" _Twitter_, Twitter, 15 Oct. 2021, [https://twitter.com/litcapital/status/1449057824236097541?lang=en.](https://twitter.com/litcapital/status/1449057824236097541?lang=en.)\n\n\"Rand Paul Blocks Quick Passage of $40 Billion Ukraine Aid Package.\" _NBCNews.com_, NBCUniversal News Group, 12 May 2022, [https://www.nbcnews.com/politics/congress/rand-paul-blocks-quick-passage-40-billion-ukraine-aid-package-rcna28648.](https://www.nbcnews.com/politics/congress/rand-paul-blocks-quick-passage-40-billion-ukraine-aid-package-rcna28648.)\n\n\"Saifedean Ammous: Bitcoin, Anarchy, and Austrian Economics | Lex Fridman Podcast #284.\" 12 May 2022, [https://youtu.be/gp4U5aH_T6A.](https://youtu.be/gp4U5aH_T6A.)\n\nIt was a lot of fun writing this article and I hope it is clear I believe in Bitcoin so much because it can be used as a tool to create prosperity for all rather than enrich the few at the expense of everyone. War is never the answer, especially in these trying times. God bless!\n\n5/23/22\n\nConor Jay Chepenik",
  "wordCount": 3691,
  "readingTime": 14.978301886792453,
  "claps": 0,
  "voters": 0
}