{
  "id": "14741b55aa18",
  "title": "Day 1101",
  "createdAt": "2025-03-28 01:35:15",
  "tags": [
    "perspective",
    "is",
    "important"
  ],
  "url": "https://chepenikconor.medium.com/day-1101-14741b55aa18",
  "content": "# Day 1101\n\nEven as I marvel at what AI can do, I'm reminded how incredible human ingenuity still is. Huge shoutout to my father-in-law, who came down and willed my backyard into something 10x better than before through nothing but effort, vision, and grit. Also to my Dad, my Step-Father, my Mother-in-law, my Mom, and everyone else who helped with this week long project.\n\nAI is going to free up time for so many of us. And with that time, I want to keep building. To will better backyards. To shape better days. To keep showing up and sharpening my craft. Which can be for so many things, writing, coaching, reading, hell even shitposting. I want to keep getting better at a lot of things.\n\nI saw a post today claiming that the worst thing that can happen to a young man is getting rich too early and honestly, it made me pause. I'll admit, I've caught myself daydreaming about hitting the lottery.\n\nBut that tweet was a needed reminder: sudden wealth, especially without discipline, can take you to some dark places. If I suddenly had $100 million, I'd feel the pull to buy cool cars, go to the world's best clubs, the serious temptation to slack off.\n\nI say this because, truthfully, the things I dream of, things I can't afford right now, I know I _will_ be able to afford someday. Not through luck, but through Bitcoin and AI. Well maybe luck as well since holding bitcoin and not fumbling it requires a lot of things including some luck. The best things in life money can't actually buy, but money can buy some cool stuff. I give it maybe ten years...probably even sooner before I can buy whatever I want.\n\nSound money and powerful tech are making us more productive than ever. Business will boom. Opportunities will multiply. But I must stay grounded. I must be responsible. I need to humble myself, pray more, and listen for God's wisdom. He will lead: my job is to follow.\n\n3/27/25\n\nConor Jay Chepenik",
  "wordCount": 348,
  "readingTime": 1.3132075471698113,
  "claps": 0,
  "voters": 0
}