{
  "id": "1550d02f7991",
  "title": "Day 93",
  "createdAt": "2022-06-24 01:23:46",
  "tags": [
    "books",
    "stand-up",
    "bitcoin",
    "money",
    "comedy"
  ],
  "url": "https://chepenikconor.medium.com/day-93-1550d02f7991",
  "content": "# Day 93\n\nBeen good taking a break from Twitter. I did use it to follow back someone who said they had followed me but haven't scrolled the feed at all. As much as I love that app it is definitely having negative effects on my mood and productivity so I'm happy to be taking a break.\n\nGoing to continue crafting my stand up so here goes nothing.\n\nI've always been a big believer in being open-minded. It's a fine line though because in today's world it's near impossible to tell who the snake oil salesmen are and who are the ones providing value. Anyone with a smart phone has all of human history at the tip of our fingers and most of us use it to watch videos of people popping pimples or have food delivered to our door. Humanity is wild but as far as I can tell this tyranny of convenience our phones provide make it difficult to remain open-minded. The key to being open-minded though is not caring what other think and luckily my father taught me that life is too short to give a shit what other thinks. Yea from a young age my Dad installed in me the importance of pursuing your passion no matter what. Even if it means getting child protective services called on you because you made your son run 5 miles and give up water for 24 hours to make sure he made pop Warner football weigh ins. What doesn't kill you makes you stronger though amirite? You know some people might've thought this was borderline child abuse, but they just didn't understand my Dad's passion was his children's sports. Yea my Dad liked living a little too vicariously through my sister's and me. At my JV football games he was on the sidelines drinking a vodka red bull yelling PICK A SPOT!!! PICK A SPOT CONOR! Needless to say my teammates always knew who my Dad was. You know I give my my Dad crap but he always taught me a lot of important lessons like make sure you put your mixie in a big gulp before entering the high school football game, that having a child is unlike anything you've ever experienced, and that your happiness can only be achieved if you pursue your passion. If there is one thing I do sometimes worry about it's that I inherited my Dad's trait. Life is about having a plethora of experiences. It's not good to become completely immersed in anything which for my Dad was his children's sports and for me it's Bitcoin. Yea I'm freaking obsessed with this magic internet money that has slashed half my purchasing power in USD terms and led my family to think I'm crazy. Luckily, my Dad taught me that it's not important to worry about what others think. That goes for your family though not your partner. I bring this up because I recently found out I'm going to be a Dad and when my girlfriend told me the first thing that ran through my head was \"Thank God For Bitcoin\". That's not what I told her though. I said \"What do you think of the name Satoshi?\" Quickly I realized I would've just been better off saying my original thought. Yea I thought getting into Bitcoin would bring me a lot of money but it really only got me a Twitter addiction and my net worth in fiat terms cut in half. That's alright though my online friends assure me that by lower my time preference and holding (a funny term for holding) I will be just fine. While I'm confident in that part I do need to remember that everything I find online should be taken with a grain of salt. For example, my online friends told me that taking a 💉  could cause me to be sterile. Well low and behold that turned out to be debunked by myself and sure enough, I'm going to be a father soon. I'm excited to have a kid, I am, but I'm not sure if having a kid was a legit excuse to dunk on @mr.clownworld who gave me the idea in the first place. It's cool though. My kid is either growing up driving lambos or hunting city cats for dinner. Ain't not in between at this point. I'm convinced bitcoin will replace the US dollar as a global reserve currency. Before anyone says there is no chance keep in mind that is what the experts are saying as well. Yea the so called \"experts\" who didn't realize inflating the money supply by trillions of dollars would cause inflation are now telling us there is no chance bitcoin takes over as the next global reserve currency. So there is hope. Doesn't take a take a rocket scientist to know that printing money will cause inflation, but I guess it takes more than an economist. Plus, kids are smart as hell. Ain't no way they are going to walk in a bank to ask for permission to send large amounts of money. I think they'll use bitcoin. A permissionless system that allows anyone to send and receive value without a third party. I'll tell you kids do not play. You know this past weekend I went down to New York and when I arrived at my Aunt's house the first thing my little cousin said when we walked in is \"I'm confused. First comes love, then comes marriage, then comes a baby sitting in the baby carriage\". I said Vaughn. When you lose half your fiat purchasing power in magic internet money you got to find a way to channel that anger somewhere. Thank you that's my time... to be continued.\n\nIn other news read this hilarious article from the Verge. [https://www.theverge.com/2013/11/6/5072924/google-engineers-issue-fuck-you-to-nsa-over-surveillance-scandal](https://www.theverge.com/2013/11/6/5072924/google-engineers-issue-fuck-you-to-nsa-over-surveillance-scandal) Also, got some good reads in the mail today. Excited to dig in soon.\n\n![](https://miro.medium.com/1*HXE4cT4PC33N0qKuQsdvtQ.jpeg)\n\n6/23/22\n\nConor Jay Chepenik",
  "wordCount": 999,
  "readingTime": 3.969811320754717,
  "claps": 1,
  "voters": 1
}