{
  "id": "1700370ebadd",
  "title": "Day 590",
  "createdAt": "2023-11-03 01:09:30",
  "tags": [
    "sbf",
    "guilty",
    "bitcoin",
    "world-war-iii",
    "history"
  ],
  "url": "https://chepenikconor.medium.com/day-590-1700370ebadd",
  "content": "# Day 590\n\nNews has surfaced that Sam Bankman-Fried, the former CEO of FTX, has been found guilty. The outcome of his sentencing, set for March 28, 2024, is highly anticipated.\n\n> [**Verdict reached in Sam Bankman-Fried fraud trial | CNN Business**](https://www.cnn.com/2023/11/02/business/ftx-sbf-fraud-trial-verdict)\n\nGiven the severity of the consequences following the FTX collapse, where many faced the loss of their life savings and some resorted to suicide out of despair, a stringent sentence seems appropriate, potentially extending to life imprisonment. While individuals bear some responsibility for placing their trust in an exchange, my empathy rests with the victims. As someone who is passionate about the transformative potential of Bitcoin for the world, I recognize the steep learning curve involved in grasping the significance of private key ownership and the unique attributes of Bitcoin compared to all other digital assets in the space. It underscores the crucial ethos of \"don't trust, verify,\" and the prudence of not storing funds on any exchange, irrespective of its apparent trustworthiness or celebrity backing.\n\nActions invariably lead to consequences, and while the potential of a life sentence for Sam Bankman-Fried is a grim reality, it reinforces the principle that even the most altruistic of intentions cannot excuse fraudulent or thieving behaviors involving customer funds. The lesson here is clear: the ends cannot be used to justify the means. This is a cautionary tale with relevance not just for individuals but also for global leaders, who must consider the ethical implications of their strategies and actions, particularly as they navigate the complex dynamics of international relations and the risk of escalating the current wars happening.\n\nWe find ourselves in an era marked by significant volatility and uncertainty. It's thought-provoking to consider how future historians will reflect upon our current times. It's possible they may view this period as a 'World War III' type era due to increasing amount of wars and the widespread unrest globally. Despite the grim associations, it's important to remember that periods of great hardship can be followed by eras of profound growth and innovation, as was the case after World War II. Regrettably, history has a tendency to repeat itself, often necessitating the relearning of hard-learned lessons. It is a somber truth that pain often serves as one of the best teachers. Much like the post-war revelations of the mid-20th century, our current challenges could serve as a potent reminder of the dire consequences of global conflict and the necessity of striving for peace.\n\nI'm not a war expert or a financial professional (yet), but as someone deeply invested in the potential of Bitcoin, I hope it can be the key to incentivizing less conflict globally. I believe that human incentives are a powerful driver of world events, and the decentralized nature of Bitcoin could align these incentives towards more peaceful outcomes. The actions of individuals like Sam Bankman-Fried are disheartening and seem counterproductive to my viewpoint. Yet, in a way, his case could be indirectly beneficial. Pain is indeed a profound teacher, and the fallout from the FTX debacle has been a stark lesson in the importance of self-custody. It's now clearer to many why holding one's own bitcoin is infinitely preferable to entrusting it to an exchange. The fame or celebrity endorsements an exchange boast do not matter. As a matter of fact if an exchange seems more focused on celebrity branding than their core responsibility, that is a sign they may be putting more effort into hype than creating a reliable platform.\n\nIt is ironic that Bitcoin was created to prevent having to rely on third parties yet we've seen so many people lose their bitcoin because of failed third parties. As Satoshi [said](https://bitcoin.org/bitcoin.pdf), \"I've been working on a new electronic cash system that's fully peer-to-peer, with no trusted third party\" and all we have to do is heed his advice. DO NOT TRUST THIRD PARTIES! I mean maybe that is an oversimplification because I like some of the services third parties offer but seriously [get your bitcoin off the exchange anon](https://bitcoinnews.com/how-to-withdraw-bitcoin-on-cash-app/). Unless it is bitcoin you are willing to lose.\n\n![](https://miro.medium.com/0*oBk8JLluxlQPCcTc)\n\n11/2/23\n\nConor Jay Chepenik",
  "wordCount": 711,
  "readingTime": 2.8830188679245285,
  "claps": 17,
  "voters": 3
}