{
  "id": "18a41fb60287",
  "title": "Day 738",
  "createdAt": "2024-03-30 00:28:44",
  "tags": [
    "value",
    "wealthy",
    "poor",
    "virtuous",
    "corrupted"
  ],
  "url": "https://chepenikconor.medium.com/day-738-18a41fb60287",
  "content": "# Day 738\n\n![[https://x.com/jercephus/status/1773861839656399072](https://x.com/jercephus/status/1773861839656399072?s=20)](https://miro.medium.com/1*ZAJSs0anqI-9xisqG4c8-A.png)\n\nWhat a powerful reminder perspective is everything. It's easy to complain but no one likes a pessimist.\n\nVenture out and create value. I found this discussion with Mark Moss on the What Bitcoin Did podcast truly enlightening.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F6z2qYF1HZ1U%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D6z2qYF1HZ1U&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F6z2qYF1HZ1U%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nMark challenges a conventional notion: the idea that the wealthy are virtuous while the poor are selfish. At first glance, this seems jarring. However, when you analyze it through first principles, it begins to make sense. Wealth often stems from providing value to others, while those who haven't been able to provide such value may remain impoverished. If you create something that others want, you are likely to end up wealthy. Value accrues to those who provide value to others.\n\nCertainly, there are exceptions to this rule, such as individuals who have inherited wealth without contributing anything themselves. These outliers may not fit the definition of virtuous. Excluding such exceptions, this perspective carries significant merit. Steve Jobs, for instance, was not made wealthy by screwing people over, but rather by providing the machine (or at least the earlier version of one) that people now use for various purposes, like writing on Medium LOL.\n\nI love this perspective shift and I'm grateful to live in a time where I can learn about these perspectives for free :)\n\n3/29/24\n\nConor Jay Chepenik",
  "wordCount": 219,
  "readingTime": 1.0264150943396226,
  "claps": 0,
  "voters": 0
}