{
  "id": "193e89907ec7",
  "title": "Day 73",
  "createdAt": "2022-06-03 16:22:35",
  "tags": [
    "celtics",
    "sales",
    "basketball",
    "bots",
    "connection"
  ],
  "url": "https://chepenikconor.medium.com/day-73-193e89907ec7",
  "content": "# Day 73\n\nSuper excited to make the trip up to Littleton NH after work today. My sales job has been a roller coaster on this fine Friday. Starting with a \"Stop. Take me off your list\" email followed up by scheduling a Head of Product via cold calling. In sales it is so easy to get in your own head but I'm reminded that no one likes being sold to anyways. The more I shut up and let people talk to me about their problems the more credible I become. It's hard to convince someone I can help them over email because I can't just pose a question and then shut up. Not exactly easy over the phone, but a lot easier to ask an open-ended question and get a response than it is over email. After watching the NBA finals game last night I think Sales is a lot like basketball. You can go on runs where things are going great and you can have cold streaks where you can't get a meeting (or bucket). It is crucial to remember that getting in my own way will not benefit me. Easier said than done but my job doesn't define my worth and realizing that makes it a lot easier to sell knowing the outcome will have no impact on the way I view myself. Funny how the harder and more desperate you get to make a sale the less likely you are to make one. Same in basketball. The harder you obsess over getting a bucket the worse you play. Some of the best runs in basketball happen when the players are just reacting. You can see the players get in a flow state and just play basketball as if they were running pick up at the neighborhood park. Letting muscle memory take over and not worrying about hitting every shot seems to be what helps teams go on runs. That's what I saw the Celtics do in the 4th quarter to come back against Golden State and it was truly a thing of beauty.\n\nI've never been a massive basketball fan, but boy do I want the Celtics to win so I can celebrate at the summer parade. Boston fans are quite spoiled with their sports teams and I've gotten to witness quite a few parades since I moved up here 6 years ago to attend college. It is funny to see how critical the fans get when the team isn't absolutely dominating, but sure enough, Boston is usually pretty damn good at sports. High expectations create high-quality sports environments.\n\nOutside of that, I've got two bangers on Twitter to share. This [meme](https://twitter.com/Baltics_HODL/status/1532059483806937098?s=20&t=FbcsC5SPkASPqX3u-IuHjA) about the art of the rug killed me. Also wild stat I learned today.\n\n![](https://miro.medium.com/1*XTz8SvWtY2qxZJNIfaJzYg.png)\n\nCrazy that bots make up over 60% of internet traffic. Be careful out there anon. Just makes me wonder how many times I've been having conversations with a bot thinking it was a real person. The internet is great and all, but nothing beats connecting with people in the real world.\n\n6/3/22\n\nConor Jay Chepenik",
  "wordCount": 516,
  "readingTime": 2.147169811320755,
  "claps": 0,
  "voters": 0
}