{
  "id": "197863fe7cba",
  "title": "Day 1057",
  "createdAt": "2025-02-12 02:05:03",
  "tags": [
    "grind",
    "dont",
    "stop",
    "good",
    "i-love-this-shit"
  ],
  "url": "https://chepenikconor.medium.com/day-1057-197863fe7cba",
  "content": "# Day 1057\n\n![[https://x.com/ConorChepenik/status/1889475899038314672](https://x.com/ConorChepenik/status/1889475899038314672)](https://miro.medium.com/1*FofWvzjImeo-IV9CHul1Pg.png)\n\n![[https://x.com/ConorChepenik/status/1889442191883247903](https://x.com/ConorChepenik/status/1889442191883247903)](https://miro.medium.com/1*6qxAhLI1SvXsD2zK9dYEFA.png)\n\n![[https://x.com/ConorChepenik/status/1889437676568268868](https://x.com/ConorChepenik/status/1889437676568268868)](https://miro.medium.com/1*O7m1YHmEgRn4zKQC93m0Tg.png)\n\nBeen a solid Tuesday. My ladies got back from Jersey today, I enjoyed a good day at work, had a nice chat with Ian who is a co-founder of Joltz a company I will be writing an article about for Bitcoinnews, ran some wind sprints, and got ice cream after a nice dinner with my sister Stela, my wife Paige, and my daughter Sloan.\n\nI'll finish today by working on an article for Voltage which is a company I interviewed yesterday.\n\n**Voltage Cloud: Electrifying Bitcoin's Future with Lightning**\n\nWhen it comes to layer 2 Bitcoin infrastructure, one company has carved out a reputation for making Lightning transactions faster, cheaper, and more accessible: **Voltage Cloud**. The company was founded by a longtime Bitcoiner, [Graham Krizek](https://x.com/gkrizek), who was annoyed with the inefficiencies of building Bitcoin applications from scratch.\n\n\"I got kind of frustrated in just the state of how people have been going about building applications on top of Bitcoin,\" said Graham, who has been in Bitcoin since 2012. \"I wanted basically a cloud service where you click a button and have a Bitcoin node, and a Lightning node running instantly without having to do all of the work to set it up from scratch every single time.\"\n\nThat frustration ignited what would become one of the largest Lightning Network infrastructure providers. Today, Voltage empowers individuals and businesses to seamlessly process Bitcoin transactions by simplifying access to the Lightning Network. As a powerful Layer 2 solution, Lightning has the potential to not only scale Bitcoin but also reshape global payments.\n\nYet, challenges remain. Lightning's trade-offs often force users to balance convenience and sovereignty. Custodial wallets streamline transactions but come at the cost of privacy. Voltage offers an alternative - allowing users to run private nodes, ensuring full control over their funds without compromising security or autonomy.\n\nTheir focus? Businesses moving significant Bitcoin volume: exchanges, payment processors, and financial institutions looking to tap into Bitcoin's efficiency. \"We work with folks like exchanges, neo-banks, payment processors - basically anyone that moves a significant amount of Bitcoin today,\" Graham explained. \"We can save them millions of dollars in on-chain transaction fees over a year's time.\"\n\nTheir recent partnership with crypto platform Unbanked demonstrates this value. By leveraging Lightning, Voltage can help businesses cut settlement times from days to seconds while dramatically reducing costs. Traditional finance is next in their sights. \"We're starting to expand more into traditional finance to really bring the same amount of speed and cost savings that exists inside of Bitcoin and bring it into more traditional payments,\" Graham noted.\n\nOne of the cool things about Voltage is \"Your node is private by default. You own the keys, the transactions, everything,\" Graham emphasized. However, for businesses wanting simplicity, Voltage offers managed services without forcing custodial compromises.\n\nWhile many Lightning services force users to choose between convenience and control, Voltage takes a different approach. \"We give our users the maximum amount of control that we possibly can,\" Graham emphasized. \"Their node is very private by default and they have complete control over both their funds, their transactions, everything that happens.\"\n\nLooking ahead to 2025, Voltage sees some major opportunities on the horizon: \"Stablecoins across the world are sort of the number one most used use case for crypto in general right now,\" Graham observed. \"If we can bring that same value of literally the fastest and cheapest method of moving value, if we can do that for both stablecoins as well as Bitcoin, I think that's a huge opportunity.\"\n\nAnother interesting aspect of why lightning might beat out other chains has to do with artificial intelligence. The AI angle is particularly compelling because as Graham explains it, \"Lightning can basically move as fast as these AI agents themselves. There's not like this bottleneck of the blockchain that slows down some of these things\" because with lightning the machines do not have to wait for a block to confirm the transactions.\n\nCritics often claim Lightning adoption is low, but Graham pushes back: \"Lightning is very, very different given that it's a peer-to-peer network and not a blockchain. Any blockchains have public ledgers where you can see exactly how much is being moved. In Lightning, that is all private information strictly between the sender and receiver.\" To address this, Voltage is partnering with Fidelity on a report coming out soon that will illuminate Lightning's true adoption metrics.\n\nIf Graham could ask Bitcoin's creator one question? \"I would love to understand Satoshi's take on scaling Bitcoin. Whether it was back during the Block Size Wars when everyone was talking about increasing the blocks, even today with Lightning, these Fedimints - there's a whole bunch of different proposals on how we scale this to the masses.\"\n\nWhile that question may never be answered by Satoshi himself, Voltage isn't waiting around. They're building the infrastructure that will make Bitcoin and Lightning the foundation of tomorrow's financial system. As Graham puts it: \"There's no better time to be building in this space than right now.\"\n\nThrough companies like Voltage building the vital infrastructure today, Lightning is evolving from Bitcoin's ambitious scaling solution into the backbone of a faster, more efficient global financial system.",
  "wordCount": 872,
  "readingTime": 3.840566037735849,
  "claps": 0,
  "voters": 0
}