{
  "id": "1a011b7492d7",
  "title": "My Name Is Conor And I am A Dopamine Addict",
  "createdAt": "2021-12-06 03:26:12",
  "tags": [
    "uncertainty",
    "bitcoin",
    "kindness",
    "love",
    "technology"
  ],
  "url": "https://chepenikconor.medium.com/my-name-is-conor-and-i-am-a-dopamine-addict-1a011b7492d7",
  "content": "# My Name Is Conor And I am A Dopamine Addict\n\nIt's really hard to wake up and not immediately check my phone. Crypto prices, new Twitter posts, exciting podcasts, and so much more all consume my mind from the moment I wake up until I go to sleep. Without my iPhone, I feel irritable and naked. Crazy to think humans have become cyborgs because of smartphones. We can order food, hail a car, and transfer value to anyone in the else world who is also using the internet. The possibilities are endless. Most humans haven't started putting hardware into their bodies, but the stuff Elon Musk is doing with Nueralink probably isn't far off. While part of me is excited for the enhancements this kind of technology will bring another part of me worries about what it will do to humanity. One thing that is cool about learning is the more you learn the more questions you have. I have no idea what the future holds but I know there is a high probability chance that Bitcoin becomes a global store of value, Tesla (or a similar car company) will have 99.9% of the world using self-driving cars, humans will get fatter, and we will likely become even more dependent on the dopamine stimulating credit card size technology we all carry around every day. One day it might even become the size of a piece of rice and be implanted in our spine.\n\nI'm not trying to say humanity doesn't have hope. Technology can be used for amazing stuff. I installed the fluent browser extension to learn more Spanish. I use the Nike Run Club app to log my runs and talk shit/stay motivated with my best friends. Brave Browser helps me block ad trackers and generates me Basic Attention Tokens (B.A.T) for using it. These are a few examples of technology use that helps me do positive stuff. That said, I need to be better about putting my phone down and taking breaks. I haven't seriously tried to take a technology break or just haven't had the willpower. Maybe writing about it will help me do so.\n\nToday when I got back to my apartment my girlfriend had cleaned everything and our apartment was spotless. She even lit a candle and when I walked in I felt so grateful to feel loved and at home. By the time I got back she was out to dinner with a friend so I immediately texted her I fucking love you so much. I honestly got emotional and shed a few tears because I was reminded how happy it feels to truly be grateful.\n\nThis post might feel like it is jumping around a lot and that's because it's the best way I could describe how my brain feels with the plethora of dopamine my smartphone provides. It makes me feel so many different emotions: happy, sad, jealous, toxic (if that's even an emotion lol), horny, proud, frustrated, and everything in between. If you're reading this and worried about all the doom and gloom on the internet stop and remind yourself of the things you have in your own life that make you happy. Friends, family, relationships with other human beings. It's easy to lose sight of these things when we are surrounded by the incredible things technology brings. I'm excited \"influencers\" can monetize their own brand with technology, but it sucks corporations can exploit humans in so many ways with technology. It is good to take breaks from all the dopamine having a smartphone provides. Go out in nature, talk to others, read a book, and avoid the toxic people, products, and places that get advertised to us constantly by big tech and the mainstream media. I know I'm far from perfect but I am trying to get a little better every single day. If you're wondering how to start using technology for good you should start a blog, create a podcast, volunteer in your local community, or even better: do something that truly excites you because you want to give back to the world and leave it better than you found it. No human is perfect despite what others might tell you. When in doubt take a deep breath, remember to be grateful, and always remember you never know what someone else might be going through so choose kindness.\n\n12/5/21\n\nConor Jay Chepenik",
  "wordCount": 734,
  "readingTime": 2.769811320754717,
  "claps": 2,
  "voters": 2
}