{
  "id": "1a64e8a85908",
  "title": "Day 616",
  "createdAt": "2023-11-29 03:23:50",
  "tags": [
    "gold-rush",
    "ai",
    "compute",
    "frameworks",
    "making-fiat"
  ],
  "url": "https://chepenikconor.medium.com/day-616-1a64e8a85908",
  "content": "# Day 616\n\nDuring the Gold Rush in the mid-19th century, thousands flocked to California, dreaming of striking it rich. But here's the twist - it wasn't just the gold prospectors who found fortune; it was those savvy enough to sell the tools of the trade.\n\n![](https://miro.medium.com/0*WcTReafOyTP0hoG8)\n\nThink of it as the \"picks and shovels\" strategy. While many miners spent day and night sifting through rivers and dirt, often ending up with little to show for it, others recognized a different opportunity. They started businesses to supply the miners with necessary equipment - pickaxes, shovels, pans, and the like. These entrepreneurs tapped into a guaranteed demand, providing essential tools for the gold seekers.\n\nThis concept applies to many things in life today. For AI the obvious answer would be sell the compute resources. The core idea is to identify rising trends, then supply the infrastructure and tools needed to power that trend. This can make for a steady, lucrative business model compared to chasing the trend itself.\n\nAnyways, just something to think about. Speaking of AI though this tool [neets](https://neets.ai/) is amazing. You can make tons of celebrities say literally anything. I love uncensored AI.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1729695979253665972%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n11/28/23\n\nConor Jay Chepenik",
  "wordCount": 198,
  "readingTime": 0.9471698113207547,
  "claps": 0,
  "voters": 0
}