{
  "id": "1c54911469f4",
  "title": "Day 103",
  "createdAt": "2022-07-03 23:02:59",
  "tags": [
    "podcast",
    "celebrity",
    "comedy",
    "life",
    "children"
  ],
  "url": "https://chepenikconor.medium.com/day-103-1c54911469f4",
  "content": "# Day 103\n\nPlayed 9 this morning, then crushed a Podcast with my father, and followed that up with a taylor ham, egg, and cheese on an everything bagel. Needless to say, life is pretty damn good right now. Did get sun burnt going out on the boat with my girlfriend and her family but it was a great day. Nothing like celebrating America's independence.\n\n![](https://miro.medium.com/1*FjuEO4X3z40wHNNd5xKyVg.jpeg)\n\nThis was the flag I was talking about yesterday. Seeing it gave me a good feeling for the future. Also been thinking about ways to spread the good word of my podcast and I've got some ideas. Need to look into buying some stickers with my Podcast logo on them and having a little QR code attached people can scan. I'll post them around the Boston/Cambridge area so that way people will pass it everyday and maybe give it a listen. I had a really enjoyable time talking with my Dad today about what having a child is like. Definitely a life changing experience but one I'm excited for.\n\nCrazy to think my child will be able to look back and really understand what I was like as a young adult via this medium, my podcast, and my social media profiles. It would have been cool to see my parents and grandparents online profiles but at the same time I think it would've force me to grow up a little faster. Took me a long time to realize those raising me were also humans just trying to figure out this life thing we all have to do🤣. I don't know, the world changes and us humans change with it. You can either adapt or get left behind.\n\nWas disrespecting sunscreen on the podcast with my Dad today but I still got mad burnt. Could've been too many seed oils in my diet. Not saying sunscreen would've solved my problems, but maybe it's karma for bad mouthing sunscreens and the chemicals in it. Or maybe I just got to get more strict with the foods I put in my body.\n\nGoing to be driving back up to Boston tomorrow on the actual 4th of July. Wonder if I will see fireworks on my way up. Hopefully traffic is light since most people will be celebrating. Luckily, the 4 hours in the car should give me some time to practice my stand up set on my girlfriend and get ready for the big show on the 5th. Exciting times anon :D Got a good feeling this is the start of something big.\n\n7/3/22\n\nConor Jay",
  "wordCount": 427,
  "readingTime": 1.8113207547169812,
  "claps": 0,
  "voters": 0
}