{
  "id": "1ce0f2e19569",
  "title": "Day 40",
  "createdAt": "2022-05-01 15:49:49",
  "tags": [
    "orange-coin",
    "correspondents-dinner",
    "trevor-noah",
    "comedy",
    "critical-thinkers"
  ],
  "url": "https://chepenikconor.medium.com/day-40-1ce0f2e19569",
  "content": "# Day 40\n\n![](https://miro.medium.com/1*p8FPGxQEfJNcsNzjHfWv9w.jpeg)\n\nStarted my morning by watching Trevor Noah's correspondent dinner [stand up comedy/speech](https://www.youtube.com/watch?v=f5J9E1KNJ5M). Powerful stuff: God bless comedy. Making people laugh is such a blessing. I thought Trevor did a good job using truth to point out policies that didn't make sense and encroached on freedom. Looking back these policies also failed miserably and caused a lot of pain and suffering. We need more people pushing for exercise and eating healthy rather than draconian lockdowns. I didn't agree with everything Trevor said but that is the beauty of America. People can disagree on something and still find value in the other's perspective. No matter how much I might disagree with someone's opinion I can't censor their speech. Which I would not want to do anyways, but if you don't acknowledge the importance of freedom of speech one day you will lose it. Freedom of speech is vital to a functional democracy. I would have loved to have seen Trevor poke fun at the new department of disinformation or \"Ministry of Truth\" as many on social media are calling it. There was one part where Trevor joked about how you could check Google to get an answer and that was the one part I didn't agree with. Google is a great tool, but very few people truly understand what the algorithm is doing on the backend. A search result will yield millions of results but people will only look at the top 3. Not to mention the ads you have to avoid at the top when you search🙄  Taking words on a screen with a grain of salt is both important and good for your sanity. It's impossible to know someone's agenda/bias when you see something online. We have come so far as a species and we've regressed in many ways as well. Truth, Love, Life, Liberty, energy in its purest form will win. Another way of putting it is whatever you want to call \"good\" is going to win out, but that can be hard to see especially when social media is filled with so much doom and gloom. The more critical thinkers the world ends up with the better. Saylor put it perfectly in this quote [tweet](https://twitter.com/saylor/status/1520756426242764805?s=20&t=rkKpVq1kj45D7EDiAp_b0Q), \"You are free to choose money that empowers you rather than suffer from money that impoverishes you.\"\n\nComedy feels visceral. Watching Trevor crack jokes in front of and about the most powerful people in Washington D.C was awesome. I felt like I was in the room, not just watching from my living room. While the world seems more authoritarian by the day, I'm grateful to live in the freest country according to its constitution. The idea you can make a living and find opportunities if you are willing to work hard is an idea that will resonate with anyone who is good deep down. This is why so many people come to the U.S.A. To find opportunity. Anyone who is willing to use their energy, their life force, their being to do something, would prefer to spend it doing something they love. I want to see America enabling people to find good opportunities. This is how you create win-win situations for everyone. People in power who impose top-down control have had disasters results. Meanwhile, bottom-up Bitcoin has grown to be over a trillion-dollar asset at times and benefitted greatly from the fact no one is being forced to use the network. Opt into math and open source software rather than money backed by the threat of violence. From a first principals perspective, it really is that simple. Don't overcomplicate it anon. Study, learn, and think critically about what you want to hold your lives energy in. A money that is programmed to debase or a money that is programmed to never exceed 21 million coins? I choose the orange coin personally :)\n\nNot financial advice: A.D.Y.O.R!\n\n5/1/22\n\nConor Jay Chepenik",
  "wordCount": 653,
  "readingTime": 2.6641509433962267,
  "claps": 0,
  "voters": 0
}