{
  "id": "d56afd54ac7e",
  "title": "Chep’s “Online” Personal Diary",
  "createdAt": "2020-11-17 19:51:48",
  "tags": [
    "diary",
    "tech",
    "binmucker",
    "personal-growth",
    "humor"
  ],
  "url": "https://chepenikconor.medium.com/cheps-online-personal-diary-d56afd54ac7e",
  "content": "Chep's \"Online\" Personal Diary\n\nYou might be thinking to yourself who would want to put their personal Diary online and to that, I say a true Binmucker. You see I've been writing in a diary since a young age and they are great, insightful, and rewarding to go back and read. However, they also taught me an important lesson at a young age.\n\nWhen I was a boy my father purchased journals for my sisters and me. He said we should write down our experiences so when we grow up we can look back and know what we were thinking. I thought to myself \"HELL YEA\". You might be thinking what kind of pre-pubescent kid would be so excited about journaling, but for me the journal, diary, book of empty paper, well that was my therapy.\n\nSo for the next three months, every night, I would write my feelings in that journal. Things were going great and even though I didn't know what mental health was as a child my mental health was on fleek. (Sidenote: SOMETIMES PEOPLE JUST NEED TO VENT AND LET OUT THEIR EMOTIONS AND THAT'S OKAY. DON'T BE AFRAID TO JUST LISTEN) That was until my Dad told my sisters and me that he was really hurt by what some of us had been writing in our journals. Well as you can imagine I WAS HURT. I had written really mean things about my parents. (My parents got divorced when I was around ten.)\n\nHonestly, I don't even remember what I wrote. It was so long ago and my parents were both loving and kind and always put my sisters and me above their petty drama. I just felt upset and angry that my Dad told us he wouldn't read our diary and read it anyway.\n\nAs much as it hurt, my Father and I both walked away from that situation stronger. He got a true glimpse into how his actions were making me feel and after that, he never read my journal again. I came to understand that if my father could read my most honest thoughts and still love me then I must be one lucky individual to have someone who loves me no matter what.\n\nIt was not apparent at first, but as I reflected I realized those mean thoughts aren't worth holding onto. I get no pleasure from going back and reading about how pissed off and upset I was at my parents for not sticking together. As a child, it seems your parents are the perfect example of what a human being should be. So of course I was angry when they split. As people get older it becomes apparent everyone is trying to figure out this difficult thing we call life. (Luckily, humans get pre-school, elementary school, middle school, high school, and college in some cases before being thrust into the real world)\n\nMy biggest takeaway from all this is that the true joy of journaling comes from the happy entries that make you feel nostalgic. Thus, I try to only write about my most positive and curious thoughts. I'm not perfect and I get angry and jot down negative thoughts on paper because I need to vent. The difference is now I burn those sheets of paper because I don't want to hold on to those negative feelings anymore.\n\nAs I watch technology grow at rapid rates I am filled with so many emotions. Joy, fear, anticipation, curiosity, even envy. Envy that while I might get to see some incredible things in my lifetime I can only imagine what my ancestors will be fortunate enough to live through. I also fear that the human race could kill itself off if we continue to drain all the resources this precious planet offers, but I'm an optimist and like to think that the good in humanity will prevail before humanity destroys Earth.\n\nUltimately, I've come to realize that the only thing I want in my life is to be happy. A lot of different things make me happy like writing in this online diary, going for runs, accomplishing my goals, eating delicious food, mucking bin, fostering relationships with people I just met and people I love, spreading happiness to others, etc. My hope is with this diary, journal, blank webpage that allows me to write on it, is that I can spread joy to others and create an online time capsule that will bring me joy to come back and read. My goals have changed throughout my life and unfortunately, I never accomplished my main goal as a child which was to be a Quarter Back in the NFL. However, I did get to play four years of college football and forged friendships that will last a lifetime. So if you are a child, adult, elderly person, basically any human being, set your goals high and make sure you appreciate the journey. We are only on this Earth for a short period of time so we might as well do everything in our power to enjoy it. Setting massive goals and not reaching them is okay because even if you don't end up throwing footballs for millions of dollars you can still look back on your life and be content at the incredible journey you've been on.\n\n11/17/20\n\nConor Jay Chepenik",
  "wordCount": 892,
  "readingTime": 3.3660377358490567,
  "claps": 0,
  "voters": 0
}