{
  "id": "2117bcaf8a60",
  "title": "Day 150",
  "createdAt": "2022-08-19 17:58:10",
  "tags": [
    "rearrange",
    "cast-iron",
    "life",
    "learning",
    "productive"
  ],
  "url": "https://chepenikconor.medium.com/day-150-2117bcaf8a60",
  "content": "# Day 150\n\nMy girlfriend had mixed feelings about the switch up. Hahahahahaha she appreciated that I did all the hard work, but said she needs to be in control. Thus, this whole morning she has been moving stuff around the apartment making sure everything is arranged how she likes it. As you can imagine it looks even better now, but I'm proud to say I did the heavy lifting. It feels really good being in a space where things are arranged neatly. Our apartment feels so much bigger now that the living room is essentially the master and we have two side rooms for work and television. While I didn't hate the way I had everything set up my girlfriend improved the space dramatically.\n\nFeels good to be alive this fine Friday. Going to make some more dials and go crush a run afterwards. I keep this imessage group chat called Proof Of Work where my buddies and I post our runs. My friend Keenan had been lacking, but after me consistently posting my runs the man has picked it up and posted some even more solid runs. Now I'm more motivated to keep running so I can keep up with Keenan. Working towards a common goal with others is powerful. It doesn't even have to be a defined goal per se. My buddies and I just want to be healthier so we all post runs. No end goal in sight, but when I'm lacking and I see a good friend grinding it reminds me \"hey time to get my fat ass moving so I can live a long life\".\n\nCooked a nice breakfast for my girlfriend and me this morning. I enjoy cooking. Buying a cast iron to cook in has definitely been one of the best decisions I've made. Easy to clean and easy to make stuff with. Not to mention I hear teflon is pretty toxic. Anyways, not much else to report. Looking forward to a nice relaxing weekend of learning, reading, golfing, and running.\n\nAlso, 150 days of writing completed. Feels good to commit to this. 215 more days until it will have officially been a year. I think taking the time to put my thoughts down, even if mundane and boring thoughts get included frequently, is important. Not everything is a profound discovery, but often ideas in my head seem so powerful and then I try to type them out and I'm like damn that wasn't as powerful as I thought. Sometimes they are, but many take a lot of time to flesh out and think through. If you are a thinker you can be a writer and since we all think it seems we can all be writers anon. It is never to late to learn new stuff. :D\n\n![Photo by Sebastian Coman Photography from Pexels: [https://www.pexels.com/photo/cooked-vegetable-on-pan-3510155/](https://www.pexels.com/photo/cooked-vegetable-on-pan-3510155/)](https://miro.medium.com/0*92WbdXJXd9zCDKE3)\n\n8/19/22\n\nConor Jay Chepenik",
  "wordCount": 469,
  "readingTime": 1.969811320754717,
  "claps": 0,
  "voters": 0
}