{
  "id": "220b92b12518",
  "title": "Mid March Thoughts",
  "createdAt": "2021-03-16 18:32:17",
  "tags": [
    "surrealism",
    "random-thoughts",
    "writing",
    "life",
    "adult"
  ],
  "url": "https://chepenikconor.medium.com/mid-march-thoughts-220b92b12518",
  "content": "# Mid March Thoughts\n\nWell it's been a couple of months so I wanted to write something. This might come off as a stream of consciousness piece and that's because it is. Amazing how life starts to move so much quicker the older you get. I guess everyone has a different gauge for time and they say time feels like it is moving quicker when you're in the zone. I guess being an adult gives me this flexibility since I have the freedom to do as I please when I please. Not sure if I would necessarily say I'm in the zone 24/7, but I do find myself doing things for me rather than for an authority figure which has been awesome.\n\nI love sports and I'm grateful for the lessons and friends I acquired by playing them. The downside was I hated being bossed around. No Coach is perfect and I was lucky enough to work with some incredible ones throughout my athletic career. Even the ones who weren't up to par with the rest I have nothing bad to say about them. I just recognize that authority annoys me for lack of a better word. I'm at my best when someone is guiding me with constructive criticism rather than cursing me to be better. I've found this to be true as well in my sales career thus far. (Shout out my current company because they do a great job of boosting my morale and being a resource not an authorative figure). As I get older I imagine I'll be in more leadership positions and I plan to always do my best to be a resource not a nusaunce for anyone I lead. It's amazing how much better people perform when they're having fun with something. The more stressed people get the worse they perform the less results you see.\n\nWhen I still played sports I hated running. I know cardio is super healthy for the mind and heart, but I despised having to run because a coach deemed it important. Now that I'm done with sports I run all the time because it makes me feel good. Something about not having anyone tell me to do it makes it awesome. I guess it's because I'm running for myself and my own health. Nothing against working hard with a team to achieve a greater good. Hell I did for 15+ years playing organized sports my entire adolescence, but when I played my final game something clicked and I realized if I ever worked out again it would be for myself. I know this piece has been all over the place, but if you take one thing away from it I hope it's that doing things for yourself and because you want to do them feels a lot better than justifying doing things for others in your head. Life passes a lot quicker when your actions are for yourself rather than for pleasing others.\n\nI'm sure some people will disagree with this, but I've always found every action ever taken to be in a person's own self-interest. Even saving someones life by risking their own people do because they either A. cherish the person so much they can't stand to see them die such as a child, partner, family member, etc. or B. You want your legacy to live on or C. a combination of the two. I don't think this is a bad thing I just think it's the way our brains have been programmed for survival. Thus, you might as well take actions that you know will make you feel happy and fulfilled rather than ones that will give you short term comfort, but long term suffering like putting up with a coach/ boss you hate because you need to keep a job or don't want to upset someone close to you. Do things for yourself that excite you and your life will be a lot better.\n\nEasier said than done, but as I get older I'm getting much better at taking my own advice lol.\n\nConor Jay Chepenik\n\n3/16/2020",
  "wordCount": 682,
  "readingTime": 2.5735849056603772,
  "claps": 0,
  "voters": 0
}