{
  "id": "220be4851b69",
  "title": "Day 329",
  "createdAt": "2023-02-15 04:21:02",
  "tags": [
    "football",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-329-220be4851b69",
  "content": "# Day 329\n\nAfter a personal blog post last night I would like to focus on more professional work today. So I'm going to use today's post to make some progress, maybe even finish up, my football post about Bitcoin. I was thinking about how one day they will be able to feed all these posts to an AI in order to better understand my psychological profile, but humans change constantly so I'm not that worried. I am a different person than I was a year ago and I'm sure I'll be a different person by the time that technology exists. Hell it might exist already and is just not available to the public. I could see the intelligence agencies pulling data from various social media profiles to create a psyche profile for all the American citizens on social media😂 . Partly joking but to be honest it would not suprise me if they had some sort of program like this so I'm not that worried about writing long form on Medium. Anyways...\n\n...\n\n**Title: How Football Helped Me Understand Bitcoin**\n\nBeing part of a team can provide valuable experiences that extend beyond the sport or activity. In my case, one of my teammates introduced me to Bitcoin in 2017. We watched a documentary called [\"Baking On Bitcoin\"](https://youtu.be/6jSm9vTBGKU) that convinced me decentralization was an important thing to have in our financial system. Little did I know this introduction would change my life. After the documentary I bought a variety of cryptocurrencies on Coinbase because as any wanna-be investor knows \"diversification is key.\" It did occur to me that using a third party to buy something that helps eliminate third parties was odd. Unfortunately, I ignored the thought instead of digging deeper. There is definitely value in exchanges that allow people to exchange their fiat currency for Bitcoin. However, the true beauty lies in the fact anyone can create a wallet in order to sell their goods and services for bitcoin. Opting out of saving in fiat currency and buying Bitcoin with that money is commendable. Spinning up your own node and stacking sats by selling your labor, goods, or expertise is even more badass.\n\nIt was not until I hung my football cleats up three years later that I started to understand the difference between Bitcoin and every other token in the space. I was looking for something to fill the void left in my heart after my football career was over. Luckily, the Bitcoin rabbit hole was there to greet me. Games and sports provide a way for individuals to unwind, relieve stress, improve cognitive function, and foster social connections. Without my favorite game, I was lost. Football helped me get an education at a solid university, it helped me make some of the best friends I still have today, and it helped me stay in shape. I've found going down the Bitcoin rabbit hole has done all of those things and then some. For example, I've started learning how to code, I've met tons of new friends online and in-person, I've become more religious, I started a family, and even tried fasting after hearing about the benefits on a bitcoin podcast. In my experience fasting does seem to offer increased focus. It's weird to think that computer code can have such a profound and positive impact on both individuals and civilization as a whole. Most computer code today is set up to polarize and [separate people into echo chambers](https://youtu.be/3E7hkPZ-HTk). Bitcoin does the opposite. It connects complete strangers and allows them to barter and exchange value without any third party. The computer code is completely open source and brings strangers from around the world together to work towards a decentralized financial system. This is the key, because, as Henry Kissinger said,\n\n> _\"Who controls the food supply controls the people; who controls the energy can control whole continents; who controls money can control the world.\"_\n\nMakes you wonder what our world would look like if everyone controlled the money instead of Central Bankers. I've found Bitcoin to be a bit of a paradox in the sense the community is both global and inclusive, and local and exclusive. As someone who has been on many different teams, Team Bitcoin is unlike any team I've had the pleasure of participating in. Anyone can run a Bitcoin node with an old laptop to send and receive transactions. At the same time, if you venture into Bitcoin Twitter and start trying to orange wash your shit-coin you will quickly get to experience the wrath of the cyber hornets.\n\n**Reframing Success: Beyond Money, Wins, and Losses**\n\nThe environment in which one is born heavily influences their unit of account. One's life circumstances play a significant role in shaping their beliefs, values, and norms. In football, success is commonly defined by wins and losses. However, every player knows that a team's final record is not the only indicator of success. The strong bonds formed between teammates can last a lifetime. Nevertheless, it is still nice to have a straightforward way to determine a team's performance for a given season. Teams with positive records typically form stronger bonds. In life, financial wealth is often viewed as the ultimate measure of success, despite the flaws inherent in our monetary system that create an unequal playing field. People frequently prioritize material possessions, such as cars, clothing, and homes, while incurring debt to acquire them. It is crucial to remember that health, fulfilling work, personal purpose, and meaningful relationships are more essential elements of a meaningful life. Attempting to optimize one's life to appear wealthy in a corrupt system is unlikely to bring long-term happiness, especially as inflation (or currency debasement, as I like to call it) increases the cost of desirable items.\n\nBitcoin operates on a level playing field, without giving undue advantages to the wealthiest. Both football and Bitcoin have the potential to transform people's perception of success by shifting their personal yardstick to more meaningful standards. On the football field, socio-economic status is irrelevant. A team's chemistry, hard work, and the coach's decision-making are the most critical factors in determining the outcome of a game. While referees can make mistakes, it is still relatively fair. Achieving this level of fairness in life is challenging since traditional financial systems often favor the wealthy. Bitcoin, on the other hand, operates on a fair and equal basis, without providing any unjust benefits to the wealthy. Bitcoin creates a sense of fairness where the network treats everyone equally, regardless of their background or resources. This is the true beauty of Bitcoin. Anyone can verify for themselves that the game they are playing has rules that have not been violated without the ambiguity that life often presents.\n\n**My Personal Journey**\n\nI compare my journey in the crypto space to moving from a junior varsity team to a varsity team. When I first joined the crypto space, I was like a junior varsity player - enthusiastic but unprepared. After six years of hard work and research, I am now part of the varsity team of Bitcoin Maximalists who can confidently explain why Bitcoin is the true innovation and other digital currencies are simply \"fiat 2.0\".\n\nBeing part of the varsity team, similar to any sports team, requires dedication and expertise. It's not easy to fully understand and appreciate Bitcoin's value when there is an overload of alt-coin marketing and vaporware tokens promoted by fraudsters looking to profit from the hype surrounding the crypto space. There is a big level of knowledge arbitrage in the crypto space between newbies and seasoned veterans and no shortage of grifters looking to take advantage of this.\n\nThrough thousands of hours of proof of work, I have come to the realization that only Bitcoin has the potential to make a meaningful impact on the world in a way that no other digital currency or token can. Like any successful varsity team, Bitcoin maximalists have a responsibility to educate and develop the junior varsity team and ensure the program's continued success in the future.\n\nThere are a variety of stories about those who have entered the crypto space, including those who have seen Bitcoin's innovation early on, made significant profits, but then fallen victim to alt-coins. We need to support those who haven't yet put in the effort to understand the differences between Bitcoin and other digital currencies.\n\nBeing part of the Bitcoin community can be challenging, but it's also where strong bonds and friendships are forged. Choosing to be a Bitcoin maximalist is a virtuous position, allowing one to have a clear conscience and avoid the dishonest practices of fraudsters promoting D.I.N.O tokens.\n\nAs Bitcoin continues to gain acceptance and educational resources become more widely available, it's essential to keep promoting the message that Bitcoin maximalism is the most ethical approach. We must continue to educate and support those who are committed to understanding Bitcoin, while disregarding those who are just in it for the short-term gains. Ultimately, the junior varsity team will be running the show, and it's our responsibility to prepare them for the task.\n\nThinking like this is a low-time preference move. Something prevalent in both Bitcoin and football. For example, it does not matter how many championships you win, there is always another one to go after next season. Just look at Tom Brady, who has also fallen victim to the broader crypto space. Tom won numerous championships in football and yet still strives to win more. He just announced his retirement and I remain hopeful now that he has decided to hang up his cleats, he can learn from his mistakes and see that Bitcoin only is the way.\n\nIf the planet is going to get on a Bitcoin standard it is going to involve a whole bunch of proof of work, both literally and figuratively. I was fortunate enough to attend a [Bitcoin dinner for Mass Adoption](https://youtu.be/AJrFNsNElUA?t=1723) and at that dinner everyone went around the table talking about their experience with Bitcoin. Someone brought up an amazing Odell quote that goes \"I'm bullish on Bitcoin but more bullish on Bitcoiners\". I can't think of a better way to frame it. Regardless of what happens with the price of Bitcoin, the friendships and connections I've made through this digital currency will always hold value. When it was my turn to present I talked about the impact Mass Adoption has had on my life. I had no idea going to a Bitcoin meetup would help me find a group of people committed to making sure future generations don't have to grow up under a slave system that Central Banks are frothing at the mouth to implement with their CBDCs. Going to my monthly Bitcoin meetups is truly a cathartic experience. I'll never stop laughing about how a single white paper has had such a profound impact on the lives of those who have embraced this new form of money.\n\nThis is my personal anecdotal experience so don't trust me; go verify for yourself. With that disclaimer I can confidently say I've seen Bitcoiners to be more invested in the growth and success of their community members, than in the success of the technology itself. Which is not to say that we aren't invested in making sure the technology succeeds. Bitcoin just helps you realize that the most important things in life don't necessarily come from having a certain amount of wealth. Bitcoiners care deeply about fixing the world, about educating others, and about righting the wrongs that are becoming more and more apparent by the day. Many, myself included, came to Bitcoin because number go up and while I can't speak for everyone the reason I stayed is because I believe that Bitcoin is the best hope humanity has to fix the world.\n\nSo far in 2023 we've seen what looks to be the start of another bull market. I can confidently say after being humbled through two cycles I have absolutely no idea (in the short term) which way the direction of this coin is going in USD purchasing power terms. What I do know is that when bitcoin is in its dead phase you don't see as many \"JV players\" coming to celebrate with the true Bitcoiners. At least not until the next bull market. So if this is a fake pump remember the bear market is a great time to build. Bitcoiners are a unique breed of people and the bear market is the time when you find your team, start writing, coding, podcasting, hosting a Bitcoin meetup, or whatever else floats your boat. If it turns out this is the start of the next bull market then do all these things and stay humble. Some would call Bitcoin a mind virus because those who go down the rabbit hole can't stop talking about. I'd argue Bitcoin is the antidote to the problems of fiat nihalism. It's hard to be passionate about something if you think everything is pointless! Those on the team Bitcoin don't have that problem. Bitcoiners start taking more self-sovereignty, save more, create value, and work towards a better future. I've been on a lot of teams throughout my life and I'm grateful I found this one so I don't give into the nihilism team fiat seems to be poisoning the world with. Of course, the transition is far from over and the mainstream media will never stop painting Bitcoin as either dead or a bubble. It will take a whole new set of media outlets filled with Bitcoiners who understand the potential for true decentralization and the benefits it brings. I'm confident these outlets will replace the old ones in due time. So whatever happens next in 2023 let's remain patient, teach those who have sinned with their shitcoins, and ignore those who are beyond saving. Bitcoin is not just a new form of money, it's a community of individuals who strive for self-sovereignty, savings, and a better future. It's a team worth being a part of.\n\n...\n\nOkay one more read tomorrow and I'm submitting that bad boy to the editors. Also wanted to mention I had a successful Valentine's Day shout out my Grandma Allegood for helping me get a gift. :)\n\n2/14/23\n\nConor Jay Chepenik",
  "wordCount": 2391,
  "readingTime": 9.022641509433962,
  "claps": 15,
  "voters": 0
}