{
  "id": "2546d712be2b",
  "title": "Day 767",
  "createdAt": "2024-04-28 01:32:36",
  "tags": [
    "the-sovereign-individual",
    "cuck-bucks",
    "bitcoin",
    "new-nation-states",
    "tyranny"
  ],
  "url": "https://chepenikconor.medium.com/day-767-2546d712be2b",
  "content": "# Day 767\n\nThe core argument of \"The Sovereign Individual\" suggests that governments will likely oppose giving up control, seeing it as a threat to their entrenched authority and traditional functions. In contrast, the book champions the benefits of decentralization - empowering individuals and non-state actors - which can lead to significant gains such as driving innovation, boosting personal freedoms, and developing more effective solutions across diverse sectors. Remarkably, the book foresaw the pivotal role of public/private key cryptography in reducing the ability of nation-states to forcibly charge for services that individuals might not willingly pay for otherwise.\n\nThis conflict, between governmental desires for control and the potential rewards of decentralization, is pivotal in ongoing debates and policy decisions related to emerging technologies, global trends, and the changing roles of governments. Such discussions often predict a fraught transition, characterized by contentious and potentially disruptive responses from existing power structures.\n\nThis perspective is especially relevant given recent developments in how different U.S. regulatory bodies classify Bitcoin, each with distinct implications for users and the broader financial ecosystem:\n\n- The FBI treats cryptocurrency as money, enabling charges like money laundering.\n- The IRS defines it as property, subjecting it to capital gains taxes.\n- The SEC regards it as a security, which allows them to regulate and potentially litigate against cryptocurrency exchanges.\n- The CFTC categorizes it as a commodity, restricting its use as a currency.\n\nThese conflicting classifications underscore the vicious power struggle among agencies vying for control over this disruptive innovation. These recent moves by Government agencies illustrate the broader theme of \"sealing the exits\" - efforts by authorities to maintain control over new and potentially disruptive innovations that challenge their dominance. In the face of such dynamics, the robustness of the U.S. judicial system becomes crucial, as it plays a pivotal role in upholding the rule of law and ensuring fair and consistent governance amidst these evolving challenges posed by emerging technologies.\n\n![[https://x.com/CaitlinLong_/status/1784292300270575730](https://x.com/CaitlinLong_/status/1784292300270575730)](https://miro.medium.com/1*v8MHxqafMm-LrEanzAvrNw.png)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/L0laL33tz/status/1784340810881744981&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nOf course none of this is over yet. I am of the belief they can slow the adoption of Bitcoin but they'll never stop it completely. Thus, it's good to share other perspectives. Here is one from a lawyer which makes me hopeful the courts can help sort this government overeach out.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/JoeCarlasare/status/1784341557203628164&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nPrepare accordingly. Be smart about what you write and share. Don't accept tyranny. Stand up for what you believe in. I don't need permission from a nation-state to store my wealth in non-cucked money. Understand that's what fiat is. Literal cuck bucks. Fiat money has been designed to steal purchasing power from everyone to benefit a select few who control it. Choose financial autonomy. Rights are not granted, they are taken through blood, sweat, and tears. Accepting tyranny only leads to more tyranny!\n\n4/27/24\n\nConor Jay Chepenik",
  "wordCount": 461,
  "readingTime": 1.939622641509434,
  "claps": 0,
  "voters": 0
}