{
  "id": "279c2ce644ed",
  "title": "Day 273",
  "createdAt": "2022-12-20 21:19:49",
  "tags": [
    "sbf",
    "4chan",
    "effective-altruism",
    "movies",
    "avatar"
  ],
  "url": "https://chepenikconor.medium.com/day-273-279c2ce644ed",
  "content": "# Day 273\n\nWell this one hit home. 4chan gets a bad wrap but some of the nuggets on there are full of signal.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/xamaximus/status/1604963957672116225&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt was especially condemning because it looks like a post from 2013 and it has aged quite well. A great reminder to cherish my family and put down the phone. Technology is a fun and powerful tool, but it's important to not let it consume all of our precious time. I listened to this podcast from Robert Breedlove featuring Nick Hudson and the two layout a great case for why the public has been constantly lied to these past two years. I can't recommend enough.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F7qbKnqVonWiO0yYPYLZGUu%3Fsi%3D0wdbd3jFRracbrHBjGzgxw%26utm_source%3Doembed&display_name=Spotify&url=http%3A%2F%2Fopen.spotify.com%2Fepisode%2F7qbKnqVonWiO0yYPYLZGUu%3Fsi%3D0wdbd3jFRracbrHBjGzgxw&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fcdc2082a1accec86b55b1b4d&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nThe effective altruism movement is incredibly satanic and a front to usher in a technocracy where people give up their rights for \"the greater good\". I want no part of it. S.B.F seemed to be a front for this stuff and was on the record talking about how he had to make a bunch of money so he could do more good. Think about that for a second. Homie was advocating that he NEEDED to make more money, which is likely how he justified running a ponzi scheme and stealing from his customers, so he could do more good. The irony is uncanny. These effective altruists want to justify their means by the end result when the reality is the means are everything. Not to mention the ends sucked anyways. Homie lose 8 billion of his customer's money!!! You can't claim you care about doing good if you are stealing from your customers. Well you can but you will be treated like a clown and a criminal when it's exposed. The hypocrisy of this movement is insane. The silver lining is S.B.F exposed the shit out of the E.A movement.\n\nOn a lighter note I'm going to see the new Avatar movie today. 3 hours is a long film but the first one was great so I'm excited to see the second.\n\nCan confirm it lived up to the hype. My girl and I both were shedding tears at the end of the movie. Not a fan of James Cameron's idea to eliminate testosterone in the body. However, the man can make a damn good movie. I do recommend watching Avatar at the big screens if you like action movies and want the full experience. I love movies at home too, but something special about seeing a film at the theater. I also thought Avatar did a good job showcasing the importance of family. Feels like there is a lot of subliminal messaging attack the nuclear family in mainstream media. So it was nice to see a feature film stressing its importance.\n\nAnyways, that's all for today. Going to crush a run and eat some dinner with the love of my life. Smile anon. Life is precious :)\n\n12/20/22\n\nConor Jay Chepenik",
  "wordCount": 480,
  "readingTime": 1.8113207547169812,
  "claps": 0,
  "voters": 0
}