{
  "id": "297c9aaf8108",
  "title": "Day 943",
  "createdAt": "2024-10-21 02:37:17",
  "tags": [
    "the",
    "return",
    "from",
    "zendustrial",
    "california"
  ],
  "url": "https://chepenikconor.medium.com/day-943-297c9aaf8108",
  "content": "# Day 943\n\n![[https://x.com/ConorChepenik/status/1848010662535925853](https://x.com/ConorChepenik/status/1848010662535925853)](https://miro.medium.com/1*4oUkJ5wK_-ybU_Wi-E18bQ.png)\n\nMan, what an amazing time I had out in Los Angeles, California. It's quite a unique place. I mostly stayed in the Santa Monica area during my trip, and it was gorgeous. There was a fair amount of homeless people, but the area also had so many cool stores, shops, outdoor spaces, and other attractions. I'm blown away by the culture and the vibe. My friend described it as having a \"zendustrial\" feel, which I thought was pretty accurate.\n\nLA feels like a city that perfectly encapsulates Yin and Yang. You have the uber-wealthy and incredible areas, and you have people who can't afford to eat or rent a home. You experience some of the worst smells while walking down the street, and then some of the best when you pass a street vendor. You get the beach, amazing tourist attractions, open parks, and then you might catch a homeless person showering in public facilities. Unfortunately, I witnessed this firsthand on my trip. The lifestyle seems great in many ways, yet everything is so expensive that what should be a stress-free life on the beach can, I imagine, seem very stressful because of the cost of everything. Well, depending on how you handle your finances anyway. I'm sure if you've built enough wealth for yourself, you can get by just fine.\n\nSo as I sit and type this on the Notes app because I am on a flight back home to Jacksonville, I feel motivated - to provide value, to restore more beauty to our cities, to build things that people want to enjoy. One app I have been thinking about building is an app to preserve our wisdom. I've seen some of my mutuals on X (formerly Twitter) talk about how they believe we are part of the amnesia generation. This is sad. If we can't learn from our past, we are doomed to repeat the same failures. So, in order to help others (myself included), I'd like to create an application that helps people preserve that ancestral knowledge.\n\nI'm also finishing up Replit's 100 Days of Code and think there would be value in creating a web app to do exactly this. My idea is to ask users a question every day for 100 days. The user can write down their answer, and the app will save it. After every answer, it will prompt them to share their responses on social media if they wish. They can, of course, ignore that if they want to keep their answers private. At the end of the 100 days, I'd like the app to have a big download button for your 100 questions and answers, which will give the user a PDF file they can save locally, on a hard drive, or email to their loved ones. It would also have a feature to allow someone to create a login and share that with a loved one but set a time lock on it. So that person, when logged in, would see \"Your ancestral knowledge will be revealed on XX/XX/XXXX,\" and when that date arrives, they can view all the answers.\n\nI feel there might also be some value in having a language model trained on this data, allowing the user to ask the AI questions about their input. However, that specific part will need more fleshing out. Not sure exactly what that will entail. Also, depending on how much the user typed in, I might need to feed the model chunks of data at a time or charge more for this feature since it will likely cost some money to get a language model fed this data and ready to answer questions.\n\nIn order to build this app, I'm going to need 100 questions, so I think it will be good to try and come up with 10 questions a day. Not sure if I will share these all on Medium, but I am thinking of making both a free and premium version of this app. The free version will only run for 10 days and will not have the cool features in the premium version, so I will share the first 10 here that I plan on putting in the free version.\n\n1. What makes a good life partner?\n2. How do you know when you are in love?\n3. If you could change one thing about your past, what would it be?\n4. What lessons did you learn from traveling?\n5. What is your favorite quote and why?\n6. What made you happy in life?\n7. If you could have dinner with anyone (dead or alive), who would you pick and why?\n8. How do you create wealth for yourself?\n9. What has been the craziest change you have seen throughout your life?\n10. What is your favorite place you have visited and why?\n\n10/20/24\n\nConor Jay Chepenik",
  "wordCount": 814,
  "readingTime": 3.2716981132075476,
  "claps": 0,
  "voters": 0
}