{
  "id": "2acf402da336",
  "title": "Day 13",
  "createdAt": "2022-04-04 19:35:04",
  "tags": [
    "bang-bang",
    "twitter",
    "elon-musk",
    "humanity",
    "life-is-crazy"
  ],
  "url": "https://chepenikconor.medium.com/day-13-2acf402da336",
  "content": "# Day 13\n\nWatched the Documentary _Trust No One_ by [Luke Sewell](https://twitter.com/LukeSSewell) this morning and I feel reminded that Bitcoin is like fire.\n\n![](https://miro.medium.com/0*0o_3sfSSKyJZXxjA)\n\nVerify don't trust is one of the Bitcoin mantras for good reason. The people who got scammed by QuadrigaCX have my sympathy. That said, I bet the majority will never keep their funds on an exchange again. Not your 🔑  not your 🧀. It sucks learning a lesson the hard way but those are the lessons that do not get forgotten. Bitcoin is like fire in the sense that it is both an effective tool and something that can inflict great damage. No one likes being burnt but the pain is a necessary sign to show humans not do that shit again.\n\nAnyone who has been around crypto for long enough has seen all sorts of scams and might have even fallen prey to one. Expensive lesson, but one that teaches you the importance of security and making sure you don't ever share your keys unless you are comfortable with someone else having full control over your 🌽 . I'm glad I live in a society where the Government has done a somewhat decent job providing basic infrastructure for its citizens. I'm also sad to see this same Government deem various market actors \"too big to fail\". As I understand it if something becomes too big to fail that thing loses its pain receptors. This typically leads to negative second and third-order effects. Some systems might be too broken to fix. Thus, humans need a new system that isn't rotten to the core so humanity can collaborate to do incredible things. No one likes pain, but without pain receptors, we are blind to the consequences of our actions.\n\nOne group I'm happy to see get burned playing with fire is Twitter. They've been censoring people who are asking legitimate questions which goes against the first amendment of the United States. I understand they are a public company offering a service, but that doesn't give them the right to censor people including a sitting President at the time. Like or hate Donald Trump it makes no difference in this case. Censorship is wrong. This morning [Elon Musk became one of the largest shareholders in Twitter](https://twitter.com/TIME/status/1510977489048330249?s=20&t=zEZHd5AuMvcJLXeHsjx6Zw). Elon had been complaining about the censorship when he called Twitter a \"de-facto town hall\". I hope Elon is able to inflict some pain on those wishing to silence others, let them get burned, and see how they like it. Hopefully, they can learn and adapt their behavior so they don't experience more pain in the future. Everything is a tool and humanity can use these tools for good or bad. Fire, Bitcoin, even Twitter. Learning how to use these tools for the benefit of mankind will lead to a world of abundance. Don't act in bad faith and you will likely lead a fulfilling and successful life anon. We have humanity at our fingertips in the form of a smartphone. Most people will use it to watch videos of [people hitting other people with cars](https://twitter.com/MarkJMcDonough/status/1510413266069213187?s=20&t=zEZHd5AuMvcJLXeHsjx6Zw). This is entertaining to watch, but it's also heartbreaking to see people inflict this kind of pain upon each other. As much as I'd love to fix all the problems with modern-day society it is a tall order. I need to fix myself before I can fix anything else. Being humble and realizing we are surrounded by tools that would seem like magic to our ancestors is a start. Not forgetting that the greatest tool in the universe is the hardware that is your mind and the software that is your consciousness is another step in the right direction.\n\n4/4/22\n\nConor Jay Chepenik",
  "wordCount": 617,
  "readingTime": 2.528301886792453,
  "claps": 0,
  "voters": 0
}