{
  "id": "2ceb075fd6ad",
  "title": "Day 248",
  "createdAt": "2022-11-26 00:21:27",
  "tags": [
    "bitcoin",
    "hal",
    "innovators",
    "bleeding",
    "fiat"
  ],
  "url": "https://chepenikconor.medium.com/day-248-2ceb075fd6ad",
  "content": "# Day 248\n\nGoing to use today's post to hash out more ideas for my third and final article for Bitcoin magazine in 2022. I've got some words written down in a Google doc but it's all over the place so today's post is about synthesizing that down to something a little more coherent.\n\n**Bitcoin Stops The Bleeding**\n\nWhen a Doctor operates on a wounded patient the first thing they have to do is make sure they can stop the bleeding. There is no point operating on someone if you can't get the bleeding under control because they will die. The same goes for your wealth. Fiat currencies are bleeding out which is incentivizing less people to save. If you want to stop the bleeding in your financial life you are going to need to find a way to store your wealth in something else. There are plenty of options but only one that is programmed to stop all bleeding in 2140.\n\nThe people's money isn't the only thing being bled out. Our education, time, and I'd even argue our mental sanity are being \"bled\" by bad actors. Blood isn't oozing out egregiously but rather being siphoned off from tiny cuts so the majority of people don't even realize it is happening. This is a hard pill to swallow. Most western societies teach people not to question authority, raise your hand if you want to ask questions, and trust the experts. Breaking out of this mentality is not an easy task. Just watch this [clip](https://twitter.com/canindependent/status/1595460390045028352?s=20&t=qIFHdHF4A-8z4nmfle5Mqw) of the White House Press Secretary to get an idea of how those at the top will treat people who dare question the narrative.\n\nFor better or worse, pain is the best teacher. A great example of this is Trezor reporting a 300% increase in sales revenue after the FTX debacle. My heart goes out to those who lost money because they decided to trust FTX. If you have not spent countless hours learning about Bitcoin and why holding your keys is so important it is understandable why one would trust FTX. They seemed to have the stamp of approval from every mainstream news outlet, politician and celebrity in the space. The silver lining is that their fraud was so egregious that many people are waking up and starting to see through the charade. Even the puff pieces are being exposed and starting to tarnish the credibility of these once notable media outlets.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/elonmusk/status/1595889743958798336&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe remedy to most people's problems is a better education which requires a great deal of work. However, I can attest that I've never had such a fun and condensed period of learning like I'm having going down the bitcoin rabbit hole. It opened my eyes to how much people are not taught during their traditional schooling. It is important to \"never attribute to malice that which can be adequately explained by stupidity.\" Learning one thing typically leads to ending up with twice as many questions and that number grows exponentially. There is only so much time in the day and Teachers must prioritize their curriculums accordingly. I just have a hard time understanding why taxes, how to vote, and basic financial literacy aren't at the top of most of public school curriculums. Once you get over the initial frustration of realizing how much traditional schooling leaves out learning become fun. To use a cliché it opens your eyes to the fact that you can start playing chess while everyone else is preoccupied with the checker board. When you find a teacher that speaks your language and can explain an idea perfectly, learning becomes one of the most euphoric feelings.\n\nThe standard way of learning has horrible mental models for teaching people. Memorizing things for a test is not a great way to explain any subject. Asking permission to apply your newfound knowledge on a project is the wrong mental framework and the one my traditional schooling always seemed to enforce. Those who changed the world for the better didn't ask for permission to make the world a better place. They just did it. People want a hero to fix all their problems but the truth is no one is coming to save you. The hero's journey starts with identifying your heroes and the dysfunctional relationship that might be present. For many SBF was a hero who turned out to be an ultra villain. I'm not saying don't find great mentor; it's great to listen to those who have become experts in their field in order to learn. The problem starts when you start worshiping someone like a God who can't make mistakes. SBF is on the record talking about how his biggest regret after this hole debacle is not being able to try and trade his way out of a multi billion dollar hole. Seems like stealing from customers should be his number one remorse but then again if I was a multibillionaire by the time I hit 30 I'm sure it would be hard not to develop a God complex.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/autismcapital/status/1592984494814171137&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI hope those who lost funds will learn from their pain and come out as a stronger and more resilient individual. I'm hopeful many will start to now understand the difference between Bitcoin and crypto. The difference between paper bitcoin and bitcoin you actually hold the keys for. Once the majority of people slay their heroes, self custody their coins, and stop blindly trusting others is when the world will really see fireworks in regards to Bitcoin's price action. Every person is different and has various forms of risk tolerance. This is the time where those who learned a valuable lesson double down on their education and help the next round of newcomers learn so they don't end up making the same mistakes. There is always pain involved when you stop the bleeding. However, the more educational content Bitcoiners can put out will help to minimize this pain. Rome wasn't built in a day and sometimes the only way to get a lesson through a stubborn individuals head is for them to suffer through the initial pain.\n\nWhat's beautiful about the Bitcoin space is that there is such a wealth of amazing individuals and incredible content if you look in the right spots. I'm constantly blow away by how lucky I am to be purvy to some of the conversations I get to hear on various podcasts and Yotube videos from notable Bitcoiners. Imagine explaining the modern day wonders we have like the ability to send electronic mail near instantaneously, or use the little piece of glass in our pockets to hail a ride, order food, or listen to some of the greatest minds on the planet whenever we want. It's incredible what technology is giving us and of course there are going to be many hiccups along the way as humanity tries to come to grips with these new tools. I've had this Hal Finney quote as my Twitter header for quite some time because I believe it's so relevant to what we are seeing in today's society.\n\n![](https://miro.medium.com/0*Xu97xP8W5VgmVuyn)\n\nFor all the wonders technology can do for humanity it can also drive a whole new level of control. I've been thinking a lot about this idea that price discovery in a free market is like hash functions. It takes an input of data and spits out an output that only goes one way. With a normal hash the algorithm works so that it is unfeasible to reverse calculate the data. You can verify a hash by making sure the same output is achieved based on the input but you can't take the output and figure out the input. In the same way a free market will set the price of the good but you can't figure out how all the labor, work, and travel to deliver said good was calculated. The function only goes one way. Since it only goes one way it's hard to see how manipulated free markets can become when central planners start meddling in them. People get upset with the price increases that result but the blame is typically pushed on to the producers rather than the central planners who are causing such issues. Sound familiar? Like say the U.S government who is calling out \"greedy fossil fuel companies\" while at the same time advocating for the end of fossil fuel use. *need to find a better ending to add here*\n\n![](https://miro.medium.com/0*QiZwUyPRQ0kW30ct)\n\nWe are probably at about the 30 year mark on this graph in terms of Bitcoin adoption. Exponential growth is hard to fathom but that is what's coming with the Bitcoin network. The best metaphor I can give is the internet bubble in 2000. 22 years later and companies like Facebook, Apple, Amazon, Google and many others have changed the lives of humanity in ways that seemed unimaginable not long ago. They have made it mostly better but also offered nation-states the ability to increase their authoritarianism. Bitcoin fixes this in so many ways. It allows the individual to go down a hero's journey where they can keep the value of their labor in their head.\n\nI must say I completely agree with [Bruce Fenton](https://twitter.com/brucefenton) who has been getting a lot of slack on Twitter recently for saying that self-custodying bitcoin is difficult. He is absolutely right. It's very difficult to self-custody your bitcoin in an ideal manner especially if you have large amounts of money. That's the beauty of Bitcoin though. Your wealth rests on complete ownership of how you create your setup. Everyone has different tradeoffs to consider and the majority will not take the time to remember 12 words to store the majority of ones wealth in their head. It might not be a bad idea to store a little bit of 🌽  in memory though for a rainy day. Everyone's situation is unique and the fact that Bitcoiners have that option is what matters.\n\nBitcoin empowers and offers a better system. One where people take full responsibility to play the game. If you try and cheat Bitcoin it will come back to bite you in the ass. Preston said it best \"Bitcoin is like the affinity stone.\" Not many can hang on to it but those who do over long periods of time will be greatly rewarded.\n\nThe zero to one invention. I can't stop thinking about all the hope Bitcoin as a technology will bring to humanity. Bitcoin is like the self help book that you didn't know you needed. Most self-help books are super cheesy and offer no tangible advice other than \"you can do it if you believe in yourself\". Which is true but how does one begin to believe in themself? Action. As far as I can tell the only way to make progress it to take action, fail, and learn from those mistakes. Bitcoin helps with this tremendously. I've consumed more podcasts, books, articles, and even written some of my own because of this magic internet money. I've driven my family mad because I won't stop talking about. Luckily, my Grandparents like listening to me but they typically follow up my rants with \"Conor I'm so proud of how much your vocabulary has grown and how knowledgeable you are on this stuff but I didn't understand half of it. Which is just an amazing feedback loop because it makes me go back and try and synthesize my ideas into more coherent ones. When my Grandparents can understand my rants is when I know I have developed a solid understanding of the thing I'm trying to articulate.\n\nThe future is bright. I'm not saying there won't be turmoil and pain in the short term for those obsessed with measuring things in fiat. There will definitely be some pain in that regard. The way to fix that is too orient yourself around the new system. To spend time with all the incredible minds in the Bitcoin space. To seek knowledge from so many who are starting to realize that humanity is entering another renaissance. There are so many people who I feel like I'm best friends with in the Bitcoin space because I've listened to thousands of hours of them talking. Which is kind of hilarious because most of them have never heard me speak a word. Luckily, they don't need to speak to me in order to keep putting out amazing content. They are doing it because they see a similar future that only Bitcoin can bring. The things that will come out of this Bitcoin renaissance are going to seem unimaginable in the same way that if you took someone from 100 years ago and played them a podcast with your magic glass device and airpods they would be freaking out looking around for the person speaking.\n\nIf you are reading this piece you have likely heard of Bitcoin and might even be deeper down the rabbit hole than me. If you are not then I encourage you to spend some time in this space. Start to think about Bitcoin as your unit of account. Go out and listen to all the incredible podcasts out there. Don't trust me; verify for yourself. It's easy to get bogged down with all the bleeding going on in fiat world. Bitcoin is the band-aid to fix it. Focus your energy there and you'll be amazed at how quickly those wounds turn into scabs which turn into barely noticeable scars.\n\nWhat's interesting about watching FTX fail so rapidly is the same thing would happen with our traditional financial system if we didn't have central banks acting as lenders of last resort. It was gross and wrong of SBF to take customer funds and trade them, but when a registered bank does it 99.9% of the world either turns a blind eye or just doesn't know that is how fractional reserve banking works. In his book _Human Action_ Mises writes,\n\n\"The rich, the owners of the already operating plants, have no particular class interest in the maintenance of free competition. They are opposed to confiscation and expropriation of their fortunes, but their vested interests are rather in favor of measures preventing newcomers from challenging their position. Those fighting for free enterprise and free competition do not defend the interests of those rich today. They want a free hand left to unknown men who will be the entrepreneurs of tomorrow and whose ingenuity will make the life of coming generations more agreeable. They want the way left open to further economic improvements. They are the spokesmen of progress.\" (page 83)\n\nFTX sought to become like the rich Mises was referring to by lobbying congress and creating a regulatory moat around their business that would've made it impossible for competitors to compete. They spent tons of money lobbying regulators and donating to the democrats. The world is fortunate their system blew up before FTX was able to get their way with D.C because if the leaders at FTX were willing to use customer funds as they saw fit one can only imagine what they would've done to the crypto industry as a whole. As a self proclaimed Bitcoin maximalist I'm not worried about the other coins but I feel very strongly that Mises was right. The free hand can regulate and figure out what makes our life more agreeable. Bitcoin has over 10,000 competitors and that number is growing everyday. I don't think any of them can compete with Bitcoin in the long run but that isn't for me alone to decide. It is the market's job. We need more people advocating for a free hand that lets entrepreneurs innovate. Ultimately, the great entrepreneurs won't ask for permission. They will just build like Satoshi did. The reason I advocate for free markets and less regulatory moats for the incumbent is because free markets will increase the speed of hyper-bitcoinization so we can get to a world where one doesn't have to hold the majority of their wealth as a liability on a bank's balance sheet. The free market will stop the bleeding.\n\n—\n\nWell that's all for today. I need to do some rearranging and towards the end my eyes were getting sore so I just kind of glanced over the last stuff. Will probably use tomorrow's piece to write more of this and make it coherent. One cool part of editing this today was that I wrote out a whole paragraph and scrolled down and realized I had written an almost identical take a few days earlier. So I scrapped the paragraph but there was a nice sentence I added in. Feels good to make some progress on this piece. I also got my Bitcoin for Developers certificate from saylor.org today which made me proud. The future is looking bright anon!😎 🤝🫡\n\nSources:\n\nFoer, Jonathan Safran. _Eating Animals_. Penguin Books Ltd., 2011.\n\n\"Hard Money Show With Natalie Brunell\" _YouTube_, YouTube, 17 Nov. 2022, [https://www.youtube.com/watch?v=W6CTHoTTMyo.](https://www.youtube.com/watch?v=W6CTHoTTMyo.) Accessed 25 Nov. 2022.\n\nThe Atlas Society. _Objectivism and Bitcoin_. _YouTube_, 19 Oct. 2022, [https://www.youtube.com/watch?v=uix5BrzMTBM&t=1s.](https://www.youtube.com/watch?v=uix5BrzMTBM&t=1s.) Accessed 16 Nov. 2022.\n\n\"The Future Is Bitcoin with Michael Saylor | Moonshots & Mindsets.\" _YouTube_, 3 Nov. 2022, [https://youtu.be/v4na2pycrcc.](https://youtu.be/v4na2pycrcc.) Accessed 16 Nov. 2022.\n\nPreston & Peter . _Bitcoin Is the Answer with Preston Pysh_. _YouTube_, YouTube, 16 Nov. 2022, [https://www.youtube.com/watch?v=9b1boWwTvNw.](https://www.youtube.com/watch?v=9b1boWwTvNw.) Accessed 17 Nov. 2022.\n\n11/25/22\n\nConor Jay Chepenik",
  "wordCount": 2890,
  "readingTime": 11.288993710691823,
  "claps": 7,
  "voters": 1
}