{
  "id": "2dc0a5958483",
  "title": "Day 1127",
  "createdAt": "2025-04-23 01:59:33",
  "tags": [
    "chapter-1"
  ],
  "url": "https://chepenikconor.medium.com/day-1127-2dc0a5958483",
  "content": "# Day 1127\n\nToday's Medium post is going to be for my book **121 Questions For My Children**\n\n**Chapter 1: What Does It Mean to Be Rich?**\n\nWhen I was young, I thought being rich meant having a mansion with columns out front, a sports car that made people turn their heads at stoplights, and beach vacations where strangers served you drinks with little umbrellas. That's what TV taught me. That's what culture echoed. That's what memetic desire burned into my brain. Success, I believed, meant being seen.\n\nLater, I thought being rich meant being early. Catching the right stock tip. Riding a coin that moons. Watching numbers move in only one direction. I told myself it was different this time. That I wasn't chasing flash, I was chasing freedom. But deep down, it was the same hunger. I still wanted to win. To be ahead. To be right.\n\nAnd the truth is, I'm human. Like most people, I'm good at convincing myself I've changed just by upgrading the illusion. So even though I now believe Bitcoin is a moral imperative, I can't pretend I wasn't drawn in by the same old lure. Maybe I wasn't saying it out loud, but I was still chasing a kind of applause. That feeling of wealth. That's what drew me to Bitcoin at first, the upside, the thrill. That number-go-up itch is hard to ignore.\n\nBitcoin is funny that way. Most people arrive for the gains. But they stay for the truth.\n\nBecause the deeper I went down the rabbit hole, the more it stripped away the noise. It quietly rewired how I thought about everything: value, time, trust, even purpose. Fiat teaches that wealth is about accumulation. Bitcoin teaches something quieter.\n\nThat time is wealth. That freedom is wealth. That health, trust, and meaningful work are forms of capital no one can print.\n\nI felt this most clearly, not on a chart, but on a field.\n\nI was coaching elementary school flag football. A bunch of wild little kids with big hearts and short attention spans. We practiced in the Florida sun. I made plenty of mistakes that first season and often felt like I was herding cats. But looking back, I cherish every moment. The laughter, the effort, the simple joy of showing up together.\n\nWe lost our first game. I remember some of the kids crying afterward, and at first, I didn't get it. It seemed ridiculous, this wasn't the NFL. But to them, it mattered. That loss taught me perspective. It reminded me that meaning isn't measured by scale. It's measured by heart.\n\nWe clawed our way back, game by game. And in a full-circle twist, we faced the same team in the championship that beat us in that opening loss, our only loss of the season.\n\nBy the grace of God, we won.\n\nAnd let me tell you running down that field yelling like a madman, high-fiving a pack of ecstatic kids, celebrating a nail-biter championship, I've rarely felt richer. I wasn't even playing. I was just the coach. But in that moment, watching those kids explode with joy, it hit me: _this_ was wealth.\n\nOf course, nothing compares to the moment you watch your spouse bring life into the world. But this was up there. That championship moment held everything fiat can't measure, love, resilience, teamwork, growth. We built something together. We struggled for it. We won.\n\nThat's true wealth: doing something meaningful with people you're proud of.\n\nSo to my children, I want to say this:\n\nDon't be fooled by highlight reels. Riches aren't always loud. Sometimes they look like early mornings spent on a task you love. Deep friendships built through adversity. Meaningful work that energizes you. And the kind of love that endures through the hard seasons. Anyone can love when things are easy. But when you're ready to quit and keep going anyway that's rare. That's sacred.\n\nBe skeptical of anything that promises wealth without effort. Or happiness without sacrifice. The best things in life usually require both.\n\nTrue wealth is the ability to wake up and choose your day. To live by your values. To give more than you take. To build what matters. To be someone others can count on. To have time for a walk, a conversation, a game of catch.\n\nThere's nothing wrong with money. It's a useful servant. A powerful tool. But it's a terrible master. And in a world built on debt and dopamine, learning to define your version of \"rich\" is a quiet act of rebellion.\n\nI hope you live richly. Not just with full wallets, but with full hearts, strong bodies, free minds, and days that matter.\n\nBecause the greatest wealth can't be counted. It can only be lived.\n\n![](https://miro.medium.com/1*5mTVtX33wbbxU1QWeGAbQQ.png)\n\n4/22/25\n\nConor Jay Chepenik",
  "wordCount": 802,
  "readingTime": 3.226415094339623,
  "claps": 0,
  "voters": 0
}