{
  "id": "3092d6dbc9b5",
  "title": "Day 86",
  "createdAt": "2022-06-16 23:28:29",
  "tags": [
    "energy",
    "chakras",
    "bitcoin",
    "corporate-culture",
    "humor"
  ],
  "url": "https://chepenikconor.medium.com/day-86-3092d6dbc9b5",
  "content": "# Day 86\n\nI used to think people's energy or chakra or whatever the hell you want to call it wasn't legit, but I've changed my view. Going into corporate America I feel so much stressed energy. Writing and going for walks during lunch helps to detox from this energy. It really is incredible how tense stuff can feel in an office. Not like we are doing the most important stuff either. Cold calling and writing sales emails isn't going to change the world hahaha. Well, it can if you get the right person on the line. Got to remember to sell value while not taking it too seriously because many people might not need the product, but when you find one who does it can be game-changing. Remaining hopeful is key.\n\nHad a nice steak and cheese for lunch today and ate it near the water. I do love that Boston is a port city. Then again most big cities are port cities lol. If they're not a port city they typically have a large lake or river running through. Crazy to think about how important water and boats are to making sure people get the necessary food, supplies, and whatever other shit they need. It was nice eating by the water today for lunch. I love the smell of the ocean.\n\nRead a Twitter post today that claimed anxiety and depression stems from our ego and not being satisfied with who we are. I need to remember this and realize I'm not my job. No need to be stressed about sales. I can always find another sales gig. Easier said than done to let go of my ego but the better I get at doing this the better I will be in the long run. Letting go of labeling and thinking my perspective is the best will do wonders for me. That does not mean I have to let go of my passion for Bitcoin because I really do believe it can do so much good for the world. It means I need to stop trying to convince others to think like me. Letting others make their own judgments and only sharing my perspective when they seek it is a good thing.\n\nLife is such a gift and I'm lucky to be living a good one. Sometimes I get down, but I'm incredibly fortunate. Can't ever let others' expectations define how I think of myself. By focusing on loving myself I will ultimately make those I truly care about happy and that's what is important in life. Cheers to making others' lives better by learning to let go of my ego and remain optimistic no matter what. Kill em with happiness baby.\n\nComedy as well is another great way to remain positive. Cracking jokes and making others laugh are one of the best things life has to offer. There is definitely some material I can write up from my sales job. Need to channel all the negativity into humor to A. Provide relief from my gig and B. Perfect my stand-up craft. Today my manager joked that sales forecasting is an art. Yea the art of bullshitting hahahha. Sales in general is also the art of bullshitting the right amount. Finding the balance between providing value and also convincing prospects to take a meeting.\n\nSaw this [tweet](https://twitter.com/Rothmus/status/1537563438599352325?s=20&t=f2_BTcU4MqqA1cebWQFj-g) from an account I follow. Not sure if it's true, but if so wtf. We are living in some wild times. Need to get the incentives of the world right.\n\n![](https://miro.medium.com/0*4FFP21qfkIUpY-dB)\n\nI got faith though. Evil will not prosper. Humor, kindness, and overall being a good person are going to win out. Rest assured anon the big man upstairs got a plan.\n\n6/16/22\n\nConor Jay Chepenik",
  "wordCount": 625,
  "readingTime": 2.558490566037736,
  "claps": 0,
  "voters": 0
}