{
  "id": "12168042db87",
  "title": "Day 337",
  "createdAt": "2023-02-23 00:46:08",
  "tags": [
    "podcasting",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-337-12168042db87",
  "content": "# Day 337\n\nI'm pumped to have Shane Hazel coming on my show tonight. Will release the podcast episode soon, but since he is coming on at eight o'clock tonight I'm going to use today's post to game plan what I want to ask.\n\n- Low-time preference and how Governments interfere with their citizens ability to practice low-time preference thinking.\n\n- How to become expensive to tyranny.\n\n- Thoughts on the Twitter files. If Twitter is actually a place for free speech and if Nostr is the solution to fix social media platforms?. (I think with time the UI will become much better but I also think there are many who would prefer the centralized platform so they can put in an email and have recourse if their account gets hacked)\n\n- How to think about privacy in an increasingly digital world and ways to protect your privacy both online and offline.\n\n- Thoughts on the U.S Military as someone who spent time serving.\n\n- How Mushrooms have impacted the way you see the world.\n\n- Homeschooling your children.\n\n- East Palenstine Ohio\n\n- The War in Ukraine. Is this another 20 year fight like in Afghanistan or do you think this will be resolved in the next few years?\n\n- In an [article](https://bitcoinnews.com/freedom-money-gods-money/) you recently linked on your Twitter from bitcoinnews it linked a quote from Tomer that reads \"_It eliminates the belief that it is only fame, fortune, or power which motivates people.\"_ Why do you think Bitcoin attracts such altruistic individuals?\n\n- How Shane found Bitcoin.\n\n- What excites Shane the most about the next ten years?\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ShaneTHazel/status/1626934762945249281%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGood tweet. I couldn't agree more that Bitcoin fixes all of this. I've been reading _[The Singularity Is Near](https://www.amazon.com/Singularity-Near-Humans-Transcend-Biology/dp/0143037889)_ and I'm only 30 pages in but the book keeps talking about the power of exponential growth. Well we've been growing our technology exponentially and the cost of living is still going crazy. I've written a lot about why and it can all be summed up in two words: fiat currency. Money we have to use \"by decree\" that is backed by debt and violence. Fiat money needs to be abolished and I'm excited to chat with Shane how we can go about making sure that our society smoothly transitions off fiat currency. I'm sure it will be a bumpy ride but I think Bitcoin can make it a lot smoother. :)\n\n2/22/23\n\nConor Jay Chepenik",
  "wordCount": 394,
  "readingTime": 1.4867924528301886,
  "claps": 0,
  "voters": 0
}