{
  "id": "15145399ac89",
  "title": "Day 183",
  "createdAt": "2022-09-22 00:25:23",
  "tags": [
    "bitcoin",
    "metaverse",
    "fed",
    "hobbies"
  ],
  "url": "https://chepenikconor.medium.com/day-183-15145399ac89",
  "content": "# Day 183\n\n![](https://miro.medium.com/0*nHcwmoteQdcrpzlZ)\n\nHonestly wild how much ones interests, hobbies, and passions can change over the years. Not too long ago I was more concerned with my fantasy lineup than I was with monetary policy. While I firmly believe that Central Banks are communist organizations I also live within a system that is effected by the decision of our central banks. In my pursuit to see what the FOMC meeting declares and show they adjust interest rates I stumbled upon the Fed's YouTube and watched this video. Turns out they hiked by 75 BPS. I am curious how long they can keep this up. Anyways here is the link to the video.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FwLyh5fSTLLw&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DwLyh5fSTLLw&image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FwLyh5fSTLLw%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nHoly crap I can't with these people. Part of me wants to laugh and another part can't stop rolling my eyes. There is a reason the comments are turned off on this video. The Fed has done a horrible job with their policy decisions, they are backwards looking and the data they do collect is \"mid\". That's is me putting it nicely by the way. With Information Technology companies like Sqaure, PayPal, and the likes they could have much better data than what the Fed is currently pulling in. The Fed should be getting data in real time and have it up on their websites 24/7/365. There is no reason (outside of bureaucracy, misaligned incentives, and government incompetence) that the Fed doesn't have live data on their website pulling in real time updates about all the things they monitor. I'm sure companies like Zillow, Square, PayPal and many others would work with the Fed to feed them this data so citizens could better understand true inflation and what prices are spiking.\n\nOf course none of the Fed people want this because it would much harder to make CPI not seem so egregious. There is no way I believe the number they are reporting at slightly above 8% is true. It is frustrating to learn about how they calculate the CPI index and how they manipulate the data but alas the incentives are broken and the silver lining is these people are going to have to print again at which point it is likely Bitcoin will shine when the pain from inflation forces many to wake up to how ridiculous our current monetary system is.\n\nEnough trash talking the Communist Reserve Of The United States. I just think it's funny how now I follow monetary policy more than I do the NFL. Life changes quick and because of Bitcoin I've enjoyed learning about how money works because it helps me position myself to benefit in the future. Thinking long term baby. I do wonder what the world will look like in ten years. Read an interesting article this morning about rights in the metaverse. While the article made some really good points I'm not so sure regulation is the answer to stopping all the abuses that could occur in virtual cyberspace. In the article it pointed out how powerful computers are becoming and their ability to detect and analyze all sorts of data like blood pressure, heart rate, and even tiny movements in your face to detect various emotions. With this data companies can better advertise to you and do so in a way where it doesn't seem like an advertisement. The example given in the article was you pass a car, you hear some NPC go \"I love driving this vehicle\" and that subtle occurrence could be the difference between a person buying and not buying a car one day. Article attached below.\n\n> [**Migration to the metaverse: We need guaranteed basic Immersive Rights**](https://venturebeat.com/virtual/metaverse-we-need-guaranteed-basic-immersive-rights/)\n\nIt is crazy how targeted and powerful ads like this can be. No one likes being sold to but people love word of mouth endorsements because they are usually pretty trustworthy. No company is going to be taken seriously by talking about how fantastic they are. Every company is incentivized to drink their own kool-aid. However, when it comes from a customer of said company that endorsement is way more powerful. The article did a great job making me think about how word of mouth endorsements in the metaverse could be severely compromised and the end consumer would have no idea. I don't think regulation fixes this because bad actors will still be bad actors. In my humble opinion, the key is education. Showing people how misleading and targeted ads can be. Thinking about how targeted ads already are and how much more data will be given up when you have fully immersive metaverse experiences is kind of scary. It's also cool what the tech will be able to do and the features it will have. I just hope more companies can prioritize educating their audiences and more people using these services are aware of the risks.\n\nI'm more hopeful than gloomiest because I think Bitcoin will incentivize more people focused on value creation than optimizing ads. Not that optimizing ads is not creating value because any sane CXO or board at a company would want their ad spend to generate maximum revenue. The problem is the majority of social media companies make all their money from ads so they feel the need to extract maximum data from the users of their platform so they can target them with better ads. I'm hopeful Bitcoin will allow companies better ways to make money. For example, Fountain is a podcasting app that allows people to stream Satoshis to the podcast they are listening to. They can even pay Sats to get their question or comment featured in the app. This is just one example but the idea of the \"prosumer\" (consumer and producer combined because that is what people are on most social media applications) being able to stream tiny payments is very exciting. I'm hopeful these micropayments will allow companies to profit from creating the best ad and not be beholden to the people buying ad space on whatever platform. Who knows how it actually looks but I think the fact big Pharma was the biggest ad spend customer for the MSM here in the USA is a big reason why well you know the MSM was full of crap and spread a bunch of claims like 100% safe and effective that turned out to not be true at all. Just my 2 sats but I'm excited to see how the future plays out!\n\n9/21/22\n\nConor Jay Chepenik",
  "wordCount": 1093,
  "readingTime": 4.324528301886793,
  "claps": 0,
  "voters": 0
}