{
  "id": "1751463ef372",
  "title": "Day 181",
  "createdAt": "2022-09-19 22:47:56",
  "tags": [
    "computer-science",
    "life",
    "plans"
  ],
  "url": "https://chepenikconor.medium.com/day-181-1751463ef372",
  "content": "# Day 181\n\nBeen taking various classes on Udemy to up my computer science skills which turned me on to this short video. Pretty cool to see how well this aged from 2007.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F-4CV05HyAbM%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D-4CV05HyAbM&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F-4CV05HyAbM%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"640\"></iframe>\n\nIt is truly amazing to think through the implications of the information technology revolution. While I do get upset about the bad actors using modern day technology for surveillance and mass control I need to remember it has also provided people with tools that allow them to bootstrap an education, transact with anyone in the world, and (myself included) learn about almost any topic out there. In a way the printing press was the first information revolution which allowed for the mass printing of books like never before. The printing press is the tool that decentralized education from a select few. Before the printing press people literally had to hand write all books. Once books became more accessible and affordable because of this new technology information was able to be shared wide and more people than ever before were able to obtain an education. Information technology has only sped up this process and I need to be focused on creating more ways to advance education and positive ideas than I do spending time upset about the BS coming from authoritarians actors.\n\nNot to say that there isn't value in calling these people out and pointing out the flaws in their systems (like why CBDCs are just enslavement tools and provide no value for the masses). It just does me no good to dwell on these things and be so overcome with rage I don't focus on building parallel systems prioritizing life, liberty, and the pursuit of happiness: just like the United States' forefathers had imagined.\n\nIt is amazing to think how well the constitution has held up as a document/outline/way of organizing that protects peoples liberties. I doubt there were many people around during the founding of those documents that could've predicted humans in 2022 would have a piece if glass in their pocket that can buy assets, make phone calls worldwide, stream movies, order food to your doorstep, and hail a ride. I take most of this stuff for granted since I grew up during the beginning of the smart phone era but I'm grateful to be taking a course that reminds me how incredible all this stuff is. Not that long ago people had to have massive filing cabinets for their businesses and now most people can keep all their files in a big database. While there is something special about holding a book and reading it I do think the majority of people are happy to see filing cabinets becoming a thing of the past. I know I am anyways.\n\nI think I need to start creating more content about things I learn. Writing on Medium is great but I'd also like to monetize my podcast and create a website so here goes some brainstorming.\n\n- Reading Bitcoin articles like Guy Swan, Svetski and many others. I could add my thoughts and analysis in between.\n\n- Creating educational videos about coding. This would both help me learn quicker (because the best way to learn something is to teach it) Plus it could be fun and create additional motivation to learn.\n\n- Write more twitter threads to grow my following.\n\n- Discussing and posting about various cooking methods I've used.\n\n- Showcasing my favorite websites and tools for creating.\n\n- Posting and summarizing stuff from books that I've read.\n\n- Finally, discussing solid habits I've developed.\n\nThe Eagles played tonight and while I've been off the sports ball I do hope we can pull out a victory. Love a good sports ball game. Hahahhahaha calling it sports ball cracks me up. When you think about it sportsball makes more sense than football since you barely use your foot in American football.\n\n9/19/22\n\nConor Jay Chepenik",
  "wordCount": 642,
  "readingTime": 2.422641509433962,
  "claps": 0,
  "voters": 0
}