{
  "id": "18dcb71abc87",
  "title": "Day 75",
  "createdAt": "2022-06-05 19:20:05",
  "tags": [
    "woman",
    "sick",
    "health",
    "tea"
  ],
  "url": "https://chepenikconor.medium.com/day-75-18dcb71abc87",
  "content": "# Day 75\n\nFound out I have the vid-19 today. Wasn't able to sleep last night due to a sore throat so ended up coming back to Cambridge first thing in the morning and after waiting an hour at the urgent care the doctors confirmed it was covid. Didn't think covid would be the diagnosis because my symptoms are struggling to swallow, but sure enough, that's what the test said. Been taking ibuprofen to help with any swelling and got some more emergen-c. Health is something that I often take for granted and stuff like this reminds me how important it is to prioritize my health.\n\nIt sucks being sick, but I know I'll get through this and come out stronger. Part of me wants to go crush a run to brute force my body to recover, but I'm also exhausted. Maybe tomorrow if I'm feeling a little better. Was disappointed I wasn't feeling up for a stop to Bretton Woods today, but I can confirm I will be back up to New Hampshire. Such a charming town and driving through the vast white mountains was truly a sight to behold. Never fun riding in a car when you're feeling sick, but it does help when the views are incredible. Something so peaceful and calming about being in a place surrounded by nature. Boston does have some beautiful nature trails, but nothing like New Hampshire has in its mountains. The rivers and streams that my girl and I came across were so awesome. The water just looked cleaner and it probably is since it isn't used by so many people. We stopped at this awesome thrift store in Littleton as well and I got a dope flannel and my girlfriend got a ring which cost 22$. Wild the deals you can find and the store was so cool. Filled with cool art and a bunch of other niche items. The owner of the shop was wearing a white t-shirt with 'hello' written in a size 5 font on it. I thought this was a pretty hilarious shirt and for some reason, it stuck out to me.\n\nThat is all for today. Going to make some tea to help with my throat and watch What is a Woman? by Matt Walsh. Until tomorrow.\n\n6/5/22\n\nConor Jay Chepenik",
  "wordCount": 388,
  "readingTime": 1.4641509433962263,
  "claps": 0,
  "voters": 0
}