{
  "id": "1b67a8e87a66",
  "title": "Day 314",
  "createdAt": "2023-01-30 20:40:52",
  "tags": [
    "dollar",
    "exercise",
    "bitcoin",
    "coding",
    "seo"
  ],
  "url": "https://chepenikconor.medium.com/day-314-1b67a8e87a66",
  "content": "# Day 314\n\n![](https://miro.medium.com/0*ez14rcs6O6imcaPQ)\n\nLife is taking an exciting turn. I'm starting to learn what it's like behind the scenes working as a writer for a news publication (bitcoinnews.com). Lot of SEO, editing, and work on the backend to make sure the front end of the sight is usable. Wordpress and Yoast are some pretty incredible tools. I've also started a coding bootcamp which I know will be a grind but has me super excited to kick off my coding career.\n\nFinished the majority of Dalio's \"Changing World Order\" book today and then read this substack. I still have to read the end of the book that compares the different positions countries are in but I got to the part in the book where he signed his name so the majority of the writing is done now it's just looking at charts which I will do later.\n\n> [**Reports of the dollar's death have been greatly exaggerated**](https://thebitcoinlayer.substack.com/p/reports-of-the-dollars-death-have)\n\nThought this article was fantastic and fit in line with a lot of what Dalio was talking about. Yes China is on the up and up but the dollar is still the best horse at the glue factory. The Chinese currency is in no position to settle global trade because it's not liquid enough which in a sense is the same problem Bitcoin has at the moment. Gives me hope because as both Bitcoin and the Chinese Yuan grow I imagine more people will see the value in a permissionless currency that no one controls. Only time will tell.\n\nOther than that hit another mountain run while I'm down here in Jersey and that felt amazing. I remember hearing someone ascribe exercise to the time where your body can circulate its blood and rid itself of toxins. The two main ways being through sweat and going to the bathroom. Outside of throwing up I'm not sure how else toxins might leave the body, though I could definitely be missing something. That said, I see how exercise helps make it so your body can rid itself of those toxins because if you sit around all day you severely limit your blood-flow. Long winded way of saying move! Even if it's just for a walk your body will thank itself later.\n\nBefore ending this Medium post today I wanted to write a letter more so I asked chatGPT for some ideas. One of those ideas was the rise of plant based diets so naturally I prompted it to give me a Twitter thread about the importance of eating meat. This is what it said.\n\n1/ Meat has been a staple food in human diets for millions of years. Our ancestors relied on hunting for survival and ate meat as a main source of protein and nutrients.\n\n2/ The human body is well-adapted to digesting meat, with a strong jaw and sharp teeth for biting and chewing, and an acid-rich stomach for breaking down animal protein.\n\n3/ Meat is rich in essential nutrients like iron, zinc, and B vitamins, all of which play important roles in maintaining good health.\n\n4/ In addition to providing essential nutrients, meat is also a great source of energy, with high levels of protein and healthy fats.\n\n5/ Research has shown that a diet high in meat can help reduce the risk of chronic diseases like heart disease and diabetes.\n\n6/ Meat is also an excellent source of omega-3 fatty acids, which are important for brain health and mental well-being.\n\n7/ With so many health benefits, it's no wonder that meat has been a staple food in human diets for so many generations. Whether you're looking to build muscle, maintain good health, or boost your energy levels, meat is an excellent choice.\n\n8/ So next time you're looking to make a healthy, satisfying meal, don't hesitate to reach for the meat! #MeatLoversUnite #HealthyEating.\n\nIf you ask me pretty spot on. I think that every body is different and some people might not be so fortunate to be able to scarf down red meat. For the majority of people I don't think there is a better food out there. Growing up I enjoyed eating the fake meat sausages because my Dad used to be a pescatarian. It was a real red pill moment finding out that crap is filled with seed oils. Now my Dad primarily eats meat and a little fruit. I've also seen countless accounts who eat mostly red meat and are shredded. Anecdotal evidence but still. I don't see too many vegan accounts of people in fantastic shape. Part of that could be because of the algorithms feeding me content to reenforce my beliefs in keep me scrolling. However, when I've eaten strictly meat I usually feel fantastic. Worth experimenting and seeing what works best for you. I think we can all agree (outside of big food who is paid to promote propaganda) that seed oils are horrible.\n\nThink for yourself anon. Don't let all these social media algorithms influence your every decision. It's near impossible to not have them influence you to some degree unless you never use social media. If you do use social media then think critically and try to figure out the incentives behind the things you are being shown.\n\n![](https://miro.medium.com/0*5lnAXMSJ56sAJ2r5)\n\n1/30/23\n\nConor Jay Chepenik",
  "wordCount": 902,
  "readingTime": 3.787106918238994,
  "claps": 10,
  "voters": 1
}