{
  "id": "1bb7e5d72402",
  "title": "Day 661",
  "createdAt": "2024-01-13 03:33:40",
  "tags": [
    "the-prince",
    "slavery",
    "freedom",
    "governments",
    "goods-and-bads"
  ],
  "url": "https://chepenikconor.medium.com/day-661-1bb7e5d72402",
  "content": "# Day 661\n\n![](https://miro.medium.com/1*hWDlUHXM5XROR61dLEbOEw.png)\n\nOne aspect of slavery that often goes unconsidered is the potential reluctance of slaves to embrace freedom. This hesitancy can stem from unfamiliarity with the concept of liberty, making the unknown intimidating. This phenomenon is somewhat analogous to individuals who, after being released from prison, commit crimes to return to incarceration - a peculiar but understandable human tendency. Our inclination for comfort and the path of least resistance, when viewed from first principles, reveals why such behavior can occur.\n\nIn reading 'The Prince' by Machiavelli, I was struck by a passage in Chapter 5 that resonates deeply with these ideas:\n\n> But, when cities or provinces are used to living under a prince, and his bloodline is eliminated - since on the one hand they are used to obeying, and on the other they do not have the old prince - they will not agree to make one from among themselves and they do not know how to live free. So they are slower to take up arms, and a prince can gain them with greater ease and can secure himself against them. But in republics there is greater life, greater hatred, more desire for revenge; the memory of their ancient liberty does not and cannot let them rest, so that the most secure path is to eliminate them or live in them.\n\nWhile I unequivocally condemn slavery as a deplorable practice, its modern manifestations are worth contemplating. Today, many individuals surrender a significant portion of their income, ranging from 10–50%, to the government in the form of taxes, ostensibly to maintain the status quo. This raises an intriguing question: Can the percentage of our income paid in taxes be likened to a 'slave bracket'? Think about it; a person who gives away all their earnings to another entity is completely enslaved. This is a thought-provoking concept that invites personal reflection, though it might not align with popular opinion.\n\nI do not view myself as a slave, yet the extent of my obligation to the government leaves me questioning my true level of freedom. Currently, I comply with tax obligations primarily to avoid the negative repercussions of defying Uncle Sam.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1741561211571884462%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIn a free market, individuals engage in voluntary exchanges of goods and services. However, the role of government in this dynamic often involves enforcing compliance through the threat of bads. The dichotomy between voluntary trade and enforced compliance underscores the complex relationship between citizens and their governments. Kind of funny to say governments trade in bads but sure enough they do. The United States is infamous for being a bully. Do X or we will bomb Y. It's an awful thing bombing people but it is a reality humanity is dealing with.\n\nFurthermore, witnessing the misappropriation of resources by corrupt officials, particularly when used to fund unjust conflicts, adds to the frustration. It highlights the paradoxical nature of humanity: capable of remarkable achievements and yet deeply flawed.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/joakimbook/status/1745837655273644514%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nSo yea stay free anon but remember that freedom is sure as hell not fre!\n\n1/12/24\n\nConor Jay Chepenik",
  "wordCount": 508,
  "readingTime": 2.116981132075472,
  "claps": 4,
  "voters": 2
}