{
  "id": "26b917999fba",
  "title": "Day 656",
  "createdAt": "2024-01-08 02:36:46",
  "tags": [
    "the-fountainhead",
    "ayn-rand",
    "soul",
    "block-770876",
    "children"
  ],
  "url": "https://chepenikconor.medium.com/day-656-26b917999fba",
  "content": "# Day 656\n\n![Few](https://miro.medium.com/0*W9yy7w2efh-H-nOI.jpeg)\n\nToday we celebrated with friends, family and loved ones. It was a special day getting to watch my child enjoy the company of so many people who love and care about her.\n\nAfter the party we all sat in bed and enjoyed each others company. It was hard getting out of bed to read my daily chapter and write. I did it though because I'm proud of these habits. Even went back to last year and read what I wrote during that time.\n\nI can't believe that it has been a year already. Time flys when you have children, the days are long but the year(s) is fast. The book I immersed myself in tonight, after tucking the little ones into bed, was Ayn Rand's \"The Fountainhead.\" I stumbled upon a particularly poignant scene where Catherine, driven by a sudden, compelling urge, proposes getting married to Peter the next morning since they engaged. She felt an instinctive fear that if she didn't act on her impulse immediately, the opportunity might slip away forever. As the chapter drew to a close, the narrative hinted with a sense of inevitable finality that they surrended because the next morning they did not get married. Thus it seems that Catherine and Peter would ultimately never walk down the aisle together.\n\nI don't know how the Fountainhead ends yet but I am looking forward to finding out. Earlier in the chapter a point that resonated with me is when Guy Francon's daughter, Dominique, is talking about mankind being totally connected like a net. I do believe the Universe is connected and sends signals. We just have to be open to receiving them. If we aren't we will miss the signals and they will provide us no value or insights into how to better live our lives.\n\nAyn Rand really tapped into so many things that make sense. It's remarkable to read her work, crafted long before my time, and discover its timeless relevance and insight. Among the many striking thoughts, one quote from Howard Roark particularly stands out: \"To sell your soul is the easiest thing in the world. That's what everybody does every hour of his life. If I asked you to keep your soul - would you understand why that's much harder?\"\n\n1/7/24\n\nConor Jay Chepenik",
  "wordCount": 385,
  "readingTime": 1.6528301886792451,
  "claps": 0,
  "voters": 0
}