{
  "id": "276462af707f",
  "title": "Day 63",
  "createdAt": "2022-05-24 17:37:25",
  "tags": [
    "world-economic-forum",
    "bitcoin",
    "carbon-footprint",
    "parenthood",
    "new-skills"
  ],
  "url": "https://chepenikconor.medium.com/day-63-276462af707f",
  "content": "# Day 63\n\nSent both sets of my Grandparents a postal card yesterday from Portsmouth, NH. My girl and I went and visited this past weekend: amazing town. Writing letters is becoming a lost art in our increasingly digital lives, but there is still something so special about receiving some actual postage. I hope that is not lost in the future and I can show my child the joy of sending actual paper rather than electronic mail. My Grandma Allegood sent me this picture from my childhood the other day.\n\n![](https://miro.medium.com/1*tHpqtT0UjZhy1v5vMU0rYQ.jpeg)\n\nMy Grandma said I exhausted her and barely slept. I imagine my child will likely be the same lol. Can't wait to have a little nugget I can shape into a Bitcoin Maximalist. Jokes aside, I will do my best to let my child explore what they are actually passionate about, but I do hope they enjoy discussing hard money. Speaking of said child, I went with my girlfriend to the Ultrasound and got these photos.\n\n![](https://miro.medium.com/1*RYSAP383yaNZKG-8oCrSJA.jpeg)\n\nGot emotional looking at the screen. Fortunately the child is doing well and no problems so far. God is good and I can't wait to meet the lil guy. Outside of that it has been good watching Avi from Rebel news [expose](https://twitter.com/OzraeliAvi/status/1529116792396066823?s=20&t=N7jvFy-7tBhFaHGS32ziLA) the hypocrisy going on at the W.E.F this week. No need to dwell, but I can't wait to bring a child into this world so I can show him he is part of the environment. Teach him that all the stuff coming from our mainstream media is 💩  and that these people want to [track our carbon footprints](https://twitter.com/ConorChepenik/status/1529142557988556800?s=20&t=N7jvFy-7tBhFaHGS32ziLA) while having carbon footprints 100x the average person. *Note that is a total guestimate but these people fly private jets all over the place* That alone is a bigger carbon footprint than someone living in a less developed country who has to walk miles just to get water. These \"elites\" are hypocrites and they need to piss off and mind their own damn business. They are the literal scum of the earth saying do as I say not as I do. Alas, I will have a kid who will know better than to trust anything these cowards say. Sure he might have a massive carbon footprint. Good. Energy is what allows humanity to flourish while killing reliable forms of energy causes human to suffer. Like any sane parent I want my child to flourish.\n\n![](https://miro.medium.com/1*Z8ZBIbWjaslZiz7Lj3wP4w.jpeg)\n\nThis meme got me thinking. Why spray our food with stuff that is so dangerous people have to where haz mat suites. Seems like there has got to be a better way to prepare food in mass quantities. I understand that bugs can ruin crops, but if the chemicals are so dangerous that the people spraying them can't get it on their skin it does not seem like such a bright idea to be eating that same food. Need to start doing some homesteading and find a place to garden. I live in an apartment so it is difficult, but companies are coming out with all sorts of cool stuff that let you grow food inside. Plus there are gardens around. Need to go put some boots on the ground and meet people who garden around Cambridge.\n\n![](https://miro.medium.com/1*DIL9fxhdydQJSfp8EhuDaA.jpeg)\n\nSaw this chart from Croesus and thought it was an absolute banger. Brilliant point about how the more you understand Bitcoin the more you put your value in it. I liked how it takes a little time before you actually start to invest since most people are skeptical. Never a great idea to just go all in without doing your due diligence. Knowledge is important and it can be fun to learn. Keep an open-mind and start learning anon. It is never to late to pick up a new skill, hobby, or talent. Speaking of trying new things this is going to be me tonight at my stand up comedy class.\n\n![](https://miro.medium.com/1*5SPNdMxx8s9Fbh79Uq3X1Q.jpeg)\n\nWe're doing one minute sets tonight. I'm hoping to incorporate jokes about my Dad being a little too invested in living vicariously through his children, finding out I was going to be a father while at work, and Bitcoin of course. Wish me luck anon :)\n\n5/24/22\n\nConor Jay Chepenik",
  "wordCount": 698,
  "readingTime": 3.4672955974842767,
  "claps": 0,
  "voters": 0
}