{
  "id": "282b77261b6c",
  "title": "Day 105",
  "createdAt": "2022-07-05 21:20:10",
  "tags": [
    "cooking",
    "comedy",
    "health",
    "children",
    "family"
  ],
  "url": "https://chepenikconor.medium.com/day-105-282b77261b6c",
  "content": "# Day 105\n\nBig night tonight. Excited to do my stand up set for an actual crowd and see if the jokes land. I did the set for my friend Ariel over facetime and she was genuinely laughing so I'm hopeful. Also, hit a nice run and was proactive at work so I could get my mind right for tonight. Outside of that not much to report. Released the podcast with my Dad and got some nice feedback from an old coworker. Feels good putting myself out there and creating stuff. Podcasting is a cool art and I appreciate long-form art very much. Speaking of podcasts I listened to Lex's 300th episode with Joe Rogan and thought it was an excellent example of a top-tier podcast. Do recommend listening if you appreciate the long form art that is podcasting.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fgk4tEO4jDUM%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dgk4tEO4jDUM&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fgk4tEO4jDUM%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nStarted season 4 of Stanger Things today. Last time I watched this show I had the worst hangover of my life in Bogota, Colombia. Literally watched all of season 3 in one sitting because I could not move that day. Still have an aversion to mojito because of that night🤣. So far season 4 is good, but I don't know. It's hard for me to watch normal TV unless I really like the show. I need to give Stranger Things a chance because I did like the show in past seasons. Been appreciating the art form of podcasting more recently so might take a second to get back into TV.\n\nCooked a nice steak today for lunch. Cooking with a lot of butter and a cast iron is key. Also garlic, salt, & pepper, maybe even some thyme if you're feeling fancy 😉 . Super glad I ordered a ton of beef from [K&C Cattle](https://www.kandccattle.com/). I hope the world doesn't get away from people cooking their own food. I know it's nice ordering delivery straight from our phones sometimes, but there really is something special about taking the time to prepare your own meal. Excited to teach my child how to cook all sorts of stuff.\n\nFinally, I just want to note that I'm very grateful to have my health. Was a wild past few months between the appendicitis and catching covid right after, but I'm feeling much better. Been good about crushing runs this July and will continue to put my health and wellbeing above other things. Being sick is awful and I want to make sure I continue prioritizing stuff that will allow me to meet my grandkids and maybe even my great-grandkids if my child pulls what my Dad and me did by having kids at the ripe age of 25😂 . Until tomorrow anon.\n\n7/5/22\n\nConor Jay Chepenik",
  "wordCount": 451,
  "readingTime": 1.7018867924528303,
  "claps": 0,
  "voters": 0
}