{
  "id": "28300eb7f36e",
  "title": "Day 374",
  "createdAt": "2023-04-01 00:57:23",
  "tags": [
    "politics",
    "code",
    "software",
    "restrict-act",
    "nostr"
  ],
  "url": "https://chepenikconor.medium.com/day-374-28300eb7f36e",
  "content": "# Day 374\n\n> [**The U.S. Restrict Act Explained | ExpressVPN Blog**](https://www.expressvpn.com/blog/the-u-s-restrict-act-explained/)\n\nHere is the summary a la chatGPT: The Restrict Act is proposed U.S. legislation that aims to limit national security risks by allowing the Department of Commerce to review, block, and mitigate transactions involving foreign information and communications technology that pose undue risk. The bill would apply to technology connected to six foreign adversaries: China (including Hong Kong and Macau), Cuba, Iran, North Korea, Russia, and Venezuela. The Act could give the government power to scrutinize any technology used by more than one million people in the U.S. Critics argue that it gives the government too much power to censor and control information and limit freedom of expression. The Act is primarily aimed at companies that create systemic risks to the U.S. national security, not individual users. The media statement from the bill's leader says the punishments in the bill would not be used against ordinary citizens, including those who use VPNs to access banned services in the U.S.\n\nI'm calling bullshit on the idea it would not be used against ordinary citizens. Seeing a former President get indicted is nuts. Does not matter what political side you lean. This is a horrible precedent to set. Wild times right now. I'm so grateful for protocols like Bitcoin & Nostr which do not care about these dystopian bills. They are just tools to allow people to transact and communicate freely. The Government has no business being an all seeing eye. People have a right to communicate and transact with whoever they want without big brother approving it.\n\n![](https://miro.medium.com/1*fu-KdOq1EoRjVxA9fzpIJA.png)\n\nShout out all the cypherpunks making moves to make digital freedom a reality. There are so many factors at play with these kinds of things, but I'm grateful to be on the side of using tech as a tool to help empower people. Using it as a tool to crack down on people is lame. I'm proud to report I passed my second systems check today at coding bootcamp. This means when I graduate I will have access to hiring partners if I keep successfully passing my system checks. This is exciting and whatever career path I decide to go down next I need to remember to find work which I know will benefit the world.\n\nAll the lies and half truths we are seeing today will be fixed over a long enough time horizon. Do not forget that demonizing or dehumanizing people based on their political beliefs only serves to further divide society and inhibit meaningful dialogue and progress. It is possible to disagree with someone's political beliefs while still treating them with respect and recognizing their inherent dignity as a human being.\n\nFocus on people's actions rather than their politics. People are complex individuals with a wide range of beliefs and experiences. We should strive to understand their perspectives and motivations, and work together to find common ground and solutions to the issues facing our society.",
  "wordCount": 515,
  "readingTime": 2.1433962264150943,
  "claps": 0,
  "voters": 0
}