{
  "id": "2d79e6a09d96",
  "title": "Day 472",
  "createdAt": "2023-07-08 03:50:59",
  "tags": [
    "bitcoin",
    "inflation",
    "youtube",
    "shorts",
    "ideas"
  ],
  "url": "https://chepenikconor.medium.com/day-472-2d79e6a09d96",
  "content": "# Day 472\n\nYoutube Shorts Ideas:\n\n- The difference between proof of work & proof of stake\n\nProof of work is a mechanism designed to ensure fairness and prevent cheating in a game or system. By requiring participants to solve complex computational puzzles, it establishes a level playing field where no single entity can dominate the process. In contrast, proof of stake has the potential to lead to centralized systems, especially if a small group of participants amasses a significant portion of the coins early on. This concentration of power can result in disproportionate control over the system's operation, undermining its decentralization principles.\n\nIn the context of Bitcoin, proof of work plays a crucial role in establishing the value and credibility of the currency. It provides a tangible link to reality by requiring real-world computational effort, making it more difficult to manipulate the system. This inherent difficulty and the secure nature of proof of work contribute to why Bitcoin measured in USD looks like this.\n\n![](https://miro.medium.com/1*dx_Pzt6tpN4ABs0zdFt6xw.png)\n\nYes it's volatile but how else would you expect the market to come to grips with the idea of absolute scarcity. Measured in btc 1 bitcoin === 1 bitcoin and there will only ever be 21 million of them. (Really less if you include all the coins already lost)\n\nOn the other hand, proof of stake is akin to a Rube Goldberg machine. It's a complex and convoluted system that relies heavily on obfuscation and unproven narratives. It's essentially fiat 2.0 because it leverages blockchain instead of banks to control the ledger. The potential drawbacks and complexities associated with proof of stake systems make it inferior money when compared to the more established and proven proof of work mechanism.\n\nSo, in proof of work, the winner is the one who solves a difficult puzzle to add a block to the blockchain, while in proof of stake, the winner is chosen by the number of coins they already have.\n\n- Twitter as Digital Glasnost and Bitcoin as Digital Perestroika\n\nThe combined impact of Glasnost and Perestroika was transformative for Soviet society. Increased openness and political reforms allowed for the emergence of civil society organizations, independent media, and a more engaged citizenry. It led to the exposure of previously suppressed social issues, discussions on national identity, and debates on historical events. However, these changes also created tensions and uncertainties as existing power structures were challenged, leading to political and social instability.\n\nSometimes you have to go through challenging experiences to come out the other side stronger. Freedom of speech is essential for several reasons. Firstly, it promotes the exchange of diverse ideas and opinions, leading to intellectual growth, innovation, and progress. When individuals have the freedom to express their thoughts and challenge prevailing beliefs, it fosters critical thinking and encourages the exploration of new possibilities.\n\nSecondly, freedom of speech enables transparency and accountability. By allowing open discussion and public scrutiny, it becomes easier to identify and address societal problems. It allows for the exposure of corruption, injustice, and human rights violations, ultimately leading to social reform and improvement.\n\nFinally, freedom of speech nurtures a vibrant democracy. It ensures that citizens can participate in political processes, voice their concerns, and hold their elected representatives accountable. In a democratic society, the free flow of information and ideas is crucial for informed decision-making and the protection of individual rights.\n\nFreedom of speech not only contributes to the intellectual and cultural development of a society but also serves as a safeguard against tyranny and promotes a more inclusive and democratic environment.\n\n- This Tweet\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/LynAldenContact/status/1677497634661998592%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n- Newton's third law of motion states: \"For every action, there is an equal and opposite reaction.\"\n\nNewton's third law of motion applies beyond physics! When Central Banks create money out of thin air and pump more cash into the economy, inflation becomes the opposite reaction.\n\n![](https://miro.medium.com/0*Er4M3-vyTFMdJmsx)\n\nGot some good scripts from writing today. I look forward to shooting and editing these shorts tomorrow.\n\n7/7/23\n\nConor Jay Chepenik",
  "wordCount": 657,
  "readingTime": 2.8625786163522013,
  "claps": 0,
  "voters": 0
}