{
  "id": "2d7ba1d519f3",
  "title": "Day 288",
  "createdAt": "2023-01-04 22:31:35",
  "tags": [
    "bitcoin",
    "mopeds",
    "internet-clout",
    "digital-chaff"
  ],
  "url": "https://chepenikconor.medium.com/day-288-2d7ba1d519f3",
  "content": "# Day 288\n\nHere is a prompt I'm trying to write about currently.\n\n> The Gatekeepers Issue\n\n> Who died and made you King? The average hand dealt these days are typically faceless and off-suit, coming from a deck stacked against us. Our lives have quietly become restricted by the hidden hands of a tabletop dealer, mandating an unfamiliar game in which the house always wins. Our stacks dwindle, theirs grows ever larger, and anytime it seems like one of us at the table starts to get something going, the pit boss pays a visit and suddenly the rules have changed. Got a nice stack of gold? Here comes Mr. #6102. Thank you for your service. Got a wallet stuffed with redeemable banknotes? What's that? Sorry friend, Nixon just called. (Shocking, I know.) How about that savings account full of dollars? Better spend 'em before Bernanke prints them into oblivion. Would you like to file a complaint? Sure thing, just use this pen filled with disappearing ink and be sure to sign it legibly before depositing it in the shredder disguised as a comment box.\n\n> The riverboat casino of modern society rolls on, complete with security cameras, guarded exits, metal detectors, other state of the art surveillance devices and a paid mob of enforcers keeping us all in check. But how did we get here? Who is it that sits in that presumably smokey back office while their all-seeing eyes dart between the monitors filled with scenes from our day-to-day lives? And better yet, who exactly has their eye on Mr. Monitor? With all apologies to Alan Moore; who watches the watchmen?\n\n> Gatekeepers come in all shapes and sizes with varying autonomies and jurisdictions. Not all are evil and certainly not all have much influence in how we all go about our lives. Yet the archetype is eternal and pervasive; teachers, policemen, social media moderators, school boards, medical advisors, legislators, late night radio DJs, politicians, and yes, even that uppity host from your favorite Italian joint. The information superhighway itself has become congested with checkpoints and toll booths, constricting the flow of digital information yearning to be in its natural state; free and flowing in the proverbial top-down convertible of an open internet.\n\n> The more connected we are, ironically, the more choke points present themselves. Are we hypocrites for calling out the gatekeepers of our times while selectively platforming the content you yourself are about to read? You bet your ass. But at least we are transparent and honest about it. There is a thin-line between curation and censorship. There is an even thinner line between moderation and constitutional violation. **The Gatekeepers Issue** explores the liminal space between these nuances, hoping to paint the fences worthy of demolition and those deserving respect. But in a world where journalists can be imprisoned for telling the truth, assets can be seized, conversations can be listened-in on, medical professionals' opinions can be censored, and all the while your data is unknowingly packaged and sold to the highest bidder...\n\n> it just might be quarter-past time we start calling out the night watch.\n\nThe reason the U.S constitution has held up so well, despite many kleptocrats attempting to do away with it, is because our Founding Fathers understood how important is was to decentralize power. It is a bit counterintuitive when you think about it. The United States became the most powerful nation by making sure no one individual could consolidate all the power for themself. In doing so, even the President has limits imposed on what they can and can not do. It's a beautiful thing. Sure America had other advantages like two oceans separating our land on each state plus a bunch of resources. The point still holds though. There is no way we would be the nation we are today if it weren't for the separation of the judicial, executive, and legislative. This combined with the will of the people who were given the right to bear arms made for a lethal combination of wealth generation, freedom, hope, and prosperity. Unfortunately, with modern technology it seems our current regime is attempting to consolidate all of the power inside the U.S Government.\n\nThe problem with the Government is that it's unlike a parent raising a child. You see a child by themself is pretty helpless. A parent will raise this kid and with enough time that kid can become sovereign and independent. If the parent raised their kid correctly then the parent can hopefully depend on that child for help when the parent grows old. It's a beautiful thing relying on family. There is no shame in the mutually beneficial relationship between a parent and a child.\n\nNow lets look at the relationship between the state and the individual. Even in the United States which has some of the best property rights in the world we are dealing with an abusive relationship. If you want to own land in the U.S you will have to pay property taxes on that land. If you want to earn an income you will be taxed on a federal level and potentially on a state level. The wealthy have learned to borrow against their assets in order to avoid income in many cases just to avoid income tax. Accountants and lawyers make a lot of money helping wealthy individuals figure out how to best game the system. Individuals also have to pay an inheritance tax if they want to pass wealth down to their family. If you are wealthy enough and try to renounce your citizenship there is also an exit tax. The best part of all this is that the state can print this same money it charges you for all of these things.\n\nBUt mUh roAdS?! The state should exist only to protect private property. It takes egregious amounts of wealths from its subjects while providing little to no value in most cases. As if all these taxes were not bad enough the past two years are full of more examples of \"The Swamp\" trying to centralize power and impose ridiculous mandates without having actual scientific debates. Censoring people who questioned the narrative is the opposite of the scientific methods.\n\nWithout the state the U.S would not be what it is today, but unfortunately the state has been occupied with a bunch of old, narcissistic, and entitled kleptocrats who think they don't have to answer to we the people. When a family starts acting this way the effects are noticed almost immediately. When the state starts acting this way it takes a long time for those in power to notice from their ivory towers. People are pissed off and there needs to be a change. Luckily, Satoshi came along and created a digital constitution. You can not coerce people forever, but you can rely on incentives to drive behavior. When Saotshi created Bitcoin he created a system based entirely on truth. One that decentralizes power similar to how the U.S constitution did.\n\nThere are few things in this world with more contradictions than Bitcoin. It still amazes me to think that greed is what gets people interested while generosity is what encourages people to stick around. If you believe that the human abundance, prosperity, and freedom is a bad thing then you will hate Bitcoin.\n\nMe thinking of what else to write at the moment. This is rough draft and I will continue working on it the next two days so if it seems like shit just know this turd is going to get polished by Jan 6. (the due date for initial submissions)\n\n![](https://miro.medium.com/0*k3c7nJsfQSzVM1An)\n\nHahahaha there is a kid outside my apartment trying to do wheelies in the street on a moped. A taotao 50 cc moped which are truly pieces of shit. I know because I had one in college and it always had trouble starting. Kind of funny watching his buddy record him as he tries to do wheelies. Hopefully the kid doesn't hurt himself but I do respect the grind. Amazing what us humans will do for internet clout.\n\nListened to this podcast read from Guy Swan today and wow. He knocked it out of the park with both the read and his comments afterwards.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F1iHMk7Gf1nGTYfzHjIZQGF%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F1iHMk7Gf1nGTYfzHjIZQGF&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f7d01526428cefdf9d4bc0958&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nPeople are waking up baby. The gatekeepers are being reactive rather than proactive. You love to see it. Their narratives are crumbling and they are doing the autistic screech in a last ditch effort to prevent people from having legitimate conversations. Or as the author, Aristophanes, puts it, \"So they fire out digital chaff frantically in every direction, they play whack-a-mole with high-engagement nodes that are or could be threats.\" Which become less and less effective as more people recognize these psy-ops for what they are.\n\n> [**Highway to Hell**](https://alilybit.substack.com/p/highway-to-hell)\n\nAnother great article showing how much power the American technology companies + Wall street has. It appears these two groups have teamed up with the Government through back channels. Their goal seems to be to bankrupt citizens and then offer a UBI through a CBDC. At least this is what the above article articulates and I agree. People aren't just going to roll over though. Many will just say \"ah whatever CBDC can't be that bad\" but a big enough group that is steadfast in their beliefs will opt out. They will use Bitcoin and decide for themselves that they don't want to eat their allotted amount of bigs!\n\nI understand I am spoiled to live in the U.S. It's a great privilege to live in the nation that can print the global reserve currency at will. Our luxury here often comes from less developed countries getting screwed which is unfortunate. I say this because today when I was at the grocery store I noticed that it cost about 35 bucks for just over a 1.5 pound steak. It blew my mind. I remember when I was a teenager that Ruth Chris steaks were like 40 bucks. That means you could get an incredible steak dinner for $5 more than the one at the grocery store costs today. It is deeply disheartening to see inflation making steak unaffordable. If it is this bad in the U.S I can only imagine what it is like in the rest of the world.\n\nWhen no one is watching \"The watchmen\" they do shady shit. There is that great quote \"Hard times create strong men, strong men create good times, good times create weak men, and weak men create hard times. Well I just thought of another one. \"The watchmen consolidate power, that power makes the watchmen complacent, the people get angry with the watchmen, the watchmen lose their power.\" We are seeing it take place in real time. Some people are beyond the pale, but many others are pissed and rightfully so. You can only cheat people for so long before something breaks. World leaders are playing a dangerous game and I hope they stop being so complacent before they wake up the majority.\n\nIf you think that the watchmen are going to fix the mess they made then I got a bridge to sell you. Just hit my Twitter DMs and I'll send you a lightning invoice to purchase said bridge. Jokes aside, I hope anyone reading this thinks about how truly terrible a CBDC will be. They are going to either going to try and force the masses to use it via \"another emergency\" or make it so if you want to receive your UBI you will need to sign up for the CBDC. Don't buy it anon. These Central Banks want us eating pastes and blindly following their narratives. Front run them and buy some 🌽 . It is the right thing to do. Don't trust me though. Go verify for yourself!!!!\n\n1/4/23\n\nConor Jay Chepenik",
  "wordCount": 1993,
  "readingTime": 7.720754716981133,
  "claps": 0,
  "voters": 0
}