{
  "id": "301a4ff21f95",
  "title": "Day 121",
  "createdAt": "2022-07-21 22:43:20",
  "tags": [
    "comedy",
    "bitcoin",
    "checking",
    "savings",
    "costa-rica"
  ],
  "url": "https://chepenikconor.medium.com/day-121-301a4ff21f95",
  "content": "# Day 121\n\nSo far avoiding my Twitter TL has just led me to using other apps. One of those apps is Mimo which is a coding app that has been good. I think becoming a software engineer is valuable for two reasons. Job security in the future and an ability to help create platforms that make Bitcoin easier to use. Tomorrow I can redownload Twitter according to my month off self-made rule and I'm looking forward to that because Reddit has just been urking me when I'm not using Mimo.\n\n> [**Packed your Bitcoin? A BTC holiday in Costa Rica goes fiat free**](https://cointelegraph.com/news/packed-your-bitcoin-a-btc-holiday-in-costa-rica-goes-fiat-free)\n\nSo back to important things like Bitcoin lol. Many parts of the network are growing rapidly. Take the lightning network which is helping merchants accept bitcoin for goods and services. This is so exciting to see and the article I've posted above makes me want to visit Costa Rica. Paying for stuff with sats seems like a no-brainer with tools like Muun wallet. I like to think of Muun wallet as a checking account and hardware wallets and multisig setups as savings. You wouldn't walk around with millions if you had them so it doesn't make sense to store 100s of bitcoin on a Muun wallet. Not that I have millions or 100s of bitcoin hahahaha but you get the idea anon. Easy to load up a Muun wallet with more sats if need be especially since Muun accepts lightning\n\nGoing back to that comedy show Duckduckgoof I went to last week. If I'm feeling bold I might rip an open mic. If not I get to drink beer and enjoy some quality standup. Watched Bill Burrs Netflix special with my girlfriend recently which was pretty solid. The man does a great job pointing out how ridiculous some of the crap that went on the past 2 years without being controversial. It was also pretty funny listening to a \"self-proclaimed alcoholic\" give his take on mushrooms.\n\nPsychedelics are a powerful thing and while a lot more research into them would be good it seems they have amazing potential to help people with their mental health. In today's world, it is easy to get caught up thinking dark thoughts. Psychedelics seem to do a great job helping people let go. Hahaha I'm reminded of the meme that the government can't let psychedelics become legal because then people wouldn't put up with their Frankenstein system.\n\nChoosing kindness is always a great option. Easier said than done, but when our leaders aren't incompetent, cruel, and corrupt it's more likely people will be kind. Not saying having corrupt leaders justifies being a bad person, but I do think a lot of people use this excuse to be shitty. This might be a gross overgeneralization but I like to make those to get my point across. At least I'm honest about it unlike the mainstream media and politicians around the world.\n\nFeeling like I might have the confidence to hit the open mic tonight. Did the first part of my set at work today because someone asked for my tight five and I gave them a solid 2.5 hahaha. Would've crushed the whole set but the farther along my sets gets the more out there my jokes become and I didn't want to crack those at work. It was fun though doing the first part and I got some good laughs.\n\nLife is better when you can crack jokes. Not always easy to have fun in a corporate setting but doing so definitely makes the job better.\n\n7/21/22\n\nConor Jay Chepenik",
  "wordCount": 618,
  "readingTime": 2.332075471698113,
  "claps": 0,
  "voters": 0
}