{
  "id": "314d189f2d47",
  "title": "Day 168",
  "createdAt": "2022-09-06 18:52:27",
  "tags": [
    "river",
    "streams",
    "bitcoin",
    "going-with-the-flo",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/day-168-314d189f2d47",
  "content": "# Day 168\n\nToday I'm trying to imagine my life as a River. It's a lot easier to go with the flow of said River than it is to try and swim upstream. I need to place more emphasis on listening to my heart, mind, and soul rather than my ego and desires. It's good to have desires but making goals to get there and adjusting the goals based on your life seems like a better plan than obsessing over hitting your \"perfect\" goal. Life has a funny way of getting in the way of your plans. Like for example this past Friday I had the goal of picking up my Mom and Stepdad at the airport. Well it turned out someone hit my car so I wasn't able to achieve my goal. Luckily, my Mom had no qualms about taking an uber and the people who hit my car are paying for a replacement so it is not a big deal. I could've let the crash ruin my day but instead I just threw on the spare and got to feel like a handyman for 30 minutes.\n\nObviously, I would have preferred to have been able to pick up my parents but the universe had other plans. Being able to adapt to a situation is a lost art. If you chase perfection not only will you never attain it but you'll lose your hair in the process of trying to attain it. Thus, I'm learning to go with the flow of life rather than swimming upstream. Solving problems as they occur rather than looking for them in everything I do.\n\nNow to tie it to Bitcoin because that is what I enjoy doing😂 . Bitcoin will win out because those who try and go against the flow of the network waste massive amounts of resources for a result that won't achieve anything. I can't think of a feasible reason why someone would rather 51% percent attack the network than just add the highest bidding transactions to the next block. Miners stand to gain more monetary value playing by the rules (going with the flow) than they do going against. Some might argue nation-states might want to attack it to prove it's not a good alternative to fiat, but when that starts happening it sets off this game theory where other nation-states start mining and that results in the 51% attack becoming more difficult. Thus, all the utxos end up getting added to blocks at some point, the network strengthens, and the miners realize they face more of an opportunity cost attacking the network (swimming upstream) than playing by rules. Man Satoshi was a smart dude. If there is one thing that people can count on it is humans acting in their own self interest. Making a network that is strengthened over time via people using the network in their own self interest is brilliant. The stream of Bitcoin is a beautiful thing and now I'm inspired to draw a Bitcoin stream. So here goes nothing.\n\nShout out procreate and google images because without them this bad painting would be even worse.\n\n![](https://miro.medium.com/1*wBv5B4aBMBTQGeV4vuSJIg.jpeg)\n\nNot sure why it came out so tiny but whatever. It's difficult to find your voice in this world. Writing and reflecting on my own thoughts and happiness reminds me how connected everything is. I'd like to one day not work for anyone and be my own boss, but it is the stream of Bitcoin that has helped me think long term and realize I can get there one day. It just starts by stacking sats and being humble. That will lead me to have a goal but also adapt accordingly to what life brings me. The river of life and bitcoin is amazing. Swim with it not against it anon. Otherwise you'll end up in the rat race looking where \"they\" want you to look and being to0 scared to ever write down your goals and chase them.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/spiro_ghost/status/1567195009232797696&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nNothing can replace the work not even quality self help books which I do honestly enjoy sometimes. Go out write some goals, chase those goals, and adapt as life's stream guides you to deal with various problems.\n\nBang bang.\n\n9/6/22\n\nConor Jay Chepenik",
  "wordCount": 704,
  "readingTime": 2.8566037735849057,
  "claps": 0,
  "voters": 0
}