{
  "id": "3213c8fa88e6",
  "title": "Day 823",
  "createdAt": "2024-06-23 02:58:54",
  "tags": [
    "trump",
    "biden",
    "politics",
    "bitcoin",
    "democracy"
  ],
  "url": "https://chepenikconor.medium.com/day-823-3213c8fa88e6",
  "content": "# Day 823\n\n**Why I'm Voting for Donald Trump**\n\nThis year's election is significant for me as it marks the first time I will cast a vote for President of The United States. I graduated high school in 2016 and college in 2020. Now, in 2024, I'll be exercising my right to vote in a system designed for the people, by the people. Previously, I refrained from voting because I didn't view either side as less evil. Politics is often characterized by partisan hostility, with both sides engaging in relentless attacks on their opponents. This adversarial approach to politics left me feeling disillusioned, as if the choices presented to voters were merely variations of the same flawed system.\n\n![](https://miro.medium.com/0*Mtos1pLoStCFPh1j)\n\nJokes aside, as I approach this election, I find myself reevaluating my stance. Engagement, rather than apathy, is the path to positive change. Through a lot of studying I've come to the conclusion that if we fix the money we can fix the world. So when I look at the options available it's pretty clear which party seems more genuine about fixing the money.\n\n![](https://miro.medium.com/0*MuVZ-gNyv7a3gTPE)\n\n![](https://miro.medium.com/0*9J6n_W-KYH-gphS1)\n\n![](https://miro.medium.com/0*-LBQO-V1iWptoAOh)\n\nIt's honestly astonishing that Bitcoin became a legit computer network on January 3rd, 2009, in the aftermath of the global financial crisis and now it might just be the thing that decides the election. The 80/20 rule has always intrigued me. It suggests that a mere 20% of your actions can yield 80% of the results. When it comes to politics, this idea applies nicely to embracing Bitcoin. It's like a magic potion for gaining public goodwill. On the flip side, attacking it doesn't seem to win you any popularity contests.\n\nDuring the 2016 election, I was an uninterested bystander, neither voting nor particularly invested in the outcome. The next morning, though, I walked into my sociology class to find a room full of students who looked like they'd just been told the apocalypse was upon us. Everyone was upset that Hillary Clinton, [who allegedly threatened to drone strike Julian Assange](https://www.politico.com/story/2016/10/hillary-clinton-julian-assange-229123), was not going to be President of the United States. The general consensus in that room was that democracy had failed. I remember sitting there, watching the chaos unfold, thinking, \"Isn't the whole point of democracy that you don't always get your way?\" After all, if one party always got what they wanted, it wouldn't really be a democracy, would it? It would be more like a dictatorship.\n\nDespite all the people freaking out it is hard to argue with the fact that under Trump's presidency, tensions across the world were relatively lower. We weren't on the brink of World War 3, the Department of Justice wasn't weaponized against presidential candidates, and gas was cheap. I'm not a die-hard Trump fan, but there is no denying his administration handled certain issues better than the current one. Operation Warp Speed, for instance, was a misstep, and the [COVID vaccines didn't deliver on their promise](https://www.thecommonsensemovement.com/posts/pfizer-lawsuit) to prevent the spread of the virus. That said, Trump's current stance on Bitcoin and his [promise to free Ross Ulbricht](https://x.com/zackvoell/status/1794545383525532027) are more appealing to me than the Democrats' policies, which have brought us to the edge of global conflict. Compared to the communists on the left, the 'Orange Man' doesn't seem so bad after all.\n\nThe bright side is we are already at the point where some democrats are defecting from party lines. Andrew Cuomo, the former Attorney General and Governor of New York, recently made headlines with [his comments on Bill Maher's show](https://x.com/BehizyTweets/status/1804381656486203707) regarding the Trump hush money case. \"I'm telling you, that case would have never been brought. And that's what's offensive to people. And it should be.\" Regardless of if you are a Republican, Democrat, or something else, Americans should call out the weaponization of the justice system. If the courts become fully corrupted, this country will face much bigger issues than the left vs. right divide. We need to realize that the real divide is between the establishment class, which seeks an ever-expanding bureaucracy, and the anti-establishment class, which wants more peace, prosperity, and our God-given rights to be left alone.\n\nWhen you compare the two candidates with a realistic chance of winning, it becomes clear that President Trump is the anti-establishment candidate. Yes Trump has his flaws, just like any other human being, but let's not forget that he was a successful businessman before he became President. Unlike Biden, who's been in politics his whole life. It's like comparing apples to oranges, or in this case, a business mogul to a career politician. Now to be fair Trump hasn't always been a fan of Bitcoin. His recent embrace of digital assets marks a significant shift from his stance in 2019, when he was quite critical of it.\n\n![](https://miro.medium.com/0*3XbXJMlufv56HBP-)\n\nHowever, a lot has changed since 2019, including Trump's opinion on Bitcoin. If the Democrats genuinely did a 180 on Bitcoin and backed it with convincing actions rather than just rhetoric, I would gladly vote for them, especially if the Republicans were attacking Bitcoin. However, the Democrats seem to have only flipped because Trump found success in embracing Bitcoin. Since gaining power in 2021, their actions have continually hampered the industry as a whole. Meanwhile, Trump met with publicly listed Bitcoin miners in the USA and afterward posted about mining the remaining Bitcoin in the United States.\n\n![](https://miro.medium.com/0*KDAUwedd_1akBohL)\n\nBitcoin is not a panacea for all the world's problems. However, fixing the money could address many issues caused by the broken incentives of fiat currency. One concept illustrating these problems is \"luxury beliefs\" - ideologies adopted by the elite for status, which ironically undermine the quality of life for the less privileged. A great example of these luxury beliefs is a homeowner who proudly displays a 'Defund the Police' sign in their yard, yet their property features signs for private security services.\n\n![](https://miro.medium.com/0*dKvfKsXT3Qg_tjMK)\n\nThis stark contradiction between advocating for the removal of public safety measures while ensuring personal security through private means is hypocritical. There are plenty of other examples, like those who shout about climate change yet fly on private jets. There is nothing wrong with flying private if you have the means, but don't lecture the general population about CO2 emissions and tracking people's carbon usage.\n\nThese people need to be called out for their hypocrisy. It is one thing to genuinely care about an issue and have your actions align with it. What is despicable is when someone expects others to make sacrifices they themselves are not willing to make. That is called a hypocrite. Society is a better place when people continually mock and expose the inconsistencies of these hypocrites. This process of exposure allows others to see through the facade and recognize the truth. In the long run, truth and common sense tend to prevail. However, the critical question remains: How much discord and disillusionment must occur before the majority recognizes and rejects such hypocrisy? It's our collective responsibility to demand authenticity from our leaders and public figures.\n\n![](https://miro.medium.com/0*tSxVRr8RUMzQ8Kyq)\n\nDon't be fooled by divide-and-conquer tactics which are rampant in politics. Speak up when you see politicians betraying their principles, regardless of party affiliation. While many of us would prefer to avoid politics, we can't ignore its impact on our lives. Even if you resist aligning with a political party, remember that politics affects you whether you engage or not. As Plato wisely noted in 'The Republic', 'The heaviest penalty for declining to rule is to be ruled by someone inferior.' Stay informed, think critically, and participate in the political process to protect your interests and values.\n\n![](https://miro.medium.com/0*MC-tBLzwNS4y4Dbk)\n\nFreedom requires vigilance. As Henry David Thoreau wisely noted, 'There are a thousand hacking at the branches of evil to one who is striking at the root.' Astute politicians recognize this, addressing issues they believe tackle fundamental problems. In contrast, unscrupulous politicians will resort to denial, accusation, and gaslighting. The choice is clear: actively participate in the political process or be subject to the decisions of those who do.\n\n![](https://miro.medium.com/0*P0Q0b1lM1J_imcKd)\n\nWhile no single politician can solve all our problems, it is evident that some align better with the critical priorities of our time. We should do everything in our power to avoid violence. Trump's potential to de-escalate international tensions, foster the digital assets industry in America, and challenge the establishment status quo should resonate with those seeking a better United States of America. Ultimately, informed engagement in our democracy is the key to shaping the future we desire. This is why I will be voting for Donald Trump in the 2024 election.\n\n6/22/24\n\nConor Jay Chepenik",
  "wordCount": 1428,
  "readingTime": 6.638679245283019,
  "claps": 0,
  "voters": 0
}