{
  "id": "3273f11c5f69",
  "title": "Day 275",
  "createdAt": "2022-12-22 18:07:37",
  "tags": [
    "zelensky",
    "war",
    "kleptocrats",
    "podcasts",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-275-3273f11c5f69",
  "content": "# Day 275\n\nI've been listening to a lot of my podcasts at 1.5x speed and what always catches me off guard is the intro music. After a minute or two I don't even notice that the people are speaking faster. It sounds like a normal conversation. I only notice the podcast is sped up during any intro and outro theme songs. Sometimes I'll even put the podcast up to 2x and after awhile it just seems normal. The drawback to listening to podcasts so fast is that it makes you speak faster. I appreciate being able to consume more podcasts in a shorter amount of time. However, if it is a conversation I'm really excited for I'll slow it down to 1x speed. I'm reminded of Emerson Spartz who I heard on the What is Money? podcast. Genius dude and that pod was full of great advice. Homie spoke so fast though. Emerson mentioned he listens to a lot of podcasts at 3x speed and I can tell he is not lying based on how fast he speaks. I enjoyed that whole podcast at 1x speed hahahaha.\n\nCrazy to think Christmas is right around the corner then 2023. Life moves quickly and it feels like yesterday I was a high school student. It's funny to look back on your younger self and think of all the stupid things you did. What's ironic is we think we're so much smarter now than we were. I'm confident in 10 years I'll look bak on my twenties and think man I was so ignorant. Nothing beats life experience. In a way this means you have grown as a person. Probably not great to look back on yourself from 10 years ago and think yea I was just as wise hahahahaha.\n\nGot a Bitcoin meetup tonight which I'm excited for. Need to write the first Mass Adoption substack afterwards. I'd like the theme of the piece to focus on how Bitcoiners continue to build in the bear market while kleptocrats try and fast track a 1.7 trillion dollar bill through congress. I'm not going to post it here because it's quite frankly embarrassing, but I saw a picture of Nancy and Kamala holding a Ukraine flag behind Zelensky as he gave a speech asking congress to fund his war with Russia. While I feel bad for Ukrainians stuck fighting a war it is not the responsibility of the United States to pay for it. The American taxpayer should not foot the bill for a nation that has been deemed one of the most corrupt in Europe. I can't imagine what our forefathers would think of a foreign flag being held up by the Speaker of the House and the Vice President in the halls of Congress. There is nuance to be considered in these conversations. War is always horrible and those who have to fight it end up facing the consequences. The politicians and executives running the corporations who benefit from the military-industrial complex make tons of money. This is not right. Zelensky was also not wearing a suite, but instead a military type outfit. It is clear this whole thing is supposed to be a scripted piece of propaganda to make sure citizens don't question why were are sending billions to a foreign country. We should be having peace talks with a nuclear power like Russia, not provoking them by funding a proxy war. It's a sad state of affairs in Washington D.C right now.\n\nThus, I'm going to focus on the positives of this Bitcoin meetup. The energy and excitement by those focused on building a better system rather than extracting wealth from the current one. I would feel so much better about paying taxes if I knew the money was not going to people who could care less about \"We The People\". Anyways, these conversations are difficult to write about and discuss with others.\n\nPeople get emotional when war is involved. Understandable of course. If people are dying it's a natural reaction to want to help. However, as an American I don't believe we have any business meddling in the affairs of a war on the other side of the planet. Maybe it would be one thing if Ukraine was actually in NATO and a legit democracy. As far as I can tell Ukraine is full of Nazis ([The Azov Battalion](https://www.reuters.com/article/us-cohen-ukraine-commentary/commentary-ukraines-neo-nazi-problem-idUSKBN1GV2TY)) and they suspended any other political parties. I guess the latter could be argued was necessary during times of war, but as many know once politicians get power they don't give it up. I'm far from a geo politics expert but this whole thing seems more about furthering the military industrial complex and laundering money than actually defending democracy. The cherry on top being ordinary citizens pay while kleptocrats feast on their profits. This is why we Bitcoin. I have no plans to talk about these problems in my Mass Adoption Substack piece. Just going to focus on the positives coming out of Bitcoin :)! Plus it's Christmas which means it is time to celebrate and get in the spirit of giving. (Just not to nations trying to start World War 3 lol.)\n\n12/22/22\n\nConor Jay Chepenik",
  "wordCount": 868,
  "readingTime": 3.2754716981132077,
  "claps": 0,
  "voters": 0
}