{
  "id": "329a7812c40c",
  "title": "Day 538",
  "createdAt": "2023-09-11 20:16:29",
  "tags": [
    "gold",
    "bitcoin",
    "fiat",
    "problems",
    "solutions"
  ],
  "url": "https://chepenikconor.medium.com/day-538-329a7812c40c",
  "content": "# Day 538\n\nHow can I learn and grow if I don't go out, try new things, and take risks? Yes, it's possible I'll fail. But learning from my mistakes will be key. There are many expensive lessons out there, but the worst lesson you can learn is not even trying. You miss 100% of the shots you don't take. But you also must take 100% of the shots you miss, as opportunities to improve.\n\nThe core idea is that success requires boldness to pursue opportunities, as well as wisdom to do so prudently. Too much caution leads to stagnation, while imprudence leads to ruin. The ideal path blends measured risk-taking with careful planning.\n\nScience started to make truly significant strides by embracing the fundamental notion that \"we don't know; let's test\" rather than assuming homo sapiens already know everything. Science is about inquiring, testing, scrutinizing, and iteratively refining our understanding. It continually progresses with each successive test, evolving and expanding our knowledge.\n\nIt's crucial to recognize that not taking a risk is, in itself, a choice - a choice to remain stagnant and unfulfilled. When we allow fear to dictate our decisions, we limit our potential and hinder our ability to provide value. Fear kills critical thinking. To make a difference, we must be willing to step out of our comfort zones and take those shots, even if we miss many along the way.\n\nThese are the things I have been pondering after finishing _Sapiens_ today. It feels good to read. I've been guilty of not reading as much as I should and now I realize I do myself many more favors reading > watching quality content on Youtube.\n\n![](https://miro.medium.com/0*RnFjvIiMmBBmhttJ)\n\nStill love quality content though. Just saying reading feels good on my brain.\n\nOn a different note when you view governments through the lens of individual behavior, the U.S. Government finds itself in a situation akin to someone maxing out their credit card, fully aware that bankruptcy looms on the horizon. It's a race to make the most of the current favorable conditions. After all, nobody wants to be caught standing without a seat when the music eventually stops.\n\n![](https://miro.medium.com/1*1Q6Jw6mNvkkbaDsQOK9Fvg.png)\n\n![](https://miro.medium.com/1*uInYNLavQYhWnw0cA-Hp4A.png)\n\n![](https://miro.medium.com/1*kfHMtVtO9YMics8Jdm8Djw.png)\n\n![](https://miro.medium.com/1*S3jv7VDCkI2dl-5ui2B3-g.png)\n\n![](https://miro.medium.com/1*HdP9Bhp9oHIC6HImLK2v8Q.png)\n\nMemes are winning this war. Slow and steady. Find the problems, address them from first principles, show others there is a better way. Find solutions to problems. Fix the money; fix the world.\n\n![](https://miro.medium.com/0*KhKMbQbGSCYUII_m)\n\n9/11/23\n\nConor Jay Chepenik",
  "wordCount": 396,
  "readingTime": 2.5443396226415094,
  "claps": 0,
  "voters": 0
}