{
  "id": "33a3827334ae",
  "title": "Day 172",
  "createdAt": "2022-09-10 16:04:55",
  "tags": [
    "tesla",
    "father",
    "profits",
    "rent-seeking",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-172-33a3827334ae",
  "content": "# Day 172\n\nLet me start by saying I love my Dad. That man is just damn stubborn and he does not see Bitcoin the same way I do. I feel like he views Bitcoin the same way I viewed Bitcoin in 2017. A get rich quick scheme that has no real impact on the world outside of a cool project for computer geeks and a speculation tool for retail. Not proud of the fact that is how I viewed Bitcoin in the beginning. I had a very fiat mindset and didn't think much about the implications of Bitcoin outside of the number go up part. After taking some time to go down the rabbit hole my opinions have completely changed. I want to help people adopt Bitcoin not so I can find some rent seeking position in the space, but because I want to help people save themselves from fiat currency that is being constantly debased by the government who controls it.\n\nJimmy Song said it best in a [LinkedIn pos](https://www.linkedin.com/posts/jimmysong_dollars-sanctions-war-yuan-surveillance-activity-6974286951508037632-g6rb?utm_source=share&utm_medium=member_desktop)t I saw,\n\n\"Dollars: sanctions, war\nYuan: surveillance, monetary imperialism\nEth: scams, narratives, exploits\nBitcoin: savings, financial empowerment\n\nMoney reflects the character of the people that collectively control it.\"\n\nI got in a heated conversation with my Dad about what I'm doing in Bitcoin. I was excited to tell him about the ideas that were discussed at the Bitcoin lunch I went to yesterday and what frustrated me is my Dad kept trying to tell me to take a little cut. It's not that I don't want to monetize my efforts, but in the beginning I'm eager to create a sort of farmers/flea market where people can sell their goods or services for Bitcoin. A place where people can barter and exchange hand made goods or whatever service they provide for bitcoin. My Dad's idea was to find a way to take a small cut for connecting people. I told him Bitcoin is not about finding these rent seeking positions and with the Bitcoin network serving as the third party there is no way for me to take a cut. It's not necessary since bartering with bitcoin is similar to bartering with cash. You don't need any third party to facilitate the transaction since the Bitcoin network does that heavy lifting.\n\nI do appreciate the fact my Dad wants me to monetize doing what I love, but god damn is it frustrating trying to explain why the Bitcoin network will be the one getting any fees involved (whether it's the routing fees on lightning or the layer 1 fees that go to the miner who ends up adding the block with all the transactions). I'm trying to create circular economies to help people form strong relationships and insulate themselves as best as possible from the fiat currency debasement that is occurring. I brought up how Ross Ulbricht is in jail for creating an open marketplace and my Dad argued that's because it was a black market. The C.I.A literally caused the [crack epidemic](https://en.wikipedia.org/wiki/CIA_involvement_in_Contra_cocaine_trafficking) so while I understand my Dad's point I don't think our current institutions can take the high ground here. No one has been jailed as far as I can tell over the B.S the C.I.A pulled, meanwhile Ross is in jail for life for following his ideals. I'm not trying to be the next Ross. The U.S government has made it abundantly clear it will punish those who try and create completely free markets. As far as I can tell setting up a site like that and being a rent seeker would make me an easy target. Thus, I would much prefer to just let people barter and use the Bitcoin network for trade. I don't need to take any cuts and as a matter of fact I don't want to take a cut because I don't want to be liable and on the receiving end of the U.S governments wrath like Ross was. Pretty sure Ross wasn't even taking a cut either. He just got punished for setting up the website. Maybe I'm wrong though I only saw the silk road via friends I never actually used it.\n\nMy Dad also brought up the point of Nikola Tesla and how he died miserable because he didn't profit off of his inventions. This one irked me so much because Tesla was screwed over by J.P Morgan who saw that Tesla's invention would make electricity so cheap that it wouldn't be profitable. Morgan sabotaged Tesla to make sure he could profit greatly from the discover of electricity. Tesla wanted to provide value and create a world of abundance for humanity. Morgan was a rent-seeker who set back humanity's growth for his own profit and benefit. In fairness I did speak over my Dad when he brought up Tesla so maybe I do not fully understand my Dad's point. It just irks me to no end that he would think Morgan was in the right for seeking to profit rather than give humanity one of the greatest gifts ever. That said, profit is a hell of an incentive. I'm glad profit is what incentivizes people to keep the Bitcoin network secure. In the long run I truly believe fiat will debase and just holding Bitcoin in self custody will make me plenty wealthy. I should listen to my Father and try and figure out ways to profit. For me it is very important that I profit because I end up providing value rather than profit from rent seeking. My Dad appreciated me desire of wanting to help people but I could tell on the phone he thought I was naive and he asked has there ever been a time in history where altruism made someone rich. I tried to argue that there was never a time in history where we didn't have to rely on banks to keep up with commerce on a massive scale until Bitcoin came to be. Again, I need to be better about listening rather than yelling about why Bitcoin fixes this. Glad I decided to write about it so I could calm down and realize it just takes time for some to see. The Bitcoin rabbit hole is long and requires one to put in the proof of work. Maybe I could learn a thing or do and better prepare myself for the future rather than trying to convince my Dad why he is wrong and Bitcoin fixes this lol.\n\n![](https://miro.medium.com/0*TQVDt_9dAes3SWLw)\n\nAnyways, I know my Dad just wants me to be happy and do what I love. I let my emotions get the best of me because I feel like he is stuck in the \"fiat mentality\" of making money. Which as I see it is about rent seeking positions that our government is full of. I am hopeful Bitcoin can eliminate many of these rent seeking positions over a long enough time horizon and that is why I want to help build these circular economies and not worry about taking a small cut for myself. I'm going to Maine with my Dad next weekend so maybe I can learn more about his perspective. I will be better about listening and not so quick to attack his ideas. At the end of the day I know he just wants me to do what I love. I might get frustrated because the idea of rent seeking kind of defeats the purpose of what Bitcoin stands for (at least in the way I see it). I'll never see eye to eye with everybody, but if I shut my trap and listen more there is a lot I can learn.\n\nGoing to Golf later and then got a double date later with my buddy McGoober and his girl Nicole so that should be fun. Until tomorrow anon.\n\n9/10/22\n\nConor Jay Chepenik",
  "wordCount": 1304,
  "readingTime": 5.120754716981132,
  "claps": 0,
  "voters": 0
}