{
  "id": "33e25c32e3bc",
  "title": "Day 27",
  "createdAt": "2022-04-19 00:51:51",
  "tags": [
    "austrian-economics",
    "bitcoin",
    "the-matrix",
    "donut-software",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/day-27-33e25c32e3bc",
  "content": "# Day 27\n\nAtomic Habits by James Clear is an incredible book. Worth reading the whole thing but if you don't feel like committing there is a great 30-minute YouTube [summary](https://youtu.be/PZ7lDrwYdZc) that hits home on all the major points. One that stood out to me was focusing on the positive aspects of difficult tasks. A personal example for me would be cold calling. There are some sickos who love it, but most people I know who do it dislike cold calling. Instead of focusing on all the negatives, I wrote out the positive parts.\n\nThis includes...\n\n- A chance to make money\n\n- Opportunity to grow my network\n\n- Learn more about the psychology of humans and what works to make people open up to a complete stranger on the phone\n\n- Hit quota which will result in career advancement and less stress about my job\n\nWhen I come into a day of cold calling focused on these things I will be a lot more happy and successful vs if I focused on everything that could wrong. This is specific to my life because I'm currently calling strangers in order to get federal reserve notes so I can pay rent, buy food, and stack sats. However, this framework can be applied by anyone to almost anything. Life is full of stuff people don't what to do but if you focus on the positives it's likely you'll have positive outcomes.\n\nHappy people are successful and not the other way around. Don't ever forget that anon. My work has this feature in slack called Donut.ai that matches you with random people in order to help you meet new people since the company that employs me has over 3,000 employees. At first, I brushed it off because it seemed lame. Like most people, I am tired of AI trying to automate everything in our life. It can be nice for many things, but I don't want an AI monitoring every waking second of my life and I sure as hell don't want everything in my house hooked up to TCP/IP because god knows how many hackers have zero days when it comes to new technology. Ultimately, I decided to give Donut.AI a shot and boy was I pleasantly surprised. I got paired with a software engineer who just started at my company the same time as me and had a fascinating conversation about bitcoin with him. He thought the use-case and idea of a decentralized network was cool but actually ended up asking me more questions about bitcoin than I asked him. (I brought up bitcoin as a topic by mentioning I was curious what his thoughts on it since he was as a software engineer) After doing my best to answer all his questions it occurred to me how many different disciplines Satoshi had to pull from in order to create Bitcoin. We talked about USD as a global reserve currency, Quantitative Easing, and what running a bitcoin node requires. It was my first time meeting this software engineer and he seemed like a very smart individual. However, he was humble enough to mention he didn't understand many of the finical terms I brought up and asked me questions about them in order to better understand. First and foremost it gives me hope to meet others who aren't afraid to admit what they don't know and ask questions to fix their knowledge gap. What I haven't stopped to consider is that so many people just don't have the technical or finical literacy to even begin to understand bitcoin. I'm paraphrasing but Anthony Pompliano once had a great quote about bitcoin saying \"It took the Fed printing trillions of dollars for people to understand the importance of fixed supply. It took the freedom convey having all their assets seized for people to understand the importance of permissionless and censorship resistance money.\" I hope it doesn't take a war for nation-states to understand the importance of bitcoin but my fear is that it will take some very catastrophic event for central banks to wake up and realize bitcoin can and will replace them. If you are an individual reading this I urge you to do everything in your power to understand Bitcoin before you need to understand Bitcoin. If you can stack sats before public companies and nation-states start piling in you will likely not have to worry about your retirement.\n\n![](https://miro.medium.com/1*mUWlGF1nJB2SJeuAXO1qxA.jpeg)\n\nJames Lindsey [tweeted](https://twitter.com/ConceptualJames/status/1516092329333084173?s=20&t=akO_qDq3cNdc3Y_fX3S7Rg) today about the law of convenience and why he thinks it hurts bitcoin. If you are reading this and bitcoin still has a smaller market cap than gold understand you are still so early. Many people have told James they want to send him money but he said it's too difficult for him to figure out. I personally really like James and his work after seeing him on J.R.E but I do think that he is dead wrong about what the law of convenience means for Bitcoin. Apps are only going to improve and make bitcoin easier to use. Even now in 2022, it is so much easier for me to buy bitcoin daily vs what it was like when I first bought a little on coinbase in 2017. I can only imagine what it was like trying to buy BTC from a Mt. Gox back in the early days. The reality is most people who interact with bitcoin will do so via Apple Pay or some similar payment platform. Think of all the tech out there today. Most people just expect their social media to work and don't question what is going on in the backend of Facebook, Twitter, Snapchat. Almost no one questions where social media companies host their servers when they post a tweet or snap a photo for their story. I'm a big believer that bitcoin will be the same way and whenever I've sent someone a dollar via Muun Wallet over the lightning network to show them the power of this technology they are blown away. I get such a kick out of seeing a person's reaction when they realize this technology will change everything. Life is great man.\n\n![](https://miro.medium.com/1*ke2-xcSmwlGn02xkVUX9NQ.jpeg)\n\nI remember the first time I watched the Matrix all the way through was recently and it felt like deep down in my soul this was a movie made about Bitcoin even though Bitcoin had not been created when the Matrix got released.\n\n4/18/22\n\nConor Jay Chepenik",
  "wordCount": 1070,
  "readingTime": 4.421069182389938,
  "claps": 0,
  "voters": 0
}