{
  "id": "346eeb9fa2fc",
  "title": "Day 585",
  "createdAt": "2023-10-29 04:11:45",
  "tags": [
    "effective-altruism",
    "sbf",
    "fraud",
    "ruin",
    "bloomberg"
  ],
  "url": "https://chepenikconor.medium.com/day-585-346eeb9fa2fc",
  "content": "# Day 585\n\n![The line between good and evil runs not through states, nor between classes, nor between political parties either but right through every human heart - Aleksandr Solzhenitsyn](https://miro.medium.com/0*tMl4dSR_B2jYTx45)\n\nThe belief that the end results justify the actions taken to achieve them is a misguided one. If you really want to make the world a better place then you should improve yourself. Sounds a bit paradoxical but I believe it to be true. This perspective has been solidified in my mind, particularly after watching this Bloomberg documentary highlighting the controversies surrounding SBF and the malpractices at FTX.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F3QpdU9LS540%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D3QpdU9LS540&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F3QpdU9LS540%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nSBF identified as an effective altruist, a philosophy I had heard of but was not very familiar with. This documentary shed light on the pitfalls of effective altruism (EA). At its core, EA advocates for using evidence and rationality to discern the most impactful ways to aid others. While this sounds commendable, the real-world application of EA neglects the intricate realities of the real world in its quest to optimize outcomes.\n\nTake, for instance, an effective altruist organization that makes it their mission to replace fossil fuels with renewable energy in impoverished regions. This may seem like one way to help mitigate climate change. But implementing such top-down interventions without input from local communities can have detrimental, even deadly, consequences. Reliable energy is required to lift people out of poverty.\n\nRenewable energy sources like solar and wind cannot yet provide the affordable, reliable, around-the-clock energy that fossil fuels produce. If a hospital in a developing nation has its diesel generator replaced with unreliable solar panels, lives could be lost when backup power fails during critical procedures.\n\nSimilarly, effective altruists may seek to eliminate disease in the developing world by distributing mosquito nets. But simply maximizing the number of nets distributed fails to understand on-the-ground realities. Without educating local communities properly on using the nets, they may end up getting used for other purposes, providing little malaria protection.\n\nThe pitfalls in these hypothetical scenarios arise from an overemphasis on quantifiable metrics - like the number of lives saved or the reduction in carbon emissions - while sidelining complex socio-cultural factors. Implementing solutions without understanding and respecting local contexts is almost guaranteed to be counterproductive. EA's analytical approach misses the mark in recognizing the importance of empowering communities to derive solutions that resonate with their values and circumstances. A more enlightened approach would prioritize relationships with locals and foster understanding for their situation before imposing top down solutions.\n\nEffective altruism's technical approach often overlooks the need to empower communities to develop solutions tailored to their values and context. The focus on quantifiable impact can thus result in misguided interventions that fail to respect people's dignity. If you want to see what happens when effective altruists put their ideas to practice I thought this youtube comment under the documentary gave a great idea.\n\n> Well down technically. But it starts to sour the moment they build the scenario that FTX was \"forced into survival mode\" dipping into FTX budget as Alameda was getting pressed - as we know now they decided to use FTX customer funds well earlier (including 10M for his dad let alone all the millions for political donations and personal gains) It also leaves out how he put out directives to build in the back door to drain FTX consumer funds according to Garry Wang (which is now on the record) as well as other people in his inner circle to make use of customers money for his deals, personal investments ... and his connections to SEC's Gary Gensler - but then how you can end the film with his quote \"I just wanted to make the world a better place\" is just beyond me. There have been suicides over this! And you portray him as if he just stumbled into his own misery. This is one of the largest frauds in financial history and you offer him the soft exit? Jesus ... not a good look.\n\nSo yea don't try and rob people only to justify it in your head it will be okay because \"I'll give back\". If you want to make a positive difference in the world just work on being your best self. It is that simple!\n\n10/28/23\n\nConor Jay Chepenik",
  "wordCount": 691,
  "readingTime": 2.807547169811321,
  "claps": 0,
  "voters": 0
}