{
  "id": "352f9e9187c8",
  "title": "Day 541",
  "createdAt": "2023-09-14 23:43:24",
  "tags": [
    "medium",
    "monetization",
    "creators",
    "revenue-sharing",
    "twitter"
  ],
  "url": "https://chepenikconor.medium.com/day-541-352f9e9187c8",
  "content": "# Day 541\n\n![Counting money generated with Firefly](https://miro.medium.com/1*1K0GvEJ5srkdhRNgibf6Tw.png)\n\nMedium has allowed users to monetize their content by putting it behind a paywall. It used to be that you needed at least 100 followers but that seems to have been replaced with just a button that says this story will be eligible for monetization if you put it behind a paywall. Twitter has also recently allowed people to participate in revenue share from ads. This helps empower independent writers and thinkers. However, with Twitter you need to pay for verification and get a certain amount of views.\n\nI'm happy to see websites with prosumers (consumers who produce the content on these sites) be given the ability to earn money from this. I also believe that not monetizing my Medium is the right move for me. I don't pay for Medium so I should not expect someone to do something I don't do. That said I do appreciate Medium's web services and I'll continue to write on this platform for as long as its in business.\n\nAs for what content people choose to monetize online it will differ depending on what you're doing. Some platforms are much easier to monetize than others but each approach has trade-offs. Thinking carefully about our own values and priorities when it comes to monetization is important. For me personally I've enjoyed using Nostr and memes to earn some sats. The ability to participate in value 4 value is so easy on Nostr because zaps with bitcoin are built right into the protocol.\n\nFreedom technology is the best. Anyways, that is all the writing I plan on doing today. I am going to watch my Eagles beat the vikings tonight and then I'm going to code my personal website like this guy did his.\n\n> [**🔴  Let's build a Modern Portfolio with NEXT.JS (Framer Motion, Tailwind CSS, Sanity.io, React) |...**](https://www.youtube.com/live/urgi2iz9P6U)\n\n9/14/23\n\nConor Jay Chepenik",
  "wordCount": 324,
  "readingTime": 1.4226415094339622,
  "claps": 0,
  "voters": 2
}