{
  "id": "364d97f52916",
  "title": "Day 573",
  "createdAt": "2023-10-17 03:32:23",
  "tags": [
    "god",
    "religion",
    "money",
    "government",
    "atheist"
  ],
  "url": "https://chepenikconor.medium.com/day-573-364d97f52916",
  "content": "# Day 573\n\nBeen writing a ton of articles recently which I will share here.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1713974530652148178%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n> [**Bloomberg Analysts: Chances Of Bitcoin ETF Approval Rose To 90%**](https://bitcoinnews.com/bloomberg-analyst-bitcoin-etf-approval-by-jan-2024/)\n\nI have another Bitcoin news article dropping tomorrow discussing how the U.S government holds over 200k bitcoin. Feels good to get back to writing articles for my favorite Bitcoin publications. I like to think of myself as a good journalist and that means I'm constantly questioning my own biases which I realize the more I write are prevalent. After all I am human!\n\nIn other news, tonight I delved deep into a philosophical discussion with my stepdad. Our topics spanned from economics and governance to spirituality and the concept of God. My stepdad identifies as an atheist, a stance I've often found challenging to understand, especially considering the notion that everyone, in some form or another, worships something. When this void is filled with negative influences, it can lead to detrimental outcomes. Yet, my stepdad defies this stereotype. He upholds strong moral principles, consistently strives to do right by others, successfully manages a business employing many, and radiates kindness.\n\nWhat truly fascinated me was his response when I inquired about his higher power. He passionately spoke about the human drive for knowledge. This pursuit of understanding, truth, and goodness, in my eyes, holds a divine essence. While he may not believe in a traditional deity, his faith in humanity's quest for knowledge is commendable. It's far more admirable than blindly following earthly leaders who might falsely proclaim divinity. After all, salvation isn't in the hands of any human, political figure, or religious leader - it's a personal journey.\n\nBroadening one's perspective is invigorating. It's concerning when individuals resort to violence against those with differing beliefs. Every life holds immeasurable value, and no one should assume the authority to end another's life, save for instances of self-defense. Even then, the emphasis should be on avoiding violence. I'd undoubtedly protect my loved ones if threatened, but it's a complex moral terrain to navigate.\n\nWhile I might not have all the answers, the exploration itself is enlightening. Always stay inquisitive anon.\n\n![prompt: Photo of a vast landscape with rolling hills and a tranquil sky. Dominating the sky is an angel with shimmering wings, from whom a powerful light radiates. Down on a meadow, a man with light skin and wearing simple clothes is on his knees, gazing up with tear-filled eyes, completely overwhelmed by the divine sight.](https://miro.medium.com/0*-_vUAferP32pUsNV)\n\n10/16/23\n\nConor Jay Chepenik",
  "wordCount": 378,
  "readingTime": 1.6264150943396225,
  "claps": 11,
  "voters": 4
}