{
  "id": "3670a8282eac",
  "title": "Day 104",
  "createdAt": "2022-07-04 18:46:58",
  "tags": [
    "4th-of-july",
    "absolute-power",
    "fiat-money",
    "bitcoin",
    "habits"
  ],
  "url": "https://chepenikconor.medium.com/day-104-3670a8282eac",
  "content": "# Day 104\n\n![](https://miro.medium.com/0*4lvop_SaezbEQeFu)\n\nIt is a special thing to celebrate Freedom in one of the freest countries on this planet. While the United States has gotten away from the principles that make this country the greatest on earth in recent years I know we're going to get this ship turned around. Ironically, taking away the power of money from the hands of the Government will do more to make sure our Government remains the most powerful force of democracy on the planet. It's ironic in the same way that helping others starts with helping yourself. Absolute power corrupts. Human nature is a funny thing and the worst parts of it come out when people aren't held accountable because they become \"too big to fail\". For example, the fact the Federal Reserve can create money out of thin air leads to a lot of consequences in the world since politicians can use that tool to fund whatever bullshit thing they want to fund. Doesn't seem that bailing out Wall St. and funding endless wars is heeding the will of the people. It's greed, evil, or whatever other negative adjectives people like to use to describe the politicians in D.C who speak of defending democracy while using their position in office to generate insane amounts of wealth for themselves and their families. I understand the Federal Reserve is supposed to be separate from the Federal Government but it definitely does not seem to be. If it were Biden wouldn't be having visits with Jerome Powell and Janet Yellen. The bullshit will continue until more and more people wake up to the fact that their hard-earned money is being doubled taxed when they get paid and also via inflation. Luckily, those in charge are incentivized to spend and run deficits while Bitcoin just does its thing adding blocks and running the code that restricts its supply to 21 million coins. Incentives are a real thing of beauty and humans will flock to the best money because no one likes to see their money devalued so a small minority can do as they please.\n\nThus, on this July 4th I've been reading Bitcoin Magazines articles and appreciating the fact that Bitcoiners genuinely care about creating a world where the U.S constitution is honored and citizens are granted a fair chance at life, liberty, and happiness. This one was particularly good from a fellow Bitcoiner (who I don't know but I did shoot a LinkedIn connection so maybe I will get to know better, Mickey Koss).\n\n> [**July 4th Is A Reminder To Declare Monetary Independence And Protect Freedom By Using Bitcoin**](https://bitcoinmagazine.com/culture/on-july-4th-use-bitcoin-and-protect-freedom)\n\nWhile central bankers and grifter politicians are trying to figure out how they can continue to rob their people Bitcoiners are trying to figure out how to best support the individual. Time and incentives will help make sure Bitcoin becomes the next form of money & global reserve currency. I look forward to the day Bitcoin is widely accepted in this great nation and believe with all my being that it will fix many of the problems we are seeing. It won't fix everything but I'm confident that as more people start thinking through what money is the better off they will be. Hard to add value if you don't even understand what the purpose of money is.\n\nAlso, took some time today to go for a little walk with my girlfriend near Denville, New Jersey, and get some coffee at Boonton coffee shop. I love what the coffee shop did with their new place (they recently moved to a larger location). They had a little stage and microphone plus an incredible ambiance. While I do occasionally drink coffee from the behemoths that are Dunks and Starbucks nothing beats a local coffee shop. Looking forward to opening my own one day and paying all my employees in Bitcoin after hyperbitcoinization. Also having a little stage and microphone for stand-up shows.\n\nHappy 4th anon and if you're reading this after the United States birthday do me a favor and do some freedom shit like taking your bitcoin off an exchange and learning how to properly self-custody your coins. Final note, the Pod with my Dad was a great experience and I'm having fun editing the episode. Should be out soon. Bang Bang. Stay safe, stay healthy, and stay bettering yourself every single day. Like my Dad told me on our Pod it is a marathon not a sprint so start developing habits that will compound and make your life a lot better by this time next year. :)\n\n7/4/22\n\nConor Jay Chepenik",
  "wordCount": 792,
  "readingTime": 3.188679245283019,
  "claps": 0,
  "voters": 0
}