{
  "id": "36d12ac72ef8",
  "title": "Day 644",
  "createdAt": "2023-12-27 01:25:19",
  "tags": [
    "war",
    "ukraine",
    "russia",
    "fiat",
    "nazis"
  ],
  "url": "https://chepenikconor.medium.com/day-644-36d12ac72ef8",
  "content": "# Day 644\n\n![](https://miro.medium.com/0*6rLcDTPtsKBFY_nt)\n\nSaw this posted on X today. I'm not sure it is really Putin writing this, but regardless the letter was eye-opening. I would love to know if this is legit or not.\n\nHere is the letter:\n\n> Vladimir Putin's letter to the world:* Dear inhabitants of our beautiful planet Earth, I, the President of the Russian Federation, Vladimir Putin, decided to address all of you directly, bypassing diplomats, your leaders and journalists. In Russia, there is a so-called \"Ural exchange\", where it is forbidden to lie, deceive and exaggerate. Therefore, I will speak very honestly so that everyone will be convinced of the truth of my words. Russia is a big and rich country, its most important value is more than 150 million people who live in a territory where justice is above all. We don't need new territories. We have energy and all other resources are abundant. Since the time of the Great Tartar and the Great Mughals, the peoples of Northern Eurasia have not developed because of the onslaught of the Crusades and the colonization of America, Africa, India, or the drug addiction of China, but because of their hard work and pacifism. Anyone who knows Russian understands that \"Russian\" is an adjective that refers to all the peoples of our country. Russian Slavs, Russian Tatars, Russian Jews, Russian Evans, etc. All Russian at heart, even if their culture, language and way of life differ. We honor this diversity of unity. The Russian people are once again forced to sacrifice their lives to protect the world from Nazism and fascism. We exchanged 50 of our prisoners of war for 50 Ukrainian soldiers. Ukrainian soldiers were treated in our hospitals, given three full meals a day and returned home. We received Russian soldiers who had their fingers and genitals cut off. Not even the Nazis did that in the last war. We will present this evidence in a future process. Shame on everyone who supports these scumbags now. Your leaders in the US, Europe, Japan, Australia and elsewhere have sided with these subhumans who put civilians, pregnant women and children above themselves in combat and deliberately want POWs. I can't imagine any sane person supporting these monsters. * And your Bidens, Scholz, Macron and other dark democrats * not only protect criminals, but actively arm them, provide them with money that is not enough to lower prices in your countries. Prices are rising, the world is collapsing, but not because the Russians are cleansing Europe of Nazi evil spirits, but because you are silent and even support the new wave of Nazism. This time we will not go to Berlin, we will stop at our historical borders, and all the Nazi evil spirits that your leaders open the door to will give you a new \"crystal\" life, as the Nazis did, adding circumcision of the reproductive organs to it. I appeal to all who want to live and work in the world, raise children and socialize with people all over the world. Help Russia fight the new cancer - Ukrainian Nazism. Not Ukraine, where peaceful and hard working people live, but Nazism, fueled by your US taxes and NATO hawks. If your leaders support Nazism, push them over the edge, take power into your hands. Ukrainian Nazis are protected from bullets by civilians, your rulers also decided to transfer the burden of high prices and future troubles to the population under the pretext of terrible Russia. In Ukraine, just like you, the Nazis live well behind the backs of ordinary citizens, and ordinary citizens have to suffer - these are the same crimes in Ukraine as in the West. We have not broken any of our promises and your leaders have stolen 300 billion dollars and Euros from the Russian people. They steal the property of our country's citizens all over the world, you deliberately want our soldiers, ban the Russian language, attack the Church of God. I see that in countries where leaders are tightening sanctions against Russia, there is a growing awareness of what is happening and a wave of protests is spreading. [https://tiktok.com/@presidentputinfanpage66/video/7310029924012690718?_r=1&_t=8iQNu85HCuP...](https://t.co/JumVFWFXIL) To spread this letter around the world, please share it on networks around the world.\n\nHere is the original [tweet](https://x.com/peacemaket71/status/1739367383439917230?s=20).\n\nThe West has become Godless in many ways. Too many people have replaced God with Gov. That is a recipe for disaster. Russia was our ally in World War 2 and they helped up defeat the nazis. However, Russia under Stalin was a complete nightmare. The West worked with some evil allies to defeat a greater evil. That does not mean we should absolve the Soviets of their sins. Some of the things they did to people are unimaginable. If you want a glimpse into these atrocities I thought this discussion offered a lot of insights into those dark times.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F3cVr2Qp_ic8%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D3cVr2Qp_ic8&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F3cVr2Qp_ic8%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI say all this to note there is no disputing that the West is funding Nazis in Ukraine. The [Azov battalion](https://www.aljazeera.com/news/2022/3/1/who-are-the-azov-regiment) is a part of the Ukrainian army. It saddens to me to see blood thirsty leaders using people as pawns in their war games.\n\nNot sure how to fix these issues. Humanity is full of bloodshed and most places that get inhabited by humans result in the death and destruction of all the life that was their before. The great thing is we replace it with amazing things.\n\nThere is no death without life. No joy without sorrow. No beauty without ugly. I can't pretend to know how to stop humans from doing typical human bullshit. I am however convinced that fiat money creates horrible incentives to fund forever wars. That's why I opt for monetary protocols that don't allow bankers and politicians to create money out of thin air and fund atrocities like War.\n\nDon't trust me. Go verify if Bitcoin is legit on your own time!\n\n12/26/23\n\nConor Jay Chepenik",
  "wordCount": 983,
  "readingTime": 3.909433962264151,
  "claps": 0,
  "voters": 0
}