{
  "id": "377a546fbddd",
  "title": "Day 286",
  "createdAt": "2023-01-03 02:08:26",
  "tags": [
    "watchmen",
    "bitcoin",
    "threat",
    "social-media",
    "data"
  ],
  "url": "https://chepenikconor.medium.com/day-286-377a546fbddd",
  "content": "# Day 286\n\nInteresting take that I've been thinking about today. I imagine this also applies to American companies, but Chinese ones are possibly the worst.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/alilybit/status/1609951538381717511&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAt least the American companies collect this data to improve the product? I feel like TikTok does use that data it collects to make their algorithm as addictive as possible. Which in a way is improving the end product? Doesn't help people break their addiction to social media and become more productive though. It is pretty hard to avoid social media at this point. Respect to those who aren't on the social media apps at this point. Needless to say, I would guess that Chinese companies are worse than American companies because the CCP has unfettered control of private businesses in China. In the United States the deep state at least tries to hide it. Snowden revealed that the NSA was spying on Americans and the Twitter files shows the deep state was doing everything in their power to silence Americans. However, we still have this thin veneer in America that all of the stuff the deep state is doing is illegal and unconstitutional. The result; at least the deep state tries to pretend they aren't colluding with private businesses even if they clearly are. Where in China I don't imagine they have any veneer. They just take the data they want from private companies and if those companies push back they will be punished.\n\nAll speculation though in regards to what the CCP can and can't do with private businesses. Pretty insane seeing everything that went down the past two years and realizing the richest most powerful people in the world are ruthless. Grateful for Bitcoin which I think will change the incentive structure for the majority of humanity. One where people can control their data if they want. That is pretty much what Bitcoin is. Private key data that can be transferred on a global, permissionless, decentralized, peer-to-peer network. Tomorrow is 1/3 which is private key day or something like that. So if you haven't yet take your corn off the exchange. LEARN SELF CUSTODY ANON! It is worth it to avoid the counter party risk!\n\nI watched the movie the Watchmen today. Pretty good film. ***SPOILER ALERT*** The ending shows the stupidity of our human psyche. Threats unite people. So by forcing all of humanity to think that Dr. Manhattan was the greatest threat to humanity the bad guy (or good guy?) was able to convince the world that we needed to unite. That guy who set off the bomb that killed millions in L.A, New York, Hong Kong, and other major cities was not Dr. Manhattan. I forget the name of the superhero/villian who framed it to look like an attack from Dr. Manhattan but he did convince Manhattan in the end to not change things. By killing millions this character is able to help the world avoid nuclear war which was present during the whole film. The reason a nuclear fall out is averted is because the leaders of the world think Dr. Manhattan is the one attacking cities. After these attacks nation-states come together in the film to defend against the threat and people rejoice. When Dr. Manhattan saw this he decided to leave things be even though he could have theoretically fixed this heinous act because Dr. Manhattan wanted humanity to avoid nuclear war. At least that was my interpretation. While this is a made up film the lesson seems relevant today. The whole time everyone is worried about nuclear war between the U.S and the U.S.S.R and what unites these two countries is an even greater threat.\n\nI wish our world leaders could see that the greatest threat now is globalists at the W.E.F. These people who are pushing for a technocratic deep state and two-tiered society. Bitcoin can help fight this, but I'm afraid Joe Biden and many other world leaders are captured by the W.E.F. Become expensive to tyranny anon because these globalists are evil and we now have the tools to defend ourselves from the coming hyperinflation or recession. I'd guess hyperinflation so nation-states can actually pretend like they are paying their debts back but who knows. Thought this piece did an excellent job spelling out what I'm articulating here without providing much content myself.\n\n> [**Bitcoin Is Money Made Simple, AKA Monetary Decomplexification**](https://bitcoinmagazine.com/markets/bitcoin-is-money-made-simple)\n\nFinally, I'd like to note I recorded a Podcast with my Bitcoin friend Sean and it was awesome. I love talking to fellow Bitcoiners and I need to record with them more often. :D\n\n1/2/23\n\nConor Jay Chepenik",
  "wordCount": 792,
  "readingTime": 2.9886792452830186,
  "claps": 0,
  "voters": 0
}