{
  "id": "37dc1b636757",
  "title": "Day 398",
  "createdAt": "2023-04-25 01:59:41",
  "tags": [
    "database",
    "coding",
    "ai",
    "tech",
    "language-learning"
  ],
  "url": "https://chepenikconor.medium.com/day-398-37dc1b636757",
  "content": "# Day 398\n\nToday was full of various lessons. We are learning how to update databases in monolith apps at my coding bootcamp and it's a repetitive and tricky task. It's also very satisfying when you figure something out.\n\n![](https://miro.medium.com/0*cZCphnAicKhOA0jk)\n\nCoding can feel so overwhelming at times. It can also feel so satisfying. Many such cases where a massive problem you are running into is because of the tiniest little error. I'm curious with AI how many people will remain expect coders in multiple languages.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/matthew_d_green/status/1649569229035773952%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nEven snapchat is adding chatGPT like features. On the one hand AI can be super helpful and on the other I imagine psuedo coding in english will be enough in less than ten years to build a full stack app. Coding in traditional computer languages will become obsolete the better AI gets. I believe, maybe I'm horribly wrong on this prediction but it is fun to speculate.\n\nAnyways, practice makes perfect. I will keep gradually improving my skills.\n\n> [**rand0mguest2 on Iris**](https://iris.to/note1a52su0d2mzz453ec65eml62t5qw4ram06r9mxm3gs933yy95m7vqclzq2r)\n\nOf course coding also requires a ton of staring at a screen. So I'll try and make more solid posts about other stuff when this coding bootcamp is over. For the next 4 weeks or so though expect many shorter posts like this as I figure out what I want to code up for my group project & solo project while not staring at a screen literally all day.\n\n4/24/23\n\nConor Jay Chepenik",
  "wordCount": 260,
  "readingTime": 1.181132075471698,
  "claps": 0,
  "voters": 0
}