{
  "id": "384a17dd584e",
  "title": "Day 789",
  "createdAt": "2024-05-19 17:37:37",
  "tags": [
    "data-science",
    "bitcoin",
    "tinkering"
  ],
  "url": "https://chepenikconor.medium.com/day-789-384a17dd584e",
  "content": "# Day 789\n\n**Data Science Made Easy: Visualizing Stock and Bitcoin Returns**\n\nData science is an important field and one that anyone can contribute to. It all starts with getting some data and visualizing it. Check this out.\n\n**Step 1: Import the Necessary Libraries**\n\nWill be using Python code to help us create our visuals. First, we need to import the necessary libraries. These libraries will help us download the data, manipulate it, and create visualizations.\n\n```python\n# Import the necessary libraries\nimport yfinance as yf\nimport pandas as pd\nimport matplotlib.pyplot as plt\n```\n\n- `yfinance`: This library allows us to download financial data from Yahoo Finance.\n\n- `pandas`: This is a powerful library for data manipulation and analysis.\n\n- `matplotlib`: This library is used for creating visualizations in Python.\n\n**Step 2: Define the Date Range and List of Tickers**\n\nNext, we define the date range for our analysis and the list of tickers we want to download data for. The tickers include Bitcoin (BTC-USD) and the top tech stocks, also known as the \"Magnificent Seven.\" The date ranges have been set to start in 2020 right before the Covid Pandemic and end on 5/19/24 (the date this article was written).\n\n```python\n# Define the start and end dates\nend_date = '2024-05-19'\nstart_date = '2020-01-01'\n\n# List of tickers to download\ntickers = ['BTC-USD', 'AAPL', 'MSFT', 'GOOGL', 'AMZN', 'NVDA', 'TSLA', 'META']\n```\n\n**Step 3: Download Historical Data**\n\nWe use the `yfinance` library to download the historical data for all the tickers within the specified date range.\n\n```python\n# Download historical data for all tickers\ndata = yf.download(tickers, start=start_date, end=end_date)['Close']\n\n# Handle missing data by forward filling\ndata.ffill(inplace=True)\n```\n\nHere, we download the closing prices for each ticker and handle any missing data by forward filling, which means filling missing values with the last available data.\n\n**Step 4: Calculate Daily Returns and Cumulative Returns**\n\nWe calculate the daily returns for each stock and then compute the cumulative returns normalized to a base of 100. This helps us visualize the growth of each asset starting from the same baseline.\n\n```python\n# Calculate daily returns for each stock\nreturns = data.pct_change()\n\n# Calculate cumulative returns normalized to 100 for each stock\ncumulative_returns = (1 + returns).cumprod() * 100\n```\n\n**Step 5: Plot the Normalized Cumulative Returns**\n\nNow, let's plot the normalized cumulative returns. Each line represents the cumulative return of an asset, starting at a base of 100. This visualization helps us see the growth trends of Bitcoin compared to major tech stocks over the selected period.\n\n```python\n# Plot the normalized cumulative returns\nplt.figure(figsize=(14, 7))\ncolors = ['b', 'g', 'r', 'c', 'm', 'y', 'k', 'orange']\nfor i, ticker in enumerate(tickers):\n    plt.plot(cumulative_returns[ticker], label=f'{ticker} Cumulative Returns', color=colors[i], alpha=0.7)\n\n# Set the title of the plot\nplt.title('Normalized Cumulative Returns of Bitcoin vs. The Magnificent Seven since Jan 1, 2020')\n\n# Label the x-axis as 'Date'\nplt.xlabel('Date')\n\n# Label the y-axis as 'Cumulative Returns (Base 100)'\nplt.ylabel('Cumulative Returns (Base 100)')\n\n# Add a legend to distinguish between Bitcoin and each stock\nplt.legend()\n\n# Enable grid lines on the plot for better readability\nplt.grid(True)\n\n# Show the plot\nplt.show()\n```\n\n**Why Use Cumulative Returns?**\n\nWith all this code we should be able to plot the normalized cumulative returns. Each line represents the cumulative return of an asset, starting at a base of 100. This visualization helps us see the growth trends of Bitcoin compared to major tech stocks over the selected period. The colors and legend make it easy to distinguish between the different assets.\n\nCumulative returns are used because they provide a clear picture of the total return on an investment over a period of time. By normalizing to a base of 100, we can compare different assets on the same scale, regardless of their initial value. This is particularly useful when comparing the performance of assets with different price ranges, like Bitcoin and tech stocks.\n\n**Using [Google Colab](https://colab.research.google.com/)**\n\nUse Google Colab (or your preferred IDE) to run the entire script as shown below. After running the code, you should get a chart that looks like the one below.\n\n```python\n# Import the necessary libraries\nimport yfinance as yf\nimport pandas as pd\nimport matplotlib.pyplot as plt\n\n# Define the start and end dates\nend_date = '2024-05-19'\nstart_date = '2020-01-01'\n\n# List of tickers to download\ntickers = ['BTC-USD', 'AAPL', 'MSFT', 'GOOGL', 'AMZN', 'NVDA', 'TSLA', 'META']\n\n# Download historical data for all tickers\ndata = yf.download(tickers, start=start_date, end=end_date)['Close']\n\n# Handle missing data by forward filling\ndata.ffill(inplace=True)\n\n# Calculate daily returns for each stock\nreturns = data.pct_change()\n\n# Calculate cumulative returns normalized to 100 for each stock\ncumulative_returns = (1 + returns).cumprod() * 100\n\n# Plot the normalized cumulative returns\nplt.figure(figsize=(14, 7))\ncolors = ['b', 'g', 'r', 'c', 'm', 'y', 'k', 'orange']\nfor i, ticker in enumerate(tickers):\n    plt.plot(cumulative_returns[ticker], label=f'{ticker} Cumulative Returns', color=colors[i], alpha=0.7)\n\n# Set the title of the plot\nplt.title('Normalized Cumulative Returns of Bitcoin vs. The Magnificent Seven since Jan 1, 2020')\n\n# Label the x-axis as 'Date'\nplt.xlabel('Date')\n\n# Label the y-axis as 'Cumulative Returns (Base 100)'\nplt.ylabel('Cumulative Returns (Base 100)')\n\n# Add a legend to distinguish between Bitcoin and each stock\nplt.legend()\n\n# Enable grid lines on the plot for better readability\nplt.grid(True)\n\n# Show the plot\nplt.show()\n```\n\nThe chart the code will return:\n\n![](https://miro.medium.com/1*9s0MMYFEco7TDWDjNHSFYg.png)\n\n**Analysis of the Chart**\n\nFrom the chart, it is evident that Bitcoin (BTC-USD) has been a strong performer overall, despite its significant volatility. At various points in time, some of the \"Magnificent Seven\" tech stocks have outperformed Bitcoin, but none have sustained the same level of overall growth across the entire period.\n\n**Key Observations:**\n\n1. Bitcoin's Performance: Bitcoin shows significant peaks and troughs, indicative of its high volatility. Despite these fluctuations, its cumulative return remains one of the highest over the period. This demonstrates Bitcoin's potential for high returns, albeit with considerable volatility that holders must stomach to achieve these high returns.\n\n2. Tech Stocks Performance: Among the tech stocks, NVIDIA (NVDA) and Tesla (TSLA) show notable performance. In recent periods, NVIDIA has outpaced the returns of Bitcoin, highlighting its strong upward trend. This indicates that while Bitcoin has substantial long-term growth, certain tech stocks can outperform it in the short term.\n\n**Investing Insight (Not Financial Advice)**\n\nInvesting in Bitcoin through a strategy of dollar-cost averaging (DCA) and holding over the long term has proven to be a highly successful strategy, outperforming many individual tech stocks. However, it's important to note the high volatility associated with Bitcoin, which can be hard to handle if one has not spent many hours studying the asset. Bitcoiners tend to view their Bitcoin as the world's best saving instrument, while those not so far down the rabbit hole view it as a riskier investment.\n\nDespite the impressive short-term performance of stocks like NVIDIA, Bitcoin offers unique advantages. It has more optionality than any equity because it can be sent anywhere globally, essentially representing value over IP. This global transferability and the decentralized nature of Bitcoin give it a distinct edge as a form of value storage and transfer.\n\nMoreover, to achieve better returns with tech stocks, one would need to correctly pick the outperforming stock, like NVIDIA, among the \"Magnificent Seven.\" While indexing can mitigate this risk, it still requires active management and strategic choices. In contrast, selecting Bitcoin - often considered the \"best money\" in the world - simplifies the investment process. Instead of trying to predict which tech stock might outperform Bitcoin in the short term, investors can choose Bitcoin for its long-term potential and inherent value proposition.\n\nWhile both Bitcoin and tech stocks offer lucrative opportunities, Bitcoin's unique characteristics and long-term growth potential make it an appealing choice for those who want to watch their capital grow without having to worry about counterparty risk or managing which equity is in their portfolio at any given time.\n\n**The Power of Curiosity & Tinkering in Both Life & Data Science**\n\nThe best breakthroughs often come from curious individuals who are willing to tinker, experiment, and explore. The Wright brothers, who were bike mechanics, figured out how to fly. Satoshi Nakamoto, an anonymous computer scientist, revolutionized the world by creating Bitcoin. Satoshi combined the insights of those who came before him to discover digital scarcity, incentivizing more cooperation and less violence through powerful cryptography.\n\nJust as these pioneers transformed their fields through curiosity and experimentation, you too can harness the power of data science to uncover new insights and innovations. There are so many great tools out there, including the ones we used today like Python, yfinance, pandas, and matplotlib. Combine these with AI tools and the accessibility of platforms like Google Colab right in your web browser, and it has never been easier to create and tinker.\n\nData science is not just for the experts - it's a playground for anyone with curiosity and a willingness to learn. Whether you're visualizing stock and Bitcoin returns or delving into more complex analyses, the tools and knowledge are at your fingertips. By experimenting with data and refining your skills, you can contribute to this ever-evolving field.\n\nRemember, some of the best tools and insights will come from those who are curious, eager to test, learn, and explore. So go ahead, experiment with data, and see where your curiosity takes you. The world of data science is vast and full of potential, and you have all the tools you need to make your own breakthroughs. The tinkerers of today will change the world for the better, just as they always have.\n\n5/19/24\n\nConor Jay Chepenik",
  "wordCount": 1595,
  "readingTime": 6.218867924528302,
  "claps": 6,
  "voters": 1
}