{
  "id": "387c41d70f12",
  "title": "Day 333",
  "createdAt": "2023-02-18 23:16:24",
  "tags": [
    "proof-of-work"
  ],
  "url": "https://chepenikconor.medium.com/day-333-387c41d70f12",
  "content": "# Day 333\n\nYou know what I've been thinking about today? Before I know it Sloan will be 18 and out of my house. At least if she goes to University. I'm genuinely curious what college will look like at that point (2041). How will technology impact the ways humans get an education? Will a piece of paper from an elite University hold as much weight as a proof of work resume online? You got to think with technology getting exponentially better people will be able to do far more with far less.\n\nIt's fascinating to consider the potential impact of technology on the future of education, particularly as it pertains to the rising prevalence of online learning and personalized, data-driven learning experiences. As more people are able to access quality education from anywhere in the world, it's possible that traditional degrees from elite universities may become less important in the job market. To the Universities: Good luck competing with Youtube, Tiktok, and any other video platform where experts can share how to do almost anything for free. Instead, employers may start to prioritize candidates with strong skills and experience in emerging fields like data science and AI.\n\nOf course, what's most important is that individuals like Sloan find fulfilling careers that align with their interests and passions. As the cost of education trends towards zero and more alternative means of learning become available, it's possible that people will be able to pursue their dreams without the burden of crushing student debt. At the end of the day, the value of education lies in the knowledge, skills, and experiences gained along the way, rather than a specific piece of paper or job title.\n\nHolding a degree might seem like a massive deal now but it reminds me of paying for Apple Music. At a certain point other platforms like YouTube, Spotify, Tidal, and Soundcloud continued to offer me free alternatives for listening to music and the value of that paid music subscriptions diminished to the point where I couldn't justify ten bucks a month for ad free listening. I don't hate saving 120 bucks a year with inflation running hot. I also started crushing podcasts more which weighed in the decision. Maybe one day another platform will offer such an awesome algo for recommending songs that the ad free, downloadable library is worth it, but until I see that innovation I will continue to enjoy a free music listening experience. Just like how free alternatives for music consumption disrupted the music industry, technology is disrupting the traditional education system. Embrace it.\n\nIt will be interesting to see how these trends develop over time and how technology continues to shape the future of education. Perhaps proof of work will become the norm for many across all aspects of life, as individuals demonstrate their skills and experience through online portfolios and other means of showcasing their abilities. Only time will tell, but it's an exciting and thought-provoking topic to consider. Proof of work in all aspects of life is the way.\n\n2/18/23\n\nConor Jay Chepenik",
  "wordCount": 514,
  "readingTime": 1.939622641509434,
  "claps": 0,
  "voters": 0
}