{
  "id": "39b81ab4995a",
  "title": "Day 504",
  "createdAt": "2023-08-09 01:29:06",
  "tags": [
    "information",
    "oysters",
    "data",
    "overload"
  ],
  "url": "https://chepenikconor.medium.com/day-504-39b81ab4995a",
  "content": "# Day 504\n\nToday I watched an awesome video from someone at Stanford's Graduate School. The main idea: live an asymmetric life.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FdZxbVGhpEkI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DdZxbVGhpEkI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FdZxbVGhpEkI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\n1. Do hard things 2. Do your thing 3. Do it for decades 4. Write your story\n\nI'm going to take this guy's advice and try writing my story. In 5 years I want a house with a big yard for playing outside with my children. I'm going to grow my own food and be a renowned software engineer. Every morning I'm going to wake up grateful for my health, my children, and meaningful work. My relationship with my current partner, to be wife by the time it is 5 years in the future, will be incredible. This Medium will still be a thing I do *if Medium is still in business*. Finally, I will have my grown my podcast/Youtube to over 100k subscribers by continuing with these 3 things. Quality article reads, software engineering videos people find valuable, and worthwhile conversations with a wide variety of guests.\n\nBig goals but ones I can absolute achieve. The world is my Oyster. Let's go out and get it. I wasn't sure how that phrase came to be so I asked [claude.ai](https://claude.ai/) and was told just as an oyster has a precious pearl inside it waiting to be uncovered, the world has endless treasures for those willing to go out and discover them.\n\n![](https://miro.medium.com/1*oiUO2O5P4lqyLGL0juxXag.png)\n\nBefore I end this peace today I'd like to note two things. Respect to [Guy Swann](https://bitcoinaudible.com/) for being able to do such incredible reads. I'm still cranking on that Nick Szabo peace. I'd also like to note this tweet seems super relevant in our modern world.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/BrianRoemmele/status/1650737403529924609%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt is seemingly impossible to not have information overload if you spend time on the internet. It's so incredibly vast! When faced with too much data, we look for familiar patterns to make sense of it rather than closely analyzing each new piece of information. For perspective, the amount of information available today is astronomical compared to centuries ago. By one estimate, the total amount of data created in 2002 alone was five exabytes - that's over 4,000 times the amount of information contained in the Library of Congress print collections.\n\nThe deluge of data we face today necessitates the use of heuristic thinking and pattern recognition to make sense of it all. However, over-reliance on these mental shortcuts can lead to biased, superficial analyses. The most effective approach is to leverage our pattern recognition abilities to rapidly identify meaningful trends and insights in data, while also cultivating curiosity to dig deeper and validate our assumptions. Experts distinguish themselves by combining efficient pattern recognition with the patience and discernment to investigate anomalies and test intuitive judgments against empirical evidence. In this way, we can tap into the wisdom of our experience while also gathering new knowledge. The synthesis of instinct and inquiry is key to extracting truth from today's sea of information.\n\nI'll admit I've written articles before where I just assumed something and in order to validate my belief I googled stuff that I knew would back up my already held belief. The better option is to google stuff I do not agree with so I can see if my beliefs hold up. Often we can learn more from people who don't agree with us than from those who do.\n\n8/8/23\n\nConor Jay Chepenik",
  "wordCount": 564,
  "readingTime": 2.328301886792453,
  "claps": 0,
  "voters": 0
}