{
  "id": "3a515e5835a9",
  "title": "Day 115",
  "createdAt": "2022-07-15 20:14:58",
  "tags": [
    "grateful",
    "friday",
    "life",
    "meat",
    "smoothies"
  ],
  "url": "https://chepenikconor.medium.com/day-115-3a515e5835a9",
  "content": "# Day 115\n\nIt's Friday and to be honest I'm not in much of a writing mood. Thus, it's more important than ever that I sit my ass down and write. I've walked out on my porch and now I'm typing these words outside because being in nature always help clear the mind. Not feeling sad but just kinda meh. When I'm in one of these moods I think the best thing to do is just list out all the things I'm grateful for.\n\n- The fact I have a lot of grass-fed meat and a cast-iron stove to cook it in.\n\n- Frozen fruit and chocolate to make delicious smoothies.\n\n- The Nike Run Club app and friends who keep me motivated to run. For example, yesterday my boy Keenan posted a 3-mile run so I hit a 3 mile run. Today I posted a 2-mile guy so he went ahead and posted a 2-mile guy. Having friends that hold each other accountable is the best.\n\n- A mum who loves me and is willing to support me if I ever need her support. She gives me great life advice and the courage to try new things.\n\n- A girlfriend who cares deeply about me and is willing to have a child with me.\n\n- A cool city that has comedy shows all over. I went to one yesterday and it was awesome. Should've stayed for the open mic and I'm planning on doing so next week but my girl was sleepy and wanted to get back.\n\nNot going to lie after typing all that out I already feel better. I've got a nice weekend ahead of me and some R&R coming up. Also, if all goes well I will be doing a Pod very soon with my boy Travis who co-hosted my old podcast, The Binmucker Podcast. Smile anon, our time here is finite. If you're upset maybe go list out all you have to be grateful for on the internet😂 . It's honestly wild how much a little appreciation can do for your mood.\n\n7/15/22\n\nConor Jay Chepenik",
  "wordCount": 349,
  "readingTime": 1.3169811320754716,
  "claps": 0,
  "voters": 0
}