{
  "id": "3b1aaecfb26c",
  "title": "Day 12",
  "createdAt": "2022-04-03 17:06:45",
  "tags": [
    "nature",
    "newport",
    "ocean-drive",
    "mansions",
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-12-3b1aaecfb26c",
  "content": "# Day 12\n\nExploring Newport was incredible. It's amazing to think about how much water impacts where societies set up civilization. [Robert Breedlove's Saylor series](https://www.youtube.com/watch?v=4rvTppy1qLI&list=PL2jAZ0x9H0bQFY6wIbQfnrnIlqMcSHd6X) does a great job pointing out how crucial water is to human cooperation and survival. As I've been able to travel recently I've noticed this to be true. Almost all major cities are set up around big bodies of water.\n\n![](https://miro.medium.com/1*KK63T9I4Fo-1MYf17U5iQA.jpeg)\n\n![](https://miro.medium.com/1*hL9_I7_xd7JZYCESp5wKWg.jpeg)\n\n![](https://miro.medium.com/1*X5cwed--Gcezvm1KusxifQ.jpeg)\n\nNewport was incredible and for those who get the chance to visit, I highly recommend checking out the mansions. I thought mansions tours would be kind of lame, but it was incredible. The low-time preference architecture throughout this house was worth the 20$ ticket. Even the ceilings were filled with incredible art. I feel like social media has made everyone eager to sound profound and increased time preferences. While watching the sunset yesterday on Ocean Drive with my girlfriend I was reminded that the fact we are even conscious is profound. Playing with the rocks along the ocean was so enjoyable. Just breathing the air by the sea felt good. It was like drinking a large cup of coffee except there was no crash later on. Society prioritizes sitting up in an ivory tower and \"think tanking\" a solution to the ills of the modern-day human. Truth be told I think we would be much better off if people just went outside and observed nature. Low-time preference activities come from learning to love your craft. It's hard to love reading dense textbooks and thinking through complex stuff. There is a time and place for this no doubt. I just think these people would be much better served going out and experiencing how profound nature already is before deciding to change it. Good intentions don't mean shit if the outcome is negative.\n\nConor Jay Chepenik\n\n4/3/22",
  "wordCount": 302,
  "readingTime": 1.689622641509434,
  "claps": 0,
  "voters": 0
}