{
  "id": "3b31928a7d63",
  "title": "Day 34",
  "createdAt": "2022-04-26 02:31:51",
  "tags": [
    "fiat",
    "bitcoin",
    "life",
    "pickup-sports",
    "low-time-preference"
  ],
  "url": "https://chepenikconor.medium.com/day-34-3b31928a7d63",
  "content": "# Day 34\n\nWas listening to fellow freak, [Marty Bent, discuss Bitcoin and its environmental effects with Matt Odell](https://open.spotify.com/episode/7rWDrXxR1OcJTKdZmUaL0C?si=9mGtcugeSCO2ALNt8sr_wA). Just listening to these guys they sound like genuine people who want a better world. One point Marty brought up at the end of the podcast was under a sound money standard the environment would be better off because people would be incentivized to build things that last. Saifedean also touched on this idea in his Bitcoin and Fiat Standard books which I can not recommend enough. There is one part (can't remember which book) where Saifedean started talking about time preferences and how modern art is a classic example of time preference being raised tremendously. Meaning that instead of putting in 10,000 plus hours to master a skill, artists are throwing together random [piece](https://www.sothebys.com/en/articles/the-story-of-andy-warhols-campbells-soup-cans)s and calling it \"modern art\". A great example of this is Andy Warhol's Campbell Soup piece. One might argue less is more, or he took something so simple and made it profound! I like the piece honestly, but no way would I pay over 800k for a painting of Campell's Soup. I don't care who painted it. I'm going to paraphrase so excuse any discrepancies but Saifidean gave a great example of modern art in his book when he talked about a janitor who accidentally threw away multi-million dollar pieces thinking they were trash. As someone who has always loved modern art, even I must admit that it is comical a janitor threw it away because he didn't realize it was not trash. I've also grown up in a modern era so it's highly likely I was Psy-Oped at a young age to like modern art, but that is a Medium post for another time.\n\nI bring all this up because if you look at the housing units they are putting up in Florida, the place I grew up, and compare them with the architecture of Europe, which was built hundreds of years ago, it's a great example of high time preference vs. low time preference. Some of the buildings built in Europe are still standing and will continue to be for centuries. Most of the stucco housing being put up in Florida is not likely to last a full century. This brings me back to Marty's point. If more people built stuff that was meant to last we could have a better environment. No need to bring in a carbon-fueled vehicle to do teardowns if your new construction is built to last for centuries. Under a fiat money standard people just want to build stuff as fast as possible so they can start making money. My girlfriend used to live in a pretty new apartment complex in Tallahassee Florida during college. While it appeared nice at first glance it was so cheaply made. You could hear practically everything through the walls and I'm confident I could've punched through the stucco as long as I didn't hit a stud. That's not a testament to my strength, but an example of how flimsy these walls had been made. Climate hysterics always want to point out projections of catastrophe, but the truth of the matter is modeling the globe's environmental changes is a near impossible task that becomes exponentially wrong the farther out you get. Yes, we need to start treating the Earth better. I just hold a firm belief that focusing on first, second, and third-order effects rather than screeching at those who realize the importance of fossil fuels in modern-day society. The only way to one day reach an electric car standard is by slowly transitioning while building nuclear and hydro-powered plants to produce the electricity. Solar and wing don't provide reliable energy yet. Hopefully innovation can help change this, but until it does we need to make rational decisions like nuclear and hydro energy.\n\nMy Grandma always told me that I need to dress for success. I used to roll my eyes at this because getting dressed up used to annoy me. That was until I became an adult and saw firsthand how one's appearance causes people to treat them differently. Whenever I put on a suit now I get a swagger. That probably sounded lame as hell to read in a blog post but it's true. Looking good and dressing nice is a sure-fire confidence boost. I imagine the same can be said for one's home. Not shitting on anyone who is forced to live in a cookie-cutter apartment. Unfortunately, due to the fiat money standard, few people can afford anything other than to rent in a cookie-cutter building. Governments around the world have made it nearly impossible to go build a stunning home unless you get permits, and licenses to do so. I'd love to build a beautiful brick home and feel good about my dwelling. I really hope Marty is right and that bitcoin will start to de-incentivize cheaply made consumer products from apartments to fidget spinners. It's nearly impossible to measure but if producers made quality stuff that lasted there would be so much less cheap plastic crap floating in the ocean. I remember working one summer for a roofing company and my boss was telling me about the bullshit they let fly in the car industry. My boss's brother worked as an executive at one of these car companies and he said the engines are supposed to break down after 250–300k miles. They were designed this way because if they didn't very few people would ever come back to buy a new car. While my source for this information may or may not have been telling the truth I wouldn't be surprised to find out he was being honest. If profit is the one thing people are trying to maximize then it would only make sense they do everything they can to maximize it. Incentives, literally, run the world. What incentive do car manufacturers have to make a vehicle that almost never breaks down? Under a fiat standard, I'd argue a weaker one because they know governments will bail them out if necessary. Under a bitcoin standard, it would be easier for customers to pick another car company if the one they bought from wasn't delivering a quality vehicle. You can still choose to take your business elsewhere under a fiat standard, but if there is no lender of last resort to save car companies I feel confident that these companies would do everything in their power to churn out the best possible vehicle instead of the one that breaks down after a certain period. The Federal Reserve likes people taking on more debt In OrDeR tO InCrEaSe G.d.P. Under the current fiat standard, both the central banks and car companies win when people have to buy a new car every 5–10 years. Under a bitcoin standard, I really believe the best car company would win out which would encourage everyone to create vehicles that last longer and longer, otherwise the free market would cause the complacent car companies to fail.\n\nBitcoin does not guarantee a cleaner environment or cars that last for a million miles. What it does do is make it harder for corporations and governments to maximize profit and subsidize the things that the free market won't put up with. Under a Bitcoin standard, I believe people will lower their time preferences and work towards becoming a specialist at something. Under a fiat standard, the incentives are to align yourself close to the money printer, or with someone who has access to the printer. I don't think free markets can function without rules, but I do believe the free market doesn't need rulers. Only Bitcoin can provide a system with rules and no rulers. As far as I can tell the proof-of-stake systems might as well just be fiat 2.0 where the wealthiest write the rules in order to benefit themselves. I want a more prosperous world where people are proud of their home and their job. Fiat perverts this by incentivizing everyone to take on massive debt and spend beyond their means. I do believe bitcoin can fix this problem though. Stay hopeful anon. It doesn't pay to be a pessimist.\n\nP.S - Felt super emotional when I got home from work today. I'm doing everything in my power to remain as positive as possible. It's just hard staying positive about something I'm not passionate about. Not sure what my next course of action will be, but I want to love what I do. Writing, reading, listening, and learning about Bitcoin is what has been consuming me lately. Grateful for the things I've learned at my current gig, but man... I hate fiat and what it has done to the incentive structures of the world. I can make 65k USD cold calling strangers (not including any commission) while a farmer busting his ass in a less developed country might take 10 years to make that amount of money. Jokes on me though because that farmer probably has everything he could hope for and enough food to feed his family while I'm staring at a screen 8 hours a day. Truth be told though I can change my life. Nothing is stopping me from doing what I want to do besides myself. Food for thought. (No pun intended XD)\n\nP.S.S - Scored the game winning goal in my rec soccer league to win 2–1. DAMN THAT SHIT FELT GOOD! I hope I never stop playing pickup sports🏀  🏈  ⚽️\n\n![](https://miro.medium.com/1*3qHVDmdZbIhAhHXojwH8Ng.jpeg)\n\n4/25/22\n\nConor Jay Chepenik\n\n![](https://miro.medium.com/0*qxTNSsTa9_-lhgKB.gif)",
  "wordCount": 1597,
  "readingTime": 6.409748427672956,
  "claps": 11,
  "voters": 1
}