{
  "id": "3b5a071953f3",
  "title": "Day 741",
  "createdAt": "2024-04-02 02:32:30",
  "tags": [
    "bitcoin",
    "scaling"
  ],
  "url": "https://chepenikconor.medium.com/day-741-3b5a071953f3",
  "content": "# Day 741\n\n![Lightning finna be a big part of this scaling issue👀 ](https://miro.medium.com/0*_zT_uXZPVKHzYwya)\n\nThere's been a lot of discussion recently about scaling Bitcoin, and I want to share my perspective. Bitcoin will find a way to scale; I'm confident about that. Where there's a will, there's a way. We don't have an intense urgency to onboard the entire world to Bitcoin right now. That urgency will come when more fiat currencies experience hyperinflation. However, in its current form, the most crucial thing is keeping Bitcoin decentralized and secure. Computers can do amazing things.\n\nThere will be many Bitcoin banks that hold private keys, and when I send BTC from my bank to a friend's bank, if we use the same bank, it's likely that those private keys won't change, but a database will be updated. Is that ideal for self-sovereignty? Absolutely not. But if I'm buying a coffee, I don't care about that. My stack held in cold storage, which I will broadcast with my own node, is vastly different from my stack held at a custodian using the Lightning Network or some database to allow me easier medium of exchange.\n\nBitcoin has sacrificed scalability to remain secure and decentralized. That is a good thing. Entrepreneurs can compete for my sats by providing easier ways to use Bitcoin as a medium of exchange, but the Store of Value aspect only works if Bitcoin remains permissionless, secure, and decentralized. I'm confident it will, and I find people obsessing over scaling prematurely when the demand for scaling has not even really started to become an issue. I'm sure it will at some point, but it's not the most pressing need at the moment.\n\nPeople just love looking for problems. Which is great in the sense that adversarial thinking helps people stay ahead of the curve. It's also tiresome. I need to spend less time online and more time focused on things that truly matter, like running. I went for a run tonight and crushed 5 miles. My calves are cooked, but it felt good to run for so long non-stop.\n\nI bring this up because Bitcoin is exciting in the sense that it can allow me to buy more things, including my time back. But Bitcoin can't feed me, give me love like my child or partner can, or provide complete fulfillment (though Bitcoin podcasts have provided me plenty of enjoyment). Bitcoin is just money, and money is just a means to an end. So focus on what matters and stack sats in the background. Let the enthusiasts worry about what happens next; they seem hell-bent on fixing problems, and I'm glad they are because despite being able to code websites, I am not working on the protocol day in and day out. But I do use it almost daily, and I want to ensure it's working properly so I can pass on wealth through the generations.\n\n4/1/24\n\nConor Jay Chepenik",
  "wordCount": 481,
  "readingTime": 2.0150943396226415,
  "claps": 0,
  "voters": 0
}