{
  "id": "3c10c9c354f",
  "title": "Day 478",
  "createdAt": "2023-07-14 00:49:43",
  "tags": [
    "religion",
    "fasting",
    "children",
    "karma",
    "god"
  ],
  "url": "https://chepenikconor.medium.com/day-478-3c10c9c354f",
  "content": "# Day 478\n\nToday at dinner my partner mentioned I have been more present. This made me feel incredible. Could be from fasting and having some more mental clarity. Could also be because I've made a cognizant effort to try and help out more around the house. I'm not sure to be honest, but I must say it feels amazing to be told that.\n\nShe joked with me today that she texted one of her friends Conor is going to do this fast no matter how bad he feels. This also felt good to here. I've got some mild ADHD (self diagnosed but let's be honest who doesn't in the age of the internet) but I do like to believe if I set my mind to do something then you can rest assured I will do it. Luckily though, I do not feel that bad. If anything I feel better than normal with some light hunger. During this experience I've made an effort to touch grass and breath deeply. Saw Russel Okung mention breath work and grounding helped him so I made a big effort to do the same.\n\nI have also been praying more. Today I said a prayer and God answered it. I'm not going to get into specifics because it feels like making a wish and then telling someone your wish. The point I'm trying to make is never underestimate the power of prayer, close your eyes and give it a try.\n\nEverything on this planet is deeply connected. This is an idea I've discussed before on my Medium, but it is worth bringing up again. I'm trying to be a better person because I believe deep down what goes around comes around. Today I was actually offered a job doing door to door marketing but I decided to pursue other opportunities. I could have ghosted the interviewer but when I met with him the first time he mentioned if they select me for the job then they will have to decline another person. I did not want someone to not get the position because this organization was waiting for my response. So I called up the interviewer, thanked him for the opportunity, and politely let him know I would be exploring other opportunities. You know what he said to me? Thank you for your professionalism and taking the time to reach out.\n\nThe little things go a long way. None of us are perfect. However, each one of us has amazing characteristics that no one else on this planet has. So find the good ones inside of you. Focus on those, grow those, have the discipline to work towards an end goal that makes you happy. If you do those things and strive to be a good person God will reward you.\n\nI'm going to wrap this Medium up here, but I'd just like to make a note to post on my binmucker substack about how having a child made me more religious. It is impossible to look at one of God's creation that you helped create and not believe there is a God, at least in my experience on this planet.\n\n![Generated with Adobe's firefly!](https://miro.medium.com/1*xMvMJag_nxwBA7t2feiINQ.png)\n\n7/13/23\n\nConor Jay Chepenik",
  "wordCount": 529,
  "readingTime": 2.1962264150943396,
  "claps": 2,
  "voters": 1
}