{
  "id": "3c53131671fc",
  "title": "Day 351",
  "createdAt": "2023-03-09 03:26:59",
  "tags": [
    "1984",
    "cbdc",
    "bitcoin",
    "freedom",
    "opt-out"
  ],
  "url": "https://chepenikconor.medium.com/day-351-3c53131671fc",
  "content": "# Day 351\n\nMan I've been having a good time stealing memes and shitposting on Nostr. I'm not even sure if stealing memes is fair to say; Repurposing memes? Hahahaha I don't know. I think what's beautiful about the meme community is most people like the idea of open sourcing memes. Memes are meant to be shared, not kept hidden. I once saw Saifedean tweet that his book _The Bitcoin Standard_ was meant to be read. This is the opposite of many phd thesises which only get read by other academics. Creating is better when you share and open-source it to the world. Academia would be so much better off if they didn't charge 200 bucks for textbooks no one reads and instead open sourced everything so humanity could thrive. I imagine some of the work would be discredited, but plenty other would likely help humanity innovate in ways we didn't think possible. Anyways, who knows. More people are posting stuff on their social media, podcasts, blogs, etc so I'm bullish. Knowledge is meant to be shared NoT PeEr ReVieWEd. So back to memes... If you are really that scared about losing credit for your meme then you can always water mark it. I'd share watermarked memes all day.\n\nOn other note Satoshi's Journal hit me up about publishing something on their platform so I'm going to rework my 1984 piece for the remainder of this.\n\n**Bitcoin Prevents Doublethink**\n\nIn George Orwell's _1984_ the totalitarian government of Oceania employs re-education camps to \"cure\" individuals deemed thought criminals by erasing their existing beliefs and replacing them with the party's ideology. This results in effectively brainwashing any citizen who disobeys big brother into accepting the party's doctrines and becoming experts at doublethink, the ability to simultaneously hold two contradictory beliefs and accept them both as true.\n\n![](https://miro.medium.com/0*3iZgLSQciFqgNqIS)\n\nThe notion that a dystopian society could arise within a Western democracy may seem improbable, but the fact is that it is already happening, and many are unaware of it. Erich Fromm's afterword to 1984 exposes a paradoxical shift in human perspective: \"At the dawn of the industrial age, when technology could not yet sustain a world with sufficient food for all, people were hopeful. Yet today, despite possessing the means to achieve that hope, we appear to have lost it.\" This perfectly reflects the doublethink that is prevalent in the West, where contradictory beliefs are held simultaneously and subconsciously.\n\nConsider the paradox of owning a fridge, TV, washing machine, or car, all incredible devices that require energy, while simultaneously believing that we need to reduce energy consumption to tackle climate change. When you consider it from first principles, it doesn't make sense. The world needs to consume more energy if humanity is to thrive, not less.\n\nWe should be commending the technological and economic progress that has brought us closer to a world where everyone can have access to basic necessities, and be proud of our capacity to produce more than we require. We are at a point in time where every government should be renouncing territorial conquest as a method of wealth acquisition. Globalization should be a force that ought to unite us and pave the way for a more prosperous future for all. Instead it is turning out to be a vehicle for the creation of a bio-security state, controlled by technology, that empowers authoritarian kleptocrats to tighten their grip on power.\n\nIf this trajectory persists, there is a real danger that we will lose hope and a sense of purpose as a society. Despite having the capacity to create a better world, we still witness widespread poverty, inequality, and injustice. Millions of people around the world go hungry, while others waste food. Wars persist despite the absence of economic benefits. We see billionaires using private jets to lecture the underprivileged about climate change and environmental degradation, and yet we overlook the fact that many of them seek to institute a social credit system that [tracks everyone's carbon footprint](https://dossier.substack.com/p/how-the-federal-reserve-is-using?r=223b20&utm_campaign=post&utm_medium=web).\n\nThis doublethink is a product of a corrupt system which tells us we have free market capitalism while [12 individuals on the FOMC sit around and plan the cost of money](https://www.federalreserve.gov/monetarypolicy/fomc.htm). Meanwhile the mainstream media spews propaganda telling the masses that we can have our cake and eat it too. It is ridiculous to claim that the layman must stop consuming at unsustainable rates, while kleptocrats continue to be the number one user of CO2. Considering that C02 is necessary for plants to survive there is a whole debate to be had about whether or not it is really as big a pollutant as the \"experts\" claim. [Fossil Future by Alex Epstein](https://www.amazon.com/Fossil-Future-Flourishing-Requires-Gas-Not/dp/0593420411) does a much better job laying out these arguments than this article could. The point I'm making is we in the West hold two contradictory beliefs simultaneously: we celebrate the progress and prosperity that we have achieved, while also claiming we need war to defend democracy. If we are to move forward and create a better world for all, those who aren't completely asleep at the wheel must confront this doublethink and make difficult choices about the kind of world we want to create.\n\nIn _1984_, Big Brother uses a combination of psychological and physical torture to break down the individual's resistance and sense of self. In some cases, prisoners are subjected to intense electric shocks, drugs, and hypnosis. They are also forced to confront their deepest fears and traumas causing their sense of self to be systematically dismantled and replaced with the party's propaganda. The party's method of torture in _1984_ does not involve literal killing, but instead metaphorically kills their victims by effectively \"killing\" their sense of self without necessarily taking their physical life.\n\nThe process of re-education aims to create individuals who are unwaveringly devoted to the party and its leader, Big Brother, by not only controlling their actions but also their thoughts and beliefs. The ultimate objective is to build a society of people devoid of individuality and free will, who are entirely committed to the party's cause. This is a haunting vision of a world where the state wields absolute power, and individual liberty and freedom are completely obliterated.\n\n![](https://miro.medium.com/0*WTz3h_ytr6gDMXn3)\n\nNow you might be thinking that could never happen in our modern day society. However, complacency is a silent killer. It creeps up on you, lulls you into a false sense of security, and then strikes when you least expect it. It is important to remain vigilant about the challenges that lie ahead. The expansion of central bank digital currencies (CBDCs) is a topic of great concern for many individuals who value their privacy and freedom. CBDCs will likely claim to offer certain benefits, like convenience, universal basic income, and reduced transaction costs, yet the potential for these currencies to be used as tools of control is alarming. Let's dive into these a little more.\n\n- Convenience: Central bankers may try to promote CBDCs as a more convenient and efficient way to make transactions. For example, they could emphasize the ease of using a digital currency for online purchases or for sending money to friends and family.\n\n- Financial Incentives: Governments could offer financial incentives to encourage people to switch to CBDCs. For example, they could offer cash back or rewards programs for those who use the digital currency for their transactions.\n\n- Coercion: Although it's not a desirable option, governments could potentially use coercion to force people to use CBDCs. This could involve making physical cash illegal, or imposing penalties on those who don't use the digital currency.\n\n- Safety and Security: Governments could emphasize the safety and security benefits of using a digital currency. For example, they could highlight how CBDCs can reduce the risk of fraud and theft, and can be used to track illicit activities.\n\n- Public Education: Governments could invest in public education campaigns to promote CBDCs and explain how they work. This could involve working with community organizations, schools, and businesses to educate people about the benefits of using digital currencies.\n\nWith CBDCs, central banks can gain full access to every financial transaction made by individuals. Imagine how powerful an organization with the ability to monitor and control every citizens' spending behaviors could become. Such a high level of surveillance can be used to coerce individuals into certain actions and even be exploited for political purposes. Although the Federal Reserve is technically a private institution, it operates under close supervision from Congress and the President, which has led some to question its true independence. If a government or political party takes control of the central bank, they could manipulate CBDCs to serve their own interests, at the expense of individual liberty and privacy. The answer to the failures of central planning is not to hand the keys over to a different group of central planners.\n\nInstead of replacing one group of central planners with another, we should seek solutions that empower individuals to make their own financial decisions while protecting their privacy and liberty. Fortunately, we now have a protocol that can help individuals resist this kind of coercion: Bitcoin. Unlike CBDCs, Bitcoin is a decentralized digital currency that operates outside of the traditional financial system. Transactions are recorded on a public blockchain, making them transparent and resistant to censorship. While there are privacy tradeoffs tools like [Wasabi Wallet](https://wasabiwallet.io/), and many others are improving these issues with things like [coinjoin](https://bitcoinmagazine.com/technical/a-comprehensive-bitcoin-coinjoin-guide).\n\nUsing Bitcoin, individuals can retain control over their own financial transactions, without fear of government or central bank interference. They can enjoy the benefits of a global, borderless, and censorship-resistant currency that doesn't require any third parties to use. In a world where governments and central banks are increasingly seeking to exert control over citizens, Bitcoin is the solution.\n\nHaving money with a decentralized structure and emphasis on individual freedom is virtuous. This is particularly important as central banks begin exploring the potential \"benefits\" of central bank digital currencies. We all saw what happened to [toilet paper](https://www.bbc.com/news/world-australia-51731422) in the beginning of the pandemic. Jokes aside, you don't want to be the person looking for a lifeboat when the titanic has already started sinking. Learning how to use, purchase, and self-custody Bitcoin is the best way for an individual to resist nation-state coercion and protect their purchasing power. I find it ironic that the Bank of England's consultation paper on the digital pound claims Bitcoin is not a legitimate form of money. Yet, the paper also acknowledges the double spend problem, citing it as a reason why a British CBDC cannot be a bearer instrument.\n\n![](https://miro.medium.com/0*4cvCcC0xJU1v6vjh)\n\nPredicting the exact circumstances that would lead to a government becoming as controlling as Big Brother in _**1984**_ is difficult, but certain factors could contribute to such a scenario. These include the strength of democratic institutions and the government's overall goals and values. While the use of CBDCs is a significant step towards authoritarian regimes, it's not inevitable. It's crucial for individuals and democratic institutions to remain vigilant and hold governments accountable to prevent any potential abuse of power. Some proponents of CBDCs promise safeguards to ensure their responsible use. I say let's just ignore them completely and opt out with Bitcoin. In the free market, money arises spontaneously as a result of people's voluntary interactions and exchanges. There is no need for any government intervention or control. Especially since Satoshi went ahead and [solved the double spend problem on Oct 31, 2008](https://news.bitcoin.com/satoshi-nakamotos-seminal-bitcoin-white-paper-turns-14-today/).\n\n...\n\nOh yea that feels good. I'm back in the writing sattle baby. Well always was these past 351 days, but for writing stuff for an actual publication. I need to get started on this print magazine paper about Mass and the Spirit Of America but like I said in my earlier posts that piece is going to take me some time to get out. I'll have a rough draft by Sunday but I can already tell this is going to be a lot of work to get it right.\n\nUntil tomorrow anon.\n\n3/8/23\n\nConor Jay Chepenik",
  "wordCount": 2003,
  "readingTime": 8.108490566037736,
  "claps": 0,
  "voters": 0
}