{
  "id": "3c84e7da5d7c",
  "title": "Day 621",
  "createdAt": "2023-12-04 03:33:32",
  "tags": [
    "family",
    "sublime",
    "creative",
    "meaning",
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-621-3c84e7da5d7c",
  "content": "# Day 621\n\n![Damn bruh I was really blessed to be born during Bitcoin's monetization phase aye?](https://miro.medium.com/0*QgOh9Ilm3_bpjigF)\n\nTonight I filmed both my Grandma & Grandpa Chepenik and asked them six questions. I might be off on the exact phrasing of the questions but they were:\n\n1. What advice would you give Sloan for when she turns eighteen?\n\n2. What would you say you are most proud of?\n\n3. What do you regret the most in life?\n\n4. What makes a good person?\n\n5. What is the point of life?\n\n6. Anything else you want to tell Sloan before I end this interview?\n\nMan this simple experiment is powerful. I've done this with other family members and when I'm done I am going to splice it all together and upload it to Youtube. Then I will share the link to the unlisted video with Sloan. This way when she becomes and Adult she can hear wisdom from her ancestors.\n\nMultiple times this has led to someone getting emotional. Sometimes it was the interviewees and one time it was the interviewer (me)\n\nI'm so glad I did this though. It blows my mind how lucky I am to be alive at a time when I have these tools to share the wisdom of those older than me with my child who is too young to appreciate it right now. It is cool watching old VHS tapes of when I was a kid but now my kid will grow up with incredible footage and wisdom from her direct family. I talked about the sublime yesterday and my hope is watching this video I make will be a sublime experience for Sloan someday.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1731516301816865000%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n12/3/23\n\nConor Jay Chepenik",
  "wordCount": 262,
  "readingTime": 1.1886792452830188,
  "claps": 0,
  "voters": 0
}