{
  "id": "3e3bc8579b53",
  "title": "Day 139",
  "createdAt": "2022-08-08 22:41:11",
  "tags": [
    "social-justice-warriors",
    "lunch",
    "bitcoin",
    "life",
    "baby"
  ],
  "url": "https://chepenikconor.medium.com/day-139-3e3bc8579b53",
  "content": "# Day 139\n\nHad lunch with an old classmate named Jack today. Good dude. It was really refreshing to talk to someone else my age who sees the world in a similar vain as myself. This is not to say we didn't have vastly different lives and experiences. He grew up in New England and I grew up in the south. What I did notice is we were both sick of the crap our government has been pulling and noticed that the U.S is steadily declining. We both want to see a bright future for the U.S and are frustrated by the \"woke\" agenda that is masquerading as caring about others when in reality they destroy anyone who doesn't fall in line with their agenda.\n\n![](https://miro.medium.com/0*qIQiH0u4vBha8-RG)\n\nWe talked about inflation, having to police what you say in the work place, and podcasts as a new medium. It was a really refreshing conversation. It's funny because Jack made the point that it was his senior year of college that he started getting financially literate. He graduated a year after me and I'd say I got financially literate around the same time right after I graduated college. Seems both of us started to learn more about \"money\" because we knew something was wrong in 2020 when the Government started giving out checks for free. It's sad to see the U.S continually debase its currency. That said, it's hopeful to see and hear from people who started learning about money because of the bullshit our government is trying to pull on its citizens.\n\nThe [Streisand effect](https://en.wikipedia.org/wiki/Streisand_effect) is real. I'm sure many at the top thought sending checks would cause people to ignore the fact our Government was working with the Fed and Treasury to create dollars out of nothing. Luckily, convos like today remind me people see through this crap and are taking actions to protect themselves.\n\nWe also talked about Rome. I made the point that what collapsed Rome was when they started clipping their gold coins and the currency devalued. Jack mentioned around that time they saw gender become much more fluid and a big focus of the population. We both laughed at how history doesn't repeat but it often rhymes. Obviously people have a right to do whatever the hell they want with their body. The problem is when people start forcing it on others. Deep down neither of us wants to see the U.S fall but it's so ridiculous watching people argue about pronouns as the government passes stuff like the [Inflation Reduction Act](https://www.democrats.senate.gov/imo/media/doc/inflation_reduction_act_one_page_summary.pdf) which has 124 billion for IRS enforcement and a goal of reducing carbon emissions by 40% percent. The fight is not on the left vs right. It is on the ruling elite vs the masses and the masses are distracted and fighting about bullshit we should not be fighting over. Fossil fuels make our lives so much better. They make the world a livable place for humans. It is ridiculous to act like all these \"green subsidies\" for stuff that is not reliable energy compared to fossil fuels will help the climate. It also requires massive amounts of fossil fuels (and of course government subsidies) to get this set up. Also why the hell does the IRS need 124 billion more dollars. My god it is absolute madness. The audacity of these people to act like spending almost 1 trillion dollars will reduce inflation is wild. We are living through wild times and it is so refreshing to write about it and have meaningful conversations about it with people who see through the mirage.\n\nI can't fix the world's problems, but I can keep focusing on myself which I will do. Let's end this on a positive note anon. Found out today I'm having a baby girl. At the moment Sloan is the name we have decided on. I like that name. It brought tears to my eyes when I got to see the ultrasound. A little person growing inside of my girlfriend. Truly incredible feeling and I will make sure I do everything in my power to provide a good life for my daughter. I can't wait to welcome you in the real world come winter Sloan. Love you soon to be child and proud as hell of my girlfriend for carrying this baby.\n\n![](https://miro.medium.com/1*SQsDDpTMDcbjGwXLb0exog.png)\n\nThis was the second ultrasound but this time Sloan wasn't just a lil beanstalk. She is an actual baby. My heart melts just looking at her. No matter how much bullshit the governments, ruling elite, whoever the hell is running the show try and pull I will persevere and figure out a way to make sure my daughter can live a life she is proud of. I hope I'm wrong, but it seems the next ten years are going to be wild. Much of it is out of my control, but I now have all the more reason to help others save in money that can't be debased (Bitcoin) and wake them up from the constant propaganda that is being blasted all over the airwaves.\n\nStay safe, stay healthy, stay brave anon. The party is just getting started and we need as many brave souls in the world willing to do the right thing to make sure humanity prospers instead of pretending to be social justice warriors worried about what others think only to turn around and attack people who might see the world differently. Productive conversations come from learning about other people and not scolding them for disagreeing on stuff. Plus it's more fun having meaningful conversations than it is trying to be a social justice warrior and tell others how to think😎\n\n> *Edit after initially posting*\n\n> Some thoughts after reflecting on what I wrote today.\n\nAnon is likely my sub-conscious. I don't specify who the \"elite\" are. I don't even know exactly who they are. I just think of them as the bad guy in my own mind. Based on what shows up on my social media my ego forms an opinion and I blame those who I don't even know for the world's problems. Writing this helps remind me to fix my home first. I know that I should spend less time on Twitter and more time on positive activities. The past and future can't be changed I can only focus on the here and now. Grateful to reflect and realize that most of the social media algorithms are made to provoke emotion so I keep scrolling and get these companies paid. My attention is valuable and writing helps remind me that I should be using it to learn and improve upon things I care about. It's cathartic to chat with people in real life and see they can relate. However, focusing on things out of my control doesn't serve to make my life better. I need to continue to accept things outside of my control as they are. When I'm channeling what I want to focus my time on I'll strive to use it in ways that make the world a better place. I'm glad this reflection session served as a reminder to focus on the now, focus on what I can improve, and keep getting a tiny bit better everyday so my gains compound exponentially. It is easy to talk a big game and pretend to care about others. It's a much different thing to live your life in a way that actually improves others lives for the better. LOW TIME PREFERENCE!\n\n8/8/22\n\nConor Jay Chepenik",
  "wordCount": 1250,
  "readingTime": 5.100314465408806,
  "claps": 10,
  "voters": 1
}