{
  "id": "4103ae37cf99",
  "title": "Day 81",
  "createdAt": "2022-06-12 00:47:10",
  "tags": [
    "energy",
    "running",
    "grid",
    "top-down-control",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-81-4103ae37cf99",
  "content": "# Day 81\n\nCrushed a nice lil 5k today. The humidity had me sweating and struggling so I ran the first 2k walked 1k and ran the last 2k. It's kind of funny how when you get into the run you feel good, but starting out is brutal. Same thing happened after my 1k break, it took me about .5k to get back into a groove. It reminds me of energy use in vehicles. Gasoline engines are much more efficient on a highway because there isn't all the stop and start. Driving in the city gives me a much lower MPG because I'm constantly stopping at lights and what not. Amazing how much more energy efficient I am, in both my runs and when I'm driving, when I can get a steady pace going and not stop. I imagine the grid is similar. If the operators are constantly having to start/stop the grid it probably wastes much more energy than if they could operate them at a steady rate all day. Luckily, with bitcoin miners now they can plug them in when they need a buyer of excess energy and turn them off when the grid needs the surplus power. All this F.U.D from the M.S.M about how bitcoin miners are bad for the environment is ridiculous. Need people thinking through stuff before they open their mouth and spew bullshit. Unfortunately, the incentives of the M.S.M are to just be first rather than report factual news. Doesn't matter: bitcoiners will win. We got truth and reality on our side, something those who F.U.D Bitcoin don't seem to have (*there a few bitcoiners who call stuff out in Bitcoin because they want to strengthen the network and see it operate smoothly, but those people are different than those who just attack Bitcoin for persoanl gain*).\n\nWent and got some dinner with my girlfriend tonight which was nice. Hit up a solid Mexican joint called Ole. Before dinner, my girlfriend got mad at me for using Twitter too much today which is absolutely fair. I love all my bitcoin plebs on the bird app, but she is right. The algorithms filter me too much content that gets me pissed and it's not worth it. Not to say I will never use Twitter again, but the amount I do use it is very important. That amount needs to be less. I'm grateful that she calls me out on my shit because that is what a good partner does. I have no clue what the world is going to look like in 5 years. I'm sure the problems I have at that point will look a whole lot different than the problems I'm facing today. Got to take life one day at a time and remember to enjoy the little things. One topic we discussed tonight was how harmful it is for parents to constantly impose their top down controls on kids. There are times when it is necessary since parents know best, but giving kids the independence to make their own choices is important. For example, letting a child pick out their outfit can make them feel like they are independent. It gives them the confidence to make more decisions down the road and if a parent controls every decision a kid makes at some point the kid will rebel. At least it seems this way. Funny because whether it's a family or a nation-state I think this same logic applies. When a government won't stop imposing its top down control on society people start to get pissed. It's important we have rules for a civil society so people don't just lie and cheat their way to the top. Outside of that I would argue we don't need politicians controlling how companies operate. That is just not going to work in a successful capitalist society and I thought it was funny how whether it's a family or a system as complex as a nation-state the same ideas seem to apply.\n\nFinally, I'm happy to share this episode of The Nyc & Griff show. It was a pleasure chatting with these bitcoin plebs I met on Twitter. Podcasting is good shit and I look forward to going back on their show when I get a chance. Bitcoin plebs give me hope for a better future.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F1phnJzLbLtMftaZA3trKYE%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F1phnJzLbLtMftaZA3trKYE&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f4f75577fa4264c1c3e315be7&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"207\" width=\"368\"></iframe>\n\nAlso, got to share this shirt my Mum got for my child while she was in Greece. Hahahaha Moms are the best. Can't wait for my child to rock this when they pop out of my baby momma.\n\n![](https://miro.medium.com/1*xrc6CZSUT3ENQvdMGW9w0Q.jpeg)\n\n6/11/22\n\nConor Jay Chepenik",
  "wordCount": 764,
  "readingTime": 3.0830188679245283,
  "claps": 7,
  "voters": 1
}