{
  "id": "410fddb39f86",
  "title": "Day 79",
  "createdAt": "2022-06-09 21:15:38",
  "tags": [
    "economy",
    "challenge",
    "podcasts",
    "bitcoin",
    "coffee-shops"
  ],
  "url": "https://chepenikconor.medium.com/day-79-410fddb39f86",
  "content": "# Day 79\n\nHad to take a break from my regular scheduled Bitcoin podcasts to check out pods about other topics and this Lex Fridman Podcast did not miss.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F15C2T0Zz4cJQ5gkvX9jaBH%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F15C2T0Zz4cJQ5gkvX9jaBH&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f13fbc4114bb30ebff71264e6&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"207\" width=\"368\"></iframe>\n\nI knew social media probably was not the best thing for my mental health, but Jonathan's perspective has me convinced it is wreaking havoc on society's mental health collectively. Jon talked a lot about bubbles that social media creates and I can clearly see I'm in one with regards to Bitcoin. As far as I can tell the people in the Bitcoin bubble at least want a peaceful and prosperous civilization, but this doesn't mean I can't get blindsided into thinking a certain way. What I want and the reality are two different things. Many things can happen before hyperbitcoinization. Including hyperbitcoinization looking nothing like I imagined. It's important I keep an open mind and not assume or place my preconceived notions on the future. Easier said than done, but something I will do my best to keep in mind.\n\nThey also talked about challenging yourself. Jon gave a story about playing paintball with colleagues and how it unlocked a part of the brain him and his colleagues did not they had. That natural testosterone response is real and solicits tight bonds. It's why I'm so close with all my buddies that I played football and other sports with. Today it is hard to have those testosterone filled bonding events because everyone is so glued to their screens. Lmao \"testosterone filled bonding\" sounds like a funny phrase, but it is true. Going through adversity with people is what builds strong bonds. Sports can help with this to some degree, but society does not seem to be optimizing for this. When you love someone you let them experience pain. It might sound counter intuitive but it seems to be the truth. Monsters are created when they never have to face the actions of their consequence. Lifelong friendships are forged when people go through incredibly challenging situations and come out the other end stronger. I hope I can help my child lead a fulfilling life by showing them how to challenge themself everyday.\n\nNeed to remember in my own life the importance of challenging myself. I'm quite scared of the idea of going out on my own and opening a small business, but I do think it would be an incredible next step in my life. I've also thought about getting back into coaching football. I miss being part of a football team. Will see how it plays out. Going to keep taking it day by day and doing my thing. Shout out to writing. It's very easy to get down on myself and doing this everyday is a great reminder that creating is powerful. Synthesizing my thoughts onto a page everyday is an action that has helped me think more clearly. I've still got so much more to figure out about life, but I know doom scrolling Twitter and watching Netflix won't help me find the answers I'm looking for. Challenging myself as far as I can tell is the only thing that will bring some piece to my mind. My takeaway from that whole podcast I brought up earlier is that if you want to unlock parts of your brain you didn't know you had it's your duty to challenge yourself. Social media sheilds us from challenging ourself because it makes us concerned with mundane BS that doesn't matter. Absolutely wild how much time we can spend thinking about what to post rather than thinking about how to start a business, raise a happy family, work on a side project. I'm so guilty of this myself with Twitter, but the first thing an addict can do is admit it. Need to become more obsessed with writing a business plan for Chep's Comedy and Coffee Shop. A working title but I think it has some promise.\n\nI'd like to have it be a B.Y.O.B type joint. Maybe once I get a liquor license I could serve my own alcohol. During the day make it more of a relaxed coffee joint for Bitcoiners and other individuals to come together and have meaningful conversation. At night let it get rowdier as comedians crack jokes. Something so powerful about comedy. Speaking of I need to think of 2 minutes worth of jokes for my comedy class on Tuesday. I'd like to crack jokes about the importance of family. Why social media is making the world an increasingly dangerous place. Might be worth touching on how people will literally see someone getting robbed and think to themselves I need to record so I can go viral. No call for 911 or nothing. People are so eager to gain virality they would risk their life filming an armed robbery instead of calling 911. Saw a Twitter video today of this happening and I'm not even going to link it because it's just sad. It was a big crowd of people filming, but it seems ridiculous that the majority just filmed the robbery. Like what if the gunman got mad and started shooting at the people filming because he didn't want to be recorded. Got to find comedy in the painful situations. Also might be worth cracking jokes about covid-19. \"I thought it might be nice working from home, but I was going kind of crazy being alone all day\".\n\nLot of material to crack jokes about as 🤡 🌎  rages on but I'm hopeful things will get better. Pessimistic people don't live long lives. Lmao Janet Yellen was q[uoted ](https://twitter.com/DeItaone/status/1534994603652300800?s=20&t=bHbcocUwVRJnZIn64s2ZUA)saying today, \"AMAZING HOW PESSIMISTIC HOUSEHOLDS ARE GIVEN JOB GAINS\"\n\n![](https://miro.medium.com/0*h2lrvqJznYnr-0f7)\n\nFr fr I was like people spending mad money no cap I don't get it. Can't be that inflation is forcing people to spend more that is cap. Economy is doing just fine and inflation worrys will be calmed soon on G. Stop whining and let mama Yel get her bag right and we gonna go ahead and see. Tired of yall clowning and acting like the economy frowning. Ima be on top of this me and Uncle Jerome bout to make this shit Pop. We got ESG stocks bout to go bussin and bop.\n\nI don't even know what the paragraph that just came out of me was but I can't stop laughing at that pic of Janet Yellen with the millennial hair. Too funny.\n\n6/9/22\n\nConor Jay Chepenik",
  "wordCount": 1072,
  "readingTime": 4.245283018867925,
  "claps": 0,
  "voters": 0
}