{
  "id": "41cfc636e94a",
  "title": "Day 241",
  "createdAt": "2022-11-19 01:49:53",
  "tags": [
    "coding",
    "dogs",
    "children",
    "running",
    "habits"
  ],
  "url": "https://chepenikconor.medium.com/day-241-41cfc636e94a",
  "content": "# Day 241\n\nBeen using this youtube video from freeCodeCamp and it's actually insane how much free knowledge is out there for those seeking to learn. I'm getting a little frustrated because I can't get my JavaScript to work and make each button on my website functional, but I've still got a lot to get through and I'm sure it will come with time.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FxV7S8BhIeBo%3Fstart%3D2889%26feature%3Doembed%26start%3D2889&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DxV7S8BhIeBo&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FxV7S8BhIeBo%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOnce I create the Mass Adoption website I plan to use this same code with some minor tweaks to update my own personal website. I'd like to start programming websites for others and the more comfortable I become updating templates the better I will get at offering web design services. I've got a ways to go but the end goal will be to make quality websites in a short period of time from say 5–10 different templates I get real comfortable marking up. It feels good to make some progress though. As frustrating as the process can be I'm reminded that it means I'm learning. If you aren't being challenged when you learn then you aren't pushing yourself hard enough.\n\nI've been watching a dog named Reese this week which has been fun but also frustrating. Overall he is a good dog but since I'm not his owner and he's in a new spot he hasn't been sleeping through the night. Had to take him for a 4am walk last night but that's okay. Having a dog around is nice because it forces me to go for more walks. I'm pretty good about running and walking already but having a dog around takes it to the next level.\n\n![](https://miro.medium.com/1*uHBc9MOVZl9X2bxJl3Rkcg.png)\n\nAnimals are funny man. I feel like they pick up the temperament of their owners. I've been a professional dog walker since my senior year of college and met many different pet personalities. I find that I can calm most dogs down. Reese has chilled out the more time he has spent with me and my girlfriend. Maybe my theory is completely off but I feel like I will know when I get my own dog. I'm sure having a kid with my partner will give me plenty to deal with but if I do end up moving out of the city and get some land I might just say screw it give me the extra adversity. Plus I'd love to have my child grow up with a dog that will love and protect her. Reese reminds me of a tinier version of my Rottweiler Kobe. R.I.P Beefman (my families nick name for Kobe).\n\nMy Dad is great but he can be pretty type A. I found Kobe was like that. He would always growl when we stopped rubbing him. Not in the violent I'm going to bite you way but more so in the what the hell do you think you're doing human?! I'm not done being scratched way. Our Golden Sammye was always pretty wild until Kobe passed. Now she is super well behaved. Maybe she was just trying to show off for the Beefman and with him gone she no longer feels the need. Who knows. It is clear humans have much greater IQs than all known animals on earth but I think there is a lot we can learn from our animal friends. We might have the book smarts but animals have instinctual knowledge and seem to be a lot smarter than many give them credit for. I've heard many stories about dogs saving their owner's lives. I'm grateful that I get to be around animals for one of my side hustles. Coding is cool and all but when I need a second to calm down because I'm getting pissed off about JavaScript not working how I want it to work (which as I type this I realize is completely my fault because computers just do exactly what they are told to do and I clearly am messing something up in the code). Anyways, I'll figure it out and I'm sure it's going to be some tiny stupid little thing I missed. Practice makes perfect.\n\nThat's all for today anon. Now I'm going to go for one more nice walk that I wouldn't have gone on if I wasn't watching a dog. See this is why I might need to get a dog when I move out the city. I'm sure the last thing I will want to do after being exhausted from raising a kid is go for a walk even though it's exactly what I might need. If I have a dog it will be a mechanism to convince me to go anyways kind of like Nike Run Club and my \"proof of work\" groupchat is for running. The are many times where I go for a run solely so I can brag to my buddies about it. Which by the way has been working great for me. I'm smoking the competition because I'm consistent. Technology is just a tool anon. Use it to your advantage.\n\n![](https://miro.medium.com/1*Pw8b6Q8YgM-OuZsWnJnO2Q.jpeg)\n\nI hope Keenan doesn't go and pull an ultra marathon lmao. Homie is like the 🐇  while I'm the 🐢 . I will consistently run between 1–4 miles and get many 30 mile months in while Keenan will takes weeks & months off depending on his mood then come back and hit multiple 9–13 mile runs and bust out the occasional 50 mile month. I hope one day to be busting out 10+ mile runs but for the time being I'm going to keep being consistent. The longest I've run is an hour non-stop and that was a grind. Got a quarter marathon in that and I was exhausted the next morning. Worth it though runners high is amazing. I didn't believe in it till I actually tried running for my own sake rather than because someone made me run. Lesson in there.\n\n11/18/22\n\nConor Jay Chepenik\n\nP.S Sex is great but have you ever debugged code that was pissing you off? Oh my god I feel so much relief. Like way more than I should but I stayed up late to knock out this error and when I fixed it the relief felt amazing. It was a little just me mistyping a whole part. Took me like an hour to figure it out but boy oh boy did that feel great. Now I must become a developer so I can chase the rush of debugging.",
  "wordCount": 1069,
  "readingTime": 4.417295597484277,
  "claps": 1,
  "voters": 1
}