{
  "id": "42680d47ef64",
  "title": "Day 433",
  "createdAt": "2023-05-30 03:18:32",
  "tags": [
    "self-love"
  ],
  "url": "https://chepenikconor.medium.com/day-433-42680d47ef64",
  "content": "# Day 433\n\nMy app Habit-Chain is officially live. Here is the link to use it if you so desire.\n\n> [**Habit-Chain**](https://habitchain.herokuapp.com/)\n\nNot sure if I will continue using Heroku for hosting in the future, but I must say it feels damn good to have this app finally be built out. Been thinking about this bad boy for a long time. Of course, like horses, development never really stops it just keeps going.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FI7w9otyiE9g%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DI7w9otyiE9g&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FI7w9otyiE9g%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOn another note I've been thinking about this recently. Which is dumb because I have not read Nassim Taleb's work I just find it interesting all the spats he has gotten into over the years on the good ol' bird app.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/francispouliot_/status/1663370311335641088%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI need to read Taleb's book. Dude seemed to be way more fragile than you would expect from someone who pointed out the virtues of being anti-fragile. Then again, who tf am I to say anything about Taleb. I don't know the guy, haven't read his book (yet), and I'm basing these claims off twitter drama. Hahahaha Twitter drama is enjoyable to watch from the sidelines, but it is a net negative on society.\n\nI need to be better about not wasting my time on Twitter drama. I wrote a peace awhile back about being a dopamine addict. Here is another reminder to myself I'm still a dopamine addict. The internet is great. Seriously you can leverage it to learn almost anything. You can also waste your life on the internet looking at memes. I want to end this post with something positive so I'll quote Jimmy Song,\n\n> Most celebrities are fake.\n\n> I don't mean that they're insincere, immature, or require a lot of makeup, though they're probably that, too. I mean that they're created out of thin air like fiat money.\n\n> It used to be that fame was reserved for the truly deserving. You had to have significance, importance. At least a modicum of talent. But nowadays, that's not what's needed, at least in the conventional sense.\n\n> Conventional celebrity goes to the people that are connected, the people that are chosen for their roles, whether through nepotism, bribery or being at the right place at the right time.\n\n> Think Anderson Cooper made it by his merits? Think again. He's an heir to the Vanderbilt fortune and it's not a coincidence that he's the face of CNN.\n\n> Think Greta Thunberg is some prodigy? Her mom is an environmentalist and a member of the Green Party. She's been groomed for the role she's playing now. She didn't make it on her merits or her ability to speak. She got the publicity because her mom hyped her up. The narrative around her is as fake as the fiat system she's from.\n\n> Thankfully, we have the internet and if the internet is anything, it's a meritocracy. And it's a meritocracy because it's decentralized. The people that succeed are almost always people you wouldn't expect. They're not the Harvard MBAs or the professors in sociology or someone conventionally successful. They're always the oddballs, the outcasts, the people you would never expect that succeed.\n\n> And that's a good thing because the world of celebrity, like I said is fake. And this is why it's important to keep the net decentralized. We saw in the past three years an attempt to centralize it. But we're seeing that it wasn't successful. We're seeing more platforms than ever.\n\n> Let merit reign!\n\nExcellent points. Don't compare yourself to others. Realize the most important person in the world is you. Every morning you have to get up and stare that son of a bitch in the face hahahaha. At least we are the most important person in the world from our own perspective. I don't think you are the most important person anon, I think I am the most important person in the whole wide world. Why? Well because how can I try and help others if I have not first helped myself!!! When you recognize that at the end of the day the one you need to be competing against is you, well that's when you become a better human being.\n\n![](https://miro.medium.com/0*nYaiojVNrv_2Gv00)\n\n5/29/23\n\nConor Jay Chepenik",
  "wordCount": 693,
  "readingTime": 2.8150943396226418,
  "claps": 0,
  "voters": 0
}