{
  "id": "42a463e43ee6",
  "title": "Day 674",
  "createdAt": "2024-01-26 03:29:44",
  "tags": [
    "ordinals",
    "inscriptions",
    "bitcoin",
    "permissionless",
    "software-development"
  ],
  "url": "https://chepenikconor.medium.com/day-674-42a463e43ee6",
  "content": "# Day 674\n\n![](https://miro.medium.com/0*m2EcVKiCoH-mVzp4)\n\nListened to this podcast and learned a lot about ordinals and inscriptions on Bitcoin. I'll note first that inscriptions are actually part of Bitcoin while Ordinals are software for labeling satoshis, that is not technically a part of Bitcoin.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FYqDkuIsgfY0%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DYqDkuIsgfY0&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FYqDkuIsgfY0%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nSo with those technical details lets talk about, ah yes, ordinals. The Bitcoin world's new shiny toy that's as divisive as pineapple on pizza. Trading millions of satoshis for a singular, artsy one? Not my cup of tea, but hey, who am I to judge? If you get a kick out of digital collectibles that resonate with your soul, more power to you! But for those treating this like some modern-day Picasso investment, let's call a spade a spade: you are better off staying humble and stacking sats than you are trying to get rich by finding the next Mona Lisa inscribed to Bitcoin's blockchain.\n\nOrdinals and inscriptions represent a novel utilization of Bitcoin's blockchain technology. They are a digital graffiti of sort, embedding extra data directly into Bitcoin's transaction outputs, effectively creating unique digital artifacts. This became more feasible following significant upgrades to the Bitcoin network.\n\nThe introduction of Segregated Witness (SegWit) in 2017 was a key development. SegWit improved Bitcoin's block capacity and transaction efficiency by separating the witness information from the transaction data. This upgrade indirectly facilitated the storage of additional data in a more space-efficient manner.\n\nLater, in 2021, the Taproot upgrade further enhanced Bitcoin's scripting capabilities and privacy features. Taproot allows for more complex transactions to be processed more efficiently and privately. While it did not directly aim at facilitating Ordinals and inscriptions, the upgrade's improvements in efficiency and flexibility have indirectly supported these uses.\n\nIt's important to note that these upgrades did not result in hard forks. Instead, they were soft forks, maintaining backward compatibility with previous versions of Bitcoin software. Node operators are not obligated to adopt these upgrades; however, those who do can take advantage of the enhanced features and efficiencies they provide, including the potential for extra block space utilization.\n\nIf that was not geeky enough here's where it gets really nerdy: inscriptions are tucked into the witness data of a transaction, wrapped up in a neat little envelope that's revealed upon spending. Then there's ordinal theory, cooked up by Casey Rodarmor in 2022. Again, it is software that sits on top of Bitcoin and it's all about keeping track of every tiny satoshi ever mined. It's like a backstage pass to the Bitcoin show, tracking the movement of every satoshi on the network.\n\nIt's important to note that while ordinals may resemble NFTs in some aspects, they are fundamentally different due to Bitcoin's distinct architecture. Unlike typical NFTs on platforms like Ethereum, which use smart contracts, ordinals are inscribed directly into individual satoshis (the smallest unit of Bitcoin). This method does not leverage smart contracts but rather uses the existing data capacity of a Bitcoin transaction.\n\nTrading inscribed satoshis on Bitcoin does present complexities due to the network's design, which is not inherently geared towards complex smart contract functionality like some other blockchains. This necessitates the use of specialized wallets or tools capable of recognizing and transferring these inscribed satoshis. These tools must ensure that the embedded data within the satoshis remains intact during transactions. A key aspect to observe in the future is the consensus around the software and protocols used for managing these inscriptions. As interest in ordinals grows, the Bitcoin community will likely see a variety of solutions emerging to facilitate these transactions. These solutions will operate on top of Bitcoin's existing infrastructure and seeing how the incentives shake out will be interesting.\n\nSome other challenges to keep in mind is that there is no content moderation. Which is a good thing in many ways but one should realize that this arises from the permanent nature of data inscribed on the blockchain. Once data is inscribed, it cannot be altered or removed, which poses challenges in moderating content. There is also the concept of \"lost inscriptions\" which primarily refers to the risk of inscriptions becoming inaccessible if the inscribed satoshis are spent without regard to their unique content.\n\nIn essence, ordinals showcase Bitcoin's versatility without altering its foundational principles. While Bitcoin remains the preeminent decentralized digital currency, it can also accommodate unique digital expressions. However, it's essential to remember that Bitcoin's primary strength lies in its role as a secure, decentralized monetary system.\n\nBitcoin's open and permissionless nature indeed allows for diverse use cases, including digital art. Its robust and inclusive ecosystem can welcome varied interests while maintaining its core monetary functions. After all, Bitcoin's capacity to adapt and evolve continues to demonstrate its unparalleled position in the digital world. For those who aren't bullish... well Satoshi said it best...\n\n\"If you don't believe me or don't get it, I don't have time to try to convince you, sorry.\"\n\n1/25/24\n\nConor Jay Chepenik",
  "wordCount": 819,
  "readingTime": 3.290566037735849,
  "claps": 0,
  "voters": 0
}