{
  "id": "432d4272cd6f",
  "title": "Day 384",
  "createdAt": "2023-04-10 17:39:45",
  "tags": [
    "arrays",
    "religion"
  ],
  "url": "https://chepenikconor.medium.com/day-384-432d4272cd6f",
  "content": "# Day 384\n\n![Let the record show I asked for anArray symbol as a giant statue in Manhattan](https://miro.medium.com/0*_V32LeSCF7XBEGeC)\n\nFor my coding class, we have been learning about the difference between using .push() and .concat() methods in React. During lunchtime today, I went for a run and listened to a podcast that made me think of a pretty cool metaphor.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FOsh0-J3T2nY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DOsh0-J3T2nY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FOsh0-J3T2nY%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nHaven't listened to Lex in awhile, but this convo was great. Anyways, I digress! Before delving into the metaphor, let's first understand the difference between .concat() and .push() JavaScript functions. The .concat() method is used to merge two or more arrays by creating a new array that contains the elements of the original arrays. On the other hand, the .push() method adds one or more elements to the end of an existing array, modifying it directly without creating a new array.\n\nNow, let's revisit the crude metaphor comparing religion and science with the JavaScript functions .concat() and .push(). In today's rapidly changing world, we often find ourselves questioning our long-held beliefs and faith, sometimes replacing them with the latest scientific discoveries. However, it's crucial to understand that religion and science can coexist harmoniously.\n\nWhen confronted with new information, one might be tempted to use .push() to modify an existing array by adding new data to old data that doesn't fit well. If the stuff in this array is not jiving then people might replace GOD with the Science *TM*. I write that tongue in cheek but it is important to not lose the valuable wisdom and lessons of our ancestors, as we construct an entirely new way of thinking that might incorporate the old data but doesn't keep it separated. It just creates a completely new array and disregards the old one.\n\nInstead, we should strive to integrate our newfound knowledge with our existing beliefs, much like how .concat() adds elements to an existing array, enhancing it without discarding the original. This approach allows us to add to our current way of thinking without creating a whole new belief system. So with .concat() you get 3 arrays, the 2 OG arrays and the new combined one. That way if something isn't jiving you can look at the two original arrays to better understand what's going on.\n\nBy embracing a \"concatenated\" approach to religion, we preserve the rich tapestry of our heritage while incorporating the insights of modern science. As we navigate the complexities of the modern world, let us not forget the power of .concat() when it comes to our spiritual journey. By merging the wisdom of the past with the advancements of the present, we create a belief system that is not only rich in history but also adaptable and relevant in the face of an ever-changing world. This is a crude metaphor for sure, but hey I hope you learned something about coding!\n\n4/10/23\n\nConor Jay Chepenik",
  "wordCount": 464,
  "readingTime": 1.950943396226415,
  "claps": 0,
  "voters": 0
}