{
  "id": "43bc5701c3e5",
  "title": "Why I Gave Up Social Media As A New Years Resolution",
  "createdAt": "2021-01-14 16:36:21",
  "tags": [
    "social-media",
    "addiction",
    "withdrawals",
    "false",
    "hackers"
  ],
  "url": "https://chepenikconor.medium.com/why-i-gave-up-social-media-as-a-new-years-resolution-43bc5701c3e5",
  "content": "# Why I Gave Up Social Media As A New Years Resolution\n\nUnlike most years where I set some fitness goal that I don't complete I wanted to try something different. So this year I told myself I'll give up social media for a month and reassess how I feel after that month. So far 5 days in I feel great.\n\nAll jokes aside, I'm personally scared for the mental health toll social media is going to have on future generations. Social media makes people appear much better looking than in real life because people select the best photo and edit the shit out of it. Even the non-edited photos tend to be the best angles unless you're posting something funny. Thus, all people see are the very best from someone's life tricking people into thinking that person is happy as can be. The sad truth is a lot of people are not like their online presence. I'm just as guilty of doing this because of course, I don't want to post a photo where I look ugly and miserable. Thus, the only solution I saw was to go cold turkey and reassess how I feel afterward.\n\nI'd also like to throw in that I do believe good has come from social media. Never before could people connect so easily with long lost relatives, donate to social causes they wouldn't have been aware of without social media, and find online communities that are meaningful and fulfilling. Those parts of social media are incredible and I hope they continue to be utilized in the future. What's not so incredible are the like buttons constantly feeding dopamine and serotonin to our brains, push notifications so we can know when grandma needs some more lives on candy crush, and all the targeted car ads I don't want to see, but I'm seeing because the word \"car\" came up in one of my conversations.\n\nFast forward to two weeks into 2021 and I believe that I've experienced some form of withdrawal from social media. Couldn't tell you why, but yesterday was an absolute roller coaster of emotions. I felt angry, sad, anxious, and eager. My life is pretty normal on most accounts and I have food, friends, family, a steady job, and a roof over my head so I should feel grateful. However, I felt anything but grateful yesterday. Part of it is probably external factors, but I truly believe another part of this has to do with the fact that I don't have Snapchat, Twitter, Instagram, Facebook, or Tiktok on my phone anymore.\n\nThe more I learn about these companies the more alarmed I become about how controlling these apps are. Social Media has gotten so good at making humans feel certain motions based on the content displayed. I wouldn't be surprised if they are using our cameras to gauge our reactions to various content. (Remember we gave them access to our cameras to post content, and they already use our microphones to listen to our conversations to recommend us ads so what's stopping them from creating algorithms that gauge our facial reactions so they can better recommend content to keep us scrolling). Like I mentioned earlier this is not to say that Social Media has not done good in our world because it has. However, it seems the anger, sadness, and frustration these apps have caused people far outweigh the benefits they have brought.\n\nUltimately, it appears social media is here to stay. The law does not keep up with technology because technology grows too fast. I just hope educators, parents, and hell even influencers can start to do their part in teaching younger generations about the pitfalls of this technology. I'm only 23 and I've been doing as much research as I can into social media and its effects. So far all I can say is I'm overwhelmed. I remember watching the /The Social Dilemna in 2020 and they brought up the fact this technology could cause a civil war. I thought to myself yeah right this is the United States. Welp... the first couple days of 2021 proved me wrong as the capital was stormed by angry Trump supporters who probably read a ton of false information created by hackers from other nations hoping to see the downfall of the U.S.A. (Not saying being a Trump supporter is bad or good my point is hackers put out false information on both sides because polarization is what engages and keeps people scrolling. People love being fed what they already believe.)\n\nI don't have the answers to fix social media, but I will say this. Be kind, be patient, and realize when you see something on social media it doesn't necessarily reflect reality. People tend to post the highlights of their lives on social media so don't get down or jealous because of an app. I know it's easier said than done, but I can say besides that one day I experienced a plethora of emotions from my social media \"withdrawal\" I truly do feel better not having all those time wasters on my phone.\n\nStarted 1/5 Finished 1/15\n\nConor Chepenik",
  "wordCount": 859,
  "readingTime": 3.241509433962264,
  "claps": 10,
  "voters": 2
}