{
  "id": "46eef9ad64ba",
  "title": "Day 120",
  "createdAt": "2022-07-20 23:39:13",
  "tags": [
    "hope",
    "maps",
    "failed-banks",
    "good",
    "evil"
  ],
  "url": "https://chepenikconor.medium.com/day-120-46eef9ad64ba",
  "content": "# Day 120\n\nWork, work, work. Went into the office today and it's a lot sitting from 8:30–5:30. Feels like I'm a cog in the machine when I go in the office. Luckily, I'm on the hybrid schedule so I get to work from home on Tuesdays and Fridays but when I do go in I love going for walks. It's amazing how much better my day is when I can throw on a podcast and explore downtown Boston. While the view from my office is cool and the kitchen is packed with snacks it is maddening sitting all day cold calling and emailing. Getting outside is crucial to make sure I stay motivated. Also hitting the gym before I go up to the office helps a lot. Lion mentality baby. Sprint then rest (in my case rip dials/emails then walk lol)\n\nA lot of the podcasts I've been listening to are discussing how this \"fiat\" mindset is obsessed with getting compliance so people fit like cogs in their corrupt system. Bitcoin is a solution to this problem. A way to preserve your wealth outside of our current mainstream system that will steal your wealth if you don't comply. Hell, even if you do comply your wealth still gets stolen via taxation and inflation. The system does provide some benefits, but these are dwindling as more quantitative easing is required to keep the banking system propped up. One important metaphor I've made while listening is that both at the individual and institution level everyone with a fiat mindset is worried about today and not the future. People are happy to kick the can down the road and not worry about the consequences of their actions in the future as long as it solves their challenges today. I think 2008 is a perfect example of this. Since then we had the short-lived covid crash of 2020, and now this fall I don't know what to expect. The Fed is playing with fire and many businesses are struggling as the cost of fiat rises via interest rates. A pivot seems to be on the horizon, but then will see an inflationary spiral. Not great no matter which way they choose.\n\nStaying humble and stacking sats is my mindset. Also stacking cash because I have bills but that fiat will be used to either pay for immediate bills or dollar cost average into the 🌽  . It feels like there is a lot of uncertainty for the future. I have no clue how the coming years play out but I know I do not want a digital credit score come 2030. It's more important than ever that people stand up. Crazy to see what's happening in China. The CCP is literally bringing out tanks to protect their banks.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/btc_archive/status/1549808890669326336&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWild times that the CCP is using tanks to protect their banks. I shouldn't laugh but that is a funny rhyme. Anyways, thought this [map shared by Tim Urban on Twitter](https://twitter.com/waitbutwhy/status/1549586419101876224?s=20&t=BOvfxDmx_VFjMYoigX92jw) was fascinating. Sometimes I think moving to a less populated area would be chill. It's nice being able to make connections with others, but also peace and quiet are amazing. I do love visiting Montana when I get the chance. This map is so fascinating. It has been cool living in Boston for around 6 years now but come April I got a feeling my time here will be coming to an end.\n\n![](https://miro.medium.com/0*mTbwlSqL8zTJKuCP)\n\nLike sales, life is a marathon, not a sprint. There are many ups and downs but I swear taking the time to put my thoughts on this digital medium (no pun intended) has really helped keep me happy. I do worry about the pain that lies ahead but I'm also reminded pain is one of the best teachers. The masses will rise and help remind the kleptocrats who are in power that good is winning not evil. Just look at the map above. From 1980–2010 Florida's population doubled and it's only going to continue as people flee states that don't respect freedom and move to ones that do. These states can either learn from that pain or continue to experience more pain. At which point they will have to pivot and start respecting sovereignty and freedom or end like New York at the end of Atlas Shrugged. Long winded way of saying remain hopeful anon. I've got faith we can get this ship turned in the direction of freedom no matter what the kleptocrats want. Complex systems can not be planned from the top down. Good is going to win out from the bottom up. At least I got faith it will. Faith in God, faith in the corn, and faith in myself to help as an individual who will be orange-pilling people for the rest of his life.\n\n7/20/22\n\nConor Jay Chepenik",
  "wordCount": 803,
  "readingTime": 3.230188679245283,
  "claps": 9,
  "voters": 1
}