{
  "id": "48911c11663a",
  "title": "Day 209",
  "createdAt": "2022-10-17 19:01:31",
  "tags": [
    "georgia",
    "south-carolina",
    "family",
    "travel",
    "relationships"
  ],
  "url": "https://chepenikconor.medium.com/day-209-48911c11663a",
  "content": "# Day 209\n\nSitting in the airport getting ready to head back up to Boston. Some reflections from a week in the Georgia/South Carolina area.\n\n1. I have a lot of love for the south. I grew up in this area and the warm weather, friendly people, and market access to sweet tea is something I miss. Boston has a special place in my heart too but it does suck during the cold months sometimes.\n\n2. Anderson is a cool spot. There seems to be a big push to get the downtown revitalized and it reminds me a lot of Savannah, GA. It's near Greenville which is a cool town as well as Clemson. I'm happy to see my Dad doing well and getting to know his new area.\n\n3. Sammye is becoming such a well behaved dog. Unfortunate that it took Kobe's death to calm her down but she is such a sweetheart and it was great getting to see her. Went for a walk in a nature trail near my Dad and thoroughly enjoyed walking with Sammye off leash.\n\n![](https://miro.medium.com/1*_Q5642H9-5hDIw9PtrPF5Q.jpeg)\n\n4. Traveling is a nice refresher. Seeing more of the world, visiting friends and family, exploring different landscapes is awesome. Lot of clay in this area and some nice Mountains. It was awesome driving through rural parts and seeing farms with cows on them.\n\n5. I need to optimize life for my own happiness. I don't believe that becoming disgustingly rich will bring me happiness. I just want enough to live comfortably and allow my family to travel, spend time together, and own some land. What is truly going to make me happy in life is finding meaningful work, fostering a strong community, and continuing to improve the relationships I value deeply.\n\n6. Telling stories and laughing with friends is special. This past week was a great reminder of that.\n\nOverall, a 10/10 trip. I enjoyed the Atlanta Bitcoin conference. Visiting with my freshman year roommate was awesome. Seeing my Grandparents in Acworth as well as my Dad and sister in South Carolina was special. Both places are fantastic and remind me that small towns are full of charm that big cities does not have. I'm so lucky to have these experiences and live in a time where planes can make traveling thousands of miles possible in hours. As I get older and no longer live next to my immediate family it stinks not being able to see them everyday. Sitting in the airport is bittersweet because I'm excited to get back to my girlfriend and soon to be born daughter who I miss dearly. I'm also sad to be leaving an area I love deeply and was born in. I grew up in Jacksonville but Atlanta was my birthplace. I can feel the roots in me. Even more special that someone hung a sign showing the national debt next to the Fed. Bravo... I love a good Fed disrespecter😂\n\n10/17/22\n\nConor Jay Chepenik",
  "wordCount": 491,
  "readingTime": 2.0528301886792453,
  "claps": 4,
  "voters": 2
}