{
  "id": "49dc14104172",
  "title": "Day 70",
  "createdAt": "2022-05-31 23:20:56",
  "tags": [
    "bitcoin",
    "religion",
    "breedlove",
    "meta",
    "anon"
  ],
  "url": "https://chepenikconor.medium.com/day-70-49dc14104172",
  "content": "# Day 70\n\nRobert Breedlove is like fine wine. He just gets better with age. Haha all jokes aside I've been listening to Breedlove since he first went on the Lex Fridman [podcast](https://youtu.be/1pyrC6-J9KM) and this podcast with Josh Jalinski blew my mind. These two articulated and explored ideas I've been thinking about a lot recently. Watching this episode served as a reminder of how connected everything is plus how limited language can be. Humans can play imaginary but oftentimes (almost always actually) are words fall short. Take love for example. You could read every story ever written about love, but until you experience what it means you will have never fully grasped what love actually is. That is kind of how I feel about faith. It is something that has to be explored from within. Listening to others and reading the Bible is important, but at the end of the day your faith will come down to your own personal relationship with God. Our words will always fall short of the feelings we get from learning to truly love ourselves. The other great thing that this podcast reminded me about is how easy it is to get along with someone when you know they seek truth as well. Disagreeing with someone is only a problem when the two people are making arguments from an emotional place. When two people are having a conversation from a logical perspective it isn't a big deal when they disagree. Politics is such an ugly game because most politicians on both sides of the aisle are letting truth go out the door and opting for emotional appeals instead. I feel so grateful that by turning inwards I was able to find others who seek truth. Youtube recommended me this video because I decided to love myself enough to watch an educational podcast over dinner last night rather than a TV show. I'm becoming a firm believer everything happens for a reason and I'm so glad I took the time to watch this podcast instead of an entertaining show because it presented me with so much practical advice and so many new questions to ponder and reflect on.\n\n![](https://miro.medium.com/1*2gKKvNZpusAPj27iDeYNQA.jpeg)\n\nAnother rabbit hole I need to go down is the Steiner rabbit hole. Alek Svetski tweeted about this yesterday and it hit home because this is how I always felt about religion. I need to read the Bible by myself to see what I'm missing, but I always thought it was ridiculous to say those who don't believe in the Christian way of thinking are going to hell because if you grew up in a culture without Christianity and die before you get the chance to explore the Bible how is that fair? Religion does a great job guiding people to live a meaningful life, but every soul has to go on that journey alone. Another way of saying this is if you seek truth and believe you are doing the right thing according to your religion you must be good in God's eyes. That is the way I look at religion. Language falls short when it comes to describing things we will never understand. It is also a super powerful tool, but I hold the belief religion is more about living a principled life. To declare you have the right religion and others don't is vain. It just goes back to reflecting inwards so you get better at seeking to understand rather than seeking to impose your will.\n\nIn short, if you can learn to love yourself you can learn to forgive yourself for being flawed. If you can forgive yourself for your shortcomings you can start to forgive others who played a role in your shortcomings because you won't blame them anymore for your problems. When you start to forgive others the world becomes a better place because you start having stronger relationships and making those around you happy. Everything seems so complex sometimes but the truth is everything is incredibly connected. People like to say things like \"Oh I'm just one person I can't make a difference\" but I don't agree. We make a way bigger difference than we realize. Whether that difference is a net positive or negative for the world all falls back on learning to love yourself. Part of learning to love yourself has to do with your relationship with God.\n\nI will also say one thing I've realized through reflecting on who I am is that I've been addressing anon (which means anonymous) for so long because I was seeking validation from others. I wanted this to be something that caused me to get famous and blow up. Seems silly, but I never took the time to really reflect on it. Sure it is funny to address whoever might be reading my work as anon, but I need to remember that I'm doing this for myself and my children. I want them to know who their father was and I want to improve my writing skills. For so long I thought of this as something that would help me achieve fame, money, and a whole bunch of other things that just bring short-term joy rather than long-term fulfillment. So guess what anon. Today I am reminded that these posts are for myself and for my kin so they can understand who I was as a person after I pass on from this rock we like to call earth. I might address anon in future posts, but that is because I am a flawed human being with a dark sense of humor. Today I celebrate the fact I'm writing because it is literal proof of work to make me a better writer and give myself a legacy. I'm sacrificing my time in the present to create something meaningful in the long term. Well, at least I hope it turns out meaningful. If I keep doing this meta-analysis anon is going to think I'm a crack pot🤣. Anyways, learn to love yourself anon. It is a damn long and hard process that never stops, but guess what? The alternative is you become a resentful old fuck who blames everyone else which just results in no one liking you.\n\n5/31/22\n\nConor Jay Chepenik",
  "wordCount": 1041,
  "readingTime": 4.128301886792452,
  "claps": 0,
  "voters": 0
}