{
  "id": "49fe9eb56168",
  "title": "Day 225",
  "createdAt": "2022-11-02 23:19:00",
  "tags": [
    "css",
    "elon-musk",
    "bitcoin",
    "nation-states",
    "twitter"
  ],
  "url": "https://chepenikconor.medium.com/day-225-49fe9eb56168",
  "content": "# Day 225\n\nNo better way to learn than to try and teach what you are learning. I am firm believer if you can teach something (well) then you are likely pretty skilled at that thing. Not saying I can teach software development well yet but that is the goal so I'm going to use another one of these posts to go over some of the things I am learning. Starting with what the cascade in cascading style sheets means. It has to do with the fact that the order your styles are declared in matters very much to the computer. Unless otherwise specified the computer will render the last file to decide what CSS properties to show. For example if you tried to style your h1 tag twice the last thing the computer reads would be the one that gets selected.\n\nh1{\n\ncolor: red;\n\n}\n\nh1{\n\ncolor: purple;\n\n}\n\nSo in this example the h1 would be styled purple instead of red because the last line of code the computer read turns the h1 purple. It cascades which means it goes down. The example above is for styles within the same style sheet but the same principle applies if you make a website with multiple style sheets. I'm not sure why someone would do that but I would bargain there are likely reasons. So if you had a styles.css sheet and a stylestwo.css sheet whichever was at the bottom would be what renders on your website. THE ORDER THINGS ARE DECLARED MATTERS :D!\n\nI also learned about specificity in CSS which means the more specific a css selector will be selected over a common one. While I'm still not sure exactly what the difference between and ID (The one you use a # to call in the CSS) and Class (The one you use a . to call in CSS) are I know that because of specificity an ID will be selected over > a Class which will be selected over > an element. So cascading is important but it appears with specificity we can override this rule. There are levels to this computer science stuff lol. If you want to know how this specificity store is actually calculated here is a helpful website. [https://specificity.keegan.st/](https://specificity.keegan.st/)\n\n> [**Not Only Can We Avoid War But We Can Have the Best Times Ever**](https://www.linkedin.com/pulse/only-can-we-avoid-war-have-best-times-ever-ray-dalio/)\n\nRead this Ray Dalio article and it has me thinking about a third political party that would allow the middle of the pact voters to find compromise. I think social media has people very polarized and obsessed with their opinions. Many on the far right and left are so hell bent on letting others know they are correct and not willing to compromise that the word fascist has basically lost its meaning. At this point it seems the term fascist is just thrown around whenever someone disagrees with the other side. By forming a political party for the middle I agree with Dalio that we could find a way to compromise and enact political change that benefits everyone rather than a select few. Dalio writes,\n\n> Develop a strong and smart political middle that represents the majority of people and can defeat the extreme populist minority so that we can work and live well together. Because the policies that the majority of people want are both most acceptable and more sensible than the policies that the extremists are fighting for, it should not be all that difficult to put together a platform that represents what the majority in the middle wants. How would such bipartisanship work? For elections it can occur in a variety of ways that I won't digress into explaining here and now. As for governing, it can occur in a number of ways if leaders want it, such as the next president choosing to have a bipartisan Cabinet of smart people and to initiate a bipartisan \"Manhattan Project\" type initiative to make economic reforms that would both significantly improve productivity and benefit the majority of people.\n\nI do think a lot of the reason we are so divided is because of everyone's echo chamber on social media. While it is yet to be determined I hope Elon can help with this on Twitter. It is promising to see him charge 8 bucks a month to get a blue check which would mean Twitter isn't so beholden to advertisers to pay its bills. As long as ads are social media's main source of revenue I don't see how the above issues of everyone having an echo chamber gets resolved. Easier said than done but I am hopeful humanity can find a way and it was a good reminder from Dalio that most people are reasonable and in the middle. Humanity doesn't thrive when everyone is finger pointing at the other side talking about tHeY'rE tHe FaScIstS nOt My PaRtY. The real fascists are the people not willing to compromise in order to help humanity thrive!\n\nI have deep pride in the US but sometimes I forget how spoiled we are. Definitely the most spoiled country in the world which is ironic because our founders were able to install the most freedoms ever granted to the citizens of a nation. Good times create a bunch of spoiled brats I guess. This picture really made me step back and go woah. I feel bad for China's citizen and the BS they have to deal with in regards to a CBDC and vaccine movement pass but wow. Look at this.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/kimdotcom/status/1587878002553024513&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI hope Taiwan isn't the first conflict they initiate but even then the US has been poking the panda bear so will see. I like to think of Russia as a bear, China as a panda bear, and the U.S as an eagle. That's just what comes to mind when I think of what these nations would look like if they were animals. What I'm really looking forward to is nation-states becoming less relevant over time because they lose the ability to print money out of thin air. Technology is a tool and it is important to not lose sight of that. Learning about comp-sci has been pretty cool and reminded me that software just does what it is programmed to do. In my opinion, when the model is to keep people scrolling in order to show more ads the software gets engineered to create echo chambers in order to provoke emotion and keep people scrolling. This means the far right and far left get amplified to those who might just lean slightly right or left.\n\nNot everyone loves the idea of paying 8$ a month for Twitter but when people pay for the product rather than get advertised to because they are the product I believe the engineering can change. Only time will tell but I do think what I've seen so far is promising. I liked this tweet from Micheal Dell about Elon being the man in the arena.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/michaeldell/status/1587823471354068992&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWho knows how it plays out. If Twitter keeps trending in the right direction I might consider canceling my apple music membership and put that money towards a blue check hahahaha. I do want a blue check to be honest. Plus less ads on Twitter would be great. Will see I'm going to keep a close eye on the platform.\n\n11/2/22\n\nConor Jay Chepenik",
  "wordCount": 1247,
  "readingTime": 4.70566037735849,
  "claps": 0,
  "voters": 0
}