{
  "id": "4a96119e27f0",
  "title": "Day 362",
  "createdAt": "2023-03-20 02:34:30",
  "tags": [
    "the-fed",
    "eu",
    "money-printing",
    "bitcoin",
    "oooof"
  ],
  "url": "https://chepenikconor.medium.com/day-362-4a96119e27f0",
  "content": "# Day 362\n\n![](https://miro.medium.com/1*wZps1UOev_ihZDkvlT_Vxg.png)\n\nYou know how you are not supposed to scream fire in a crowded theather? Well I don't think that applies if the theater is actually on fire. On the other hand, if you want to reassure people that things are fine so you don't have to issue ticket refunds, what would you do? There is no way a theater owner would ever put their patrons at risk in order to save a few bucks on a refund, right? I personally doubt there are many theater owners who are such pieces of shit they would try to put out a fire so they didn't have to give refunds. Central Bankers though?\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ecb/status/1637559761976664064%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI said it yesterday and I'll say it again. Nothing is more permanent than a temporary program.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/luke_broyles/status/1637568330449006595%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe Fed and Treasury are stuck between a rock and a hard place and have no answer about what to do. It reminds me of the reality TV show Too Hot To handle which my girl watches and I tell her I hate watching , but I watch anyway and lowkey enjoy. In the show one of the guys Creed fancies two girls and can't decide between the two. He ends up not picking one and he gets kicked off the show for not doing the right thing. Which would be telling the truth and not leading on two girls. The Fed and Treasury are in a similar position except instead of choosing between two beautiful women their choices are hyperinflation or default on the government's debt obligations. The right thing to do would be fess up and claim they have mismanaged the economy and run up a bill they can't pay. I'm convinced it will not be the latter. So choose wisely what you save your wealth in. Stonks, bonds, and cash are likely to get a haircut in the coming decade.\n\nI would reckon real estate, physical gold, beef, bullets, vehicles, and my personal favorite, Bitcoin, will be better stores of value than U.S dollars if hyperinflation is the route the Central Bankers go. Vehicles really shouldn't be a good store of value but this is what happens when money dies. The vehicle I got at the beginning of the pandemic is now worth about 5 grand more, with an additional 45k miles on it. It is not that my vehicle is worth more now than it was when I bought it. This can happen with cool retro cars that are no longer made. No the U.S dollars just lost purchasing power. When you print 40% of the money supply and start telling people inflation is transitory weird things take place.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1637631090268557313%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n[Source](https://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm) for those who think there is no way those amazing Central Planners would hurt humanity and devalue everyone's savings. Yes it is somewhat ironic that the Federal Reserve's assets are largely made up of its own debts, such as U.S. Treasury securities and mortgage-backed securities. When the Fed buys U.S. Treasury securities it is essentially creating new money by crediting the account of the seller (usually a bank) with reserves held at the Fed. This increases the money supply and can lower interest rates, which Keynesian Economists some how believe stimulates borrowing and investment in the economy. The U.S. Treasury must also pay interest on those securities, which ultimately adds to the national debt. What they tend to miss is this creates tons of malinvestment and allows the Fed to pick winners and losers in the economy. It's crony capitalism.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/Jason/status/1637612878294581249%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe Fed wants you to believe its assets, which largely consist of U.S. government debt, serve as collateral to back the money it creates and helps maintain confidence in the value of the dollar and the stability of the U.S. financial system. Don't believe it. We are living in a system that rewards those who lie and punishes those who speak the truth.\n\n![](https://miro.medium.com/0*-UQlz0MrFC_nZg7o)\n\nFind better places to store your wealth than fiat currency.\n\n3/19/23\n\nConor Jay Chepenik",
  "wordCount": 661,
  "readingTime": 2.877672955974843,
  "claps": 0,
  "voters": 0
}