{
  "id": "4b873ce364bb",
  "title": "Day 746",
  "createdAt": "2024-04-06 23:34:57",
  "tags": [
    "russia",
    "ukraine",
    "peace",
    "war",
    "democracy"
  ],
  "url": "https://chepenikconor.medium.com/day-746-4b873ce364bb",
  "content": "# Day 746\n\nToday, I had a delightful experience at the local farmer's market. I picked up some fresh, ripe strawberries, plump blueberries, and a loaf of fragrant sourdough bread. While my child played with her friend, whose parents are originally from Ukraine, I had the opportunity to converse with her friend's father.\n\n![](https://miro.medium.com/0*NYaIho6iNQWMRG7g)\n\nHe shared insights into his background, having been born in the Soviet Union before its collapse when he was four years old. This meant he had firsthand experience living under the communist regime, albeit for a brief period. I'm not sure when exactly but I know after the dissolution of the USSR at some point his family relocated to Germany. However, he mentioned that true capitalism did not exist there either. In his opinion, the United States offers a more authentic form of capitalism, which he seemed to appreciate.\n\nAs an American, I must admit that I felt a sense of pride hearing his perspective. It reinforced the notion that my country's economic system is indeed superior to that of Europe. Of course with a Central Bank in place there will always be crony capitalism afoot, but I do believe Bitcoin will fix that in due time. While this view may be subjective, it was heartening to hear such a positive assessment from someone who has experienced different systems firsthand.\n\nWhat was not so awesome to hear was his perspective on Ukraine being a corrupt country, akin to Russia, with President Zelenskyy portrayed as a dictator at the helm, similar to Putin. He admitted to having a poor opinion of Putin, but found it ironic that Ukraine is not much better than Russia. He mentioned that the [Minsk agreements](https://en.wikipedia.org/wiki/Minsk_agreements) were violated, which is why Russia was so upset. We both noted that it was unfortunate for Boris Johnson to intervene and prevent peace from happening.\n\nHe also pointed out that the air defense systems sent to Ukraine only protect Kyiv, not the town he is from, which borders Russia. However, the part that gave me hope was his ability to see through the rhetoric and propaganda. For most people, it is clear that war is never the answer and that it is a tragedy for people to be dying on behalf of corrupt nation-states. There seems to be a growing awareness and people are waking up to the reality behind the smokescreen.\n\nWhile his views on Ukraine's leadership and the ongoing conflict were sobering they reaffirmed my own skepticism about the notion of defending democracy in Ukraine. However, I found reassurance in the fact that he could maintain a nuanced perspective, acknowledging the complexities of the situation and recognizing the devastating consequences of war. Ultimately, his words served as a reminder that genuine and lasting peace can only be achieved through open dialogue, mutual understanding, and a rejection of blind allegiance to any singular narrative or ideology.\n\nMore peace, less war.\n\n4/6/24\n\nConor Jay Chepenik",
  "wordCount": 488,
  "readingTime": 2.0415094339622644,
  "claps": 1,
  "voters": 1
}