{
  "id": "4cafca96e730",
  "title": "Day 145",
  "createdAt": "2022-08-14 16:33:23",
  "tags": [
    "bitcoin",
    "writing",
    "there-is-no-second-best",
    "cyber-hornets",
    "money"
  ],
  "url": "https://chepenikconor.medium.com/day-145-4cafca96e730",
  "content": "# Day 145\n\nWoke up and finished this bad boy. Was a little hung over, so I made some coffee, downed some water, and whipped up a bacon & cheese omelette plus an english muffin smeared in jelly & butter. The breakfast gave me a second wind to get to work and I must say it feels pretty damn good writing something like this. Going to fire off a DM to the editor of Bitcoin Magazine and see if they will publish my second article. I don't know the impact this will have but if it even encourages one more person to use and run Bitcoin than I would consider the article a success. I'm proud of this piece. I'd like to thank the orange coin for helping me figure out what is meaningful in life. Cheers anon.\n\n**Incentives Are Everything**\n\nWhen a newbie asks me about Bitcoin it's hard not to take a Michael Saylor inhale and embark on a four hour conversation about how there is no second best.\n\n![](https://miro.medium.com/0*ksnUnJM945qSGHdB)\n\nI've gotten better about my Bitcoin elevator pitch but it's challenging because Bitcoin is the perfect incentive system at every level. Summing up Bitcoin in 30 seconds for someone just embarking down the rabbit hole never does Bitcoin justice. In this piece I will attempt to lay out why the incentives of the Bitcoin network are so perfectly aligned. Starting with the individual, moving my way up to small businesses, followed by grid operators & energy companies, and finally nation-states. While I'm most hopeful that Bitcoin can help empower sovereign individuals, it appears we are rapidly approaching escape velocity. As the network continues to grow in size, Bitcoin will reach a point where every company and nation-state will adopt the technology in some form or fashion just like they have with TCP/IP. The Bitcoin rabbit hole teaches people about energy, finance, philosophy, physics, history, game theory, economics, computer science, and a bunch of other subjects. Not only did I study subjects I never otherwise would've because of the orange coin, but I also enjoyed doing so. I've heard many similar stories at my local Bitcoin meetups in Massachusetts. In order to have a good understanding of Bitcoin you must commit hundreds, if not thousands of hours. At which point you are just getting started because _**\"No one has found the bottom of the Bitcoin rabbit hole\"**_ - [Jameson Lopp](https://twitter.com/lopp). It almost feels like a cheat code for life once you start to grasp what Bitcoin means for humanity. An a-political, censorship-resistant, truly scarce, decentralized ledger that is being adopted by the masses from the ground up. This is a form of money that humanity has never had until an anonymous person or group named Satoshi Nakamoto solved the [Byzantine Generals Problem](https://river.com/learn/what-is-the-byzantine-generals-problem/). Let's dig into why individuals will adopt Bitcoin.\n\n![](https://miro.medium.com/0*LTpufSQMYeMHtwUx)\n\nINDIVIDUALS\n\nSocialism doesn't work because people are self interested. I'd love to live in a utopia where everyone cooperates and helps their neighbor. I firmly believe that giving is one of the best feelings in the world when you give via your own free will. However, it does not feel very good to give when you are forced to do so in order to avoid violence. Throughout history taking away the ability for people to keep the fruits of their labor has always ended poorly. Telling people they must produce for \"the greater good\" is a recipe for disaster. One example of this is what happened in China between [1959–1961](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1127087/). The country experienced what is now referred to as the great famine under Mao Zedong.\n\n_**\"Taking away all means of private food production (in some places even cooking utensils), forcing peasants into mismanaged communes, and continuing food exports were the worst acts of commission. Preferential supply of food to cities and to the ruling elite was the deliberate act of selective provision.\" -Vaclav Smill.**_\n\nThis is just one example of what happens when the government takes away the ability for its citizens to work on what they deem worthy. It ruins the incentive structure for productive people to work. The world is not a utopia no matter how badly socialists want it to be. It is one thing to demonize monopolistic practices because they hinder the free market from operating properly. It is a completely different thing to demonize profit. Those who do so are either malicious or incompetent because if people can't make a profit they won't spend their time and resources making something of value. That is unless they are forced to do so by the threat of violence. At which point people will do a much worse job because someone working for profit is a lot more motivated than someone working because they are being forced to do so. Not to mention the government mandated projects these people end up working on are jobs that they would have never selected in a free market. One monopolistic practice hindering our modern world today is the monopoly central banks have on fiat currency. By centrally planning interest rates and having the ability to create fiat money, without facing an opportunity cost for doing so, the free market is hindered. This leads to distorted price signals and individuals being pushed out on the risk curve. Luckily,\n\n_**\"Every day that goes by and Bitcoin hasn't collapsed due to legal or technical problems, that brings new information to the market. It increases the chance of Bitcoin's eventual success and justifies a higher price.\"- Hal Finney**_\n\n![](https://miro.medium.com/0*mFkVy9kpLMmVeYY8)\n\nWhile Bitcoin becomes less risky everyday it exists, in the beginning it was incredibly risky to put your fiat currency into this new technology. In the very beginning before [Mt. Gox](https://en.wikipedia.org/wiki/Mt._Gox) you couldn't even use fiat currency to buy any bitcoin. You had to use electricity and computers to mine it which is what made Bitcoin so special. It's outside of the traditional system that relies on credit and growth.. Many [projects that came before Bitcoin](https://river.com/learn/bitcoins-predecessors/) failed in the long run, but various ideas from these projects were referenced in Satoshi's [white paper](https://bitcoin.org/bitcoin.pdf). Over time more people will come to Bitcoin to protect their purchasing power as long as the network keeps operating and adding blocks of transactions every ten minutes~. The more people who see the impact fiat currency debasement has on their purchasing power the more likely they are to look for alternatives to protect said purchasing power. This is what initially attracted me to buy some bitcoin in early 2017. My friend told me about this new form of currency that had appreciated greatly since its inception. I watched the documentary [Banking On Bitcoin](https://youtu.be/ByvbAi924TI), which I still highly recommend to anyone interested in Bitcoin enough to read articles about it. This documentary helped open my eyes to the fact money is just a ledger. Unfortunately, I didn't fully go down the rabbit hole at that time. I spent the first couple years of my journey looking at my crypto exchange balances as my bitcoin and alt-coins did a 10x only to be depressed when my gains came crashing down after the bull market. Like most who are initially attracted to crypto for the speculation I obsessed over the fiat price. Doing so caused me to miss the whole point of not having to rely on any counter parties to verify and hold bitcoin. While it sucked losing all the fiat gains I had made it taught me some very valuable lessons.\n\n_**\"The danger is if people are buying bitcoins in the expectation that the price will go up, and the resulting increased demand is what is driving the price up. That is the definition of a BUBBLE, and as we all know, bubbles burst.\" - Hal Finney**_\n\nAs Hal so eloquently pointed out in those early days when something goes parabolic super rapidly it will likely crash just as rapidly. Pain is the best teacher and this was my first hint at why having a low-time preference is so important. It also served as a lesson for myself to focus on Bitcoin *not crypto*. I kept an interest in Bitcoin, but it wasn't until 2020 that I really started digging into the rabbit hole. When I got a stimulus check in the mail for doing nothing that set off an alarm inside my mind. While free money is always nice it was obvious that there would be consequences to the United States Government handing out cash to its citizens. I didn't fully understand why at the time. It was annoying me that I couldn't put my finger on what was wrong so I started down the Bitcoin rabbit hole which led me to Austrian economics and how money actually works. It was both frustrating and enlightening to learn about [Bretton Woods](https://en.wikipedia.org/wiki/Bretton_Woods_system), [1971](https://wtfhappenedin1971.com/), and [why central banks are in a race to debase their currency](https://www.youtube.com/watch?v=5Q4-E5K7tW0). When I learned that most US dollars are held on a server, in an SQL database, at The Federal Reserve I was shocked. These people can press buttons on a keyboard and print trillions. By granting 12 unelected officials the privilege to centrally plan the cost of borrowing money we have hindered the free market's ability to effectively tell market participants what the cost of capital is. Fiat is latin for \"by decree\" and thus it makes a lot of sense why central bankers will fight tooth and nail to not lose the ability to control money. The Fed claims to be an a-political organization but as debt levels increase to numbers typically seen during times of war central bankers are pressured politically to debase their currency. The other option is default on the debt and that is never politically viable. The silver lining is that more people are waking up because they get frustrated watching their purchasing power decline rapidly in inflationary environments. Being self-interested is not a bad thing. It is what motivates individuals to work hard so they can enjoy the fruits of their labor. Bitcoin optimizes for people enjoying the fruits of their labor while the Keynesian economic models of ever expanding credit steals the fruits of people's labor. No one knows how it ends but I'd argue over time more people will end up saving their \"fruits\" in bitcoin instead of fiat.\n\n![](https://miro.medium.com/0*iBZQor79pYwV1lkk)\n\nSMALL BUSINESSES\n\nVisa and Mastercard have a combined market cap of 775 billion~ dollars at the time of this writing. They charge around 3% for their services which eats into the profits of the companies accepting debit & credit cards. Those costs often get passed on to consumers. While these cards have made it much easier to transact these fees still seem quite high, I'm sure many businesses would be happy to avoid the fees if possible. Some companies are cash only and while I respect that I'm sure they miss out on a lot of business from younger generations who just never carry any cash on them. By accepting bitcoin these companies not only avoid the fees, but they also receive transactions that are final settlement. No more waiting 90 days to make sure a credit card doesn't get charged back. Bitcoin will massively disrupt many financial rails we have today. Many in the western world might not appreciate what a big deal this is because our financial rails are pretty well established. However, those in less developed countries know perfectly well what a pain it is to have parasites butting in to take a cut. Now they have a way to cut out these middlemen thanks to Bitcoin. It doesn't just stop at helping small businesses reduce third party fees, Bitcoin is also an incredible marketing tool. I'd gladly spend some sats at any local small businesses that took bitcoin. [Tahinas](https://twitter.com/TheRealTahinis) is a great example of a small business who leveraged Bitcoin to get some brand awareness. I've never been to Canada, but if I ever visit I plan to eat at Tahinas and use bitcoin to buy a shawarma. While the food looks good in pictures it is Bitcoin that has me motivated to eat there. As many who go down the rabbit hole find out, Bitcoin forms a special bond between people to the point where you literally want to support their business because you know they have taken the orange pill.\n\n![](https://miro.medium.com/0*wyUrJrEwSmgXcHK-)\n\nENERGY COMPANIES & GRID OPERATORS\n\nEnergy companies and grid operators also have a massive incentive to adopt a Bitcoin strategy. Rather than just having one buyer that demands more energy during the day than at night, the grid could have a second buyer who is willing to consume energy 24/7/365. Bitcoin miners can monetize energy that would otherwise go to waste. There is the upfront cost of buying an [A.S.I.C](https://www.investopedia.com/terms/a/asic.asp) and having the technical whereabouts to maintain and run said A.S.I.C. However, this means more jobs for the talented individuals who understand how to do so and more energy efficient grids. It amazes me how much fear, uncertainty, and doubt gets spread about Bitcoin's energy usage when the reality is Bitcoin can stabilize grids and make the capital put up to build out green energy infrastructure much less risky. If you wanted to build a massive hydro plant in a rural area before there was Bitcoin it would be very hard to raise the capital. Investors would not want to put their money up for a power plant that did not have buyers for the power being generated. With Bitcoin the investors can rest assured there is always a buyer for that power 24/7/365. While I think there will be a point when miners just keep the Bitcoin, they can also sell for fiat at any point in time. Unlike traditional markets, Bitcoin never stops trading. Since fiat depreciates over time the most efficient miners will be able to hold and accumulate bitcoin while the less efficient miners will have to sell for money that is constantly being debased by \"the money printer\". Thus, the best companies will thrive over the long run while the inefficient operators will have to adapt or die. It is the free market doing its job. The more I learn about how grids operate, the more apparent it becomes that Bitcoin can help usher in an abundant energy future where energy prices aren't going parabolic because of poor decisions made by central planners who are printing money at unheard of rates. The whole green energy, ESG narrative is an anti-human farce meant to hide the disaster that the central banks have created. These \"greeniacs\" claim that CO2 is going to suffocate the world, but this chart from Alex Epstein shows why more fossil fuel use is needed.\n\n![](https://miro.medium.com/0*mYFuyBGVCNfoo56G)\n\nEnergy is the base layer of society. Without reliable and reasonably priced energy things will get ugly fast. Just look at what happened to Sri Lanka who had one of the highest ESG ratings in the world before their economy collapsed. I don't want to see hyper inflation but when central banks create money out of thin air via \"quantitative easing\" it results in more money chasing the same amount of goods. People joke that Bitcoiners are psychopaths who can't stop talking about magic internet money, but the truth is we just want others to take the orange pill so we can stop suffering from the central planners. Bitcoin maximalists have a reputation of being mean online for calling out bad actors, but almost every Bitcoiner I've met in person turns out to be some of the most genuine, kind and intelligent people I've ever met. In person I've seen that Bitcoiners are willing to help onboard as many people as they can because we all strongly believe Bitcoin is the best way to achieve a pro-human future where we have an abundance of food, energy, and choice. In my opinion, helping people understand that Bitcoin is the life raft, instead of going out on the risk curve because the Fed is devaluing everyone's dollars, is one of the most noble things a person can do. History has shown that the free market will ultimately end up with one form of money winning out. Before Bitcoin that was gold and that got turned into fiat to keep up with the speed of commerce. Now that we have Bitcoin I believe fiat will continue to rapidly lose its purchasing power as more people and businesses realize that Bitcoin can't be debased by a single entity.\n\nNATION-STATES\n\nThis one is a double edged sword for me. I want as many individual people to adopt Bitcoin before the nation-states start accumulating. However, I'm hopeful that the nation-states who do end up adopting Bitcoin will be able to utilize its fiat price appreciation to create a more abundant society for the individuals that live there. At the time of this writing two countries have adopted Bitcoin as legal tender. El Salvador and the Central African Republic. According to [https://worldpopulationreview.com/country-rankings/legatum-prosperity-index](https://worldpopulationreview.com/country-rankings/legatum-prosperity-index) out of 167 countries El Salvador ranks 98 and the Central African Republic ranks 165 on the prosperity index. Neither of these countries is in the top 50% of prosperous nation-states and they were the first to adopt Bitcoin. I believe this trend will continue since the most prosperous countries have much more to lose by not being able \"to decree\" what happens with their country's money. Before Bitcoin, El Salvador was a dollarized economy. Now they allow both USD and BTC to operate as legal tender. The Central African Republic had the CFA franc as its currency which according to [wikipedia](https://en.wikipedia.org/wiki/CFA_franc)\n\n_**\"Critics point out that the currency is controlled by the French treasury, and in turn African countries channel more money to France than they receive in aid and have no sovereignty over their monetary policies.\"**_\n\n![](https://miro.medium.com/0*zOUSgOJes6uapzcR)\n\nIt is encouraging to see nation-states at the mercy of foreign central banks adopt Bitcoin to get around these monopolies. I imagine at some point the richest nation-states will be forced to adopt Bitcoin if their currency is hyper-inflated because it will be the only viable way to trade with other countries. These wealthy nations will fight for as long as they can to keep control of their monopoly on fiat currency. It is the poorer nations who don't have complete sovereignty over their money that will look to bitcoin to protect their purchasing power because they have the least to lose. If you are a nation-state and you can't create your own money to fund government spending you are much more likely to invest in a truly scarce currency than another nation-state which can create both bonds (IOUs) and currency out of thin air. While at the time of this writing El Salvador might not be in the green in terms of where they bought bitcoin on the spot market, they have made up for it with the massive boost in tourism and interest in their country. Personally, I would love the opportunity to visit El Salvador and use bitcoin to buy stuff. El Salvador has and will likely continue to experience a massive influx of tourism as more Bitcoiners, like myself, start to plan trips down there so they can use this new form of money. The cyber hornets don't mess around and as more countries notice the impact Bitcoin can have on their local economies the logical conclusion is to adopt it as legal tender and attract tourists to bolster their economy.\n\n![](https://miro.medium.com/0*6VbDi8ktYIreGM7I)\n\nCONCLUSION\n\nIt might get messy. Rich nations, The World Bank, and The I.M.F aren't just going to toss up their hands and go welp it was fun controlling fiat while it lasted. Just look at the U.S who is hiring and arming an additional 87,000 IRS agents. The United States is planning on printing money out of thin air so they can pay citizens to do this.\n\n![](https://miro.medium.com/0*B8kzHsKnjI_cl8xW)\n\nIt is quite ironic that the nation which was created because we demanded no taxation without representation is doubling down on its tax force. The people in power will fight tooth and nail to protect their interests and hinder Bitcoin's adoption. Luckily, top down controls can only go so far. Individuals, companies, and nation-states are all self-interested. No one likes a parasite when they are the one dealing with the consequences of said parasite that is draining their resources, time, and value. Over a long enough time horizon it seems Bitcoin will bleed these parasites dry as they lash out and try to impose top-down controls across the world. Bitcoin can fix energy, monopolistic central banks, credit based systems, and massive surveillance security states. It can help disincentivize violence because if someone stores their private keys in their head then no one can steal that Bitcoin. They can kill the person who holds the keys, but if they were not able to torture those private keys out of the victim's head then that just results in a donation to the rest of the network since that persons bitcoin will never be moved. If enough people adopt Bitcoin and use solid safety practices then powerful entities stand more to gain by cooperating with these sovereign individuals than killing them. I don't want it to get messy and truly believe the best way to avoid conflict is by getting more people to take the orange pill and convincing them to run a node. Individuals, companies, and nation-states theoretically no longer need banks to transact. As a U.S citizen I hate to see America in disarray. However, Ray Dalio makes some excellent and terrifying points about the state of our republic in his book _The Changing World Order_. The U.S is a declining empire at this point and China is on the up and up. I don't want to use China's central bank digital currency. I don't want to use any CBDCs and I know that the Bitcoiners who are reading this don't either. China has an incredible history and a nation full of hardworking people. However, their massive surveillance state and CBDCs are not something that will ever fly in a free country. It is up to the masses to say enough and opt out. I refuse to let my child grow up in a world where the government can turn off access to its citizens' money with the flick of a switch. These past 2 years have been absolutely insane. We are seeing people get their bank accounts frozen because they donated to a peaceful protest put on by truckers in Canada. We are seeing an attack on farmers across the globe to meet anti-human ESG agendas that will destroy countries in the same way it did Sri Lanka. We are even seeing the greatest nation on the planet come after its own citizens by devaluing their currency at unprecedented levels, hiring more IRS agents, and raising taxes during a recession. All of this is what is at stake if the masses don't wake up and peacefully opt out from these corrupt regimes with Bitcoin. All we have to do is use an old computer or a raspberry pi, with a terabyte hard drive, and an ethernet cable to run Bitcoin core. If you do this you are now able to transact with anyone in a peer-to-peer manner and verify that only 21 million bitcoin will ever be created. It brings me a warm tingly feeling thinking about the freedom, prosperity, and abundance Bitcoin can bring to the world.\n\n\"Abundance in money creates scarcity everywhere else, and scarcity in money creates abundance.\" - [Jeff Booth](https://twitter.com/JeffBooth)\n\nThat's why the cliche is \"Fix the money; Fix the world\".\n\nSources\n\n\"Bitcoin's Predecessors: River Learn - Bitcoin Basics.\" _River Financial_, [https://river.com/learn/bitcoins-predecessors/.](https://river.com/learn/bitcoins-predecessors/.)\n\nBooth, Jeff. \"Finding Signal in a Noisy World.\" _Medium_, Medium, 9 Aug. 2022, [https://medium.com/@JeffBooth/finding-signal-in-a-noisy-world-57497df06a35.](https://medium.com/@JeffBooth/finding-signal-in-a-noisy-world-57497df06a35.)\n\n\"Bretton Woods System.\" _Wikipedia_, Wikimedia Foundation, 8 Aug. 2022, [https://en.wikipedia.org/wiki/Bretton_Woods_system.](https://en.wikipedia.org/wiki/Bretton_Woods_system.)\n\n\"CFA Franc.\" _Wikipedia_, Wikimedia Foundation, 12 Aug. 2022, [https://en.wikipedia.org/wiki/CFA_franc.](https://en.wikipedia.org/wiki/CFA_franc.)\n\nDalio, Ray. _The Changing World Order_. Simon & Schuster, 2021.\n\nDaly, Lyle. \"Average Credit Card Processing Fees and Costs in 2022: The Ascent.\" _The Motley Fool_, The Ascent by The Motley Fool, 5 Aug. 2022, [https://www.fool.com/the-ascent/research/average-credit-card-processing-fees-costs-america/.](https://www.fool.com/the-ascent/research/average-credit-card-processing-fees-costs-america/.)\n\nEpstein, Alex. _Fossil Future: Why Global Human Flourishing Requires More Oil, Coal, and Natural Gas - Not Less_. Portfolio/Penguin, 2022.\n\n_Legatum Prosperity Index 2022_, [https://worldpopulationreview.com/country-rankings/legatum-prosperity-index.](https://worldpopulationreview.com/country-rankings/legatum-prosperity-index.)\n\nNakamoto, Satoshi. _Bitcoin: A Peer-to-Peer Electronic Cash System_. [https://bitcoin.org/bitcoin.pdf.](https://bitcoin.org/bitcoin.pdf.)\n\nSmil, Vaclav. \"China's Great Famine: 40 Years Later.\" _BMJ : British Medical Journal_, U.S. National Library of Medicine, [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1127087/.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1127087/.)\n\nTardi, Carla. \"Application-Specific Integrated Circuit (ASIC) Miner.\" _Investopedia_, Investopedia, 16 Mar. 2022, [https://www.investopedia.com/terms/a/asic.asp.](https://www.investopedia.com/terms/a/asic.asp.)\n\n\"Mt. Gox.\" _Wikipedia_, Wikimedia Foundation, 23 July 2022, [https://en.wikipedia.org/wiki/Mt._Gox.](https://en.wikipedia.org/wiki/Mt._Gox.)\n\n\"What Is the Byzantine Generals Problem?: River Learn - Bitcoin Technology.\" _River Financial_, [https://river.com/learn/what-is-the-byzantine-generals-problem/.](https://river.com/learn/what-is-the-byzantine-generals-problem/.)\n\n\"WTF Happened in 1971?\", [https://wtfhappenedin1971.com/.](https://wtfhappenedin1971.com/.)\n\nYouTube, What Bitcoin Did, 20 June 2022, [https://www.youtube.com/watch?v=5Q4-E5K7tW0.](https://www.youtube.com/watch?v=5Q4-E5K7tW0.) Accessed 12 Aug. 2022.",
  "wordCount": 4154,
  "readingTime": 16.87547169811321,
  "claps": 5,
  "voters": 0
}