{
  "id": "4cd42b44db1c",
  "title": "Day 405",
  "createdAt": "2023-05-01 22:32:46",
  "tags": [
    "all-in-podcast"
  ],
  "url": "https://chepenikconor.medium.com/day-405-4cd42b44db1c",
  "content": "# Day 405\n\n![LAB GROWN MEAT BABY!!!!](https://miro.medium.com/0*VTFsNVsl5o0DU_No)\n\nWalking home every day from downtown Boston has significantly improved my health. It's particularly enjoyable on sunny days when the Charles River bustles with sailors and duck boats. Today, as I strolled across the Longfellow Bridge, I tuned in to the All-in Podcast. What an excellent rip.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F3slYsEzJZoY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D3slYsEzJZoY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F3slYsEzJZoY%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThe conversation centered on the comparison between lab-grown meat and traditional meat. Chamath raised compelling points about how the grass and water consumed by a cow directly affect the taste of its meat. In contrast, Friedberg argued that by solving the appropriate scientific equations, we could engineer meat at a significantly reduced cost. I appreciated Friedberg's transparency regarding his investments in companies working on this technology, as well as his belief that the free market would contribute to lowering meat prices. Nevertheless, I personally find investing in such technologies somewhat dubious.\n\nFriedberg pointed out that cow flatulence significantly contributes to methane emissions in the environment, a notion that I thought ridiculous. Cow farts are hardly going to melt the earth! It's challenging to argue that cows are the sole culprits of environmental degradation when they also play an essential role in sustaining human life in today's world. Personally, I agree with Chamath that if we concentrate on farmers raising the healthiest cows possible, with access to the finest spring water and the lushest grass this country can offer, we would likely address the issue more effectively.\n\nWhile I have no objection to Friedberg or others consuming artificial beef, I believe the market should decide its viability. To his credit, Friedberg admitted he doesn't foresee Beyond Meat and similar companies becoming profitable in their current form. Instead, the focus seems to be on smaller startups that transform sugars into protein through an innovative process, reminiscent of futuristic sci-fi concepts, like 3D-printed meals which reminded me of The Orville. However, such technology may still be quite a long way off.\n\n![](https://miro.medium.com/0*B8AxC90-4CsyMfep.jpg)\n\nI have no inclination to be a guinea pig for these unproven technologies. However, in the future, if artificially-produced Wagyu were to cost only 100 sats and the majority of people find it delectable, I might be willing to give it a try. Ultimately, time will reveal the outcome. It's essential to maintain an open mind, as the future is bound to be exponentially different👀 🫡\n\n5/1/23\n\nConor Jay Chepenik",
  "wordCount": 391,
  "readingTime": 1.8588050314465407,
  "claps": 0,
  "voters": 0
}