{
  "id": "4cdaeef8291d",
  "title": "Day 9",
  "createdAt": "2022-04-01 01:18:10",
  "tags": [
    "bitcoin",
    "alt-coins",
    "shitcoins",
    "going-parabolic",
    "best-business-show"
  ],
  "url": "https://chepenikconor.medium.com/day-9-4cdaeef8291d",
  "content": "# Day 9\n\nToday my father called me up and got upset because I kept calling alt-coins \"shitcoins\". He said this was a very limited view. My response was being open-minded is important, but based on what I've learned, researched, and studied I believe that bitcoin is what's important. My first experience with crypto was in 2017 and the speculation is what attracted me. If a coin had a chance of increasing my USD holdings I was interested. Fast forward 5 years and now I'm praying for bitcoin price drops so I can decrease my USD holdings for cheap 🌽  . All I want is to stack as many satoshis as I possibly can before hyperbitcoinization occurs.\n\n![](https://miro.medium.com/0*oUu2RrbSBcW0wJ3f)\n\nIf hyperbitcoinization doesn't occur the world is looking at a two-tiered society where the people on top do whatever they please and the ones on the bottom get to eat bugs and own nothing. That might seem dramatic, but so does shutting down the world for a virus about as deadly as the flu. Truth be told no one knows what will play out in the coming years, but I'm going to do everything in my power to own stuff and continue eating steak. On the macro stage, I wouldn't even be considered a pawn. Doesn't matter. I can stay solvent and chill with the anon toxic bitcoin maximalist pleb crowd that fills my Twitter feed longing than governments around the world can pretend that their money printing isn't causing massive inflation. Are they toxic? Yea governments are the worse, but bitcoin plebs are the good kind of toxic. They call out bullshit and crack me up. Just the kind of frens more of us need in our life.\n\nFor better or worse, these toxic anons likely scare many people away. Luckily, bitcoin can be used by anyone and those who are smart enough to learn about it will likely come to see its value prop. [Svetski](https://twitter.com/GhostofSvetski) had a great quote on a song called _[Plebs Run This](https://www.youtube.com/watch?v=i_jteRb2mA4)_. He said \"We are the white blood cells of the network. When an external force or a virus of stupidity comes and tries to adjust it we fight them off.\" Bitcoin is freedom money. It will make sure the masses can't be enslaved by a bunch of jerk-offs in Davos who think they know what's best. I listened to Pomp's podcast today with Chris Larsen because I wanted to see if my bias is blinding me. I do appreciate Chris taking the time to debate someone who understands that proof of work is critical to bitcoin. My takeaway is Chris doesn't actually care about decentralized, permissionless, fixed supply money. Classic shitcoiner.\n\nThere are some people who dabble in altcoins and seem like good people. Watching [today's episode](https://www.youtube.com/watch?v=MqxGEuz43_M) of The Best Business Show helped me realize this. Pomp had on [Jason Williams](https://twitter.com/GoingParabolic), a \"Non-Toxic Bitcoin Money Maximalist\" who is worth the Twitter follow. Jason thinks NFTs are one of the top 4 greatest innovations up there with bitcoin, the internet, and a business he sold that I'm not familiar with. NFTs have a use case, but I don't agree JPEG monkeys selling for millions are the greatest of these use cases. I think event tickets and stuff like that could be a cool use case in the future though. The great thing about the free market is it doesn't give a shit about what I think. Watching Jason helped remind me of this. I still feel strongly about knowing the difference between bitcoin and crypto, but clearly, there is a market for stuff outside BTC. Even Chris Larsen mentioned on the Pomp podcast that if Bitcoin fails the rest of the crypto market will go down with it. Thus, I'm confused why he thinks there needs to be a code change that would eliminate the whole value prop of bitcoin. Enough of letting someone with differing opinions have free real estate in my head. I'm not a financial advisor and this is not financial advice, but if you are a pleb you're much better off trying to stack a full coin than searching for the next Bored Ape Yacht Club NFT collection. If you end up wildly successful and want to branch out you should. Look at Jason. The guy has incredible tenacity, built and sold something that made him a lot of money and wrote a book on bitcoin. He might play with the other stuff in crypto, but the guy clearly understands bitcoin's value prop and is hilarious. The episode is worth the watch just to hear Jason talk about why he has a Twitter header showcasing him in a fight with Twitter.\n\n![](https://miro.medium.com/1*Cj192D_YzLlGVELwDmMzUQ.jpeg)\n\nDespite my kind words, Jason did not change my opinion about bitcoin being the only thing that matters. What he did do is point out there is more to life than bitcoin. At one point he and Pomp are joking about how a lot of \"bitcoiners\" have matured since 2017 and are no longer foregoing couches to stack sats. Not saying there is anything wrong with selling your furniture to get as many sats as possible. What I'm saying is most people like furniture and other nice things. It is good to see bitcoiners living their best life. For people like myself who hope to one day stack a full coin playing around in alts is not a great strategy. Dollar cost averaging and buying every day will likely be a much better strategy for 99.9% of people. For someone like Jason who has been in the space for some time and seen his wealth appreciate greatly it makes much more sense to play with the other stuff. Jason has gotten more from airdrops this year than I have in net worth. Nuance is important and I'm glad there are people out there to enlighten and remind me that what I'm optimizing for is not the same as others. I won't stop urging the people I care about to learn why Bitcoin is different from the rest. I will stop calling altcoins shitcoins though. Sike cry harder shitcoiners. Stable coins might have a market and so do protocols where people can build decentralized applications on them. Ethereum is the dominant platform but who the hell knows if Solana, Avalanche, or another \"eth-killer\" might win out in the long run. I don't know and until one of them has better applications than all the ones on TCP/IP it does not matter to me. I will stack sats regardless. I guess what I'm trying to say is unless you are mad wealthy from being self-made your best bet is stacking sats like a pleb.\n\n3/31/22\n\nConor Jay Chepenik",
  "wordCount": 1121,
  "readingTime": 4.613522012578617,
  "claps": 0,
  "voters": 0
}