{
  "id": "4e5ad2431a5e",
  "title": "Day 488",
  "createdAt": "2023-07-24 03:37:04",
  "tags": [
    "oliver-malcolm",
    "movies",
    "chatgpt",
    "technology",
    "crutch"
  ],
  "url": "https://chepenikconor.medium.com/day-488-4e5ad2431a5e",
  "content": "# Day 488\n\nAfter numerous attempts, I'm thrilled to say that I'm finally grasping programming. The sheer amount of knowledge to absorb can be overwhelming, but I've found that building the same applications repeatedly really helps concepts click. Lately, I've been focused on developing a full-stack app for user authentication, and it's been a great learning experience. However, there's still plenty for me to explore, especially when dealing with various packages depending on specific requirements.\n\nBut that's alright; I'm committed to continuous practice and improvement every single day. Those green boxes on GitHub will soon see more action! My Github and this Medium are my real Habit-Chain lol.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fjrne_fGdeVM%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Djrne_fGdeVM&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fjrne_fGdeVM%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOn another note, this dude is an incredible singer. I had the pleasure of watching him perform in Cambridge before a Felly concert, and it was a fantastic live experience. Although this may seem unrelated, his music is what I am jamming as I write this on Medium.\n\nYou know what thing I have not been able to get my mind over recently? This chart.\n\n![](https://miro.medium.com/0*xCKrcn_i9EwALAJP.jpg)\n\nIt appears that even with better tools and higher quality cameras, no movies from 2010 or 2020 have made it to the top of the list. It makes me think about how advances in technology can both enable us to achieve more while also becoming crutches. The same idea can be applied to programming, where I often find myself relying on tools like ChatGPT and LLMs to assist me, both in coding and in my writing.\n\nWhile these tools are helpful and have their place, I've also come to realize that they can sometimes hinder me from truly expressing myself. Striking the right balance between leveraging technology and maintaining creativity is crucial. Ironically enough I thought my writing could be improved so after I had a first draft of today's post I ran it through chatGPT and can confidently say my writing is better for having done so.\n\nI'll end tonights post with this, I witnessed history tonight. 800,000 blocks accomplished - quite an impressive feat for Bitcoin! Magic internet money is going to help make this world a better place. Block of Truth after block of Truth.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1683315649399980033%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n7/23/23\n\nConor Jay Chepenik",
  "wordCount": 366,
  "readingTime": 1.581132075471698,
  "claps": 0,
  "voters": 0
}