{
  "id": "4ea1bf0eb46c",
  "title": "Java Basics",
  "createdAt": "2023-08-03 20:44:33",
  "tags": [
    "java"
  ],
  "url": "https://chepenikconor.medium.com/java-basics-4ea1bf0eb46c",
  "content": "# Java Basics\n\n**What is Java?**\n\n- Java is a popular programming language and development platform that was first released by Sun Microsystems in 1995. It is used for developing desktop and mobile applications, big data processing, embedded systems, and so on.\n\n**What are some of the benefits of Java?**\n\n- Some key benefits of Java include:\n\n- Platform independent - Java code can run on any platform with a Java Virtual Machine (JVM).\n\n- Object oriented - Java supports object oriented programming features like classes, inheritance, polymorphism, etc.\n\n- Strong community - Java has a large community of developers who contribute libraries and tools.\n\n- Secure - Java runtime environment handles memory management and provides other security features.\n\n**What are objects and classes?**\n\n- Objects are instances of classes. Classes are templates that define attributes and behaviors that are common to all objects of that class.\n\n**What is the main method signature?**\n\n- The main method signature in Java is:\n\n```java\npublic static void main(String[] args){\n  //code goes in here\n}\n```\n\n**What is the difference between == and .equals()?**\n\n- == tests for reference equality (whether they are the same object). .equals() tests for value equality (whether they have the same value).\n\n**What are the primitive data types in Java?**\n\n- The primitive data types in Java are:\n\n- byte\n\n- short\n\n- int\n\n- long\n\n- float\n\n- double\n\n- boolean\n\n- char\n\n**What does 'Debugging' mean?**\n\n- Debugging is the process of identifying and removing errors (bugs) from a program. It involves stepping through code, inspecting variables, and using logging to understand the flow and find issues.\n\n**What is String?**\n\n- String is a class in Java that represents sequences of characters. Strings are immutable - once created, the value cannot be changed.\n\n**What is a Scanner?**\n\n- Scanner is a class in Java that allows reading input from various sources, like the console or files. It is commonly used to read user input.\n\n**What is the compilation process in Java?**\n\n- The compilation process in Java includes:\n\n- Editing the java code and storing in a file with .java extension.\n\n- The source code is compiled into bytecode by the javac compiler.\n\n- The JVM executes the bytecode.\n\n**Name a few operators in Java and what they do**\n\n- Some common Java operators:\n\n- Arithmetic operators like +, -, *, /\n\n- Assignment =\n\n- Logical operators like &&, ||\n\n- Relational operators like <, >, ==\n\n- Increment/decrement operators like ++, -\n\n**What does the following operation do? x += 5; What is another way to write express this statement?**\n\n- x += 5 is equivalent to x = x + 5. It increments the value of x by 5\n\n**What study habits do you find useful when learning new topics?**\n\n- Practice writing code regularly\n\n- Break problems down into smaller parts\n\n- Use online courses or tutorials\n\n- Participate in coding challenges\n\n- Work on personal projects to apply your skills\n\n- Explain concepts to others\n\n**What does \"full stack technology\" mean?**\n\n- Full stack technology refers to working with both the front-end and back-end portions of an application. It involves development skills for client-side (HTML, CSS, JavaScript) and server-side (databases, APIs, etc).\n\n**What is a flow control statement?**\n\n- Flow control statements control the order in which code is executed. Examples include if/else statements, loops, switch statements.\n\n**Describe an if-else statement**\n\n- An if-else statement executes code if a condition is true, and different code if the condition is false.\n\n```java\nif (condition) { \n// code to execute if condition is true \n  } else { \n// code to execute if condition is false\n}\n```\n\n**Describe a switch statement**\n\n- A switch statement allows execution of different blocks of code depending on a variable's value, instead of multiple if/else statements.\n\n```java\nswitch(variable) { \ncase value1: // code block 1 break; \ncase value2: // code block 2 break; \n//... default: // default code block \n}\n```\n\n**Describe a while-loop**\n\n- A while loop executes a block of code repeatedly as long as a condition remains true.\n\n```java\nwhile (condition) { \n// code to execute \n}\n```\n\n**Describe a do-while loop**\n\n- A do-while loop is similar but checks the condition after executing the code block, so it will always execute at least once.\n\n```java\ndo { \n// code to execute \n} while (condition);\n```\n\n**Describe a for-loop**\n\n- A for loop executes code a set number of times. It is useful when you need to iterate over something like an array.\n\n```java\nfor (initialization; condition; update) { \n// code to execute \n}\n```\n\n**What are the primitive data types in Java?(asked it TWICE because I NEED TO LEARN IT)**\n\n- byte\n\n- short\n\n- int\n\n- long\n\n- float\n\n- double\n\n- boolean\n\n- char",
  "wordCount": 747,
  "readingTime": 2.818867924528302,
  "claps": 0,
  "voters": 0
}