{
  "id": "4f1f1ea40faf",
  "title": "Day 309",
  "createdAt": "2023-01-26 03:52:41",
  "tags": [
    "football",
    "atlas-shrugged",
    "fiat",
    "education",
    "children"
  ],
  "url": "https://chepenikconor.medium.com/day-309-4f1f1ea40faf",
  "content": "# Day 309\n\nFinished up the article from yesterday. Bitcoin Magazine gave me some good feedback again but mentioned that this theme had been conveyed multiple times so they didn't want to pick it up. As a matter of fact here are the articles they listed with similar themes. They sent me 7 articles so it's fair to say Bitcoiners understand we are being stolen from hahahahaha.\n\n> [**Bitcoin Enables Sovereign Individuality, Our Digital Future's Holy Grail**](https://bitcoinmagazine.com/culture/bitcoin-creates-sovereign-individuals)\n\n> [**Bitcoin Unleashes The Sovereign Individual**](https://bitcoinmagazine.com/culture/bitcoin-unleashes-the-sovereign-individual)\n\n> [**As Ruling Class Plunder Becomes The Norm, Bitcoin Lets Individuals Stand Up**](https://bitcoinmagazine.com/culture/bitcoin-lets-us-stand-up-to-ruling-class-plunder)\n\n> [**Bitcoin Is the Technology of Dissent That Secures Individual Liberties**](https://bitcoinmagazine.com/culture/bitcoin-is-the-technology-of-dissent-that-secures-individual-liberties)\n\n> [**Governments Use Money To Control Us, Bitcoin Makes That Impossible**](https://bitcoinmagazine.com/culture/the-obscured-attribute-of-money)\n\n> [**Bitcoin Prevents Monetary Control, Whether Those In Control Like It Or Not**](https://bitcoinmagazine.com/culture/bitcoin-monetary-control-in-afghanistan-wall-street-journal)\n\n> [**Bitcoin Gives Users Total Control Of Their Money**](https://bitcoinmagazine.com/culture/bitcoin-gives-users-total-control-of-their-money)\n\nThat's okay there are plenty of other places to spread the good word of Bitcoin including this Medium. I do appreciate the kind words they provided. Feels better being rejected because of legitimate reasons rather than poor writing. Plus they give me a great idea for another article pertaining to football and massadoption.net which is the Bitcoin meetup I'm working on up here in Boston. So today I'd like to share the article I finished up, the thread I wrote about Andrew Jackson, the article I'm working on now per Bitcoin Magazine's recommendation, and potentially talk about my first road trip with my not even 3 week old daughter. Life is good 😎 🫡\n\nFirst the article I finished up from yesterday. I shared this one with bitcoinnews.com so maybe they'll pick it up. If not I'll just leave it here as a work in progress maybe come back to it another day.\n\n**When Plunder Becomes Mainstream (This Is A Working title open to suggestions 🤝)**\n\nIt is likely that if Ayn Rand were alive today, she would be a proponent of Bitcoin. Her philosophy of Objectivism, as outlined in her novel Atlas Shrugged, emphasizes the importance of the individual as the ultimate moral authority and the pursuit of one's own happiness as the ultimate goal. These principles align closely with the principles of capitalism and the limited role of government in regulating and controlling businesses. This is a central aspect of Bitcoin's peer-to-peer network, which operates without the need for permission or intermediaries. This allows market actors to trade freely and independently with one another, in line with the principles of individualism and free market capitalism.\n\nIndividualism, reason, rationality, and the limited role of government are all themes that are evident throughout Rand's novel, and they are also central to the concept of Bitcoin. The famous quote from Atlas Shrugged, \"The question isn't who is going to let me; it's who is going to stop me,\" encapsulates the spirit of Bitcoin perfectly. Satoshi Nakamoto, the pseudonym used by the creator of Bitcoin, did not protest or ask for permission. Instead, he released code that gave individuals a system that prioritizes their autonomy and control over their own financial decisions.\n\n![](https://miro.medium.com/0*pNKoYJJeDZrnqCc6)\n\nIt is possible that if Atlas Shrugged had been written after the creation of Bitcoin in 2009, the novel would have included the question \"Who Is Satoshi Nakamoto\" instead of the famous \"Who Is John Galt\" line. There is no doubt in my mind Rand would have seen the potential of Bitcoin to empower individuals and promote the principles of Objectivism in a world where centralized systems and government intervention often stifle innovation and progress. I don't believe central planners mean to hinder progress, but that is the natural outcome when unnecessary middle men get involved. Humans imitate other humans for a variety of reasons. One of the main reasons is[ social learning](https://www.simplypsychology.org/bandura.html), which is the process by which people acquire new information and behaviors through observation and imitation of others. This type of learning is thought to be important for the development of cultural norms and traditions, as well as for the acquisition of practical skills and knowledge. In today's society, we are seeing a trend where the actions of those in positions of power, whether in government or other industries, are increasingly focused on plundering rather than creating opportunities for growth and progress. Social media platforms are filled with examples of crime and violence in cities like New York, D.C, Los Angeles, and San Francisco, and government officials seem more focused on maintaining their own power rather than protecting the rights of citizens.\n\nBut why do people tend to imitate the actions of those in power, even when those actions are detrimental to society as a whole? Well this idea of social learning was reinforced by the discovery of [mirror neurons](https://www.apa.org/monitor/oct05/mirror#:~:text=They%20were%20first%20discovered%20in,primate%20grab%20the%20same%20object.). In the early 1990s when mirror neurons were discovered they provided new insights into how the brain processes social information and how humans are able to understand and empathize with the actions and emotions of others. These neurons, found in the premotor cortex and the inferior parietal lobule of the brain, respond to both the visual and auditory aspects of an action, as well as the goal of the action. They have been observed in a wide range of species, including humans, monkeys, and even birds. Mirror neurons play a critical role in the development of language and communication, as they allow individuals to understand and interpret the actions and intentions of others. They also play a role in social cognition, allowing individuals to empathize with others and understand their perspective. However, they can also lead to the spread of negative actions and behaviors throughout society, as people tend to imitate the actions of those in power.\n\nMax and Stacy recently discussed this idea on their [podcast](https://youtu.be/8jJkq1-YZ_A), Orange Pill. While the rest of the world is experiencing entropy, El Salvador is experiencing a resurgence. Bitcoin seems to be playing a huge role in this advancement. The country, which was once plagued by poverty and crime, is now focused on building infrastructure, creating opportunities through education and jobs, and attracting Bitcoin enthusiasts from around the world. I believe that the reason for this change can be attributed to the leadership of the President and the people of El Salvador who are following his lead. The citizens of El Salvador can sleep well at night knowing their bitcoin can not be debased by anyone. There is a lot of research to backup the idea that humans tend to imitate the actions of others, particularly those in positions of authority. In contrast, the United States is facing a different challenge, where the government is not taking any steps to address the increasing debt ceiling and instead resorting to plundering. While a disappointing one, this should not be a surprising outcome to a fiat currency essentially backed by debt and violence. We have reached a point where our elected leaders aren't even attempting to hide their crimes. One of the solutions to a ~31.4 trillion dollar budget deficit is [unlimited borrowing](https://www.foxnews.com/politics/democrats-push-eliminate-debt-ceiling-allow-unlimited-government-borrowing). If we want society to progress, unlimited borrowing is not the answer. If Uncle Sam can't practice fiscal responsibility it is unlikely the average person will either. This is a concerning trend, and it is important to note that the actions of those in positions of authority can have a ripple effect on society as a whole. It is crucial for leaders in government, Wall-street, Hollywood, and Silicon Valley to lead by example and practice fiscal responsibility to avoid negative consequences on society. If the leaders of these industries engage in plundering, it will ultimately spread throughout all levels of society.\n\nI'll share a personal story to emphasize my point. My relative, who works in politics, had a friend who was elected to Congress. They observed that this individual, who was previously seen as kind, underwent a significant change after being elected. This observation, while anecdotal, raises the question of how a political environment can foster a culture of manipulation and deceit, leading to the acquisition of unethical skills. This phenomenon is not limited to politics, as it can also be seen in the business world, as evidenced by the number of [white collar criminals on the Forbes 30 Under 30 list](https://twitter.com/Stonks_dot_com/status/1597669014246785024?s=20&t=THbiqU4R_x1yAIm_uCBhGA). However, being around individuals who prioritize building and providing value, as in the Bitcoin community, can lead to becoming a successful entrepreneur and a better person, despite the challenges and lack of instant gratification.\n\nThis is why Bitcoin is so important. More central planning is not going to fix the problems caused by central planning. In Atlas Shrugged it literally took all the productive individuals moving to Galt's Gulch to bring down the unproductive class. We're fortunate that today you don't have to move to the middle of nowhere in Colorado to withdraw your life force from the economy. Bitcoin, as a decentralized and digital currency in cyberspace, allows individuals to take back control of their own financial decisions, without the need for intermediaries or government intervention. It promotes the principles of individualism, reason and rationality, and the limited role of government, as espoused in Atlas Shrugged. By focusing on Bitcoin and decentralized systems, individuals can take a stand against the plundering actions of those in power and work towards a society that values growth, progress, and opportunities for all. It is time for individuals to start stepping on the rungs of opportunity and climb the ladder of success on their own terms.\n\n![](https://miro.medium.com/0*QHwYbM1NwDdBJJg6)\n\n![](https://miro.medium.com/0*Iut79LnaQXNGxRfM)\n\n![](https://miro.medium.com/0*8sq61jgqqJw9dDVo)\n\n(More AI generated images for the editor to choose from all created with nightcafe.studio)\n\nI wrote this Twitter thread today with chatGPT. A lot of it is edited of course but it's amazing how powerful of a tool chatGPT is for getting inspiration. I prompted with write me a 5 paragraph essay about why Jackson fought Central Bankers.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1618426720830521349%3Fs%3D20%26t%3DDaRJ5Ms0xBzWF6dwB0pwDg&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI showed it to my partner's Brother and he was enamored with it. Kind of like my Father who also quickly became obsessed with chatGPT. It truly is amazing and the fact it's only going to get exponentially better means humanity has a lot to gain from this stuff. I saw a headline about Google lobbying to ban AI due to the dangers it poses (to Google's search business). I didn't even read the article nevertheless remember where I found it so I could link it here. So take what I say about this topic with a grain of salt. I just hope progress isn't hindered by bureaucratic bullshit. That would be a shame. It does seem like the cat is out of the bag though and luckily the law moves slowly so I'm not sure they could put this thing back in \"the bag\". Plus if Microsoft does make the 10+ Billion dollar investment into openAI that I heard that I heard they were considering then it seems like Microsoft will also be lobbying for the allowance of AI which would result in a potential stallmate. Lol politics, not much seems to get done but rentseekers make a bag. Oh I'd be remiss to mention that it's pretty hilarious the name of Josh Hawley's new bill is the Pelosi Act. I do agree with the idea of the bill.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/HawleyMO/status/1617936042752868362%3Fs%3D20%26t%3D5uUc_hJuLGNuGU0Jje-5Rw&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAnyways, I'll start to wrap up today with posting a *VERY ROUGH DRAFT* of what I'm thinking about for the article on football and bitcoin meetups. Again this is more of an outline than an actual finished piece but we going to crisp it up here real good. Just made that up as a new way to describe improving your writing. Man English is amazing.\n\nBeing a part of a team is a special thing, as it allows individuals to come together and work towards a common goal. Similarly, Bitcoin is a worldwide team that brings together individuals from all over the world to work towards a decentralized financial system. Just like a football team, there are different levels of players within the Bitcoin community. On a varsity football team, the players have put in the time and effort to become skilled and experienced, ready to compete at the highest level. Similarly, Bitcoiners, or those who are fully committed to the Bitcoin philosophy and its decentralized nature, have put in the time and effort to truly understand and embrace the technology.\n\nOn the other hand, there are junior varsity (JV) football players who are still developing their skills and may not yet be ready for the varsity level. Similarly, there are those in the crypto community who hold both Bitcoin and alt-coins, or as the toxic maximalists who I enjoy following on Twitter call them \"shitcoiners.\" These individuals may not have fully committed to the Bitcoin philosophy and may not fully understand the technology and its potential. Just as JV players need to continue to develop their skills and knowledge to be ready for the varsity level, alt-coiners need to do more work to fully embrace the Bitcoin maximalism and its decentralized nature.\n\nFret not if you are reading this and hold alt-coins. I did too for a long time. As a matter of fact I still have some wrapped ether than I can't unwrap and sell for sats because the gas fee is to expensive. That ether is a battle wound I wear with pride. Reminds me of how at the end of the football season I'd look at my helmet and have a deep sense of pride about all the scratches and dings on my helmet.\n\n*Note to self go through your camera roll and look for one of these photos*\n\nWhen you are playing a team sport it is fair to say that a team is only as strong as its weakest player. However, in the crypto community that might be a bit of stretch to say considering this space attracts both the best and brightest as well as the most despicable delinquents. If Bitcoin is going to break away from crypto we need to come together as a team and help our most under-educated members realize the truth in this photo.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/GetBittr/status/1593573892060332032%3Fs%3D20%26t%3DScB821zwfrSHSQsd7lRHrQ&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt's important for everyone to strive to become a part of the varsity team, or in this case, fully committed Bitcoiners, in order to truly see the potential of this revolutionary technology. Unlike traditional sports teams which typically have a limited number of members, the Bitcoin community is global and inclusive. To truly understand and appreciate the benefits of this technology, it is important to approach it from a grassroots level and educate individuals on its potential rather than imposing it from the top down. Being a part of the Bitcoin community is full of challenges and adversity. That's why it's where some of the strongest friendships and bonds are forged. Despite the fluctuations in the value of Bitcoin, the connections and relationships formed within the community will always be valuable. Bitcoiners are more invested in the growth and success of their community members, than in the success of the technology itself. Which is not to say they aren't invested in making sure the technology succeeds. Bitcoin just helps you realize that the most important things in life don't necessarily come from having a certain amount of wealth. They come from having meaningful relationships.\n\nThese metaphors I've listed above are far from perfect but the idea holds true. When bitcoin is in it's dead phase you don't see as many \"JV players\" coming to celebrate with the true Bitcoiners. At least not until the next bull market. This is why the bear market is such a good time for Bitcoiner friendships to be formed. It's a time for those who have put in the work to focus, put their head down and build, write, podcast, and host Bitcoin meetups. I was fortunate enough to attend a Bitcoin dinner for [Mass Adoption](http://massadoption.net) and at that dinner everyone went around the table talking about their experience with Bitcoin. When it was my [turn](https://youtu.be/AJrFNsNElUA?t=1719) to present I talked about how after 11 years of football I felt a hole in my heart when I hung up the cleats. I had no idea what I was going to do to fill that hole until I found Bitcoin. Going to meetups in my area and meeting like minded individuals was cathartic. I've made a whole new set of friends who I know are willing to go to battle with me. The same feeling I had about my teammates after a brutal training camp heading into the regular season is the feeling I have with the friends I've made at Mass Adoption. It's hard to put into words but if I were to give it a shot I'd say it's a feeling that I wouldn't want anyone else by my side if I was going into fight a war.\n\nIn that same round table discussion someone brought up an amazing Odell quote that goes \"I'm bullish on Bitcoin but more bullish on Bitcoiners\". I can't think of a better way to frame it. No matter the outcome of bitcoin nothing will take away the friendships and bonds I've made because of this random software that has turned out to be the best money humanity has ever had. It's kind of hilarious to think about how one white paper has had such profound changes on the individuals who interact with this new form of money. Some would call Bitcoin a mind virus because those who go down the rabbit hole can't stop talking about. I'd argue Bitcoin is the antidote to the problems of fiat currency. Those on team Bitcoin start taking more self-sovereignty, save more, create value, and work towards a better future. I've been on a lot of teams throughout my life and I'm grateful I found team bitcoin to help make sure I don't give into the nihilism team fiat is poisoning the world with.\n\nOf course, the transition is far from over and the mainstream media often paints Bitcoin as either dead or a bubble, but true Bitcoiners know that there is more to this technology than that. They understand the potential for true decentralization and the benefits it brings. In a bull market, many new participants join the community, and the true Bitcoiners know that many of these \"JV players\" are not yet ready to fully understand and embrace the true potential of Bitcoin. We must remember to remain patient, to teach those who have sinned with their shitcoins, and teach them about the bright orange ethical abudnant miraculous future that is possible. Bitcoin is not just a new form of money, it's a community of individuals who strive for self-sovereignty, savings, and a better future. It's a team worth being a part of.\n\nMan. Worked on that a lot longer than I had anticipated but I felt like I made some progess.\n\nAnyways, final thing I'll say on today's post is I took my daughter on her first road trip and she did so well in the car. She slept pretty much the whole ride except for the one stop where we woke her up for a diaper change and a meal. Which for her is breastfeeding. Still amazes me babys need only their mother's milk. Amazing stuff.\n\nLove you anon. Thanks for reading. Hope your day is filled with peace, love, happiness and all the other good adjectives out there. Our time is finite on this planet so use it wisely.\n\n1/25/23\n\nConor Jay Chepenik",
  "wordCount": 3359,
  "readingTime": 13.375471698113207,
  "claps": 0,
  "voters": 0
}