{
  "id": "5029b389f62e",
  "title": "Day 162",
  "createdAt": "2022-09-01 00:27:34",
  "tags": [
    "goals",
    "thoughts",
    "science",
    "rhetoric",
    "proactive"
  ],
  "url": "https://chepenikconor.medium.com/day-162-5029b389f62e",
  "content": "# Day 162\n\nSpoke with my Dad yesterday and he said I should give it a week. So I'm going to give it a week. Ug I'm so torn on what to do. However, I'm pretty lucky to be in the position I'm in. I got options and I know I'll make the right choice.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=http%3A//twitter.com/asiiceofhistory/status/1564803831556280325&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nSaw this clip on Twitter and I'm blown away. These people had some crazy inventions. Pretty cool to see the technology they had with video quality that primitive. It also shows how much B.S we've had via government because society should be much farther along than it is at this point.\n\nExcited to have [Macrojack](https://twitter.com/macrojack21) on my podcast September 13th. Some goals I'd like to achieve regardless of if I quit my job soon or not. Grow my podcast to the size of the J.R.E one day. Learn to code and make myself a website. Continue to be the boyfriend (husband soon) I'd like to be. Raise an amazing daughter. Learn how to market my podcast better.\n\nI'm seriously concerned about some of the rhetoric coming out of the white house recently. They want to use the power of the government against those who do not get in line with their crazy agendas. This video of the Press Secretary acting like they are the ones defending democracy is crazy.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jessekellydc/status/1565056081969270784&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAnyways, that is all from me today. Lot to decipher and figure out in my own life. That said, I'm tired of being reactive. Time to be proactive with my life and start figuring my shit out.\n\n8/31/22\n\nConor Jay Chepenik",
  "wordCount": 264,
  "readingTime": 0.9962264150943396,
  "claps": 0,
  "voters": 0
}