{
  "id": "5253ffa92c2a",
  "title": "Day 161",
  "createdAt": "2022-08-30 19:14:03",
  "tags": [
    "life",
    "work",
    "meaning",
    "grinding",
    "decisions"
  ],
  "url": "https://chepenikconor.medium.com/day-161-5253ffa92c2a",
  "content": "# Day 161\n\n![Photo by Anastasiya Vragova: [https://www.pexels.com/photo/serious-young-man-sitting-in-black-studio-and-looking-away-thoughtfully-6770412/](https://www.pexels.com/photo/serious-young-man-sitting-in-black-studio-and-looking-away-thoughtfully-6770412/)](https://miro.medium.com/0*QBwI9X7EKHjTHt3Z)\n\nSomething just feels off as I return to work. I just feel this sense of dread like what I'm doing is wrong. I'm going to talk with my girlfriend tonight before making any rash decisions, but I am legitimately on the verge of quitting. It just doesn't feel good working in sales. My heart is not in it and I don't like cold calling strangers to try and sell them a piece of software. I know I need to make money and be a productive member of society. I'm just not sure that working in tech sales is the way I do that. So many opportunities out there and it feels so draining working in sales. I know myself pretty well and I've been trying to push through for the 3 months P.T.O when my kid arrives, but I'm not sure I can make that. I don't know. My company has some great benefits, kind people, and it's honestly a solid product. I just feel wrong spending my time trying to sell for the company. It's a weird feeling. End of rant.\n\n[Zerohedge](https://twitter.com/zerohedge) published my Bitcoin Magazine article. Feels good that both of the articles I've written got picked up by a pretty large media organization. It makes me feel like I can make a living making content. I'm very happy to do it altruistically because I believe in what I've written about Bitcoin. It truly seems to me that it can bring peace and prosperity to the world. Things I would like in order to see humanity thrive and prosper. This mission seems more important than ever as world leaders in the west claim \"We are going to see the end of abundance\". Screw that, we should be trying to help people thrive, not make them freeze to death in the winter for some ESG agenda set up by Blackrock and the W.E.F. As I type this out I feel like part of what is making me want to leave a cushy gig is the fact I see this crap going on and I'd like to do my part to push back.\n\nI'm looking forward to having a candid conversation with my girlfriend tonight. There are many variables and it's important that I can provide for my family. It's also important I don't waste my time here on earth writing sales emails and calling strangers. Well unless I got a damn good reason for wanting to call said stranger. Life passes by fast. Part of me is scared as shit to take this leap and another part of me yearns for the freedom. I feel like I'm at a crossroad. I remember when I woke up on the day of my appendicitis. It was excruciating pain. Genuinely felt horrible. I knew something was off the second I woke up.\n\nThat's sort of how I feel after returning to work after my long weekend. Like my heart is telling me I'm not doing the right thing with my time. It's a weird feeling man. I'm not afraid to work hard, but I am afraid to watch my life pass me by working hard for minimal upside. Will see. 3 months P.T.O is sweet and there are benefits to my company. Lot to process but I do feel better taking the time to write about it. If life was supposed to be easy then spoiled children would not be so bad. Life seems to be about embracing the struggling and enjoying the fruits of your labor.\n\n8/30/22\n\nConor Jay Chepenik",
  "wordCount": 591,
  "readingTime": 2.4301886792452834,
  "claps": 0,
  "voters": 0
}