{
  "id": "53d9bc67fb81",
  "title": "Day 607",
  "createdAt": "2023-11-20 00:10:04",
  "tags": [
    "cpi",
    "hedonic-pricing-models",
    "central-planning",
    "free-markets",
    "argentina-election"
  ],
  "url": "https://chepenikconor.medium.com/day-607-53d9bc67fb81",
  "content": "# Day 607\n\nDid you know they adjust CPI and claim it is deflationary when a product becomes better? I did not but I learned about this phenomenon via a video released from the Minnesota Fed.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/MinneapolisFed/status/1567912053645676546%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe concept the video above is referring to is known as \"hedonic quality adjustment\" in the context of calculating the Consumer Price Index (CPI). This approach is used by statistical agencies, including the Federal Reserve and the Bureau of Labor Statistics in the United States, to account for changes in the quality of products over time. Sadly, I don't think they add inflation to goods or services that shrink or use worse products.\n\nI would argue that the Consumer Price Index (CPI), particularly through its use of hedonic quality adjustments, is a fundamentally flawed and misleading metric for gauging inflation. The practice of hedonic adjustments, while intended to account for changes in product quality, fails to provide an accurate representation of inflation and the real cost of living.\n\nFirstly, the concept of hedonic adjustments is inherently flawed because it assumes that all quality improvements have a direct and equivalent value to all consumers. This is a gross oversimplification. When a product becomes more expensive due to added features or perceived quality improvements, these adjustments distort the CPI by suggesting that the consumer is receiving proportionately more value. However, this is often not the case. The value of these enhancements is subjective and varies greatly among consumers. Some may not need or value the additional features, yet they are still forced to bear the higher costs. Therefore, hedonic adjustments can mask the true burden of price increases on consumers, particularly affecting those on fixed incomes or those who do not benefit from the supposed improvements.\n\nMoreover, the lack of symmetry in the CPI's treatment of quality changes further exacerbates its unreliability. While there is a method to account for improvements in quality (albeit a flawed one), there is no equivalent, systematic approach for accounting for decreases in quality. Products that deteriorate in quality, use cheaper materials, or reduce functionality are not adequately reflected in the CPI. This omission leads to a one-sided and overly optimistic portrayal of inflation and living costs. The market may indirectly account for these reductions in quality through decreased demand and subsequent price adjustments, but this is a far cry from the formal/systematic approach used in hedonic adjustments for quality improvements.\n\nFurthermore, relying on hedonic adjustments ignores the fundamental role of market dynamics in determining value and price. The market, through the collective decisions of consumers, naturally adjusts prices based on perceived value, quality, and utility. By intervening with subjective and arbitrary adjustments, the CPI distorts this natural market mechanism. It fails to capture the real-world complexities of how consumers value and respond to changes in product quality and prices.\n\nThe use of hedonic quality adjustments in calculating the CPI is deeply flawed. It fails to accurately reflect the real burden of inflation on consumers, particularly due to its one-sided focus on quality improvements and the subjective nature of these adjustments. A more effective approach would be to eliminate the need for such measures altogether. This can be achieved by halting the excessive printing of money by central banks, thereby allowing deflation to naturally occur. This would enable prices of goods and services to decrease to their marginal cost of production, reflecting true market values without artificial inflation.\n\nIn such a scenario, the CPI would become redundant. People's money would increase in purchasing power over time, simplifying financial planning by differentiating clearly between savings and investments. Savings would no longer need to be risked in investments merely to keep pace with inflation. Instead, they would retain, or even increase, their value over time, fostering a more stable and predictable economic environment.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1726380417077428587%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLuckily, people are waking up the ridiculousness of centrally planning something as complex as the economy. It is encouraging to see Argentina elect a Bitcoiner who does not believe in printing money or centrally planning the free market. VIVA LA LIBERTAD CARAJO\n\n11/19/23\n\nConor Jay Chepenik",
  "wordCount": 678,
  "readingTime": 2.5584905660377357,
  "claps": 0,
  "voters": 0
}