{
  "id": "548cf9d86c0c",
  "title": "Day 587",
  "createdAt": "2023-10-31 03:00:43",
  "tags": [
    "compute",
    "ai",
    "computer-science",
    "executive-order",
    "anarchism"
  ],
  "url": "https://chepenikconor.medium.com/day-587-548cf9d86c0c",
  "content": "# Day 587\n\nSo today, October 30, 2023, President Joe Biden, signed an Executive Order on Artificial Intelligence (AI) on which manifests a comprehensive approach to ensure the safe, secure, and trustworthy development and deployment of AI in the United States. Here's a breakdown of the key directives from the Executive Order:\n\nNaturally I did not want to read the whole report which can be [found here](https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/30/fact-sheet-president-biden-issues-executive-order-on-safe-secure-and-trustworthy-artificial-intelligence/) so I asked chatGPT to draft the TL;DR.\n\nHere is what it returned:\n\nNew Standards for AI Safety and Security:\n\n- Developers of high-power AI systems are required to share safety test results and other critical information with the U.S. government, especially for AI models that pose serious risks to national security, economy, or public health and safety.\n\n- Standards, tools, and tests are to be developed to ensure the safety, security, and trustworthiness of AI systems, with rigorous standards for red-team testing set by the National Institute of Standards and Technology.\n\n- Measures are put in place to protect against the risks of using AI in engineering dangerous biological materials and to guard Americans from AI-enabled fraud and deception​.\n\nProtecting Americans' Privacy:\n\n- The order emphasizes the acceleration in the development and utilization of privacy-preserving techniques, and strengthening privacy-preserving research and technologies.\n\n- It also calls on Congress to pass bipartisan data privacy legislation to better protect Americans' privacy, especially children, from the risks posed by AI​.\n\nGlobal Leadership and Addressing Various Concerns:\n\n- The order is wide-ranging, addressing nearly every concern about the rapidly advancing technology, such as consumer protections and federal oversight, to ensure that the U.S. maintains a leadership position in the AI domain​.\n\nIndustry Involvement:\n\n- The industry is mandated to develop safety and security standards, thereby playing a crucial role in the responsible development of AI, showing the administration's intent to work closely with private sector stakeholders​.\n\nBroader Implications:\n\n- The order reflects a broader initiative to harness the potentials while managing the risks of AI, aiming to promote innovation, competition, and ensure that AI advances equity, civil rights, and operates in a manner safe for the public​.\n\nThis morning, I had the enlightening experience of reading a chapter of Tolstoy featured in [Micheal Malice's Anarchist Handbook](https://www.amazon.com/Anarchist-Handbook-Michael-Malice/dp/B095DVF8FJ). The excerpt from Tolstoy lays bare a profound skepticism towards governmental power and actions, urging the individual's responsibility to abstain from engaging in governmental activities perceived as violent or unjust. When this perspective is juxtaposed with the Executive Order on AI by the Biden Administration, it suggests that while the order might sound promising to the trusting citizen, its endeavor to regulate AI and ensure safety, security, and privacy is doomed to fail miserably. Due to the inherent nature of governmental actions and systems, their stated objectives often end up breeding the opposite result. For example, the Patriot Act and Inflation Reduction Act ironically led to outcomes contrary to what their names suggest they were meant to achieve.\n\nTolstoy's excerpt paints the government as an entity that perpetuates a cycle of violence and control, often failing to fulfill its promises of protection or justice. Power, when under the purview of the state, often gravitates towards the hands of the less conscientious and less moral, raising the stakes of mismanagement. In the realm of AI regulation, there's an ominous risk that the regulatory power could be seized or influenced by individuals or groups with vested interests, thereby potentially compromising the effectiveness and fairness of the regulations imposed.\n\nTolstoy champions the ethos of self-sufficiency, encouraging individuals to eschew reliance on governmental structures. In stark contrast, the Executive Order places a significant emphasis on governmental oversight and industry's compliance with governmental standards, which could be seen as fostering dependency rather than encouraging self-regulation and individual responsibility within the AI industry.\n\nApplying Tolstoy's viewpoint to the modern day I believe he is spot on with his framework of the state. The idea of over-reliance on governmental oversight to regulate AI is bound to stifle innovation and freedom, leading to over-regulation that will hinder the progress and beneficial applications of AI.\n\nThe Executive Order, while intending to protect public interest, falls short of mentioning how the public can actively participate in shaping AI policies. Tolstoy's emphasis on individual action and non-participation in government underscores a need for more grassroots involvement in AI governance, akin to the open source movement already underway.\n\nApplying the Tolstoyan lens, I firmly believe that real change in AI governance might come from a collective shift in individual actions and a move towards more decentralized, community-driven oversight rather than solely relying on top-down governmental regulations. The narrative underscores a glaring need to steer clear of governmental shackles to truly harness the potential of AI in an ethical and responsible manner.\n\nIf you thought the war on drugs and the DEA was bad just wait for the CEA. (Compute Enforce Agency). I say this half-jokingly, but Orwell was right that totalitarian states can deceptively portray oppression as liberation (War Is Peace). There are deep flaws with the state holding a monopoly on violence, and I will continue criticizing such systems until sovereign individuals abolish these coercive institutions once and for all.\n\n![](https://miro.medium.com/0*9c0mdMjYvDDc1scE.png)\n\n10/30/23\n\nConor Jay Chepenik",
  "wordCount": 868,
  "readingTime": 3.475471698113208,
  "claps": 0,
  "voters": 0
}