{
  "id": "55883683ed3f",
  "title": "Day 350",
  "createdAt": "2023-03-08 04:03:08",
  "tags": [
    "feels"
  ],
  "url": "https://chepenikconor.medium.com/day-350-55883683ed3f",
  "content": "# Day 350\n\nThis video got me in my feels today. Maybe it's just because I'm a new parent but bravo to whoever this Lauren woman is.\n\n> [**Lauren Weber Attachment/Sleep on Instagram: \"Posted @withrepost * @jessurlichs_writer Now a sound...**](https://www.instagram.com/reel/ClHDbGxgKrQ/?igshid=MDJmNzVkMjY=)\n\nOn another note I've been using both Stacker News and Nostr a lot more. Getting some value for what I write online feels so good. I made this post today and an arguement blew up between two anons online. Hahahahahahha nothing cracks me up like two people arguing on the internet, especially when they are anon.\n\n> [**Bukele makes an excellent point about US hypocrisy. Anyone got legit rebuttals? \\ stacker news**](https://stacker.news/items/149062/r/Chep)\n\nAt least this post helped me stack some sats and I did chyme in with my opinion as respectfully as possible. Stacker news is also great for finding signal. Came across these tweets because of Stacker News today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/LynAldenContact/status/1633178178230312963%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI also just got an email from Marty's bent because I'm a fan of TFTC and I think it's fitting to put below because Marty mentions that he interviewed Lynn this morning. Sometimes everything just feels connected. Y'know?\n\n> [**Issue #1328: The Fed is in an impossible position**](https://tftc.io/martys-bent/issue-1328/)\n\nAnyways, worth reading through those things in my humble opinion. I've got no clue what the future holds but boy oh boy are things going to change. Hopefully for the better. That's why I'm spending more time on platforms that pay me sats if I contribute something positive. One of the points made in those two pieces of content above is that the Fed will likely become more political. In the sense it will be controlled politically even though it's supposed to be a non-political organization. The solution to a problem caused by central planning will be to hand the central planning over to the government. Lmao. Not financial advice, but I'd look to store your wealth in something besides the US dollar. Gold seems to hold value well over time but it doesn't have the a-symmetry of my favorite digital asset!\n\nDo your own research though. As we say in Bitcoin DON'T TRUST GO VERIFY!\n\nMight as well finish this Medium by doing some philosophical writing about the Spirit Of America print magazine I'm trying to get going. So here goes nothing.\n\nThe nickname \"Spirit of America\" is often associated with the state of Massachusetts due to its significant role in American history and culture. The state played a crucial role in the American Revolution and the formation of the United States, including being the site of events such as the Boston Tea Party and the Battle of Bunker Hill. A lot of history has taken place in Massachusetts. Without Mass I don't think America would be a free country. Fast ~250 years after 1776 and now we don't seem to be as free. The second paragraph of the Declaration of Independence famously states, \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. - That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, - That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness.\"\n\nGot a lot more to go with this. Something to think about though. Mass can lead the way.\n\n3/7/23\n\nConor Jay Chepenik",
  "wordCount": 659,
  "readingTime": 2.486792452830189,
  "claps": 0,
  "voters": 0
}