{
  "id": "59bcac3f723f",
  "title": "Day 118",
  "createdAt": "2022-07-18 18:54:06",
  "tags": [
    "homeschooling",
    "bitcoin",
    "weak-men",
    "hard-times",
    "strong-men"
  ],
  "url": "https://chepenikconor.medium.com/day-118-59bcac3f723f",
  "content": "# Day 118\n\nDrove back from VT to MA today and listened to an incredible Podcast.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F6hW6ECJBOzDsejCi2JZMCA%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F6hW6ECJBOzDsejCi2JZMCA&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1ff73d79aae092d289412ed93e&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nCan not recommend this hour and ten minutes of conversation enough. This podcast is an important reminder that we don't need to ask for permission to do great stuff. The school system wants you to be obedient, raise your hand, and conform to their ideals. Screw that. Keynesian economics is taught out of the school system and so far Keynesian economics has given us constant wars. Just one example but you get the idea anon.\n\nNot saying to go out and just be a disrespectful human who doesn't listen to authority. What I'm saying is we have the world at our fingertips and most of us are too busy seeking others' approval before getting started. I literally felt my \"progamming\" be unwound as I listened to this podcast. I'm glad I got to listen with my girlfriend. I'm going to do everything in my power to let her homeschool our child and be a stay at home Mom. A gig that is much harder, and much more gratifying, than any corporate position. Work is hard but the fact most adults are sacrificing so much of their time to chase dollars our government can just make out of thin air is honestly wild. Raising a family, helping others, providing value, and exchanging knowledge via meaningful conversations is a lot more rewarding than life in a corporation. Understandably there are a lot more dollars to be earned in the latter, but true wealth isn't a number in your checking account (or your bitcoin wallet).\n\nWhat's so ironic about Bitcoin to me is that going down the rabbit hole is what helped me understand that no amount of money or wealth will provide me with true riches. Meaningful relationships are the key to a happy life. Obviously, money can make your life a lot more convenient but going through pain and struggle is one of the best ways to truly be happy. Took me a long time to realize this but Bitcoin played a large role in me seeing this. I do think I will have a fleeting moment of joy if I can ever get up to 1 bitcoin (100 million satoshis) but at the end of the day, this moment of joy will not provide me a life of meaning.\n\nEnded up having a long conversation with the Keeper of the Inn my girlfriend and I stayed at yesterday and it was a powerful one. I did some orange pilling and the Keeper filled me in on his life. He is a first-generation American and his father moved over from Italy after Mussolini nationalized various industries and his Dad lost everything. His Father took great pride in the U.S and was so happy to be somewhere that respected private property. Now the Father is shaking his head at the B.S going on in America and how many in my own generation don't understand what it means to work hard. I don't mean to shit on my generation. The podcast posted above helped remind me of the challenges we face, especially in regard to our schooling system. It is just the fact that our values as a country are so important and many are more worried about not offending others. It's sad and while I don't want to see hard times it seems they are on the horizon. Luckily, hard times create strong men and I think Bitcoin will play a crucial role in helping my generation wake up. Also homeschooling. I will sacrifice what I need to sacrifice so my child can be raised and taught by its own blood rather than in a marxist school that puts more value in bullshit standardized tests than it does in real-world skills.\n\nI'm excited for what the future holds and grateful to be living a life that lets me listen to amazing conversations via technology and have them in person because I'm willing to listen to others' opinions. I hope that I always remain open-minded and don't get set in my ways the older I get. This medium should help remind me why it's important to not get so one-sided in my opinions. (unless it money because the best money always wins out, but this is also kind of a joke because to some degree fiat currencies can be useful and will likely still be somewhat around for my lifetime) The U.S constitution is a beautiful thing and I hope to preserve it by fixing the money, raising a kid who thinks critically, and by just doing rather than asking for permission. Grateful to be alive and in the United States. Grateful to play my part and get this country back on the right track😎 !\n\n7/18/22\n\nConor Jay Chepenik",
  "wordCount": 805,
  "readingTime": 3.0377358490566038,
  "claps": 0,
  "voters": 0
}