{
  "id": "5be1c6a1ab98",
  "title": "Day 199",
  "createdAt": "2022-10-07 19:05:50",
  "tags": [
    "kanye",
    "tucker",
    "interview"
  ],
  "url": "https://chepenikconor.medium.com/day-199-5be1c6a1ab98",
  "content": "# Day 199\n\nWOW. This Ye interview with Tucker is pretty incredible. The first thing that comes to mind after watching this is how \"bad actors\" will use fear to influence others. We just saw a two year fear fest to keep people locked up, shut down economies, and print trillions but that is besides the point. Let me link the interview which I can't recommend enough before continuing on with this post.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FYTCJHxv4jMA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DYTCJHxv4jMA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FYTCJHxv4jMA%2Fhqdefault.jpg&key=d04bfffea46d4aeda930ec88cc64b87c&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nYou don't see stuff like this often. I don't think Kanye is crazy at all. Everything he said makes sense. Crazy to see what finding God can do to someone who used to sing about getting bleach on his t-shirt from having intercourse with a model who just bleached her arse. That song was fantastic by the way I'm just saying he has come a long way from just being a talented rapper.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FwuO4_P_8p-Q%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DwuO4_P_8p-Q&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FwuO4_P_8p-Q%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"640\"></iframe>\n\nI haven't confirmed these facts but Kanye also mentioned that over 50% of black deaths in NYC are from abortion. More black children are being aborted than had. I've always believed in the libertarian mindset of live and let be. In other words I've always been pro-choice but resided in the Bill Burr camp of do what you want but abortion is still killing babies which is wrong. When my girl and I first found out there was the option of aborting our own child and I told her no. I promised I would do everything in my power to make sure that baby was provided for. It was not even an option in my mind once I found out. My girlfriend handled it like a champ and didn't question me at all. This gave me a new found respect for her. All this to say though that it seems abortion is very prevalent in our society. That fact Ye dropped made me deeply sad. 50% of people taking the easy route rather than having the kid is so disheartening to hear. I understand there are crazy circumstances of rape, incest, and a bunch of other messed up situations I don't even want to speculate on; I also do believe in people's right to choose. I just wish places would push for other options like adoption before going the abortion route. There is no right answer but I do agree with Ye that is an absolute tragedy so many people are opting for the abortion.\n\nLife is special. I'm not a woman so I can't relate to what it's like having a child. I can say as a soon to be father my heart melts feeling my baby kick around in my girlfriend's stomach. I can only imagine how I will feel when I get to meet my daughter in person but I'm starting to get a taste of what all the parents who say, \"You can't know what it's like to be a parent until you're a parent\" mean.\n\nI also appreciated Ye calling out the \"handlers\" who tell Kim what to think or say. It's pretty wild there are people whose job is to influence the influencers. As Ye put it they don't tell her what to say but rather what to fear. When people are scared their critical thinking shuts down. Watching this interview made me regret ever trusting anything the media said about Kanye. The dude has had some wild takes on social media, but shit I've tweeted out and put up some egregious stuff on my social media too. Luckily, I'm not incredibly famous so no on goes through my stuff with a razor tooth comb looking for critiques. In a world where it is becoming increasingly hostile to speak your mind (unless you're an NPC parroting the M.S.M talking point) Kanye is a breath of fresh air.\n\nI also have to say Tucker is pretty skilled at his job. I never watch Fox or CNN because I think both are deeply biased. However, I do enjoy the clips of Tucker I see on social media. So I guess I occasionally watch Fox clips. I've also seen CNN clips on social media but almost every CNN clip I see I just want to go bang my head against a wall so I try and avoid those clips.\n\nOur world is changing. It's cool because I watched this video of Kanye going to a jail to perform and got goosebumps.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FDp78WR467xs%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DDp78WR467xs&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FDp78WR467xs%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIt also kind of sucks because for a long time I wrote Kanye off as bi-polar/insane/loosing-it simply because I trusted the media. There is a lot of bullshit noise on the airwaves but I thought this interview was a truth breath of fresh air. Good for Kanye for finding God. I've been talking about it for awhile but I really need to sit down and read the bible so I can interpret it for myself. No more taking someone's interpretation. I need to do the proof of work to strengthen my relationship with God. Amen.\n\n10/7/22\n\nConor Jay Chepenik",
  "wordCount": 832,
  "readingTime": 3.139622641509434,
  "claps": 0,
  "voters": 0
}