{
  "id": "5e31b167c08e",
  "title": "Day 297",
  "createdAt": "2023-01-14 02:55:16",
  "tags": [
    "dad-blogger",
    "substack"
  ],
  "url": "https://chepenikconor.medium.com/day-297-5e31b167c08e",
  "content": "# Day 297\n\nHere is a rough draft for Dad Blog #1 I will be posting on binmucker.com tomorrow.\n\nLast night, my girl ate some curry and Sloan wouldn't stop crying. It was a grind trying to put Sloan to sleep, but when we finally did I slept like a rock. The internet said it doesn't make a difference in terms of breast milk but I'm not so sure. I joked with my girlfriend that tonight will eat hot wings. Considering that she didn't get much sleep she didn't find this too funny. These small moments of struggles, joy and laughter are all part of the journey of being a father, and I wouldn't have it any other way.\n\n![](https://miro.medium.com/1*TUMfgvo-hV4Lhsy0hYYGXQ.jpeg)\n\nMy partner also sent me this so it's possible it was not the curry. We were a bit stressed last night. It's amazing having family around, but it's also nice being alone just me, P, and the baby. Next time we eat spicy food I'm going to try and make sure we stay calm so we can better gage if it was the food or our stress levels.\n\nAll this to say that being a father is full of so many amazing surprises. From the moment your child is born, you are filled with a sense of wonder and awe as you watch them grow and develop. Every day is a new adventure, and each milestone is a cause for celebration. I'm only a week in but I can confirm this to be true.\n\nOne of the most surprising aspects of fatherhood is the amount of love and devotion that you feel for your child. As a parent, your child becomes the most important person in your life, and you would do anything to protect and care for them. I love my partner deeply and I know she loves me back. However, if I did something truly atrocious I know I could lose that love. While I hope I raise Sloan well enough that she doesn't commit heinous acts, it doesn't matter what she does. My love her is unconditional and never-ending. I look at her and feel emotions that I've never felt before. My heart is filled with pride, joy, love, happiness, and other emotions words can't accurately describe. It is something I hope more people can experience. This whole having children thing has made me realize it makes you want to be a better person.\n\nAnother surprise of fatherhood is the amount of responsibility that comes with it. Being a parent means that you are responsible for the well-being of another human being, and that is not a responsibility that should be taken lightly. This responsibility can be overwhelming at times, but it is also extremely rewarding. It puts things into perspective and makes me realize that as a Father it is my job to make sure there is hope for my child's future. I want them to grow up in a world that is filled with love, kindness, and understanding. I want them to be able to pursue their dreams and find happiness in everything they do. I'm going to double down on spreading the good word of Bitcoin because I believe that is the best way to create a world where no one can cheat to enrich themselves. A world on a Bitcoin standard will have done away with central banks who steal their citizen's money. To show I'm not just blowing smoke here is a Substack I wrote for my Bitcoin group in Boston, Mass Adoption.\n\n> [**New York Is Fiat Boston Is Bitcoin**](https://open.substack.com/pub/massadoption/p/new-york-is-fiat-boston-is-bitcoin?r=1rxdni&utm_campaign=post&utm_medium=web)\n\nSpent a lot of time writing this bad boy today and it feels good to have it published. Talk to you tomorrow anon🫡\n\n1/13/23\n\nConor Jay Chepenik",
  "wordCount": 647,
  "readingTime": 2.6415094339622645,
  "claps": 0,
  "voters": 0
}