{
  "id": "5ea67c2e4791",
  "title": "Day 613",
  "createdAt": "2023-11-26 02:20:00",
  "tags": [
    "art",
    "culture",
    "religion",
    "subjective",
    "objective"
  ],
  "url": "https://chepenikconor.medium.com/day-613-5ea67c2e4791",
  "content": "# Day 613\n\nUber based things I read today which have had a profound impact on my conscious. Shout out the internet for truly democratizing information.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/thewardoll/status/1728476550796841103%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n> Here's a story for you. I was helping a friend renovate their first home, many years ago. It was a beat up place built in the 40s, but still something to be immensely proud of as a first time home owner. We were ripping apart the ceiling to do some repairs when we found that the problems up there weren't cosmetic like we had originally hoped, but more structural and serious. \"Whatever, lets just patch it up. I'm not gonna be here very long.\" Those words echo in my mind when I think back to that day, because almost 20 years later he still lives there. The ceiling we never properly fixed ended up leaking water years later into his newborns nursery room, and what could have been an easier fix that would have taken some hard work over a few days, ended up being a month long project to restore his entire roof and attic. The point of this story though, has nothing to do with home repairs. It is a metaphor for the absolute disastrous state of our western society at the hands of Christians eagerly anticipating a rapture event that will never happen, resulting in their gross negligence of the stewardship of this nation that will leave their children and many generations to come in a thousand year reign of chaos and death. \"I'm not gonna be here very long.\" I'm sure you've already heard that the beliefs of rapture and dispensationalism were propogated and directly funded by zionist groups, or if you've read into the studies of RC Sproul you'll find that almost all of Jesus prophecy about the end of the age has already been fulfilled in 70 A.D. You could even make the case that we are removed from the earth before the bowls of wrath are poured out, halfway throught the Tribulation, but the point remains - what if he doesn't come back for a thousand years? We've forfeited everything that's taken countless generations of blood sweat and tears to build, allowed our institutions and national morality to be sacrificed on the altar of progressivism, and given our culture over to perversion and immortality because, as many have said, \"these things must take place.\" Let me tell you, if there's is truly one argument for the rapture, it's that Christian men would be such a bulwark against the evil that's prophesied to come, that the Lord would be forced to remove us from this place or else our presence would prevent it from coming to pass. I understand that wisdom is not being right, but understanding that you could be wrong. He may come tomorrow to establish His earthly kingdom for the thousand year reign, and I would rejoice if He did. But I'll say this. If we are to survive, and if our children are to have any hope for a future, you better dig in, stack up, and fight like He's not coming back.\n\nLow time preference vs high time preference in a nutshell. Not much more commentary needed.\n\nI will say one thing though because this is my Medium and I can write whatever I want. I have caught myself daydreaming at my 9-to-5 job, imagining a scenario where a sudden war breaks out, freeing me from the mundanity of work. In this fantasy, I transform into a heroic figure, bravely protecting my family. Such thoughts are admittedly absurd. After indulging in this fantasy, I often pause and question the nature of these ideas.\n\nThis leads to an important realization: we are not defined by every fleeting thought that crosses our mind. It's more beneficial to view ourselves as observers of our thoughts rather than being fully immersed in them. Approaching our thoughts with objectivity allows us to better align with our goals and aspirations. Despite these occasional wild fantasies, I know for certain that I do not wish for the horrors of war. Yet, sometimes my mind drifts to the idea that a cataclysmic event would relieve me of my work responsibilities. It's a ludicrous notion, and in those moments, I remind myself of the value of maintaining a low time preference. Watching these thoughts pass and acknowledging their absurdity helps in focusing on long-term goals and rational decision-making.\n\nWill there come a day when we must fervently defend the values foundational to Western culture? Yes it is a challenge we face every day. This reality is underscored every time I look into my daughter's eyes or encounter a situation where I must choose between right and wrong. While I'm far from perfect and often make mistakes, I'm committed to getting the small things right. Here is a seemingly trivial example that actually makes a lot sense when you think about it, cleaning up the toilet seat after use. Regardless of weather or not the mess is mine or someone else's. It might seem irrelevant, but these small acts of consideration are what distinguish a civilized society from an uncivilized one. I'll be honest I'm not cleaning up public restrooms that are bio hazards but if I am a guest at someone's place and I see someone left pee on the seat before me then I'll fix it. It's about not allowing the careless actions of others to lower our standards. Strive to elevate yourself, to act with integrity and civility regardless of the circumstances. This commitment to doing better, even in seemingly minor ways, has a profound impact on upholding and protecting the values that shape and define our culture.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1728481328801153353%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n> \"Consciously or subconsciously, explicitly or implicitly, man knows that he needs a comprehensive view of existence to integrate his values, to choose his goals, to plan his future, to maintain the unity and coherence of his life - and that his metaphysical value-judgments are involved in every moment of his life, in his every choice, decision and action. Metaphysics - the science that deals with the fundamental nature of reality - involves man's widest abstractions. It includes every concrete he has ever perceived, it involves such a vast sum of knowledge and such a long chain of concepts that no man could hold it all in the focus of his immediate conscious awareness. Yet he needs that sum and that awareness to guide him - he needs the power to summon them into full, conscious focus. That power is given to him by art. Art is a selective re-creation of reality according to an artist's metaphysical value-judgments. By a selective re-creation, art isolates and integrates those aspects of reality which represent man's fundamental view of himself and of existence. Out of the countless number of concretes of single, disorganized and (seemingly) contradictory attributes, actions and entities - an artist isolates the things which he regards as metaphysically essential and integrates them into a single new concrete that represents an embodied abstraction. For instance, consider two statues of man; one as a Greek god, the other as a deformed medieval monstrosity. Both are metaphysical estimates of man; both are projections of the artist's view of man's nature; both are concretized representations of the philosophy of their respective cultures. Art is a concretization of metaphysics. Art brings man's concepts to the perceptual level of his consciousness and allows him to grasp them directly, as if they were percepts. This is the psycho-epistemological function of art and the reason of its importance in man's life (and the crux of the Objectivist esthetics). Just as language converts abstractions into the psycho-epistemological equivalent of concretes, into a manageable number of specific units - so art converts man's metaphysical abstractions into the equivalent of concretes, into specific entities open to man's direct perception. The claim that \"art is a universal language\" is not an empty metaphor, it is a literally true in the sense of the psycho-epistemological function performed by art.\" Ayn Rand in her book The Romantic Manifesto pages 19–20\n\nEach individual interacts with art based on their personal experiences, emotions, and beliefs. This makes the experience of art inherently subjective, as different viewers may derive different meanings and emotional responses from the same piece of art. As Rand points out, art involves an individual's metaphysical value-judgments. The way people interpret and value art is shaped by their personal philosophy, experiences, and cultural context.\n\nHowever, while the interpretation of art is subjective, the creation of art itself involves objective choices by the artist - choices about what to include, what to emphasize, and what message to convey. These choices reflect the artist's metaphysical value-judgments and view of reality.\n\nArt often reflects the philosophical and cultural values of the time and place in which it was created. This objective aspect of art serves as a historical or cultural document, revealing insights about the society and era it represents. Certain themes in art can resonate universally, transcending individual subjectivity. These themes might pertain to fundamental human experiences or universal truths, allowing art to communicate across different cultures and time periods.\n\nArt has the power to influence societal perspectives, motivating or discouraging people based on the values it embodies and represents. It can challenge existing beliefs, inspire new ideas, or reinforce certain ideologies. Ayn Rand's perspective underscores the complexity of art as both a subjective experience and an objective expression. Art serves as a conduit through which abstract metaphysical concepts are made tangible and perceptual, allowing individuals to engage with and reflect on these concepts in a deeply personal way.\n\nThis paradoxical interplay of art as both something to be experienced subjectively, yet something with an objective truth is a captivating aspect of human culture and cognition. This interplay is not just confined to art; it extends to many areas of life and knowledge.\n\n![](https://miro.medium.com/0*jec8PiNROWYk7xQ_)\n\n![](https://miro.medium.com/0*68xsIwTL7H2tcej6)\n\n11/25/23\n\nConor Jay Chepenik",
  "wordCount": 1660,
  "readingTime": 6.6474842767295605,
  "claps": 0,
  "voters": 0
}