{
  "id": "5f0fa55be687",
  "title": "Day 205",
  "createdAt": "2022-10-13 21:34:16",
  "tags": [
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-205-5f0fa55be687",
  "content": "# Day 205\n\nHad the opportunity to sit through some technical demonstrations of the exciting projects being worked on in Bitcoin right now. The two main ones being Fediminit and Taro on Lightning. Not going to lie a lot of it was over my head but the journey of 1000 miles starts with a step so I'm grateful I got to go and take my first steps down the open source software development route.\n\nWhile I can't give great technical details of either I'm pretty confident I can give a 10,000 foot view of both. I'll start with Fedimint and what it aims to do. The idea is to be a privacy tool for lightning that allows people to \"trust\" in Federation mints who will issue e-cash tokens for Bitcoin. As long as 2/3s of the Mints are acting in good faith there is nothing to worry about. This seems like a high percentage of actors required to be acting in good faith, but my guess is overtime many of these mints will be rated somehow and those who don't act in good faith will not be used. Making it so over a long enough time horizon only the good mints remain. By depositing some Bitcoin over lightning into the mint people will be able to transact privately. They can use the e-cash to receive & spend transactions with Fedimint compatible vendors as well as cash out for sats privately and with minimal fees. Another thing I learned today is that rather than leveraging UTXO (unspent transaction outputs) like Bitcoins do it will be more apt to a cash register where it takes in the cash then issues the change. Here is the Github for any open-source developers looking to help. [https://github.com/fedimint/fedimint](https://github.com/fedimint/fedimint) I'd also like to note maybe I botched this definition but this is how I understood it.\n\n![](https://miro.medium.com/0*S6MQacRrqLErFh3w.png)\n\nI also learned about Taro and all the various assets that can be issued over lightning. This includes dollar and Euro stablecoins as well as NFTs and a bunch of other stuff. By leveraging Taproot (which is a soft fork of Bitcoin people can leverage if they want to create smart contracts) people can have multiple scripts. This will will allow people to commit Taro data to the blockchain. Taro on chain transactions will be indistinguishable from regular taproot transactions. The Taro data is committed to the blockchain but it does not reside on the blockchain. Still working through exactly what that means but the way I think about it is that rather than being on the actual blockchain people can leverage the data to confirm it has been committed to a certain block. Like I said I have a lot to learn but it was awesome seeing the passion and intelligence many of these developers had.\n\nIt's pretty amazing to see so many people working on these open source projects and I think there is something really special about the open source community. I understand people need to make money to feed and shelter themselves but as software companies grow I believe many of the incentives get misaligned. There was a great video I wish I could find (not going on to distract myself by going on Twitter and getting lost right now) but it essentially pointed out how Microsoft sees what other softwares get developed then they employ their engineers to write knockoffs think Zoom & Slack > Teams & Teams chat. Once they get people in a bundle they just create shittier knock off products and because people are in the bundle they typically go for it. The video I'm thinking of did a better job explaining how Microsoft steals software ideas so they can nickel and dime people after they have gotten them in their Microsoft bundle. The reason I bring this up is because it's a great example of how over time the incentives of these companies don't actually benefit humanity but lead to people being hassled for money over software that if open sourced would never be an issue. So to see builders working on projects because they believe it can benefit humanity is awesome.\n\nBitcoin being the greatest example of this. Satoshi wrote the Bitcoin software and rather than cash in on his Bitcoin he walked away. It still blows my mind to think about the humility it would take to walkaway considering that his/her/their net worth grows massively with every cycle. Sure maybe there was the motivation to not have governments & nation-states hunting them down, but being at a Bitcoin conference and seeing the things being built on top of Satoshi's protocol that was completely open sourced from day one was truly amazing.\n\nI'm excited to go back tomorrow for the final day. I'm also going to get dinner with my grandparents tonight in Acworth, Georgia so that should be fun. Life is good anon :).\n\n10/13/22\n\nConor Jay Chepenik",
  "wordCount": 821,
  "readingTime": 3.29811320754717,
  "claps": 0,
  "voters": 0
}