{
  "id": "5f53da0ecb89",
  "title": "Day 386",
  "createdAt": "2023-04-13 01:32:12",
  "tags": [
    "massadoption",
    "print-magazine"
  ],
  "url": "https://chepenikconor.medium.com/day-386-5f53da0ecb89",
  "content": "# Day 386\n\nTime to improve this...LETS GO\n\n![](https://miro.medium.com/0*Zw9nqqptKsMjco4g)\n\nMassachusetts has been a pivotal force in shaping America's history and culture, earning it the well-deserved moniker, \"Spirit of America.\" The state boasts a rich heritage, with events such as the Boston Tea Party and the Battle of Bunker Hill playing instrumental roles in America's quest for independence from Britain. However, despite the progress achieved in the 250 years since America secured its sovereignty in 1776, the present state of freedom in the country is clouded by recent political polarization, social unrest, and constraints imposed on free speech by social media platforms. The COVID-19 pandemic further revealed the presence of authoritarian figures lurking within the corridors of our nation's capital.\n\nTo safeguard America's prosperity and liberty for the next 250 years, it is essential that we advocate for an incorruptible monetary system immune to inflationary taxation. The existing system has fostered economic inequality, leaving numerous Americans grappling with financial challenges while a select few reap disproportionate benefits. As long as the Federal Reserve possesses the power to create money, our democracy cannot function optimally. The principles of freedom and self-governance that fueled America's inception are as pertinent today as they were a quarter of a millennium ago. It is worth revisiting the renowned second paragraph of the Declaration of Independence, which eloquently asserts,\n\n> _We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. - That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, - That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness._\n\nWar is indisputably one of the most destructive forces in human history, inflicting immeasurable harm on societies and leaving lasting scars. While war may occasionally be deemed necessary, as in the case of the American Revolution, it should consistently be considered a last resort. In our modern world, with technological advancements, we should strive to find peaceful resolutions to conflicts. Economic disparities and competition for resources often contribute to war, but with technology, we should be able to do more with less. Unfortunately, this potential is hindered by fiat money, making it essential for citizens to address these underlying issues. Taxpayers should no longer be the ones bearing the brunt of the consequences. Advocating for better money, like Bitcoin, is a morally sound approach, as it establishes an economic system that isn't controlled by a select few. Bitcoin offers a form of money that can't be debased. By rectifying the monetary system, we can tackle the root causes of war and foster a more harmonious world.\n\nIt's worth acknowledging that central planners have implemented measures to protect bank depositors, such as the establishment of the FDIC. However, these measures don't resolve the systemic risks posed by fractional reserve banking. We must transform the system or risk devastating conflict. Established in the United States in 1933 in response to the Great Depression, the FDIC provides deposit insurance and protects bank depositors against the loss of their deposits if an insured bank fails. Since its inception, no depositor has lost a single penny of FDIC-insured funds. Nevertheless, the FDIC fails to address the root cause of bank failures: fractional reserve banking. This system, where banks hold only a fraction of the deposits they receive and lend out the rest, creates credit and liquidity in the economy but also generates systemic risk. Notably, FDIC insurance protects 100 times more today than when it first started, but regrettably, $250,000 today has significantly less purchasing power than it did in 1934.\n\n![](https://miro.medium.com/0*a8mS6ccb09coiMIJ.jpg)\n\n[https://americandeposits.com/history-and-timeline-of-changes-to-fdic-coverage-limits/](https://americandeposits.com/history-and-timeline-of-changes-to-fdic-coverage-limits/)\n\nWe must acknowledge that systems are constantly evolving, and it's crucial to recognize that the current monetary system may no longer be suitable for the digital age we inhabit. This is evident in various systems, including computers, energy infrastructure, roads, and even money. In today's interconnected world, a few tweets from prominent individuals can trigger a bank run, highlighting the vulnerability of the current system. Although the existing monetary system has been in place for centuries and has undergone numerous changes, fractional reserve banking has severely hindered our ability to thrive as a species, despite, or maybe in light of, central planners' best efforts.\n\nTo address the root causes of economic conflicts, we need to recognize that sometimes systems can become so entangled that it just makes sense to start over. It's akin to writing computer code, where the more patches and fixes you add, the more convoluted it becomes. Eventually, it's more efficient to scrap the old code and start fresh. Similarly, the current monetary system has undergone many changes and patches over the centuries, but fractional reserve banking has introduced systemic risks that are becoming increasingly unmanageable. The FDIC was established as a temporary fix for a system experiencing minor hemorrhaging, but now it's clear the patient is losing blood rapidly. We need a significant overhaul before the system collapses entirely. With Bitcoin, we can evolve the systems we've built to maintain our financial sovereignty and ensure that future generations aren't burdened by the mistakes of their predecessors for years to come.\n\nFractional reserve banking erodes the foundations that made America great. We often boast about free markets in the U.S., but in reality, it's like a game of Jenga where every block we remove weakens the structure until it ultimately collapses. In a true free market, the cost of capital should be determined by supply and demand, not by a group of 12 people on the FDIC. When banks create credit out of thin air, they distort the supply of money and credit, which in turn distorts prices. This leads to malinvestments, bubbles, and busts, much like how removing too many Jenga blocks from the bottom can cause the entire tower to collapse. Fractional reserve banking is not free market capitalism; it's a form of central planning that risks destabilizing the entire system. Imagine trying to build a Jenga tower with blocks that constantly change size and shape; maintaining stability and predictability would be nearly impossible. This analogy helps illustrate how fractional reserve banking can cause erratic behavior and instability in the economy.\n\nNow, compared to the U.S. Treasury market, Bitcoin is still relatively small and illiquid, making it the perfect time to transition the American economy to a Bitcoin standard. El Salvador is leading the charge in nation-state adoption, and while we hold the world reserve currency, it might be prudent to add some of the next world reserve currency to our balance sheet. The fractional reserve system is bound to implode eventually. Even if we manage to delay the debt crisis once more, it cannot continue indefinitely. Game theory suggests that money not controlled by any central authority or government will hold value in a future where most people spend the majority of their time online. By opting out of the current financial system and embracing Bitcoin, we can reclaim our financial sovereignty and ensure our unalienable rights to Life, Liberty, and the pursuit of Happiness are secured for generations to come.\n\nMassAdoption aims to help businesses in the New England area realize that we can be the change we want to see in this world. The organization's goal is to show as many people as possible that we don't need permission from tyrants to secure the unalienable rights our founding fathers granted us when they signed the constitution. New England is a special place, and it's our responsibility to preserve it for future generations.\n\nMassachusetts has a rich history and culture, having played a vital role in shaping America's identity and democratic values. Our founding fathers provided clear guidance on how to respond when the current state of freedom in America is uncertain. Fortunately, we no longer need to take up arms to alter the government. To ensure America's prosperity and freedom for the next 250 years, we simply need to demand a non-corrupted monetary system that can't be taxed through inflation. By opting out of the current financial system and using Bitcoin instead, we can reclaim what made America the world's beacon of hope.\n\nMassachusetts has a unique opportunity to lead the way in promoting Bitcoin adoption and securing financial sovereignty for its citizens. Let's ensure that the \"Spirit of America\" lives on.\n\nEst ius nostrum et voluntas meliorem mundum pro liberis nostris creare.\n\n4/12/23\n\nConor Jay Chepenik",
  "wordCount": 1469,
  "readingTime": 5.926729559748428,
  "claps": 0,
  "voters": 0
}