{
  "id": "601d0e894bc2",
  "title": "Bullish Per Usual 🔥😎",
  "createdAt": "2021-11-30 04:58:40",
  "tags": [
    "thanksgiving",
    "teaching",
    "crypto",
    "bullszn",
    "pleb"
  ],
  "url": "https://chepenikconor.medium.com/bullish-per-usual-601d0e894bc2",
  "content": "# Bullish Per Usual 🔥😎 \n\nIt was pretty great going back home for Thanksgiving and trying to convince all my friends and family to take the orange pill and opt-out of the fiat system. (I joke with the latter since being in the U.S.A makes Bitcoin a much better store of value for me than a medium of exchange since the tax laws on Bitcoin suck...please do something about this devs (Politicians of America)) I had my high school reunion and tried to discuss Bitcoin with many different people. It was eye-opening how many had no clue about Bitcoin. Most mentioned some mainstream media talking points while admitting they hadn't done much research. I appreciated the ones who admitted they didn't understand rather than the people who just thought of it as a scam. I try to convince people to learn about Bitcoin before buying it but many just don't want to make time for it. Hell, I even sent my best friends and sister ten bucks on Venmo with a signup link to my strike so they would at least invest ten dollars. (Looking forward to letting them know what that ten dollars will be in USD terms in the future in case they don't invest) Crypto Twitter likes to talk about how we're still so early on in this journey of decentralization and while I agree, if the price isn't constantly going up it's easy to get dissuaded for most. 💎  🙌  aren't built in a day but [the mainstream media is constantly looking for people they can scare into selling their Bitcoins](https://twitter.com/thebinmuckerpod/status/1464216204508286979?s=20). Getting boots on the ground and asking people I hadn't seen in years helped remind me how new these incredible cryptographic technologies really are. Hard to believe if you had mined some Bitcoin the day it came out with the plan to give it to your kids on their 18th Birthday you would still have a couple of years left before you moved that Bitcoin to their wallet. I genuinely feel bad for those who are not paying attention to what will quickly become the global store of value. I feel great when I get an open-minded person to look into Bitcoin and I feel bad for the ones who don't. Bitcoin is on its way to becoming \"the currency of the internet\" as [Jack Dorsey](None) likes to call it. (Congrats on quitting your fiat job for a Bitcoin one🤣 Mr. Dorsey). Anyways, the future is bright. Despite Jack stepping down, I'm still bullish on both Twitter and Square because these companies are both doing things to improve the crypto space in general. Fellow Bitcoiners continue to educate and spread the good word to their friends and family. I know I do because it feels so good to help the ones I care about secure financial freedom, self-sovereignty, and get to learn about history, finance, and philosophy along the way. While I believe Bitcoin is the Apex Predator, crypto in general, is one hell of a drug and it's likely we will live in a multi-chain world. Thus, convince everyone to learn the ideas behind these various chains and when they inevitably go down the rabbit hole they will end up buying some themselves.\n\n![](https://miro.medium.com/1*h65vtixHKWNe632tbgYnpw.jpeg)\n\n11/29/21\n\nConor Jay Chepenik",
  "wordCount": 547,
  "readingTime": 2.264150943396227,
  "claps": 3,
  "voters": 1
}