{
  "id": "61268b211b54",
  "title": "Day 239",
  "createdAt": "2022-11-17 02:31:54",
  "tags": [
    "larry-david",
    "ftx",
    "leverage",
    "bitcoin",
    "crypto"
  ],
  "url": "https://chepenikconor.medium.com/day-239-61268b211b54",
  "content": "# Day 239\n\nI'm thinking about how if it wasn't for Twitter SBF might be able to pull off one of the greatest scams since Bernie Madoff. These messages are insane.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/autismcapital/status/1592986188612530176&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI didn't bother to read them but I saw many on Twitter up in arms because NYT and WaPo wrote puff pieces on Sam after the dude was exposed for trading customer's funds. Dude was literally doing fractional reserve banking at a crypto exchange. Taking customer's deposits and using them to make bets. So insane.\n\nAnyways, I'm grateful that Twitter can be used as a tool to expose this dude. From what I can tell he deserves jail. It's amazing that SBF thinks he could trade his way out of this. Incredible when you consider they also lost so much money when they were trading against their clients and had way more \"size\" to trade with. This whole thing is just bonkers.\n\nThis year has been so wild to watch. I couldn't have guessed this is how 2022 would've gone down in a million years. The best part? It's not even over hahahahhahaha. Excited to see what the rest will bring.\n\nI'm grateful that this whole debacle is showing me (once again for the 10 millionth time in crypto) that not your keys = not your coins. I'm also glad many are starting to see the difference between Bitcoin and crypto. Life is a big long learning process and many are learning :).\n\nOn a better note I thought Caitlin Long absolutely nailed it with this take. Washing out the leverage in Bitcoin is amazing and anyone who wants to get greedy and lend it out for yeild will learn the hard way that you can't create more than 21 million Bitcoin unlike fiat.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/shirehodl/status/1593028219372175361&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWe're going to win anon. Keep the faith. I need to stop talking about FTX but man oh man is it fun to watch this dumpster fire burn. Pain is the best teacher and I hope those who lost big learn from this and come out stronger. I also hope the bad actors get what they deserve.\n\nOh also this tweet killed me. Poor Larry David hahahaha. Don't feel that bad though because this lawsuit will likely not win. Plus the dude is loaded and an amazing TV talent who has given many incredible laughs over the year with Seinfield and Curb.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/pauls551/status/1593010975846064128&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n11/16/22\n\nConor Jay Chepenik",
  "wordCount": 400,
  "readingTime": 1.509433962264151,
  "claps": 0,
  "voters": 0
}