{
  "id": "623b0153aa5a",
  "title": "Day 660",
  "createdAt": "2024-01-12 03:27:34",
  "tags": [
    "god",
    "religion",
    "bible",
    "quotes",
    "insights"
  ],
  "url": "https://chepenikconor.medium.com/day-660-623b0153aa5a",
  "content": "# Day 660\n\n![](https://miro.medium.com/0*FR4pS5lsax8bg3G5)\n\nFound an incredible quote in the bible.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1745295213176685038%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMany Bitcoiners consider Bitcoin's blockchain to be truth. It is just an open honest ledger anyone can verify for themselves with a machine. Investing in the tokens called bitcoin that you can send to others on this truthful network is not a bad idea. If you want to store wealth it is a lot better to do so on an honest ledger. Then maybe consider only exchanging the honest tokens with other honest actors who are providing legit value for you. You can use cuck bucks for the transactions to soulless corporations haha.\n\nThe bible really is full of so many bangers. Here are some other amazing insights from it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tyromper/status/1745430018828988616%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tyromper/status/1745430021680869719%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tyromper/status/1745430025363722596%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tyromper/status/1745430028132004121%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tyromper/status/1745430032141754609%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFaith is a deeply personal thing. I always hated the idea of telling others to follow MY religion because no one owns a religion. Sure you can be Christian, Muslim, Jewish, Buddhist, or even Atheist but it does not mean you own that religion. You have a personal relationship with the Alpha & Omega.\n\nOf course we can learn from others but the best teacher is yourself. Without an inner desire to learn something I don't care how good the teacher is. Micheal Jordan is not making a basketball player out of a kid with no desire to learn how to play basketball.\n\nWell the same goes for religion. God is the best teacher and all we have to do is ask him to share his wisdom with us. One of the things I appreciate about Tyler's content is he never forces his religion. He talks about how it changed his life. How he has become a better Father, partner, and human being because he opened his life up to God. I've yet to see him say \"And that is why you need to follow Jesus Christ as your Lord & savior to\".\n\nActions speak much louder than words. So I won't encourage you to become religious anon. I will just share that my life has gotten better after praying. I look at my past self and I don't have regrets but I do cringe at many of the things I did. I also recognize in the future I will make more mistakes. That is the beauty of life, we are fallen creatures yet the Alpha & Omega will still forgive us. Thank you God for everything 🙏\n\n1/11/24\n\nConor Jay Chepenik",
  "wordCount": 401,
  "readingTime": 1.7132075471698114,
  "claps": 0,
  "voters": 0
}