{
  "id": "62b615e953dd",
  "title": "Day 294",
  "createdAt": "2023-01-11 04:21:46",
  "tags": [
    "family",
    "congress",
    "accountability",
    "love",
    "movies-with-meaning"
  ],
  "url": "https://chepenikconor.medium.com/day-294-62b615e953dd",
  "content": "# Day 294\n\nWell I'm not convinced until it happens but there are some based bills getting passed by the House Of Representatives right now. I'm hoping these get signed into law but I am not holding my breath.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/unusual_whales/status/1612910366467719169&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI believe they actually passed one as well that eliminates the funding for the 87,000 new IRS agents. Now it needs to pass the senate and get signed by the President. I'm pretty sure that is the process but I could be wrong. Either way it's promising to see some solid steps being taken to address some serious issues. I watched this clip from Thomas Massie and was so excited to see congress members calling out our federal government that I retweeted it with a 🔥  emoji.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/repthomasmassie/status/1612912877656244224&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWorth the watch. The idea that these institutions shouldn't answer to Congress is insane. Especially considering Congress funds these people hahahaha. Insane to think these organizations should not be held accountable. Anyways... life is good. My Dad and Sister came to visit me today which was awesome. My Dad was balling tears when he first met his Granddaughter. It did not take long for me to catch my Dad passed out with lil baby Sloan sleeping on him.\n\n![](https://miro.medium.com/1*K81rqGYdkI_5LZrrXG_s8A.jpeg)\n\nThe man loves children. It is truly special to watch my Daughter bond with her \"Saba\" (Hebrew for Grandfather and what my Dad is demanding he be called). The first thing my Dad asked me when I picked him up at the airport today is \"Now do you understand what I meant when I said you'll never understand until you have kids\". I told him I think so. It really is a special feeling and I'm blessed God gave me a healthy daughter who has been a great baby. I'm also lucky to have family who is beyond supportive. My Dad had me when he was around 25 and I'm around 25 so Sloan has multiple great Grandparents, Grandparents, and even a singular great great Grandparent. Needless to say this baby is loved. My oldest sister Grace was actually getting a bit upset today because my Dad was holding Sloan and he didn't want to give Sloan up. Finally after Grace asked for the tenth time \"Saba\" begrudgingly handed over Sloan to my eldest sister who was nice enough to come up and visit with my Dad.\n\nI've been working on putting together my binmucker.com website where I will be doing my Dad blogging. I was going to use chatGPT to help me write the code and the system is down because they are at capacity. Wild to think how dependent I am becoming on this thing. It is great at explaining code. I'll find something on github I don't understand, ask chatGPT to explain it, and then from there it makes my life a lot easier. I can only imagine how future generations will feel. It's a good and a bad thing. Mostly good I hope. It reminds me of the modern day cell phone. Since we have contacts programmed into our phone there is no longer a need to remember numbers which is bad because if your kid gets lost in public without their phone they have no way of contacting you. If they can't remember their parents number to call this can turn out to be a big oooofff. However, modern day cell phones have made our lives so much easier in many ways. Think maps, streaming services for podcasts, social media (could spend hours on the good and bad of these platforms), and the ability to google stuff from almost anywhere.\n\nGot to focus on the good and understand where the bad can happen. I watched part of this movie with my family today and it was amazing. Talk about focusing on the bad to find the good.\n\n> [**Vengeance (2022) - IMDb**](https://www.imdb.com/title/tt11976532/)\n\nI look forward to finishing it soon but my girlfriend wanted to spend time with me so I will finish the rest tomorrow. My takeaway from the first hour and change I saw: we won't find meaning in the things we think will find meaning in. Well maybe I could phrase that better. We won't finding meaning in the things that society tells us we will find meaning in. We will find meaning in the things we know deep down will bring us joy that we are scared to face.\n\nFace those things. Stop listening to the little voice that says I can't; go listen to the voice that says fuck it let's ride... and go ride.\n\n1/10/23\n\nConor Jay Chepenik",
  "wordCount": 778,
  "readingTime": 3.1358490566037736,
  "claps": 0,
  "voters": 0
}