{
  "id": "63eccb01287",
  "title": "Day 136",
  "createdAt": "2022-08-05 23:00:45",
  "tags": [
    "pomp",
    "andrew-tate",
    "mike-solana",
    "podcasts",
    "friday-thoughts"
  ],
  "url": "https://chepenikconor.medium.com/day-136-63eccb01287",
  "content": "# Day 136\n\nListened to Pomp chat with Mike Solana and it was a fascinating conversation. I'm a big fan of Solana's writing and after listening to him talk I can see the guy is just a great thinker in general. Despite a lot of \"exposing the bullshit in our current system\" topics this Podcast has me very hopeful for the future. The United States will do the right thing in the end it just seems we are going to wait for the very last second to do so. They talked a lot about culture and how rapidly social media and technology is changing the culture. Everywhere in the world but especially the United States because most of the platforms and pop culture seems to stem from our nation. This podcast is a great reminder that we are in charge of our own lives. It is time to get involved in local politics and stop blaming others. Or just get involved in your local community. Find what you care about and get involved.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F2FGzRF9oJxXpqCmZfqrrdo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F2FGzRF9oJxXpqCmZfqrrdo&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f4ef33380213188e91413c3e4&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nFor me this has been getting involved in my local Bitcoin meetup. Meeting the people who think Bitcoin can change the world has been so hopeful for my outlook on humanity. My girlfriend is looking for meetups where people knit because she has become a fantastic knitter recently. Finding like minded individuals is refreshing in a world where most of the content being fed to us online is not stuff that inspires us. That said, you can find some incredible stuff that helps wake you up if you know where to look.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FUq4cDv2cUoE%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DUq4cDv2cUoE&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FUq4cDv2cUoE%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThis Pomp episode was also awesome but a very different outlook on the world. Props to Anthony though, since shutting down The Best Business Show the man has put out two fire interviews. Andrew Tate seemed a little out there at first, but the more you listen to the guy talk the more you realize he knows what he is talking about. It was interesting to listen to him point out that China has a nation full of worker bees. He admitted their government is 🗑  and corrupt, but the people get shit done and work very hard. He joked that after staying in a hotel in Iraq the U.S bombed it was the Chinese coming back and building these places back up. Look at the U.S where we are arguing about a bunch of bullshit and bombing those we disagree with. Over the course of 100 years Andrew made the case China will beat out the U.S in productivity which does seem like there is a big chance this is true. Ray Dalio has similar conclusions. Andrew also pointed out the United States is one of the biggest police states in the world. I'm glad we have liberties afforded to the citizens in our constitution, but he is right. We are a massive police state and the show trials that happen are clearly violating a lot of people's constitutional rights. Not to mention morality is a much bigger indicator of violence. As many lose their morality our police state can do very little to stop all the violence, crime, and bullshit that seem to constantly occur in liberal cities. The solution is not more police. It is taking a first principles approach to stopping violence which starts with disincentivizing violence and teaching people the importance of respect. I truly do believe an armed state is a polite state. Tate joked that without the police the U.S would descend into the Purge because we've lost our morality. I don't know if this is true but if I had to bet I wouldn't want to bet the other side.\n\nFunny hearing the sharp contrast between Solana and Tate. Very different guys and I think they both make some good points. Solana seemed to think getting involved on a local level is the move to fixing the United States while Tate took the get rich and get as many passports as you can approach. I think they both speak truth. Also a good reminder that no one knows which way this actually plays out. I do know that holding assets is going to be important in the future. It is unclear what the enslavement system the elite of the world concoct to keep people in fear and owning nothing. These past two years have shown us though that the more you can hold solid assets the better you will be. I'm very happy that Bitcoin will chop a lot of these enslavement systems at the knees, but it's on the sovereign individual to take care of themselves.\n\nBang bang.\n\n![Photo by Ryutaro Tsukata: [https://www.pexels.com/photo/outdoor-cafe-on-narrow-passage-in-old-city-on-sunny-day-5746248/](https://www.pexels.com/photo/outdoor-cafe-on-narrow-passage-in-old-city-on-sunny-day-5746248/)](https://miro.medium.com/0*CWefWEDe2VV8BV6N)\n\n8/5/22\n\nConor Jay Chepenik",
  "wordCount": 775,
  "readingTime": 3.1245283018867926,
  "claps": 0,
  "voters": 0
}