{
  "id": "64435fa9d769",
  "title": "Day 375",
  "createdAt": "2023-04-02 00:38:08",
  "tags": [],
  "url": "https://chepenikconor.medium.com/day-375-64435fa9d769",
  "content": "# Day 375\n\n## The Rise of AI prompt engineers\n\n![](https://miro.medium.com/0*szdJsVsdBBP-Ujt7)\n\nThe development of artificial intelligence (AI) technology has led to the emergence of AI prompters, which are people who figure out how to query AI most effectively. Specifically, they prompt language models like ChatGPT and other similar systems. Machine learning is going to have a massive impact on people's productivity if used correctly. If you ask AI simple questions, you will get simple answers. However, if you ask AI complex questions, in the right way, it can provide insightful and accurate answers. I can imagine AI prompters will become increasingly popular in various industries, from customer service to healthcare to education. In this Medium I'm going to explore the benefits AI can have on humanity.\n\nEfficiency is important in customer service. With the help of AI systems, prompters can process and respond to user queries at a much faster rate than normal human operators. Instead of drafting an email from scratch a CS rep can now copy and paste in an email and ask chatGPT for a response. From there the CS person can tweak the email accordingly. ChatGPT can provide the framework for a human to respond in a way that makes the customer happy. This is especially beneficial for businesses or organizations that receive a high volume of inquiries, such as call centers or online retailers. I'm hopeful AI will help users receive answers to their questions quickly and accurately, leading to higher levels of customer satisfaction.\n\nAI can also help doctors improve the accuracy and speed of diagnosis by analyzing patient data such as medical records, test results, and imaging scans. AI algorithms can also suggest personalized treatment plans based on patient data, which can lead to better outcomes. For example, predictive analytics can be used to analyze patient data and identify those at risk of developing certain conditions, allowing doctors to intervene early and prevent the progression of diseases. AI can also be used to speed up the drug development process by analyzing large amounts of data and identifying potential drug candidates more quickly. This could lead to the development of new treatments for diseases that currently have no cure. It could also eliminate many administrative tasks such as scheduling appointments and managing patient records, allowing doctors to spend more time on patient care. Not sure if it's ready for this yet, but at some point I can see AI being used for surgical assistance. For complex procedures it would be nice to have a robot which operates with near perfect accuracy help improve the safety of surgeries.\n\nNone of these systems are perfect yet. Humans are bad at estimating exponential growth. It reminds me a bit of using autocorrect. Sure, there may be times when auto-correct is more of a hindrance than a help, but the more you use it, the better the algorithm gets at predicting what you're trying to say. And let's face it, who wouldn't want a personal AI assistant to take care of the mundane tasks in life, like scheduling appointments or writing emails?\n\nPersonally, I'm excited to have this tool as I start to work as a software engineer. AI will be my own personal code guru. It can analyze my code, offer suggestions, and help me write more efficient programs. It can't create an entire web app for me (yet). It is still the most powerful tool I've ever used to help my brain hash out ideas.\n\nChange can be terrifying, especially when it comes to emerging technologies like AI. But as with any new innovation, we should approach it with an open mind and a willingness to learn. Sure, the future will have its fair share of quirks and occasional mishaps, but so did the past! Remember when the idea of a personal computer seemed like science fiction? I don't but I know someone who was born 50 years before me might have.\n\nThe more we use AI, the more we'll understand its potential and limitations. With time, we'll be able to fine-tune its algorithms and optimize its applications. And who knows, maybe one day AI will even have a sense of humor to match our own. Can you imagine a chatbot telling good jokes and puns? You feed it enough data from good comics and that will be a reality soon!\n\nOf course, there will always be naysayers who think that AI is out to take over the world or convince itself that making paper clips is the only thing important in life even if it means destroying humanity. But the reality is that AI is already making our lives easier and more efficient in countless ways. From helping doctors diagnose diseases to improving customer service to helping engineers build like they have never built before. AI has the potential to transform our world for the better.\n\nSo let's embrace AI, not fear it. Let's recognize its potential to help us solve some of the world's most pressing problems, while also acknowledging the need for caution and ethical considerations. By working together with AI, we can create a brighter future for all.\n\nI hope by automating repetitive or routine tasks, AI can help reduce labor costs, freeing up human resources to focus on more complex or strategic activities rather than eliminate all human jobs. It's important as AI proooompters get better we show humanity what could these tools can do. I'm convinced AI will be like an escalator moving all of humanity up. A few might have to take a stack down on the escalator, but it will be driving us up so quickly that it doesn't matter because those who took the step back will still be better off.\n\n4/1/23\n\nConor Jay Chepenik\n\nLuckily, I wrote this piece of April 1st so if I'm wrong about AI at least I have plausible deniability.",
  "wordCount": 977,
  "readingTime": 3.8867924528301887,
  "claps": 0,
  "voters": 0
}