{
  "id": "66875b29b081",
  "title": "Here Is To More Markets, Not Less",
  "createdAt": "2023-02-25 00:56:22",
  "tags": [
    "anarcho-capitalism",
    "free-markets",
    "innovation",
    "bitcoin",
    "central-planning"
  ],
  "url": "https://chepenikconor.medium.com/here-is-to-more-markets-not-less-66875b29b081",
  "content": "# Here Is To More Markets, Not Less\n\nIf nice flowers cost a dollar would you buy them more often? If it cost 5 dollars for someone to mow your lawn would you outsource your lawn mowing? How many vehicles would you purchase if a nice car only cost 500 US dollars, or better yet would you spend 5000 US dollars on a jetpack that flys you around quicker than a car? These are intriguing questions but something that seems like a pipe dream in an inflationary system.\n\nAs an advocate of anarcho-capitalism I firmly believe that the free market is the most efficient and equitable way to allocate resources and generate wealth. In a system without government intervention, individuals are free to pursue their own interests and engage in voluntary transactions with others. This creates a vast network of decentralized markets that can quickly adapt to changing circumstances and individual preferences.\n\nSome may argue that central planning is necessary for economic stability and efficiency, but I disagree. Central planners may have good intentions, but they lack the ability to fully understand and respond to the nuanced needs and preferences of individuals and communities. Moreover, voluntary exchange can be corrupted if a third party seeks rent between the parties who want to exchange value.\n\nOf course there is no perfect way to implement any system. Everything has tradeoffs. If we somehow found a way to limit Government we should make sure we don't go too far and end up in society where it is just survival of the fittest.\n\n![](https://miro.medium.com/0*5TvfAK5OjlVZqnfe)\n\nI just believe in a system with less middlemen more options would be available. This is where Bitcoin comes in. Technology should be making everything cheaper as productivity increases meaning we get more for less. That is not happening today because the whole monetary system is based on debt. By allowing individuals to opt into a decentralized economy we can create a more dynamic and adaptive system that better reflects the needs and desires of its users. Money is to the economy what water is to an ocean. We need clean water, not water that has been murkied from a broken social agreement. I'd argue taxation is theft but I can see why others might argue it's necessary. After all, who would build the damn roads? What I can't understand is how some justify the idea that inflation is not theft. If everyone could borrow money from themselves... endlessly... they would always be borrowing more and more. Since inflation is perpetual Governments end up borrowing until the money becomes worthless. The public also borrows more because those who are paying attention realize the way to win in a backwards system is to take on more debt.\n\n![](https://miro.medium.com/0*typqhnqXC88NOtxZ)\n\nAnother key advantage of anarcho-capitalism is that it would eliminate the barriers to entry that often prevent smaller businesses and entrepreneurs from competing with established corporations. Without government regulations and licensing requirements, new businesses could enter the market more easily. [Deloitte estimates \"Compared to pre-financial crisis spending levels, operating costs spent on compliance have increased by over 60 percent for retail and corporate banks\"](https://www2.deloitte.com/us/en/pages/regulatory/articles/cost-of-compliance-regulatory-productivity.html). Imagine the innovations that have not occurred because more people are focused on compliance than meeting the needs of the end consumer.\n\nWhen you don't have smaller, more local Governments there is a loss of accountability. It's easy for someone not providing any value to point the finger if something goes wrong. When the incentives break down you end up with wealthy countries telling smaller ones how to live.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/AlexEpstein/status/1628893063488897024%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhat if you could get free energy by letting someone use your compute when you didn't need it? Anarcho-capitalism allows for a diversity of market structures, including cooperatives, mutual aid societies, and worker-owned firms. These alternative forms of economic organization would provide workers and consumers with greater agency and control over their economic lives. There would still be wealth and power concentrated in the hands of elites, but it largely wouldn't matter because everyone would be so much wealthier. If the cost of goods and services got exponentially cheaper, rather than more expensive, everyone would be happier. Well almost everyone, maybe not the people who got to create money out of thin air in the fiat system.\n\nProponents of central planning argue that it can help to address market failures such as externalities, natural monopolies, and public goods. For example, a centralized agency could coordinate efforts to reduce pollution or manage a shared resource like a river or forest. Additionally, central planning could be used to promote social welfare goals such as reducing inequality or providing universal access to healthcare. However, most cases turn out to yield opposite results. Price ceilings create shortages and price floors create excess. The history of central planning in the 20th century is littered with examples of failure and inefficiency, from the Soviet Union to Maoist China. The problem with central planning is that it requires a vast amount of information and expertise to make effective decisions, and this information is often dispersed and difficult to collect. Central planners face the same incentive problems as market actors, and are susceptible to corruption, bias, and rent-seeking. For crypto it has gotten so bad that even people who try and do things by the book still get slammed by the regulators.\n\n> [**Kraken and Custodia Bank CEOs say regulators ignored their warnings about scams and fraud**](https://cryptoslate.com/kraken-and-custodia-bank-ceos-say-regulators-ignored-their-warnings-about-scams-and-fraud/)\n\nIf the Kraken and Custodia C.E.O could focus more on providing value to the market, instead of warning and dealing with regulators, I wonder what cool financial products they could come up with. I'm not a fan of the ponzi schemes in crypto but the problem for fixing that is more education about the difference between Bitcoin and other cryptocurrencies. Not Government agencies flexing on social media about giving Kraken a 30 million dollar fine for staking right after FTX wrecked a massive number of retail investors because they [ended up 8 billion in the hole](https://www.entrepreneur.com/business-news/who-lost-money-in-ftx-tom-brady-kevin-oleary-and-more/443653#:~:text=From%20Tom%20Brady%20to%20Kevin,scrambling%20to%20recoup%20their%20funds.).\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/SECGov/status/1623777921499336710%3Fs%3D2&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhile central planning may seem like a convenient solution to economic problems, Bitcoiners believe that the power of free will and magic internet money offers a more dynamic, adaptive, and sustainable approach. One which individuals couldn't have before because the money was corrupted under fiat. Bitcoin is valuable because of its user base which allows for anyone to opt in peacefully. No middleman needed. Everything has trades off and there would likely be some form of Government in a hyperbitcoinized world. My guess is the Government would resemble an anarcho-capitalism type system where those in power must provide fair value to their citizens or else they lose power. This offers a promising path towards a just and prosperous society where people can take their value and leave if they feel like they aren't being treated properly. The fair rules provided by the Bitcoin network means no special advantage will be given to those close to the money printer. Bitcoin is going to provide fresh blood to an economy that desperately needs some dialysis. When people are free to pursue their own interests and create wealth through voluntary exchange there will be more markets to serve consumers and better quality products for cheaper. When we fix the money the world is going to see innovation like it has never seen before.\n\n![](https://miro.medium.com/1*5y5AfkGUao1k4mx9ALJxGQ.jpeg)",
  "wordCount": 1237,
  "readingTime": 5.217924528301887,
  "claps": 0,
  "voters": 0
}