{
  "id": "66969aec6e47",
  "title": "Day 692",
  "createdAt": "2024-02-13 05:00:18",
  "tags": [],
  "url": "https://chepenikconor.medium.com/day-692-66969aec6e47",
  "content": "# Day 692\n\n> [**Nuns Building Citadels and Civilization**](https://bitcoinpapist.com/p/nuns-building-citadels-and-civilization)\n\n![](https://miro.medium.com/1*9PP7DrhpuvOgNeQ8EFJw_Q.png)\n\n**Lindy Things Are Low Time Preference**\n\nIn an era characterized by rapid technological advancement and a culture driven by the pursuit of the new, the importance of preserving the wisdom and practices that have contributed to the foundation of Western society cannot be overstated. Throughout history, there have always been individuals and groups focused on destruction rather than creation. However, it is crucial to recognize and appreciate the myriad contributions that have played a pivotal role in shaping Western civilization into what it is today.\n\n**Exploring the concept of \"Low Time Preference\"**\n\nIn the context of technology and societal development, it is worth highlighting the exemplary work of the Benedictines of Mary. By embracing the principle of thinking long term they were able to foster a culture of preservation and growth.\n\nLow time preference people value patience, long-term planning, and the prioritization of sustainable growth over immediate gratification. They embody the philosophy that true value and progress are achieved through careful consideration of the future, rather than an exclusive focus on the present moment. Investing in endeavors that yield benefits over generations, rather than seeking quick fixes or short-lived successes.\n\n**Historical Context and Modern Application**\n\nHistorically, the concept of low time preference has been instrumental in the preservation and transmission of knowledge, culture, and traditions across generations. The Benedictine monks of the 6th century serve as a prime example, having dedicated themselves to the preservation of civilization during times of societal turmoil.\n\nToday the Benedictines of Mary, Queen of the Apostles, exemplify the integration of low time preference with modern technology. By adopting bitcoin and leveraging it to support their monastery, these nuns showcase how traditional values can harmoniously coexist with contemporary technological advancements. Their approach underscores the potential of technology as a tool for positive societal impact, when used with foresight and responsibility.\n\n**A Symbiotic Relationship with Technology**\n\nThe nuns seem to practice what they preach. The monastic life of the Benedictines of Mary is characterized by a profound commitment to passing on traditions and fostering a culture that leaves the last one better than they found it. Their [daily practices include prayer, farming, and the creation of music.](https://bitcoinpapist.com/p/nuns-building-citadels-and-civilization) However, this lifestyle is not one that lacks the benefit of new technology. The Benedictines of Mary's use of Bitcoin has allowed them to store their wealth. It was a Bitcoin donation that made possible their beautiful church.\n\nMoney is an important tool for society. Good money has a resilience in the face of adversity. Bitcoin allows both organizations and individuals the ability to store value over time and sovereignly send and receive money without the permission of others. This is empowering to people all over the world; especially those who do not have a bank account. Good technology encourages a reevaluation of the role of tradition in modern life and the potential for a balanced integration of the old and the new.\n\n**Figuring Out What Truly Matters**\n\nIn a world that often prioritizes instant gratification and short-term gains, the Benedictines of Mary remind us of the enduring value of low time preference. By valuing patience, sustainability, and the preservation of tradition, they offer a model for building a future that respects the past while embracing the possibilities of the present. As one navigates the complexities of modern society, the principles embodied by these nuns remind people to consider the long-term implications of their choices and how to invest in what truly endures.\n\n2/12/24\n\nConor Jay Chepenik",
  "wordCount": 605,
  "readingTime": 2.4830188679245286,
  "claps": 0,
  "voters": 0
}