{
  "id": "67aa377c67bd",
  "title": "Day 169",
  "createdAt": "2022-09-07 22:04:34",
  "tags": [
    "passions",
    "money",
    "bitcoin",
    "adventures",
    "tftc"
  ],
  "url": "https://chepenikconor.medium.com/day-169-67aa377c67bd",
  "content": "# Day 169\n\nNice.\n\nListened to [Lord Miles](https://twitter.com/real_lord_miles) go on Marty Bent's TFTC. Dude has a hell of a story. Plus this episode was a good reminder to put my faith in God and actually live a life he would be proud of. The big man will take care of everything if you put your faith in him. Do recommend listening to Lord Miles spit some cold hard facts and discuss his adventures to some crazy places around the world.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F4h3aJ7lQy3HhJEUOQ0qfIJ%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F4h3aJ7lQy3HhJEUOQ0qfIJ&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fb23f36c8ec59b3e61be12607&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"207\" width=\"368\"></iframe>\n\nAlso went and got some new boots for my whip. Tires on my car for those who don't speak millennial. Someone hit my back tire so I had to go get a new tire and decided to go all out anyways and get 4 replacements since my tires were getting bald anyway. New tires look sharp and since the people who hit me paid me $750 for the damage I only had to pay $200 for all the new tires. (The bill came to $950.) Was thinking about just getting one tire, but that seemed silly to have one solid tire and the rest be bald so I just got 4 new ones plus a rotation and balance. Funny how the world works, but I also got 10 bucks in bitcoin for using my special credit card so I think that 10 bucks will definitely be worth more than 200 USD soon. 🤡 🌎  seems pretty hell bent on ruining the fiat currency system this winter. Personally, between giving Russia Ukraine or hyperinflation I'd take the former, but ain't no one in Europe care what I think. Greed is a hell of a drug brother. Also the thing that secures the Bitcoin network. Amazing to see people leverage greed to create some good in this world rather than leverage greed to screw over the lil guy. Satoshi is pretty based if you ask any Bitcoiner.\n\nOutside of that I feel a lot better about life. Ran everyday this month so far besides the 1st of this month. Feels really good and Keenan and I even got my buddy Q to hit a run today because we have been lighting up our running group-chat. Amazing feeling getting your buddy to improve himself by showing him you are willing to put in the work to improve yourself. Also a reminder why your friends are so important. The people you hang with will have a huge impact on where you end up in life. If you hang with lazy people who do nothing I doubt you will end up exercising, improving, and discussing cool ideas instead of a sports ball game. Don't get me wrong I love playing sports and for a long time watching them. Recently though I've been very disinterested. That's okay though our hobbies are prone to change over the course of our lives and I'm very much enjoying my Bitcoin hobby.\n\nIt's funny too because this same idea about who you hangout with IRL can also be applied to the people you follow online. It was online Bitcoiners who I listened to on Podcasts, saw tweeting, and read their articles that encouraged me to publish my own work on Bitcoin. While many people do end up getting published on Bitcoin Magazine it was not something I ever thought I would do before I got into Bitcoin. Makes me feel good knowing my work is published and that it could potentially help someone see why Bitcoin can lead to a more prosperous world. I've become so convinced that this new form of money can fix the world that I gladly dedicate my precious time to writing about it in order to help others see why this stuff is important. From my own experience I've found Bitcoiners to be some of the most altruistic people in the world despite the media labeling us psychopaths.\n\nFind your passion anon; it will make life better. Not everyone will go down the Bitcoin rabbit hole and make that their passion, but considering money is a pretty important part of a functioning society I can confirm it's a solid passion to find. I have been enjoying the Bitcoin rabbit hole anyways. Also tell your friends and family you love them. You never know what difference that can make in someone's life.\n\n9/7/22\n\nConor Jay Chepenik",
  "wordCount": 720,
  "readingTime": 2.7169811320754715,
  "claps": 3,
  "voters": 1
}