{
  "id": "689f7217ab9e",
  "title": "Day 147",
  "createdAt": "2022-08-17 02:32:22",
  "tags": [
    "british",
    "english",
    "flow",
    "bitcoin",
    "financial-services"
  ],
  "url": "https://chepenikconor.medium.com/day-147-689f7217ab9e",
  "content": "# Day 147\n\nNever estimate the power of changing up your space. Today I completely rearranged my apartment and it feels like I moved into a new spot. It's a good feeling and I'm excited for my girlfriend to get back and see. Hopefully she approves, she is usually the one encouraging us to change it up and I've usually been the one who is hesitant. She ended up being correct in the end because my new space feels amazing. Our* new space :)\n\n![](https://miro.medium.com/1*CijADborN7bcjNco2uefSA.jpeg)\n\nIt is funny all the different slangs in languages. I once heard the story of a British dude who got slapped in the club for asking a girl if she wanted to go smoke a fag outside. He was in America and the girl thought he was asking her to go kill a gay person. He explained he just want to smoked a cigarette after the slap, but pretty funny to think what a complex thing it must to be learn English as a language. You have to decide which dialect. Same thing with Spanish with all the Latin American dialects and European Spanish. Many other examples as well. Duolingo and classes are only so helpful. Going and immersing yourself in a place is the best way to learn rapidly. I hope to travel and see more of the world with my child. I believe Bitcoin will give many early adopters their time back in the long run allowing us to spend more time doing stuff we actually care about rather than time spent doing something by decree aka FIAT JOBS.\n\nMade a delicious meat sauce with liver. Shout out youtube for the idea. Basically, I just cut up the liver real thin and mixed it with beef, tomatoes, and pasta. Hopefully, my girlfriend won't notice there is liver and eat some when she gets back. Hahahahha I have a pretty big feeling she'll notice. It was good though. Much better than liver on its own. I want to eat more of this super food, but it is a process getting my taste buds adopted. I've had too much seed oils and artificial sugar throughout my life. Never too late to change up the way you eat. More meat recently has helped me feel better. Also walking in the sun and doing speed runs recently. I like speed runs where I can walk in between sets. It's fun running fast. Track workout basically.\n\nToday I was thinking what a fun idea it would be to make a streak generator website. Almost like a blockchain that is completely centralized and only good for holding your personal blocks. Blocks of good habits. Like running on the Nike Run Club, or reading a book, or completing a daily learning app like Duolingo & Mimo, or any good habit you're proud of doing everyday, even writing :D.\n\nDoesn't sound like there is any good way to monetize something like that....which is good. A completely personalized blockchain is not something to be storing anything of value other than sentimental value for the user using it. In other words. It is not always optimal when everything gets financialized. [Adam Neumann just got 350 milly in funding from a16](https://www.cnn.com/2022/08/15/tech/adam-neumann-flow/index.html)z. Got damn. Dude is literally gonna use funding to buy up apartments and shit so he can turn them \"community-driven, experience-centric service\" places where people pay for as a service stuff in order to experience others. I like being pampered as much as the next person but after what I saw in that WeWork documentary on Hulu that I can't remember it would not be how I invested 350 million. Not financial advice as of course, but if I had that kind of money I'd be putting it all in bitcoin. After 10 years I look forward to checking back on how 350m in BTC vs. FLOW investments are holding up.\n\nAnyways, I enjoyed this shit-posting stream of consciousness that just came out of my fingers. Writing is usually a grind, but sometimes it can also be an incredibly enjoyable experiencing just clacking away at the keyboard. I should really make that simple goodstreakchain website for my first app. What a fun and cool project that could be. Create different templates and layouts so people could have fun designing their own chains. Would also be a good experience learning how to code.\n\nIn my own goodstreakchains I'd like to include writing, walking, running, reading, and cooking. Many more things to add over time but when I do all those things in a day I find it to be a pleasant day. Learning was not fun in school. I think part of it was on me, but another part is the system. College you had much more freedom and honestly I did enjoy my Film and Media degree, but for most of middle school and high school there were not as many enjoyable classes (excluding the few where I had a really exceptional teacher). Teaching is not an easy job. Takes an emphatic, kind, and enthusiastic person to teach people. Since Bitcoin I really have found learning more pleasurable. Hope is powerful. Until tomorrow.\n\n8/16/22\n\nConor Jay Chepenik",
  "wordCount": 865,
  "readingTime": 3.4641509433962265,
  "claps": 0,
  "voters": 0
}