{
  "id": "68aed85160dc",
  "title": "Day 435",
  "createdAt": "2023-06-01 02:15:30",
  "tags": [
    "family",
    "memes",
    "life",
    "north-shore",
    "massachusetts"
  ],
  "url": "https://chepenikconor.medium.com/day-435-68aed85160dc",
  "content": "# Day 435\n\nProud of myself for being consistent. It's 10 pm at night, I'm tired from sitting in the sun all day, and yet here I am writing because I made it a priority in my life to become a better writer. Being able to sharpen my mind is important and there are not many better ways than actually trying to transcribe my own thoughts onto one of Medium's servers.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1663927775873445890%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nToday was spent with my partner, father, and child driving around the north shore of Massachusetts. It's a gorgeous area.\n\n![](https://miro.medium.com/0*FQRUlRpm01AQeUKg.jpg)\n\nI'm so grateful for the time I get to spend with family. My little sister is deciding where she wants to play lacrosse next season and the two choices are Boston and Tampa bay. Selfishly I hope she comes up here so more of my family will be around Mass but will see. Only time will tell what happens.\n\nAnyways, I'm going to go code now. I'm happy to see that I hit 40 miles ran this month, that I've written consistently for over 400 days, and hopefully soon here I will start to see some serious traction on my Github. Been about a month going strong making a commit everyday.\n\nI'll leave you with this. Pain is the best teacher!\n\n![](https://miro.medium.com/0*wFXMDLqBWvKtvAT0.jpg)\n\n5/31/23\n\nConor Jay Chepenik",
  "wordCount": 215,
  "readingTime": 1.1946540880503145,
  "claps": 0,
  "voters": 0
}