{
  "id": "6a6c7cfbc208",
  "title": "Day 637",
  "createdAt": "2023-12-20 02:45:47",
  "tags": [
    "health",
    "fitness",
    "oppurtunity",
    "cooking",
    "family"
  ],
  "url": "https://chepenikconor.medium.com/day-637-6a6c7cfbc208",
  "content": "# Day 637\n\nToday, out of the blue, my buddy reached out with a request to guide him in working out. Having a gym in my apartment, I enthusiastically agreed. I'm good about running but have not been great about lifting. So when my friend asked to workout together it seemed like the universe was telling me, \"Get your sh*t together, big dog!\"\n\nGrowing up, fitness was a staple in my household, thanks to my father, a seasoned personal trainer. While the fitness industry never beckoned me, the thrill of a challenging workout always does. So, I planned a rigorous session for us: sprints.\n\nWe crushed the workout, pushing through five intense sets of 0.1-mile sprints, each followed by a grueling dead hang while waiting for the other to finish. Our bodies screamed in protest, feeling like we were both going to throw up, but we persevered. Powering through to do even more exercises after the sprints despite feeling ready to throw up the whole time. The satisfaction of pushing past what you think your limits are is a great feeling.\n\nPost-workout, I played chef, cooking up a hearty meal of steak, potatoes, onions, and beef. My mom purchasing me a potato slicer from Walmart has been amazing. It cuts the potatoes perfectly into fry shape and then I just cook them in a pan with seasoning & lots of butter. The dinner turned out to be a feast celebrated in the warm company of my sister, partner, child, father, and friend. I love when the evening unfolds into an unexpected gathering, filled with laughter, delicious food, and shared stories.\n\nThe lesson from today? Embrace opportunities to help when they arise, especially when you know it's the right thing to do. What started as a casual workout invitation evolved into a memorable evening with loved ones. Not only did I improve my fitness, but I also relished the joy of connecting with those dear to me. Plus, I've committed to another workout tomorrow. Today was a reminder for me that building good habits is a joy when shared with friends.\n\nMy buddy asked me to take a pic of him so he could send it to his girlfriend. He claimed it was a \"shit pic,\" but personally, I thought he looked tough. Hahahaha. If you saw what my boy looked like before he got into a keto diet you would tell me to make a motivational poster with his before and after.\n\nJokes aside, I'm proud of you 50 cal. I highly doubt you read my mediums but if you ever do seriously, I am proud of you for getting your health right! 🫡\n\n![](https://miro.medium.com/1*0aLXbEaupRBuYl1T-ZRRXw.png)\n\n12/19/23\n\nConor Jay Chepenik",
  "wordCount": 449,
  "readingTime": 1.8943396226415095,
  "claps": 3,
  "voters": 1
}