{
  "id": "6a7f3a41288a",
  "title": "Day 222",
  "createdAt": "2022-10-30 23:04:03",
  "tags": [
    "bitcoin",
    "running",
    "goals",
    "psychedelics",
    "castle"
  ],
  "url": "https://chepenikconor.medium.com/day-222-6a7f3a41288a",
  "content": "# Day 222\n\nIt was nice seeing old friends and catching up with people I had not seen at the game yesterday. Tufts destroyed Hamilton on the gridiron and after the game I got to see inside the new locker room. Seeing a bunch of players who I had not seen since my Senior year \"their freshman year\" was wild. To see how much those kids have developed is shocking. I didn't notice it in my own class because I was with the same kids for four years. Not seeing the freshman for a couple years only to see them again as seniors was eye-opening.\n\nCollege might not be the perfect system but in today's society I do think there is value in having 4 years to mature into a full fledged adult. If I could go back I'd study comp-sci but hindsight is 20–20. I enjoyed my film and media + entrepreneurship degree I just wish I had been doing more with Bitcoin earlier. Can't change the past though and I'm excited to continue learning comp-sci at my own pace. I feel good being reminded the computer is just a tool that can compute to numbers to help people be more productive.\n\nThings I'd like to implement on my website conorchepenik.com\n\n- Email capture for those who want my newsletter (Make a newsletter)\n\n- Super sleep design with a beautiful background (Look through my photos for an amazing sunset)\n\n- A link to my Urbit planet (Buy and start using an Urbit planet)\n\n- Plug for my own podcast (Starting podcasting more?!)\n\n- Figure out how to make the domain name last rather than just have it lead to the github hosting page (Maybe this means buying a VM to host my site?\n\nGood to make lists and goals. I made the goal to run at least 30 miles every month for the rest of the year. Been doing it since August and running has become so therapeutic. Today I took a nap before the run which was nice but had me feeling groggy. Decided to crush a run anyways because my boy Q was with me and we agreed on going for a run. I can confidently say that after our run we both felt like new men. Exercise is so important; it filters your blood and provides positive stress for the body. Important to listen to your body, but I also find running to be a great mental exercise. A task you can do to master the voice in your head saying \"I'm not sure I can keep doing this\". It has moments that suck but doing hard things makes you feel good once you've done them. Running almost feels psychedelic in a way.\n\n![Psychedelic fantasy castle with a runner on it](https://miro.medium.com/0*gPFwTYI_-sNoNCPU)\n\nThese AI art generators have a lot of work to do😂 . I would not mind running around that castle though👀 .\n\n10/30/22\n\nConor Jay Chepenik",
  "wordCount": 478,
  "readingTime": 2.0037735849056606,
  "claps": 0,
  "voters": 0
}