{
  "id": "6abafdc25a28",
  "title": "Day 112",
  "createdAt": "2022-07-12 20:56:42",
  "tags": [
    "elderly-knowledge",
    "relatives",
    "marriage",
    "adulting",
    "pain"
  ],
  "url": "https://chepenikconor.medium.com/day-112-6abafdc25a28",
  "content": "# Day 112\n\nSpoke with my great Grandmother today which was really nice. Always good to call family if you need a mood boost. She urged me to marry my girlfriend which is probably a good idea. My girl doesn't want a big ceremony or a party. She said if we ever get married she just wants to go down to the courthouse and do it. Not sure what I want to be honest. Often I see weddings portrayed as this massive party and it seems to get away from the whole point of the wedding; the joining of two people for the rest of their lives. While I strongly believe in god I'm not worried about marriage. I think ethics and morals change over time as technology changes and that the bible is a guide not a literal manuscript about how to live your life. Another reason I'm hesitant on marriage is because a part of me was always scared to tie the knot. I've seen so many divorces growing up in the States it made me scared to get married. I didn't think it was necessary to marry someone in order to spend the rest of your life with that person. You can just go ahead and spend the rest of your life with that person. The more I think about this though I do think there is some reasoning behind marriage. Bonds are important. Your words and intentions are important. Committing yourself to one person is key. It ties your finances together, it means you are legally and ethically obliged to be with the person for the rest of your life. While many marriages don't work out the opportunity cost to leave someone is much greater after marriage because you have to hire a lawyer, go to court, separate estates, etc. No one really tells you this shit as a kid and the only reason I have some idea about it is that I lived through my parents getting divorced.\n\nAdulting is awesome and it is also a grind. Nice having the freedom to do as you please but also a bitch having to face the consequences. That said, pain is one of the best teachers and it is adulthood where people tend to learn from pain since many guardians and parents try and shield their loved ones from said pain.\n\nMy girl also grew up in a separated household so I think she has similar ideas about marriage. While it has helped us both understand where we are coming from I do think there is something so beautiful about \"tying the knot\". Who knows how the future plays out but these are things I would like to think through as I continue on as a \"adult\". I'd like my child to grow up in a loving household and have the confidence to get married. It's liberating just admitting that my own fears and doubts about marriage stem from my upbringing. My parents did an incredible job raising my sisters and me even after separating. It was ultimately the right decision for them and I've got to respect that and move on. The fact they were able to co-parent even after the divorce says a lot. All the more reason to try and make things work in a marriage with my current girlfriend.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.tiktok.com%2Fembed%2Fv2%2F7093979497904639278&display_name=tiktok&url=https%3A%2F%2Fwww.tiktok.com%2F%40sara_underwood%2Fvideo%2F7093979497904639278&image=https%3A%2F%2Fp16-sign.tiktokcdn-us.com%2Ftos-useast5-p-0068-tx%2Fea7850638cc2498aaf36408d77bd4894_1651695817%7Etplv-tiktok-play.jpeg%3Fx-expires%3D1658260800%26x-signature%3DUlSfxCjGy9aweAq13GantrGyPDI%253D&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=tiktok\" title=\"\" height=\"700\" width=\"340\"></iframe>\n\nMy sister sent me this TikTok and while I don't use that app anymore I do think this would be an incredible thing to do. It's amazing how cool the houses are when people build it themself. Amazing how powerful incentives are. If you are just getting paid in fiat to build a house most people aren't anywhere near as motivated to do their finest work. However, if you take the time to build your own it's likely you will do a damn good job. My Grandfather is a developer in Georgia so maybe I should talk with him. Oh life you are full of so many amazing things. :) I think if I built a house like this it would be pretty damn easy to live a happy ever after with my girl and child(ren). Who knows what the future holds but I'm excited for it :D\n\n7/12/22\n\nConor Jay Chepenik",
  "wordCount": 708,
  "readingTime": 2.671698113207547,
  "claps": 0,
  "voters": 0
}