{
  "id": "6f17bb315ec5",
  "title": "Day 113",
  "createdAt": "2022-07-13 22:29:22",
  "tags": [
    "bitcoin",
    "plebs",
    "meetups",
    "bright-future",
    "podcasts"
  ],
  "url": "https://chepenikconor.medium.com/day-113-6f17bb315ec5",
  "content": "# Day 113\n\nWent to a Bitcoin meetup last night and had an incredible time. It was a bit awkward at first since I arrived on time and there was only one other person, but slowly more Bitcoiners started showing up and it turned out to be an incredible time. Stayed the whole time from 7–10 and the last 2 hours flew by at lightning speed. Could've stayed longer but I wanted to get back to my girlfriend. I'm super excited for the next meetup in a month. It feels so good to talk with other Bitcoiners and see that many people out there understand why Bitcoin is so important to humanity as a whole. People were joking that Bitcoin is a cult last night and while they might be correct it's a cult that wants to see a better world. Fascinating to see how different minds view Bitcoin and hear a plethora of perspectives. As I've mentioned in previous posts I'm not sure if I will stay in Boston or move on, but I do know that wherever I go I want to leverage Bitcoin to create a community. People in this space are so friendly and intelligent. There is a ton to learn from all of them and new perspectives to consider that I had not before.\n\nI'm also grateful that I'm living in the time I am. It feels good to be a part of something bigger than myself that I truly care about. I'm sure the future will also have its ups and downs, but bitcoin is only getting monetized once. Many look at the USD spot price and think it's too late now, but that couldn't be farther from the truth. Bitcoin can change the way the world cooperates. It can lower people's time preferences. It can allow people with a smartphone to have a bearer asset that can't be seized by some banker clicking a button. It can completely change the incentive structure on a global scale so more people are trying to provide value rather than align themselves next to powerful entities.\n\nI crushed two awesome pods today. 9.1% CPI print today was pretty wild. It looks like the macro backdrop continues to shit the bed but the more I listen to Bitcoin pods the harder I want to stack. Like Gigi said in the Blue Collar Bitcoin pod bear markets are great because you get to stack cheap corn and there is a lot less noise and B.S from shitcoiners. As someone who wants to see Bitcoin benefit more plebs I also like to see a cheaper USD price so those with less money can benefit if btc does what btc does. It's so funny to think back in the 80s when the Fed was fighting inflation they were bitching about how gold was becoming too valuable and now we are seeing something similar with Bitcoin. Not exactly the same and the MSM seems to be doing victory laps now that bitcoin is back around 19k but I'm still so hopeful. God I love this space :D\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F0MKBNjr1Bbr6pn8YrGouEp%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F0MKBNjr1Bbr6pn8YrGouEp&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f7923738c1f4103eb6583a075&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F4xFvpjOHRsSjs2qhmPZkMR%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F4xFvpjOHRsSjs2qhmPZkMR&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fbaa389fa3710369beb2acc71&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nThe first one is a little more serious while the second one had me crying laughing. Bitcoiners are fr the best. Don't doubt anon. We going up with this ship or we ending up homeless: ride or die.\n\n7/13/22",
  "wordCount": 553,
  "readingTime": 2.086792452830189,
  "claps": 0,
  "voters": 0
}