{
  "id": "700ebad05ce9",
  "title": "Day 142",
  "createdAt": "2022-08-12 00:26:43",
  "tags": [
    "article",
    "bitcoin",
    "central-banks",
    "fiat",
    "money"
  ],
  "url": "https://chepenikconor.medium.com/day-142-700ebad05ce9",
  "content": "# Day 142\n\nI'd like to get ready to gear up for another B[itcoin](https://twitter.com/hashtag/Bitcoin?src=hashtag_click) Magazine Article and I think it will be about incentives. To get started I'm going to flush out some of my ideas for today's post and use it to build up my overall article. The working title is Incentives Run The World. Bitcoin is the perfect incentive system at every level. I will start by working my way up from the individual to nation-state. While I'm most hopeful that Bitcoin can help empower sovereign individuals, it is hard to believe that more and more nation-states won't also adopt the technology as the network grows in size. The Bitcoin rabbit hole leads people down energy, finance, philosophy, history, computer science, and a bunch of other rabbit holes. The more you learn the more apparent it becomes how perfectly laid out the incentives of this network are at every single level. Ironically, this is why it is so hard for most to grasp. In order to have a good understanding of Bitcoin you must commit hundreds, if not thousands of hours. At which point you are just getting started because \"No one has found the bottom of the Bitcoin rabbit hole\" -[ Jameson Lopp](https://twitter.com/lopp). It almost feels like a cheat code for life once you start to grasp what Bitcoin means for humanity. An a-political, truly scarce, decentralized ledger that is being adopted by the masses from the ground up. This is a form of money that humanity has never had until an anonymous person or group named Satoshi Nakamoto solved the [Byzantine Generals Problem](https://river.com/learn/what-is-the-byzantine-generals-problem/). Let's dig into why individuals will adopt Bitcoin.\n\nINDIVIDUALS\n\nSocialism doesn't work because people are self interested. I'd love to live in a utopia where everyone cooperates and helps their neighbor. I firmly believe that giving is one of the best feelings in the world when you give because you want to do so. However, it doesn't feel very good to give when you are forced to do so. If you take away the ability for people to keep the fruits of their labor by forcing them to give up everything they produce for \"the greater good of society\" you take away the incentive of people to work. The world is not a utopia no matter how badly socialists want it to be. It is one thing to demonize monopolistic practices because they hinder the free market from operating properly. It is a completely different thing to demonize profit. Those who do so are either malicious or incompetent because if people can't make a profit they won't spend their time and resources making something of value. That is unless they are forced to do so by the threat of violence. At which point people will do a much worse job because someone working for profit is a lot more motivated to do a good job than someone working because they are being forced to do so. One monopolistic practice hindering our modern world is the monopoly central banks have on fiat currency. By planning what money costs and having an ability to create fiat without facing much of an opportunity cost for doing so the free market is hindered. This leads to distorted price signals and individuals being pushed out on the risk curve. Luckily,\n\n> \"Every day that goes by and Bitcoin hasn't collapsed due to legal or technical problems, that brings new information to the market. It increases the chance of Bitcoin's eventual success and justifies a higher price.\"- Hal Finney\n\nWhile Bitcoin becomes less risky everyday it exists, in the beginning it was incredibly risky to put your fiat currency into this new technology. Many [projects that came before Bitcoin](https://river.com/learn/bitcoins-predecessors/) failed in the long run, but various ideas from these projects were referenced in Satoshi's [white paper](https://bitcoin.org/bitcoin.pdf). Overtime more people will come to Bitcoin to protect their purchasing power as long as the network keeps operating and adding blocks of transactions every ten minutes~. The more people who see the impact fiat currency debasement has on their purchasing power the more likely they are to look for alternatives to protect said purchasing power. This is what initially attracted me in early 2017. My friend told me about this new form of currency that had appreciated greatly since its inception. I watched the documentary [Banking On Bitcoin](https://youtu.be/ByvbAi924TI), which I still highly recommend to anyone interested in Bitcoin. It helped open my eyes to the fact money is just a ledger. Unfortunately, I didn't fully go down the rabbit hole at that time. I spent the first couple years of my journey looking at my crypto exchange balances as my bitcoin and alt-coins did a 10x only to be depressed when my gains came crashing down after the bull market. Like most who are initially attracted to crypto for the speculation I missed the whole point of not having to rely on any counter parties to verify and hold bitcoin. While it sucked losing all the fiat gains I had made it taught me some very valuable lessons.\n\n_**\"The danger is if people are buying bitcoins in the expectation that the price will go up, and the resulting increased demand is what is driving the price up. That is the definition of a BUBBLE, and as we all know, bubbles burst.\" - Hal Finney**_\n\nAs Hal so eloquently pointed out in those early days when something goes parabolic super rapidly it will likely crash just as rapidly. This was my first hint at why having a low-time preference is so important. It was also an important lesson for myself to focus on Bitcoin *not crypto*. I kept an interest in Bitcoin, but it wasn't until 2020 that I really started digging into the rabbit hole. When I got a stimulus check in the mail for doing nothing that set off an alarm inside my mind. While free money is always nice it was obvious that there would be consequences to the United States Government handing out cash to its citizens for doing nothing. I didn't fully understand why at the time. It was annoying me that I couldn't put my finger on what was wrong so I started down the Bitcoin rabbit hole which led me to Austrian economics and how money actually works. It was both frustrating and enlightening to learn about central banks, Bretton Woods, and how money works in general around the world. Once you understand that Fiat is latin for \"by decree\" it starts to make sense why many central banks will fight tooth and nail to not lose the ability to control money. The harder central bankers push to control their credit based systems the more people who wake up because they get frustrated watching their purchasing power decline rapidly in inflationary environments. Being self-interested is not a bad thing. It is what motivates individuals to work hard so they can enjoy the fruits of their labor. Bitcoin optimizes for people enjoying the fruits of their labor while the Keynesian model of ever expanding credit steals the fruits of people's labor. No one knows how it ends but more and more Bitcoiners seem to be putting their \"fruits\" in bitcoin instead of fiat.\n\nCOMPANIES\n\nVisa and Mastercard have a combined market cap of 775 billion~ dollars at the time of this writing. They charge roughly 3% for their services which eats into the profits of the companies accepting debit & credit cards. Those costs often get passed on to consumers. While these cards have made it much easier to transact and allowed people to go cashless they still seems quite high. I can imagine many businesses are eager to break away from Visa and Mastercard if possible. Some companies are cash only and while I respect that I'm sure they miss out on a lot of business from younger generations who just never carry any cash on them. By accepting bitcoin these business not only avoid the fees, but they can also rest assured that transactions received are for final settlement. No more waiting 90 days to make sure a credit card doesn't get charged back. Bitcoin will massively disrupt many financial rails we have today. Many in the western world might not appreciate what a big deal this is, but those in less developed countries know perfectly well what a pain it is to have parasites butting in to take a cut. Bitcoin doesn't stop there though. Energy companies and grid operators also have a massive incentive to adopt a Bitcoin strategy. Rather than just having one buyer that demands more energy during the day than at night, the grid could have a second buyer who is willing to consume energy 24/7/365. Bitcoin miners monetize energy that would otherwise go to waste. There is the upfront cost of buying an A.S.I.C and having the technical whereabouts to maintain and run said A.S.I.C. However, this means more jobs for the talented individuals who understand how to do so and more energy efficient grids. It amazes me how much fear, uncertainty, and doubt gets spread about Bitcoin's energy usage when the reality is Bitcoin can stabilize grids and make the capital put up to build out green energy infrastructure much less risky. If you wanted to build a massive hydro plant in a rural area before there was Bitcoin it would be very hard to raise the capital because investors wouldn't want to put their money up for a power plant that didn't have buyers of said power. With Bitcoin the investors can rest assured there is always a buyer for that power 24/7/365. While I think there will be a point when miners just keep the Bitcoin, they can also sell the Bitcoin for fiat at any point in time. Bitcoin trades 24/7/365 and these power plants can sell their freshly mined bitcoin at any point for fiat to pay their bills. Since fiat depreciates over time the most efficient miners will be able to hold and accumulate bitcoin while the less efficient miners will have to sell for money that is constantly being debased by \"the money printer\". Thus, the best companies will thrive over the long run while the inefficient operators will have to adapt or die. It's the free market doing its job. The more I learn about how grids operate the more apparent it becomes that Bitcoin can help usher in an abundant energy future where energy prices aren't going parabolic because of poor decisions made by central planners who are printing money at unheard of rates. I don't want to see hyper inflation but when central banks create money out of thin air via \"quantitative easing\" it results in more money chasing the same amount of goods. My hope is that as more people become Bitcoiners they will help others take the 🍊  💊  . Many love to blast Bitcoin Maximalists for being mean, but when you look at it from a first principals perspective they are some of the best people I've ever met. Most are willing to help onboard as many people as they can because they see Bitcoin as the way to a pro-human future where we have an abundance of food, energy, and choice. While I do appreciate the compliments received after writing an article my main motivation is because I want individuals to onboard to the Bitcoin network before companies and then nation-states onboard. In my opinion, helping people understand that Bitcoin is the life raft instead of going out on the risk curve because the Fed is devaluing everyone's dollars is one of the most noble things a person can do. History has shown that the free market will ultimately end up with one form of money winning out. Before Bitcoin that was gold and that got turned into fiat to keep up with the speed of commerce. Now that we have Bitcoin I believe fiat will continue to rapidly lose its purchasing power as more people and businesses realize that Bitcoin can't be debased by a single entity.\n\nNATION-STATES\n\nThis one is a double edged sword for me. I want as many individual people to adopt Bitcoin before the nation-states start accumulating. However, I'm hopeful that the nation-states who do end up adopting Bitcoin will be able to utilize its fiat price appreciation to create a more abundant society for the individuals that live there. At the time of this writing two countries have adopted Bitcoin as legal tender. El Salvador and the Central African Republic. According to [https://worldpopulationreview.com/country-rankings/legatum-prosperity-index](https://worldpopulationreview.com/country-rankings/legatum-prosperity-index) out of 167 countries El Salvador ranks 98 and Central African Republic ranks 165 on the prosperity index. Neither of these countries is in the top 50% of prosperous nation-states and they were the first to adopt Bitcoin. I believe this trend will continue since the most prosperous countries have much more to lose by not being able \"to decree\" what happens with their country's money. Before Bitcoin, El Salvador was a dollarized economy. Now they allow both USD and BTC to operate as Legal Tinder. The Central African Republic had the CFA franc as its currency which according to [wikipedia](https://en.wikipedia.org/wiki/CFA_franc) \"Critics point out that the currency is controlled by the French treasury, and in turn African countries channel more money to France than they receive in aid and have no sovereignty over their monetary policies.\" It is encouraging to see nation-states who are at the mercy of central banks they have no control over adopt Bitcoin to get around these monopolies. I imagine at some point the richest nation-states will adopt Bitcoin so they can trade with other countries, but it is the wealthiest nations with monopolies on their own currency who will be the last to adopt it because they have the most to lose. It is the poorer nations who don't have complete sovereignty over their money that will look to bitcoin to protect their purchasing power because they have the least to lose. If you are a nation-state and you can't create your own money to fund government spending you are much more likely to invest in a truly scarce currency than another nation-state which can create both bonds (IOUs) and currency out of thin air. While at the time of this writing El Salvador might not be in the green in terms of where they bought Bitcoin on the spot market, they have experienced a massive boost in tourism and interest in their country. I will say personally I would love the opportunity to visit El Salvador and use bitcoin to buy stuff. El Salvador has and will likely continue to experience a massive influx of tourism as more Bitcoiners, like myself, start to plan trips down there so they can use this new form of money. The cyber hornets don't mess around and as more and more countries notice the impact Bitcoin can have on their local economies the logical conclusion is to adopt it as legal tinder and attract tourists to bolster their economy.\n\nCONCLUSION\n\nIt might get messy. Rich nations, The World Bank, and The I.M.F aren't just going to toss up their hands and go welp it was fun controlling fiat while it lasted. They will fight tooth and nail to protect their interests and hinder Bitcoin's adoption. Luckily, top down controls can only go so far. Individuals, companies, and nation-states are all self-interested. No one likes a parasite when they are having to face the consequences of that parasite draining their resources, time, and value. Over a long enough time horizon it seems Bitcoin will bleed these parasites dry as they lash out and try to impose top-down controls across the world. Bitcoin can fix energy, monopolistic central banks, credit based systems, and massive surveillance security states. It might get messy, but the more people we can orange pill and convince to run a node the better. Individuals, companies, and nation-states theoretically no longer need banks to transact. If they take the time to go down the rabbit hole they can use a raspberry pi, a terabyte hard drive, and an ethernet cable to transact with anyone in a peer-to-peer manner which means no parasitic middle men butting in to take a cut. It brings me a warm tingly feeling thinking about the freedom, prosperity, and abundance Bitcoin can bring to the world. As the cliche goes \"Fix the money; Fix the world.\n\n8/11/22\n\nConor Jay Chepenik",
  "wordCount": 2764,
  "readingTime": 10.430188679245283,
  "claps": 0,
  "voters": 0
}