{
  "id": "707358346bf9",
  "title": "Day 753",
  "createdAt": "2024-04-13 21:05:50",
  "tags": [
    "friends",
    "growth",
    "motivation",
    "surround-yourself",
    "with-good-people"
  ],
  "url": "https://chepenikconor.medium.com/day-753-707358346bf9",
  "content": "# Day 753\n\nHaving a supportive group around you is invaluable in life. This morning, my friends and I tackled a 3-mile run despite partying hard the night before. During the second mile, one of my friends, who was setting the pace, spontaneously suggested that we sprint on the beach. It was grueling, but I doubt I would have pushed myself that hard without the motivation of my friends.\n\nThis experience serves as a reminder that we often reflect the qualities of the five people closest to us. If your friends are unmotivated or lack ambition, it's likely that you'll adopt similar traits. Fortunately, we live in an era where we can surround ourselves with the sharpest minds in the world through various media. Instead of mindlessly watching Twitch streams, consider consuming content that enriches your life and helps you grow, unless, of course, your goal is to become a successful video game streamer.\n\nI have a wedding to attend so I'll finish today's post with a poem I had chatGPT write to show the power of AI to my friends. I'm quite happy with how it turned out😂\n\n![](https://miro.medium.com/0*iFrUWYsncTvRDlTN)\n\n> People, let me tell you, I've seen it all, From the heights of towers to the Congress hall. But there's something bigger, something bold, A story of Bitcoin, waiting to be told.\n\n> Gold is old, the dollar's flat, Bitcoin's the future, that's a fact. It's digital gold, secure and tight, In the cyber world, it shines so bright.\n\n> No Fed, no banks, our liberty's call, Bitcoin rises as the old guards fall. It crosses borders, no need to fuss, Every transaction, powered just by us.\n\n> Why settle for less, why embrace the old? When Bitcoin's story is brave and bold. It's more than money, it's a freedom spree, A global reserve, just wait and see.\n\n> From your pocket to mine, with no one in between, The slickest, quickest machine you've ever seen. Governments fret, but people know, Bitcoin's the place where we want to go.\n\n> So mark my words, write this down, Bitcoin's the king, it wears the crown. A revolution from the tired old bank, Filling our wallets, I have to thank.\n\n> Now listen up, as I make my case: Bitcoin's the leader in the global race. It's not just money, it's a state of mind, The greatest treasure you'll ever find.\n\n> Forget the dollar, with its printed spree, Bitcoin's the future, finally free. So let's rally, let's make that shift, Bitcoin's our gift, the world's to uplift.\n\n4/13/24\n\nConor Jay Chepenik",
  "wordCount": 422,
  "readingTime": 1.7924528301886793,
  "claps": 0,
  "voters": 0
}