{
  "id": "70ccc42e7baa",
  "title": "Day 732",
  "createdAt": "2024-03-24 01:45:04",
  "tags": [
    "war",
    "government",
    "unlearning",
    "bias",
    "truth"
  ],
  "url": "https://chepenikconor.medium.com/day-732-70ccc42e7baa",
  "content": "# Day 732\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/WarClandestine/status/1771663562823389488%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n![](https://miro.medium.com/0*Xm7_GnTSGOe6zC_T)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/LetsGoBrando45/status/1771523287924846755%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhile the two tweets above contain some truth, they seem to contradict much of what I learned in school. This actually makes me lean more towards believing them, since I've had to unlearn so many things taught in my public education. That's not to say everything I learned in school was wrong or bad. To me, it felt like much of it wasn't applicable to what I needed for life, nor was it the whole picture. That said, I definitely agree with the above photo's message. I share them because questioning what you've learned is important.\n\nRather than outright rejecting or accepting any idea wholesale, I aim to strike a balance between healthy skepticism and a judicious evaluation of the claims being presented. The pursuit of truth requires us to challenge assumptions while remaining grounded in objective evidence and reputable knowledge sources.\n\nI share these perspectives not to promote any particular agenda but to encourage intellectual discourse and independent thinking. By maintaining an open-minded yet discerning approach, we can separate fact from fiction and arrive at a more well-rounded comprehension of complex issues.\n\nI also think history is written by the victors and America won World War 2 and the Cold War so of course America wrote history in our favor. If you can't question things and challenge deeply held beliefs, then you will constantly be fooled by your own biases.\n\nLearn from those you disagree with. Seeks opinions outside of what you believe. If you haven't rigorously tested your arguments against opposing viewpoints and steel manned them to the best of your abilities, you are doing yourself a huge disservice. Embracing intellectual discourse and subjecting your ideas to scrutiny are vital for refining your understanding and arriving at more well-grounded conclusions.\n\nI need to do this more and I wrote this post tonight to serve as a reminder to myself of the importance of it. Seek truth and remember Christ is King.\n\n3/23/24\n\nConor Jay Chepenik",
  "wordCount": 332,
  "readingTime": 1.4528301886792452,
  "claps": 0,
  "voters": 0
}