{
  "id": "722587707546",
  "title": "Day 272",
  "createdAt": "2022-12-19 20:41:31",
  "tags": [
    "bitcoin",
    "weimar-germany",
    "predictions",
    "hyperinflation",
    "inflation"
  ],
  "url": "https://chepenikconor.medium.com/day-272-722587707546",
  "content": "# Day 272\n\nRead an awesome substack that went over hyperinflation in Weimar Germany. I recommend reading to see why it is important to protect yourself from what's coming.\n\n> [**Why WiFi Money is the Best Way to Survive Hyperinflation**](https://bowtiedtetra.substack.com/p/why-wifi-money-is-the-best-way-to)\n\nAnyone who tells you they know exactly what the future holds is lying. However, some people are better at predicting what comes next than others. Like Mr. Bowtiedtetra here. Central banks around the world are likely going to print a bunch of money and if you think inflation is bad now there is a good chance it gets worse. LIKE MUCH WORSE!!!!!!! I did not realize how many similarities there are today to Weimar Germany. This quote really drove it home for me.\n\n> Many of the early warning signs of hyperinflation that were present in Germany during the early 1920's are with us now in 2022.\n\n> **Speculation** - Germans speculated in shares of industrial companies, modern people are speculating in puppy coins and WallStreetBets stonks.\n\n> **Political extremism** - People went nuts then, and they're going nuts now.\n\n> **Extreme money printing due to an \"emergency\"** - Germany printed due to World War I, America printed because of COVID.\n\n> **Increased gap between rich and poor** - Self-explanatory.\n\n> **National deficit** - Germany's was caused by reparations payments, ours by spending on nonsense.\n\n> **Riots and protests** - Political protests, workers going on strike, and food riots all played a role in the Weimar Republic. In America we haven't seen food riots yet but political protests and riots are common, and labor movements are growing in power.\n\n> **Destruction of the middle class** - The middle class in Germany was squeezed from both the bottom and the top. Laborers who were part of a union faired better than the professional class, since they were better able to collectively bargain for wage increases. The upper class prospered due to holding assets.\n\n> **Blaming inflation on a war** - Many tried to blame WWI for the inflation in Germany. Some are attempting to blame Putin for inflation now.\n\nAs far as I can tell Bitcoin seems like a nice alternative to combat this hyperinflation the world will likely experience if Central Banks start a soft default by printing money to pay their debts. Unlike Gold Bitcoin doesn't need as many central intermediaries to facilitate the buying and selling of it. Exchanges play a critical role for no-coiners to onboard, but they aren't necessary to transact in a peer-to-peer fashion. Companies like Voltage and many others who provide Bitcoin infrastructure are nice, but they aren't a requirement for those willing to take the time to learn how to run a node on their own computer. If you held gold throughout the hyperinflation of Weimar Germany your purchasing power was kept intact but no one, at least not to my knowledge, was trading gold bars for food, goods, and services on a consistent basis. I'd imagine most would go and exchange the gold for a set amount of paper fiat currency so they could then purchase what they needed. However, I'm sure many felt gutted during gold's massive downswings. No one likes watching their fiat denominated wealth drop by massive amounts.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/dylanleclair_/status/1396518689177063429&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLook at this chart and really think to yourself if you would've been able to hold your gold through these massive drawdowns. Now ask yourself the same thing about Bitcoin? If you hold bitcoin at least. It's not easy to hold unless you have spent a lot of time studying history and computer science to see why it is likely Bitcoin will be worth many multiples what it is now in the coming years. Like I said at the onset of this Medium I have no way to know what the future holds, but I do predict that 1 bitcoin will be worth a lot more than 16.5k U.S dollars come 2030. Bitcoin is every good & service in the world/21 million btc. The U.S dollar is every good & service/however much the Fed & Treasury want to create. There is no limit to the amount they can print. 21 Million or infinity anon? I think there is also a lot of value in creating your own business and holding other hard assets like real estate, and hell maybe even some gold under your bed. However, I don't think anything will perform as well as bitcoin in the coming years. My hope is that Bitcoin can allow for a smooth transition to a better monetary standard so we don't see people doing arts and crafts with U.S dollars in 10 years when they have printed so much that they have to create new 1000, 10,000, and 100,000 denominated dollar bills because the current set of 1, 2, 5, 10, 20, and 100 dollar bills are essentially worthless.\n\nMy hope doesn't mean shit though. I try and write articles because it makes me feel good knowing I'm helping see there is a better system, but I can't go and buy Bitcoin for the masses. People have to prepare accordingly on their own. Do your own research and don't just trust me. I'm so grateful to have gone down the Bitcoin rabbit hole, but there were many mistakes made along the way. I dabbled in worthless shitcoins, I shilled Bitcoin to my family at the top and they got frustrated when it dropped, I've even lost some Bitcoin with a fat finger accidental click. These mistakes are valuable lessons and I wouldn't change a thing because without these lessons there is no way I'd have the conviction to keep buying bitcoin all the way down from 69k to current prices. Maybe Central Banks don't initiate Q.E infinity, maybe a better alternative comes along, maybe humanity is collectively to stupid to adopt bitcoin in time and it takes 100 years before hyper-bitcoinization. I sure as hell hope not but to say for a fact none of these things are a possibility is a lie. As far as I can tell though it seems a lot more likely Central Banks will print like they have never printed before, there is no second best and all other alt-coins will go to zero against BTC over a long enough time horizon, and I have enough faith in my fellow man to get onboard when they see that their purchasing power is being absolutely destroyed by bad actors.\n\nSo to sum it up. Hyperinflation causes things to get ugly. Without a limit to how much debt Government's can rack up it seems they will print money out of thin air to pay that debt despite the problems it causes. Bitcoin doesn't allow anyone to print more of it. Maybe it can save humanity the pain of having to relearn a lesson we have already learned multiple times. Weimar Germany seems to be the most famous example, but Venezuela, Zimbabwe, and plenty of other countries have experienced similiar fates. Fiscal austerity is important, but man do Central Banks seems to hate it. Makes sense, when you have a monopoly on credit why not print money?\n\n![Central Banks!](https://miro.medium.com/0*IU_vvK2ZvL9tjPFF.jpg)\n\n12/19/22\n\nConor Jay Chepenik",
  "wordCount": 1209,
  "readingTime": 4.7622641509433965,
  "claps": 0,
  "voters": 0
}