{
  "id": "7484df522e8a",
  "title": "Day 185",
  "createdAt": "2022-09-24 02:20:28",
  "tags": [
    "bitcoin",
    "poker",
    "saylor",
    "john",
    "bitcoin-rapid-fire"
  ],
  "url": "https://chepenikconor.medium.com/day-185-7484df522e8a",
  "content": "# Day 185\n\nHighly recommended giving up 3 hours to listen to the GIGACHAD. Trust me if you've started your journey down the Bitcoin rabbit hole you won't regret it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FbOzm7BlGooA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DbOzm7BlGooA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FbOzm7BlGooA%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nWe are all on a mission and some people get lost because they don't focus. Nowadays getting lost is easier than ever because everything on good ol TCP/IP is trying to grab our attention. This morning I woke up feeling fantastic and I think it had to do with the fact that my mission is becoming clearer after every Bitcoin meetup.\n\nWould also like to note I was having some weird dreams. Don't remember all of them but I do remember being naked at an airport and then someone gave me some nurse pants. The nurse pants helped but I had a cut on my foot so we went to the bathroom and the person who gave me the pants kept slipping in the bathroom because my blood was everywhere. Weird dream indeed but I woke up naturally and felt amazing.\n\nThe dream had nothing to do with my mission. However, I was happy to wake up from such a weird dream lol. I felt so energized which is surprising because I'm not proud to admit I ate a McFlurry and nuggets last night because the girlfriend wanted fries and a McDonalds so on my way home from my Bitcoin meetup I stopped at \"the golden arches\" of giving America obesity hahahaha. Maybe my stomach is evolving lmao. Or maybe McDonalds is putting better chemicals in their food? Who knows. Maybe hanging with Bitcoiners just has me extra juiced up to continue my mission of helping others discover Bitcoin.\n\nThis video of Michael and John just makes me feel Zen. Mike has some amazing insight and I appreciate his perspective. I could listen to this man talk for ten hours straight. No joke.\n\nThe dude gets sales and he gets this new monetary system. It is truly an amazing thing to listen to someone so succesful rift on how this changes for the world for the better and I'm going to cut this post here because we had poker night hosted by Datadog and I just want to finish the last hour of this podcast after a fun night of gambling house money.\n\n9/23/22\n\nConor Jay Chepenik",
  "wordCount": 386,
  "readingTime": 1.4566037735849056,
  "claps": 0,
  "voters": 0
}