{
  "id": "74e99346946e",
  "title": "Day 770",
  "createdAt": "2024-05-01 00:30:09",
  "tags": [
    "governments",
    "bads",
    "goods",
    "technology",
    "nature"
  ],
  "url": "https://chepenikconor.medium.com/day-770-74e99346946e",
  "content": "# Day 770\n\nIt seems the Government is getting very nervous about Bitcoin and lashing out. I guess it goes like this.\n\nFirst they laugh at you.\n\nThen they mock you.\n\nThen they fight you < (We are here)\n\nThen you win.\n\n![[https://x.com/Truthcoin/status/1785409946625900711](https://x.com/Truthcoin/status/1785409946625900711)](https://miro.medium.com/1*RnfpNvrKczskM3kFSBPaeA.png)\n\nI heard a discussion today arguing that everything the government does is far more satanic than divine. This resonated deeply with me.\n\nThe government's actions starkly contradict the divine principles of justice and morality. Taxation represents legally sanctioned theft - a coerced confiscation of private property under threat of violence. In a truly free market system, which operates on consent, individuals voluntarily choose which goods to buy. However, governments tend to trade in bads. If you don't follow their decrees they will use intimidation and the deprivation of liberty to accomplish their ends. Failure to pay taxes leads to armed agents violating personal spaces, seizing assets, and imprisoning individuals. Such brutal tactics are more reminiscent of satanic subjugation than any righteous governance.\n\nTo clarify, this critique is not an indictment of all government officials as inherently evil. History shows that there are plenty of based leaders. However, when a government disregards the fundamental principle that its legitimacy stems from the consent of the governed, it quickly degenerates into a tyrannical entity that tramples the innate rights of its citizens.\n\nThe current tax system and government overreach exemplify a satanic disregard for the sanctity of individual liberty and private property. Regimes may attempt to subvert the natural order through force, but such efforts are ultimately futile. \"Nature does not hurry, yet everything is accomplished,\" as Lao Tzu wisely stated. For a society to be truly moral and divine, it must realign with the eternal harmony of consent, voluntarism, and inviolable natural rights.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FvfbndRTlsg4%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DvfbndRTlsg4&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FvfbndRTlsg4%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"The conversation in question\" height=\"480\" width=\"854\"></iframe>\n\nAnyways, I really do believe that things will correct for the better. Another quote I love is pessimists sound smart but optimists get rich. I am by no means the wealthiest guy out there but I have an incredibly rich life and I'm grateful to God for that. So to finish this essay off on a positive note this tech has me very excited.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F1KEtxTQUzxY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D1KEtxTQUzxY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F1KEtxTQUzxY%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nEnvision an immersive VR experience that seamlessly blends physical exercise with captivating gameplay. Imagine strapping on your headset and stepping into a realistic, high-octane shooter game like Call of Duty, where the virtual world feels breathtakingly authentic. As you navigate through the virtual battlegrounds, your body moves in sync with your avatar, transforming gaming into a full-body workout.\n\nThe possibilities are endless with the integration of a 360-degree treadmill, allowing you to explore vast virtual landscapes while staying physically active. Imagine traversing through lush forests, scaling treacherous mountains, or sprinting through war-torn cities, all while burning calories and improving your cardiovascular health.\n\nIt's only a matter of time before industry giants like Disney capitalize on this revolutionary technology, bringing it to the masses as a consumer product. The potential for creating immersive, physically engaging experiences is staggering, and the positive impact on people's health and well-being is undeniable.\n\nAs we embrace innovation and push the boundaries of what's possible, the future looks bright. By fostering a spirit of optimism, creativity, and determination, we can continue to build groundbreaking technologies that not only entertain but also promote healthier lifestyles. The path forward lies in our collective ability to recognize and call out bad actors while celebrating and supporting those who dare to create and innovate for the betterment of society.\n\nWhich feels a bit ironic because some of the woke stuff coming out of Disney these past couple years was not the best, but Disney is a big company and the dude who built this built something that has me quite excited. I loved Modern Warfare 2 growing up but the video games my children's children will play one day will knock my socks off. Which is probably how the video games I played made my grandparents feel. Haha history does not repeat but man does it rhyme.\n\n4/30/24\n\nConor Jay Chepenik",
  "wordCount": 672,
  "readingTime": 2.7358490566037736,
  "claps": 0,
  "voters": 0
}