{
  "id": "7639e35c0063",
  "title": "Day 67",
  "createdAt": "2022-05-28 16:51:14",
  "tags": [
    "bitcoin",
    "baby",
    "proof-of-work",
    "love",
    "friendship"
  ],
  "url": "https://chepenikconor.medium.com/day-67-7639e35c0063",
  "content": "# Day 67\n\nHad an awesome time hanging with my buddy, Lierce, last night. Introduced him to some of my boys in Medfuhd and it was great watching worlds collide. Always fun introducing friends groups and even better when they get along. It has been great to see the response and love I've received from my close friends. Having a kid changes things for the better. I'm so lucky to have people in my life who have been so supportive and reminded me it is without a doubt best to have this kid. I knew this anyways but it just reaffirms my choice seeing the reactions of close friends and family. Life is special and bringing it into this world is how good will win out. The sinister will die alone while the righteous pass filled with love. You can just feel it in your heart when you're doing the right thing. Langauge doesn't do it justice. Some feelings just can't be explained without actually experiencing them. A mushroom trip is another one of these things lol.\n\nHad the pleasure of going on the Nyc & Griff show this morning. Always incredible meeting other bitcoiners and getting the chance to podcast with them. Obviously, the three of us are biased towards Bitcoin so it was pretty much a big bitcoin circle jerk but you can tell via the passion our hearts in the right place. I never see anyone talking so passionately about how fiat money is making the world a better place🤣. In some sense it is because money is a powerful tool that allows humans to cooperate and accumulate wealth. The problem is when the money breaks down and we get 2nd and 3rd order consequences as a result. Thought this tweet from Tuur was interesting and one of these 2nd order consequences of the U.S exporting inflation for so long.\n\n![](https://miro.medium.com/1*XS07xKa_GxfAEVHkCkjQZA.jpeg)\n\nHowever, there is not much I can do besides keep securing my life's value in bitcoin. My buddy Lierce had a great point last night about focusing on yourself. Fix your home before trying to fix others. Yes I want Bitcoin to solve many of the issues the world faces, but I need to fix myself first. That is a lifelong journey and I agree with Lierce that if I focus on myself everything else will work itself out. Long live those who wish to spread love, joy and life to others.\n\nTalk to you tomorrow anon.\n\n5/28/22\n\nConor Jay Chepenik",
  "wordCount": 413,
  "readingTime": 1.758490566037736,
  "claps": 0,
  "voters": 0
}