{
  "id": "769fc82c62bb",
  "title": "Day 562",
  "createdAt": "2023-10-06 01:59:11",
  "tags": [
    "life",
    "longevity",
    "happiness-in-life",
    "anger",
    "growth"
  ],
  "url": "https://chepenikconor.medium.com/day-562-769fc82c62bb",
  "content": "# Day 562\n\nToday I watched a video of a 101 year old be asked about how she lived so long. Two bits of advice were given. Laughter is longevity and don't get angry. Man such simple yet profound peaces of advice.\n\nI spend too much time on Twitter. Literally just deleted it off my phone. I'm sure I'll scroll in the browser but I want to make an effort to use social media less because I do not want to be angry. There is so much bs click bait out there trying to evoke people's emotions. It is not good for us.\n\nThe reality is there is so much to be excited for. AI is going to increase productivity like never before, Bitcoin is offering everyone in the world essentially a checking and savings account that can't be debased and can be used to send value globally in a permissionless manner. Nostr is going to make it impossible to censor people's speech. I'm bullish! Humanity will flourish.\n\nThere is little point in worrying about things out of my control. The best way to fix the world is to be a force of joy in the world. To lift those up around me and do what I know is right in my heart.\n\nToday I took my daughter for a walk and passed some woman walking a beautiful lab. I stopped and asked if I could pet the dog. She let me and we had a nice conversation. It felt so good to just chat cordially with another human being. To pet a friendly animal. To get sunlight and explain to my daughter the riduclous state of affairs going on in the U.S financial system as well why Bitcoin fixes it. She is almost 9 months so I will have to reiterate what I said to her but she is smart. I'm confident that my little princess will store her value in the world's hardest money.\n\nSo two goals for myself. Laugh more and don't get angry unless it is absolutely necessary. Life is hard. You only have so many f*cks to give so give them wisely!\n\n![](https://miro.medium.com/1*PZ55cLj1M_O2sR1AZztXbg.png)\n\n10/5/23\n\nConor Jay Chepenik",
  "wordCount": 360,
  "readingTime": 1.5584905660377357,
  "claps": 4,
  "voters": 1
}