{
  "id": "779a85ccc520",
  "title": "Day 321",
  "createdAt": "2023-02-07 04:29:04",
  "tags": [
    "florida",
    "animals",
    "essay-app",
    "football",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-321-779a85ccc520",
  "content": "# Day 321\n\nDrove down to South Florida to visit my Partner's Father. Lot of driving to start 2023 but I'm fortunate to be able to travel around the United States. We walked to the pier when we got down here and enjoyed the breeze. It's amazing seeing pelicans and iguanas just chilling out in the open. I wasn't able to snap a good pic of the iguana but I got some good ones of the pelicans.\n\n![](https://miro.medium.com/1*PmftuwpxOoJo2wwLptdI7Q.jpeg)\n\n![](https://miro.medium.com/1*Om3kU3ZWOONyH-pPX4Tcrw.jpeg)\n\nHere is an AI art generated Iguana that resembles what I saw. Watching the iguana climb up a tree was quite impressive.\n\n![](https://miro.medium.com/0*d_4Ysy7HKWXwexW8)\n\nProud to report I hit a late night run. Almost skipped my run but decided to get it in which was the right choice. Now I'm going to attempt to finish up this damn football bitcoin essay I keep delaying. I used Jordan Peterson's [essay app](https://essay.app/) to help me a little and the tool did seem useful. Not something I would pay for personally because chatGPT and Medium are plenty for me to get quality essays out but I do appreciate the interface. The ability to rewrite sentences and switch them around is helpful. I'm just not sure it's enough for me to pay for the software.\n\n—\n\n**Title: How Football Helped Me Understand Bitcoin**\n\n**Teamwork Makes The Dream Work**\n\nBeing part of a team is a valuable experience. As a matter of fact, I played football for 11 years and it was one of my teammates who first introduced me to Bitcoin in 2017. Like most, I was tempted to venture away from Bitcoin only and start dabbling in other cryptocurrencies. As any wanna-be investor knows, \"diversification is key.\" It wasn't until I hung up my football cleats three years later that I fully understood why Bitcoin is completely different from the rest of the space. I was looking for something to fill the void left in my heart after my football career was over and luckily the Bitcoin rabbit hole was there to greet me. Games and sports provide a way for individuals to unwind, relieve stress, improve cognitive function, and foster social connections. Without my favorite game, I was lost. Football helped me get an education at a solid university, it helped me make some of the best friends I still have today, and it helped me stay in good shape. I've found going down the Bitcoin rabbit hole has done all of those things and then some. For example, I've started learning how to code, I've met tons of new friends online and in-person, I've become more religious, I started a family, and even tried fasting which seems to provide a variety of benefits including increased focus. It's weird to think that computer code can have such a profound and positive impact on both individuals and civilization as a whole. Most computer code today polarizes and separates people into echo chambers while Bitcoin brings everyone together to work towards a decentralized money. This is the key, because, as Henry Kissinger said,\n\n> \"Who controls the food supply controls the people; who controls the energy can control whole continents; who controls money can control the world.\"\n\nMakes you wonder what our world would look like if no one controlled the money or better yet if everyone controlled the money? I've found Bitcoin to be a bit of a paradox in the sense the community is both global and inclusive, and local and exclusive. As someone who has been on many different teams, Team Bitcoin is unlike any team I've had the pleasure of participating in. Anyone can run a Bitcoin node with an old laptop to send and receive transactions. At the same time, if you venture into Bitcoin Twitter and start trying to orange wash your shit-coin you will quickly get to experience the wrath of the cyber hornets.\n\n**Reframing Success: Beyond Money, Wins, and Losses**\n\nOne's unit of account will vary greatly depending on where they are born. A person's life circumstances often shape their perspectives and beliefs about the world, including their values and norms. In football, success is defined by wins and losses. It is an easy unit of account to see how well a team did that year. In life, success is often measured by financial wealth, even though our monetary system is flawed and creates an unfair playing field. People tend to prioritize material possessions like a house, car, and clothing while going into debt to obtain such things. It's crucial to remember that health, meaningful relationships, personal purpose, and fulfilling work are also essential components of a meaningful life. Similarly, Bitcoin operates on a level playing field, without giving an unfair advantage to the wealthiest, like in the traditional financial system. Both football and Bitcoin have the power to transform how people view success by shifting their personal yardstick to more meaningful criteria. On the football field, socio-economic status is irrelevant. The outcome of a game will vary greatly depending on a team's chemistry, how much work the team has put in, and the Coach's decision making, but overall it's a lot harder to cheat your way to the top on the grid-iron. This level of fairness is harder to achieve in life, as traditional financial systems often give an unfair advantage to the wealthy. Similarly, Bitcoin operates on a fair and equal basis, without granting any undue benefits to the wealthy. Both football and Bitcoin create a sense of fairness where everyone is treated equally, regardless of their background or resources. Although referees are human and prone to make mistakes, football still offers a relatively fair system. However, the true beauty of Bitcoin lies in its ability to determine that the game you are playing has rules that haven't been violated without the ambiguity that life often presents.\n\n**My Personal Journey**\n\nThe way I think about my journey in the crypto space is like moving from the junior varsity team to the varsity team. I started off on the JV, super excited and ill-prepared to compete. But after 5 years of hard work and research, I have finally joined the varsity team of Bitcoin Maximalists who can confidently articulate why Bitcoin is the true innovation and everything else is simply fiat 2.0. Similar to any varsity team, Bitcoiners have their own set of rules, level of commitment, and top players. It's not easy to fully understand and appreciate the value of Bitcoin when the majority of the crypto space is being flooded with alt-coin marketing and projects that are nothing more than vaporware tokens. Most of the coins are pushed by grifters who are only able to capitalize on the hype and confusion of a zero interest rate environment. After thousands of hours of proof of work I have come to understand that only Bitcoin has the potential to truly change the world for the better, in a way that no other digital currency or token can match. The best varsity teams I was a part of not only excelled on the field, but also helped to develop and mentor the junior varsity team, ensuring that the program's success would continue for years to come as the JV players eventually took the reigns of the varsity team. Thinking like this is a low-time preference move because in football it does not matter how many championships you win, there is always another one to go after next season. Just look at Tom Brady, who has also fallen victim to the broader crypto space. Tom won numerous championships in football and yet still strives to win more. He just announced his retirement and I remain hopeful now that he has decided to hang up his cleats, he can learn from his mistakes and see that Bitcoin only is the way. There are a lot of different stories for people who have decided to come and play in this space. Including people who saw the innovation of Bitcoin early, made a lot of money, and then fell victim to alt-coins. These people may be too far gone to save. For those who haven't yet put in the effort to understand the differences between Bitcoin and other crypto assets we need to continue lifting these people up. Being a part of the Bitcoin community is full of challenges and adversity, but it is also where some of the strongest friendships and bonds are forged. Choosing to be a Bitcoin maximalist allows you to wake up with a clear conscience. There is a lot of money to be made if you can spin up a cryptocurrency and pretend it's a decentralized network. However, duping less knowledgeable people into investing in your vaporware technology so you can pump and dump your D.I.N.O. project is an absolute scumbag move. Experienced Bitcoiners have a responsibility to guide and educate new members of the community on their journey to understanding Bitcoin, and why it is the only coin decentralized enough to withstand nation-state attacks. It's important to remember that Bitcoin's bottom-up approach empowers individuals to make their own choices and decisions. With the increasing availability of educational resources, it's becoming easier for people to learn about Bitcoin, and it's important to keep repeating the message that Bitcoin maximalism is the most virtuous position. If Bitcoin is going to become the next world reserve currency Bitcoiners must continue lifting up our weakest links. That doesn't mean we keep people on the team who are a liability and a distraction. It means those who have shown they are committed should be lifted up while the ones hanging around for the clout and \"ma gains bro\" get ignored. At some point the junior varsity is going to be running the show. It's not a perfect metaphor but that's how I look at alt-coin holders who need to do more work to understand the Bitcoin Maximalist philosophy.\n\nIf the planet is going to get on a Bitcoin standard it is going to involve a whole bunch of proof of work, both literally and figuratively. I was fortunate enough to attend a Bitcoin dinner for Mass Adoption and at that dinner everyone went around the table talking about their experience with Bitcoin. Someone brought up an amazing Odell quote that goes \"I'm bullish on Bitcoin but more bullish on Bitcoiners\". I can't think of a better way to frame it. Regardless of what happens with the price of Bitcoin, the friendships and connections I've made through this digital currency will always hold value. When it was my turn to present I talked about my 11 years of football and the hole I felt in my heart after hanging up the cleats. I had no idea doing a legitimate deep dive into Bitcoin would fill that hole. Going to Bitcoin meetups in my area is cathartic. I've made a whole new set of friends who I know are willing to go to battle with me. I'll never stop laughing about how a single white paper has had such a profound impact on the lives of those who have embraced this new form of money.\n\nThis is my personal anecdotal experience so don't trust me; go verify for yourself. With that disclaimer I can confidently say I've seen Bitcoiners to be more invested in the growth and success of their community members, than in the success of the technology itself. Which is not to say that we aren't invested in making sure the technology succeeds. Bitcoin just helps you realize that the most important things in life don't necessarily come from having a certain amount of wealth. Bitcoiners care deeply about fixing the world, about educating others, and about righting the wrongs that are becoming more and more apparent by the day. Many, myself included, came to Bitcoin because number go up and while I can't speak for everyone the reason I stayed is because I believe that Bitcoin is the best hope humanity has to fix the world.\n\nSo far in 2023 we've seen what looks to be the start of another bull market. I can confidently say after being humbled through two cycles I have absolutely no idea (in the short term) which way the direction of this coin is going in USD purchasing power terms. What I do know is that when bitcoin is in its dead phase you don't see as many \"JV players\" coming to celebrate with the true Bitcoiners. At least not until the next bull market. So if this is a fake pump remember the bear market is a great time to build. Bitcoiners are a unique breed of people and the bear market is the time when you find your team, start writing, coding, podcasting, hosting a Bitcoin meetup, or whatever else floats your boat. If it turns out this is the start of the next bull market then do all these things and remember to stay humble. Some would call Bitcoin a mind virus because those who go down the rabbit hole can't stop talking about. I'd argue Bitcoin is the antidote to the problems of fiat currency. Those on the team understand this and that's why they're all in. Bitcoiners start taking more self-sovereignty, save more, create value, and work towards a better future. I've been on a lot of teams throughout my life and I'm grateful I found team bitcoin to help make sure I don't give into the nihilism team fiat is poisoning the world with. Of course, the transition is far from over and the mainstream media will never stop painting Bitcoin as either dead or a bubble. It will take a whole new set of media outlets filled with Bitcoiners who understand the potential for true decentralization and the benefits it brings. I'm confident these outlets will end up replacing the old outlets soon enough. In a bull market, many new participants join the community, and the true Bitcoiners know that many of these \"JV players\" are not yet ready to fully understand and embrace the true potential of Bitcoin. So whatever happens let's remain patient, teach those who have sinned with their shitcoins, and ignore those who are beyond saving. Bitcoin is not just a new form of money, it's a community of individuals who strive for self-sovereignty, savings, and a better future. It's a team worth being a part of.\n\n—\n\nGoing to give this another read tomorrow because it's late and I'm spinning my tires and not making much progress at this point. That said, I do think I made some positive tweaks. I'd like to talk more about the idea of how football has an easy unit of account in wins and losses, but also a whole other unit of account in the relationships you make with teammates that can't be measured. Also the idea of learning about low-time preference. Maybe throw in a reference about how my Dad would convince me to train and forgo partying so I could be a better athlete.\n\nYea I like that. I need to do more planning rather than just rushing into the essay. Shout out the essay app for the idea. The price point is too high for me to buy at the moment but I do appreciate what I learned from clicking around so I'm happy to plug the software on here. Try it anon if you are having struggles writing. They offer a free 14 day trial and shit I might even use it tomorrow to try and start another essay. Got to write 2 more for Bitcoin news.\n\n2/6/23\n\nConor Jay Chepenik",
  "wordCount": 2608,
  "readingTime": 10.391509433962264,
  "claps": 0,
  "voters": 0
}