{
  "id": "77b1c59f43b2",
  "title": "Day 131",
  "createdAt": "2022-07-31 17:12:20",
  "tags": [
    "npc",
    "energy",
    "fossil-future",
    "boston",
    "golf"
  ],
  "url": "https://chepenikconor.medium.com/day-131-77b1c59f43b2",
  "content": "# Day 131\n\nGot a nice call from an old friend who was talking about moving up to Boston. While I've been thinking about leaving the city when they child gets here this would definitely shake things up. Having one of my best friends in the area would make Boston a much more desirable place to raise my child. Who knows how everything plays out but it was nice to hear from my friend.\n\nPlayed 9 holes of Golf this morning and I'm reminded how much the game is a metaphor for life. Sometimes you have bad shots and it's incredibly frustrating. You hit that one good shot though and forget all your worries. Even when I'm playing awful and getting annoyed I try to remember that I'm lucky to be outside playing a game and enjoying nature. Life is the same way. Sometimes it can be incredibly frustrating, but then you get a big win and it makes things better. Even when you are having a series of shit days if you remember how lucky you are to be alive it makes it hard to be upset. In both cases taking some time to be grateful can help turn your life & golf game into a much more enjoyable experience. Which in turn will usually help you succeed in both areas.\n\nBeen reading [Alex Epstein's Fossil Future](https://www.amazon.com/Fossil-Future-Flourishing-Requires-Gas-Not/dp/0593420411) and the more I learn about our climate experts the less I trust them. My whole life I've been taught via school that climate change is this massive problem and humans are going to destroy the planet. Alex has helped me realize this is not the case and there is a lot of hope for the future. What is infuriating though is learning that these climate experts who want to transition off fossil fuels ignore all the benefits that hydrocarbons bring to our life while making no plans to implement something like nuclear energy that could give the world access to cheap, clean, and abundant energy. I understand there might be some need to slowly minimize our fossil fuel use, but if more nuclear power plants aren't built we won't be able to do so without devastating human beings. I honestly had never thought about what a crucial role energy played in society until I went down the Bitcoin rabbit hole. The more I learned the more I understood energy is the base layer of society, but I still lacked the nuance to understand why it's possible that the world could have cheap abundant energy. Then I read a book titled [5 Good Reasons To Punch A Dolphin In The Face](https://www.goodreads.com/book/show/9260507-5-very-good-reasons-to-punch-a-dolphin-in-the-mouth-and-other-useful-gui) that talked about how Nikola Tesla discovered electricity and envisioned a world where everyone had access to cheap power. J.P Morgan saw this and said there is no money to be made if power becomes so abundant and cheap and sabotaged the plan. I might be a little off in my paraphrasing but clearly something like this happened because we still don't have cheap and abundant energy and nuclear constantly gets a bad wrap despite being legit the best solution to go green while still being able to provide affordable and reliable energy. Wind and solar will not cut it. Solar requires taking up vast amounts of land while wind turbines require tons of fossil fuel to get set up in the first place. Not to mention the lack of wind and solar power when its night out and the wind isn't blowing. You can store some of the energy in batteries but that also requires massive amounts of fossil fuel to extract the necessary minerals to create and transport the battery.\n\nI agree with Alex's hypothesis that these \"climate experts\" pushing green energy have anti-human end goals disguised under the guise of \"A green energy transition\". Might as well call these people greeniacs😂 . Kleptocrats are trying to make life worse for the vast majority of the world, but Bitcoin and apparently philosophers like Alex are here to save the day. Bitcoiners are waking up to the importance of energy and what it means for everyday life. People like Alex are doing the hard work to enlighten those willing to study why energy is so important to humans prospering. Bitcoiners are also stabilizing grids and making it profitable for people to build out more reliable, robust, and even green sources of power. Having a buyer of last resort with your ASIC (Bitcoin Miner piece of hardware or Application Specific Integrated Circuit) allows the people creating these power plants to know they can always have a buyer for their energy. Being able to monetize your energy 24/7/365 is incredibly powerful. Socialists love to shame those seeking a profit, but little do they realize everyone is self interested. If you take away the ability of people to be able to make a profit then no one will want to work. Profit shouldn't be a dirty word. I'm glad Bitcoin allows for people to put up the capital to build more reliable sources of energy so they can profit and help the world along the way. Bitcoiners and philosophers, like Alex, will continue to wake people up while the social justice warriors can have fun without A/C, vehicles, and washing machine. I joke, the social justice warriors will quickly shut the hell up and use hydrocarbons when they realize how idiotic their takes are.\n\n![](https://miro.medium.com/0*PDL9JmL5CeZ7ozfo)\n\nThere are tradeoffs to everything, but I'm hopeful that the world will wake up and start respecting those seeking to create a better world. Those who try to make global warming seem like the worst catastrophe there is for their own personal gains should be treated with disdain. These are the same people flying private jets to Davos to talk about how we can get those struggling to pay for gas to use less carbon. These people can't have it both ways forever and I'm so glad individuals are blessed with something like Bitcoin that can fix the money, fix the energy, and restore freedoms to those who seek to be sovereign. If you want to be an N.P.C (non playable character) go ahead, Bitcoiners will continue to learn, have fun, and create a world where individuals, not corporations, can prosper.\n\n7/31/22\n\nConor Jay Chepenik",
  "wordCount": 1045,
  "readingTime": 4.143396226415094,
  "claps": 0,
  "voters": 0
}