{
  "id": "77f0603fea0d",
  "title": "The Irony Of TikTok",
  "createdAt": "2020-12-04 14:01:32",
  "tags": [
    "tiktok",
    "ironic",
    "crash-course",
    "open-minded",
    "pfizer-vaccine"
  ],
  "url": "https://chepenikconor.medium.com/the-irony-of-tiktok-77f0603fea0d",
  "content": "# The Irony Of TikTok\n\nYou know this morning I woke up and started scrolling on my phone. After playing around on my coding app trying to learn Java I decided to treat myself to some social media. I pulled up TikTok and on my FYP (For You Page) John Green popped up. For those who do not know who John Green is I recommend you stop reading this and search Crash Course now. Anyways, on his TikTok channel, John Green started a video by talking about how the Pfizer CEO sold stock on the day his company released the vaccine. Immediately I am pissed off and thinking about what a corrupt and shit world we live in where a CEO of a drug company is so unsure of his vaccine that he sells stock in his own company. However, John Green went on to point out that CEOs can't legally sell stock in their own company because that would be insider trading so they hire 3rd parties to sell the stock when it hits certain price targets. Thus, news of the vaccine shot Pfizer's stock up and the 3rd party company sold on the CEO's behalf. FAITH RESTORED.\n\nAll jokes aside, this is why misinformation spreads so fast. What if rather than a short TikTok that was an article. If someone made the title \"Pfizer CEO Sells Stock On The Day Pfizer Releases A Vaccine\". So many people wouldn't even bother reading the article but would be sure to tell their friends what a horrible person the CEO of Pfizer is. Hell, I'm guilty of basing things on Article titles as well. So many things are grabbing for our attention nowadays it's hard to read through every article I see. It is also why people come up with clickbait titles like the one above because they want people to click their link. I have to applaud Twitter because the other day I saw an article that said \"New Zealand Aims To Cut Their Global Emissions to Zero Come 2025\". Without even bothering to click the link I went to retweet it because I thought that's awesome! I love to see countries doing the right thing, but Twitter had a little thing that said would you like to read the article before retweeting. I did exactly that, but only because Twitter called me out on my B.S.\n\nPeople aren't perfect and at the end of the day the vast majority of us aren't going to be able to prevent clickbait and phishing. You know what we can do though? Be open-minded, take things with a grain of salt, and always listen, learn, and do your research before criticizing. You know it's so funny because I remember being so afraid to download TikTok because I thought the Chinese Government was using it to spy on us. Finally, I caved and downloaded it and I must say there is so much content out there that has made me question some of my most deeply held beliefs. I'm not saying the app is full of great stuff because there is a lot of crap on it. However, it's ironic that an app I was so worried about spying on me has changed my perspective for the better.\n\n12/4/20\n\nConor Jay Chepenik",
  "wordCount": 548,
  "readingTime": 2.0679245283018868,
  "claps": 0,
  "voters": 0
}