{
  "id": "784475fdba5d",
  "title": "Day 771",
  "createdAt": "2024-05-02 00:57:22",
  "tags": [
    "bitcoin-etf"
  ],
  "url": "https://chepenikconor.medium.com/day-771-784475fdba5d",
  "content": "# Day 771\n\n**What Is The Best Bitcoin ETF?**\n\nMany have been wondering what is the best Bitcoin ETF. This is a trick question because the best way to gain exposure to Bitcoin is through self-custody of the actual underlying, not an ETF. Of course, self-custody means holding your own bitcoin in a secure digital wallet that you control the private keys for. Self-custody can be challenging, and some investors, particularly large institutions, may not be able to take this approach. For those seeking exposure to Bitcoin through traditional investment vehicles, several Bitcoin ETF offerings are available, each with its own structure, risks, and benefits. This article will explore the various Bitcoin ETF options to help investors make informed decisions based on their goals and risk tolerance.\n\n**Current Spot Bitcoin ETF Fees and Holdings**\n\nAs the spot Bitcoin ETF market continues to evolve, it's essential for investors to be aware of the fees and holdings associated with each fund. Here's an overview of the current spot Bitcoin ETF fees and the number of BTC held by each fund as of May 1, 2024:\n\n**Grayscale**: (GBTC) charges a 1.5% fee and holds ~295,126 BTC with Coinbase as the custodian.\n\n![[https://etfs.grayscale.com/gbtc](https://etfs.grayscale.com/gbtc)](https://miro.medium.com/0*LzdB_2OxOggEPaD9.png)\n\n**BlackRock**: (IBIT) charges 0.25% fees for the first 6 months (or until reaching $5 billion in AUM) and holds ~274,462 BTC with Coinbase.\n\n![[https://www.ishares.com/us/products/333011/ishares-bitcoin-trust](https://www.ishares.com/us/products/333011/ishares-bitcoin-trust)](https://miro.medium.com/0*BVWCguRHYqOEy6pS.png)\n\n**Fidelity**: (FBTC) charges 0.25% fees (with 0% fees until July 31, 2024) and holds ~153,493 BTC in self-custody.\n\n![[https://institutional.fidelity.com/advisors/investment-solutions/asset-classes/alternatives/fidelity-wise-origin-bitcoin-fund](https://institutional.fidelity.com/advisors/investment-solutions/asset-classes/alternatives/fidelity-wise-origin-bitcoin-fund)](https://miro.medium.com/1*KG2hleApyzyBK__OUjispQ.png)\n\n**Ark/21 Shares**: (ARKB) charges 0.21% fees (0% fees for the first 6 months or until $1 Billion in AUM) and holds ~43,706 BTC with Coinbase.\n\n![[https://ark-funds.com/funds/arkb/](https://ark-funds.com/funds/arkb/)](https://miro.medium.com/1*ZtC56Zqe-G6V4r2SuylY9A.png)\n\n**Bitwise**: (BITB) charges 0.20% fees (0% fees for the first 6 months or until $1 billion in AUM) and holds ~33,896 BTC with Coinbase.\n\n![[https://bitbetf.com/](https://bitbetf.com/)](https://miro.medium.com/1*Lma8YhqjyLG2s9vmFjKrrQ.png)\n\n**VanEck**: The VanEck Bitcoin Trust (HODL) charges 0% fees and holds ~9,278 BTC with Gemini as the custodian.\n\n![[https://www.vaneck.com/us/en/investments/bitcoin-trust-hodl/overview/](https://www.vaneck.com/us/en/investments/bitcoin-trust-hodl/overview/)](https://miro.medium.com/1*MyvLKv_gTIe36QYs_SGrpQ.png)\n\n**Valkyrie**: (BRRR) charges 0.49% fees (0% fees for the first 3 months) and holds ~7,926 BTC with Coinbase.\n\n![[https://valkyrie-funds.com/brrr/](https://valkyrie-funds.com/brrr/)](https://miro.medium.com/1*p0NvThnOiw7FVR2Pu46UFA.png)\n\n**Invesco**: (BTCO) charges 0.25% fees (0% fees for the first 6 months or until $5 billion in AUM) and holds ~6,055 BTC with Coinbase.\n\n![[https://www.invesco.com/us/en/etf/galaxy-bitcoin-btco.html](https://www.invesco.com/us/en/etf/galaxy-bitcoin-btco.html)](https://miro.medium.com/1*26AvKBtXgKacl6taxsyV3Q.png)\n\n**Franklin Templeton**: (EZBC) charges 0.19% fees and holds ~5,134 BTC with Coinbase.\n\n![[https://www.franklintempleton.com/investments/options/exchange-traded-funds/products/39639/SINGLCLASS/franklin-bitcoin-etf/EZBC](https://www.franklintempleton.com/investments/options/exchange-traded-funds/products/39639/SINGLCLASS/franklin-bitcoin-etf/EZBC)](https://miro.medium.com/1*7JDucgqVkmWoYnBJ-alNcQ.png)\n\n**WisdomTree**: (BTCW) charges 0.30% fees (0% fees for the first 6 months or until $1 Billion in AUM) and holds ~1,227 BTC with Coinbase.\n\n![[https://www.wisdomtree.com/investments/etfs/crypto/btcw](https://www.wisdomtree.com/investments/etfs/crypto/btcw)](https://miro.medium.com/1*mIXId-uMsRhp0E_D01S6Hw.png)\n\n**Hashdex**: The Hashdex Bitcoin ETF (DEFI) charges 0.90% fees (converted from a futures ETF to a spot ETF on 03/27/24) and holds ~178 BTC with BitGo as the custodian.\n\n![[https://www.hashdex-etfs.com/defi](https://www.hashdex-etfs.com/defi)](https://miro.medium.com/1*uqmEcixuSBqmWgXcM32AoA.png)\n\n**Setting Records**\n\nThe launch of spot Bitcoin ETFs has been an overwhelming success by almost every metric. With the exception of Grayscale's GBTC, which has seen outflows due to its high fees and the fund trading at a persistent discount to its net asset value (NAV), the inflows into these new spot Bitcoin ETFs have been substantial. The chart from Farside Research illustrates the remarkable growth in assets under management (AUM) across the various spot Bitcoin ETF offerings, highlighting the strong demand from investors seeking exposure to Bitcoin through regulated investment vehicles.\n\n![[https://farside.co.uk/?p=997](https://farside.co.uk/?p=997)](https://miro.medium.com/1*q4PZUD597j7wPvuZzwQHwQ.png)\n\nWhile the initial fee discounts and promotions offered by many ETF issuers have undoubtedly contributed to the rapid influx of capital, the long-term success of these products will depend on their ability to maintain competitive fee structures, robust liquidity, and efficient tracking of the underlying Bitcoin price. As the market matures and the promotional periods expire, investors will likely gravitate towards the ETFs that offer the most attractive combination of low fees, reputable issuers, and ample trading volume.\n\n**A Bitcoiner's Perspective**\n\nFor true Bitcoiners, the allure of a catchy ticker symbol like BRRR, HODL, or DEFI might be tempting, even if it's not the most rational decision-making process. After all, the rise of Bitcoin itself - literal \"magic internet money\" on its way of becoming a potential global reserve currency - defies conventional wisdom. While selecting an ETF based on its ticker could be seen as a meme-worthy move, there are more critical factors to consider.\n\nParamount among these is the custodianship and security of the underlying Bitcoin holdings. In this regard, Fidelity's Wise Origin Bitcoin Trust (FBTC) stands out as a clear leader. Fidelity has been involved in the Bitcoin space for an extended period and has chosen to self-custody its Bitcoin holdings, a commendable approach that minimizes counterparty risk. Even Grayscale, a pioneer in the space, opted for Coinbase as its custodian, introducing an additional layer of counterparty risk.\n\nWhile owning a Bitcoin ETF inherently involves some counterparty risk, minimizing this exposure is crucial in aligning with the core principles of Bitcoin's decentralized and trustless nature. By self-custodying its Bitcoin holdings, Fidelity demonstrates a deeper understanding of these principles and a commitment to upholding them.\n\nAs the spot Bitcoin ETF market continues to evolve, Fidelity's approach positions it as a frontrunner, appealing to both traditional investors seeking regulated exposure and Bitcoiners who prioritize self-custody and minimizing counterparty risk.\n\n5/1/24\n\nConor Jay Chepenik",
  "wordCount": 828,
  "readingTime": 4.474528301886792,
  "claps": 0,
  "voters": 0
}