{
  "id": "7c00fb71a7ee",
  "title": "Day 22",
  "createdAt": "2022-04-14 02:20:05",
  "tags": [
    "woke",
    "corporations",
    "davos",
    "don-draper",
    "old-fashions"
  ],
  "url": "https://chepenikconor.medium.com/day-22-7c00fb71a7ee",
  "content": "# Day 22\n\nWorking in the corporate world for a massive company is COMFY! Day 3 and my new gig hosted a party after work from 5:30–8:30 PM at a sick venue that I forget the name of, but it was in the Seaport district of Boston and it had an incredible dart setup that let you play with friends and recorded your score. It even took a video of the winner after they threw the game-winning dart. It literally had a camera up top so it could replay everyone's reaction. I had like 4 old fashions, a bunch of green tea shots, plus some delicious food, all on the company's dime. Part of me absolutely loved this and another part thought damn this is why corporations get away with so much. If it wasn't for my company paying for that night it would've probably run me around 300–400$ after tax and tip for all the food and drink I consumed. Maybe I wouldn't have consumed so much if it wasn't on my company's dime, but I'm human and it's hard to pass up some delicious Don Draper drinks.\n\nI don't say this to shit on my company. My views do not represent my employer and never will. I say this because it's eye-opening into how the world really works. It is very hard to fight the organization that hooks it up all the time for you. I can see why many well-off executives would just take a payoff rather than speak out against an employer who might be acting maliciously. So much respect for [Jennifer Sey](https://twitter.com/JenniferSey) who turned down a million dollars from Levi so she could speak her mind. When an organization has that much power I can see why people are so afraid to go against them.\n\nI'll also mention that stepping outside your comfort zone is worth it anon. I'm not going to lie, I've been at my new gig for 3 days and I was mad nervous to go to the party tonight. I barely knew anyone and it was really awkward when I first walked in. I slowly walked around with a drink in my hand not knowing what to do. Luckily, some people came up and introduced themselves and before I knew it I was meeting and greeting various employees. I appreciated the hospitality of the employees and the fact everyone was so willing to introduce themselves and have a conversation. The party ran 3 hours and I stayed the whole time. I literally was getting ready to leave after I finished my first drink, but someone took the time to make me feel welcome and it changed the whole night for me.\n\nLike most things in life, there is a stark contrast in my experience at a massive company. On the one hand, they really do an incredible job making the employees feel welcome and prepared. On the other hand, it feels so overwhelming to work at a company where I will likely never know all my co-workers because it is so big. Not sure there is a way to fix this. I've only been there 3 days and as far as I can tell it's very organized and they have great SaaS in order to get new hires ramped up. I'm more so generalizing about the fact that big corporations offer incredible perks, pay great salaries, and rent incredible office spaces with unlimited snacks and the newest tech equipment. I'm so lucky and fortunate to have the opportunities I have and I hope to crush it in my new role. I just feel like the world has some crazy shit ahead and I really hope corporations can refrain from giving into whatever BS Davos has planned for the end of 2022. Anyway, I'm sauced up anon so I'll be back tomorrow because that's all she wrote for today. Bang bang.\n\n![Follow Joe Consorti on Twitter](https://miro.medium.com/1*Utn-lobaC1RuZV6Ecf13Qw.jpeg)\n\n4/13/22\n\nConor Jay Chepenik",
  "wordCount": 656,
  "readingTime": 2.6754716981132076,
  "claps": 0,
  "voters": 0
}