{
  "id": "7d040cea3f2d",
  "title": "Day 124",
  "createdAt": "2022-07-24 22:41:58",
  "tags": [
    "bitcoin",
    "memes",
    "sunday",
    "running",
    "coffee"
  ],
  "url": "https://chepenikconor.medium.com/day-124-7d040cea3f2d",
  "content": "# Day 124\n\nBeen a nice lazy Sunday. Woke up did some reading, did some laundry, and made some breakfast. My girl made some coffee which was nice. I like my coffee black with some honey. A delicious combo. Later in the day I hit a 5k and did some walking. Listed to this TFTC podcast during my walk/run which was pretty cool.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F45MVn2IcaiVMC2HudYrheh%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F45MVn2IcaiVMC2HudYrheh&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fb23f36c8ec59b3e61be12607&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"207\" width=\"368\"></iframe>\n\nBitcoin mining and Oil & Gas go together like peanut butter and jelly was my takeaway. People can cry harder about the \"environmental issues\" and go circle jerk themselves with wind and solar. Bitcoin will continue consuming more energy and it is the best possible thing that could ever happen to humanity. While that might be a slight exaggeration, Griffin Haby said it best on Marty's Podcast. I'm paraphrasing but he basically pointed out how many of these green hysterics are screaming about climate change and eliminating CO2 but then when you say alright what do you think about nuclear they tell you that's not the solution... PEOPLE: wake up. Anyone who thinks climate change is an issue but doesn't support nuclear is either ignorant or malicious. Full stop. I'm not a climate or energy expert but it seems pretty damn obvious from what I've learned that nuclear is our only reliable way to fix the carbon problem, which I'm not even sure is as big a problem as it's made out to be. Wind and Solar might be able to help, but it's not a viable solution to power city centers. Wind and solar are better off helping those living off-grid than they are powering a large city grid. Many variables in the environment models and while they have some legitimacy they don't justify eliminating oil & gas which play an absolutely pivotal role in society. I don't think putting massive amounts of CO2 in the air is by any means fantastic, but rather than CO2 capture why don't we just plant more trees!?! You know the plants that breathe CO2 in the same way animals breathe O2?!\n\nIf it seems like I'm going scorched earth on these Medium posts then guess what. You might be part of a fiat system that has taught you to comply and not question the experts. My advice: go eat some mushrooms. 🍄  The kind that grows on cow poop. We need people focused on solutions rather than screaming about problems.\n\n![](https://miro.medium.com/0*dGDw5GxA55Im9yPr)\n\nIt is fun to doom scroll though and realize most people are sleepwalking into a totalitarian nightmare, but at least Bitcoiners are waking up the masses with memes. This [tweet](https://twitter.com/TimerOlde/status/1551165568719679488?s=20&t=7b4m_2UaT-J8lhcqzKumCg) from a based homie spells out it well. We are the wise men anon. Let's keep that aroma of rebellion and get the world on a hard money standard so humanity can prosper!\n\n7/24/22\n\nConor Jay Chepenik",
  "wordCount": 468,
  "readingTime": 1.9660377358490566,
  "claps": 15,
  "voters": 1
}