{
  "id": "7d115151c145",
  "title": "Day 258",
  "createdAt": "2022-12-05 23:49:40",
  "tags": [
    "memes",
    "bitcoin",
    "finance",
    "prisoners-dilemma",
    "chatgpt"
  ],
  "url": "https://chepenikconor.medium.com/day-258-7d115151c145",
  "content": "# Day 258\n\nThis video is hilarious. Do recommend watching.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/naiivememe/status/1599009785374208007&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI watched a Twitter spaces today between two people on Bitcoin Twitter named American Hodl and Deeterbob. I'm not even going to link the footage because it was a waste of my time watching but it was funny. I will give them that. Basically two people just screaming & insulting each other. It was a good reminder that no one truly knows another person's motivation, that we are all fallible, and that the most important lesson in Bitcoin (especially on Bitcoin Twitter) is not to trust anyone and verify for yourself.\n\nSomeone shared this work and I would like to read through it.\n\n<iframe src=\"https://drive.google.com/viewerng/viewer?url=https%3A//csinvesting.org/wp-content/uploads/2015/10/Artemis-Q32015-Volatility-and-Prisoners-Dilemma.pdf&embedded=true\" title=\"\" height=\"780\" width=\"600\"></iframe>\n\nI'm going to soon but before I give it the read through I had to ask chatGPT if it could give me a summary so I copied and pasted all 50 pages and asked for a summary. This is what it said,\n\n\"In the Allegory of the Prisoner's Dilemma, the artists Diaz Hope and Roth visually depict a tower of civilization that rests upon a foundation of human cooperation and competition. This competition, game theorists argue, creates a fragile equilibrium known as the paradox of the Prisoner's Dilemma. In the context of modern financial markets, this paradox creates a situation where global capitalism is trapped in its own prisoner's dilemma. Over the past 44 years, global central banks have manipulated the cost of risk, leading to a dangerous build-up in debt and leverage, lower risk premiums, income disparity, and a greater probability of tail events on both sides of the return distribution.\n\nThe suppression of truth by money has led to market behavior that fully expects pre-emptive central bank action in the face of crisis, creating a dangerous self-reflexivity and moral hazard. This, combined with the growth of short volatility complexes across all assets and self-reflexive investment strategies, has created a \"shadow convexity\" that could fuel the next hyper-crash. Central banks in the US, Europe, Japan, and China now own substantial portions of their own bond or equity markets, and we are nearing the end of a 30-year \"monetary super-cycle\" that has created a \"debt super-cycle\" in the capitalist system.\n\nAs markets fully price in the expectation of central bank control, we are now only one voltage switch away from the \"razor's edge\" of risk. In other words, peace and stability can exist on the very edge of volatility, creating a dangerous and potentially disastrous situation. To avoid this, global capitalism must find a way to escape the prisoner's dilemma and create a more stable and sustainable system. This will require a rethinking of our current economic and financial systems, as well as a recognition of the dangers inherent in our current state of \"peace.\"\"\n\nI mean I can't get over this thing. Such a powerful tool.\n\nNow to go watch some football at my buddies so this is going to be a short one!\n\n12/5/22\n\nConor Jay Chepenik",
  "wordCount": 499,
  "readingTime": 1.8830188679245283,
  "claps": 0,
  "voters": 0
}