{
  "id": "7d80e89b578",
  "title": "Day 154",
  "createdAt": "2022-08-24 01:44:47",
  "tags": [
    "student-loans",
    "pragmatic-play",
    "bitcoin",
    "politics",
    "children"
  ],
  "url": "https://chepenikconor.medium.com/day-154-7d80e89b578",
  "content": "# Day 154\n\nWatched a video of someone calling out Elizabeth Warren for her student debt takes. It is reassuring to see politicians get called out in real life, but she didn't answer the question at all. She just thanked the dude for his time and walked away. The guy asked if he would be receiving a refund for doing the right thing and paying off his daughter's debt while his neighbor spent his money partying and buying a jetski. That same neighbor will now have his daughter's debt forgiven because he did the wrong thing and spent his money rather than saved. Liz told him he would not be receiving a refund and then refused to answer any more questions.\n\nYou know selfishly I'd like my debt gone. I've got like 20k+ in student debt. My girlfriend has double what I've got. I also understand in no world is it fair for politicians to forgive my debt and screw everyone else with the inflation that will ensue if they go through with this debt forgiveness. It is a weird feeling knowing that the right decision, and the one I support, is not having them cancel student debt because I should have to pay for debt I took it, but also deep down wanting that debt to be cancelled to make my life easier. Tomorrow there is supposed to be an announcement so I guess will know pretty soon what happens. Like I said, I know deep down it is not right to forgive all this debt. Of course as a self interested human it is damn hard not to hope for the \"screw it\" outcome. From a pragmatic perspective it seems the best thing to do would just be cancel the interest payment. Have people pay back their debts, but eliminate the predatory interest rates many student loans have on them. I've seen countless stories of people who have paid more than the amount they borrowed and yet they've barely made a dent in the principal because the interest is so high. That seems like the reasonable solution, but when you're vying for votes I don't think reasonable and pragmatic approaches are often in the cards.\n\nWas reading a little more of Ray Dalio's _Changing World Order_ and it's so eery how empires rise and fall. It seems like I'm watching a slow motion train track as the U.S sends incredible amounts of taxpayer wealth to Ukraine, promotes woke ideology, and pulls third world shit like invading a former President's home. I'm no fan of the orange man and I'm no fan of Biden. That said, it's deeply disturbing watching one side abuse their executive powers to intimidate the other side. It's clear that our two party system here in the states does not serve to represent the will of the masses. Politics seems like it is full of problems and I'm hopeful that Bitcoin fixes this. When the money is broken the system crumbles. Dalio does a great job showing this happening time and time again with various empires. However, when the money is working well people prosper. Thus, we should all Bitcoin (Not financial advice please always do your own research). Under a Bitcoin standard they couldn't forgive the debt, because they couldn't print the money out of thin air.\n\nAnyways, it is pretty crazy to think about this student loan stuff. Curious to see how it all plays out, but I do think it's clear that while loans might be predatory it doesn't mean people should just be let off the hook. The left is desperate for votes though and I'd imagine that they will take drastic measures to gain any edge they can. I wish more people would think critically about these topics and offer up approaches that didn't enrage one side or the other. Even the lender would be better off if they just forgave the interest vs wiping out all debts. They are already government subsidized anyways and at least this way they get their principal back rather than nothing.\n\nI don't know, if 🤡 🌍  has shown us anything these past 2 years it's that they are happy to take drastic measures and not worry about the 2nd and 3rd order effects. I'm praying for a smooth transition to a Bitcoin standard, but there will likely be some turbulence in the coming years. More people demanding answers from our leaders can do a lot to help the situation. Whoever the dude was who called out Liz Warren good on you. It's easy to float ideas that are popular with the masses because they sound good. It's a whole other thing to actually have to sacrifice and compromise with pragmatic approaches rather than spend taxpayer dollars you shouldn't be spending.\n\nHad a dream last night I was holding my daughter Sloan. She is already making me want to be a better person. Someone who provides value and makes the world a better place. I can't remember everything about my dream except the overwhelming love I felt for her. Can't wait to meet her in real life at the end of the year :)\n\n![Photo by kelvin octa : [https://www.pexels.com/photo/baby-lying-on-white-fur-with-brown-blanket-1973270/](https://www.pexels.com/photo/baby-lying-on-white-fur-with-brown-blanket-1973270/)](https://miro.medium.com/0*OO7_eQvfDZ7cJ7sf)\n\n8/23/22\n\nConor Jay Chepenik",
  "wordCount": 863,
  "readingTime": 3.456603773584906,
  "claps": 0,
  "voters": 0
}