{
  "id": "7d84c400d3bd",
  "title": "Day 479",
  "createdAt": "2023-07-14 22:12:18",
  "tags": [
    "dopamine",
    "choices",
    "subtraction",
    "building",
    "audience"
  ],
  "url": "https://chepenikconor.medium.com/day-479-7d84c400d3bd",
  "content": "# Day 479\n\n![](https://miro.medium.com/1*rDsyyDQUb0jUzRyJ_G_akQ.png)\n\nWe live in a time where there has never been more choices, opportunities, and paths an individual can take with their life. According to Google's AI, Bard, the average person in 1600 traveled about 100 to 150 miles in their lifetime. Not in a year, but in their lifetime. When I go visit my partner's family in New Jersey I drive farther than that in a day. There is a great saying though that goes 'less is more'. With all these opportunities out there it is easy to get bogged down in the paralysis of choice.\n\nI did a great podcast with someone who made a massive impact during the Canadian trucker's freedom convey. You can find the episode here.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FFD5UME_fTHs%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DFD5UME_fTHs&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FFD5UME_fTHs%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nMy biggest takeaway is the power of subtraction. Even named the episode that because I thought it was so relevant. In a world with surplus food, opportunity, and entertainment it's very valuable to take a step back and figure out what matters to you.\n\nFasting has been part of that step for me and I'm excited to be so close to the finish line. I wrote a peace a few years ago titled 'Hi My Name Is Conor and I Am A Dopamine Addict'. It's hard not to be in today's world. We can fix that though by removing unnecessary noise in our life. My buddy Joe mentioned to me that we should look at social media as a tool to build an audience and be productive rather than as something to consume. I thought that was a great insight.\n\n7/14/23\n\nConor Jay Chepenik",
  "wordCount": 266,
  "readingTime": 1.2037735849056603,
  "claps": 1,
  "voters": 1
}