{
  "id": "7dd7bbf20aed",
  "title": "Day 184",
  "createdAt": "2022-09-22 20:33:09",
  "tags": [
    "bitcoin",
    "debt",
    "bonds",
    "tradfi",
    "protocols"
  ],
  "url": "https://chepenikconor.medium.com/day-184-7dd7bbf20aed",
  "content": "# Day 184\n\nGoing to a Bitcoin meetup tonight which I always look forward to doing. Nice excuse to enjoy a brew and chat about the future of money with others who understand how amazing the Bitcoin protocol is. I was listening to a great podcast today from Svetski featuring a Mises fellow who mentioned religion, like Bitcoin, is a lot like a protocol showing what are the rules that can't be altered and what is optional. Times change which means morality is likely to change. Bitcoin and Religion are different things of course but it is amazing to the similarities between the Bitcoin protocol and religion. BIPs have improved Bitcoin over the years but the consensus rules stay the same. Religion and the various sects in christianity has changed but the underlying principles stay the same. I enjoyed thinking through this metaphor on my run today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F7MKnD3211X116EtHI6i1QB%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F7MKnD3211X116EtHI6i1QB&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fb989295ed8cad29a969d25e0&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nAnyways, worth the listen: good podcast. Also had some fun talking with my buddy from TradFi today about what to buy. My mans is convinced US Treasuries are the best purchase rn. Doesn't take a rocket scientist to figure out what I'm bullish on. Thought this chart from Dylan was absolutely nuts though. Makes no sense that a 30 year bond is yielding less than a 1 year bond.\n\n![](https://miro.medium.com/1*66Hon4ju6eBF1TJ1gxopmw.jpeg)\n\nI mean yikes. That is some yield curve inversion. This is what my buddy in TradFi had to say about why this is happening.\n\n![](https://miro.medium.com/1*XEiT36BKkt2q5RUQOpoE4A.png)\n\nComplex math indeed. Honestly I think he is probably right with all he is saying here but as a Bitcoin maxi I think we just need a new system. Screw our current debt based system. Not a fan at all of fiat currency. Big fan of money backed by energy featuring a protocol set in stone!\n\nThus, I'm going to go talk with some Bitcoiners tonight. See you tomorrow Anon :D\n\n9/22/22\n\nConor Jay Chepenik",
  "wordCount": 314,
  "readingTime": 1.5682389937106918,
  "claps": 0,
  "voters": 0
}