{
  "id": "7e3aa4914098",
  "title": "Day 315",
  "createdAt": "2023-02-01 02:33:24",
  "tags": [
    "long-drives",
    "podcasts",
    "road-trip",
    "bitcoin",
    "parenting"
  ],
  "url": "https://chepenikconor.medium.com/day-315-7e3aa4914098",
  "content": "# Day 315\n\nLong road trip driving down to Florida today. Grandma is not doing well so it's not under the best of circumstances. I was eager to take a long road trip and have Sloan meet my Grandparents so in an unfortunate way I got what I wanted. Careful what you wish for I guess 😔 . The silver lining is I am glad my Grandparents will get to meet their Great Granddaughter soon. The almighty is good and I know everything he does is for a reason.\n\nSince we were driving from New Jersey my partner and I had to stop at a hotel on the way down because it is no easy feat driving with a newborn. I joked when we got out of the car that it feels weird checking into a hotel with no parents. My partner quipped back we are the parents. It was a funny moment. I've stayed at hotels plenty of times before but I can't recall doing so with just my partner and our kid. Being at a hotel on the side of the highway gave me nostalgia for road games when I was playing high school sports. Lot of good memories in both high school and college staying at a random hotels on the side of the highway. Also a lot of pigging out at McDonalds before big games which is probably the last thing you want to eat before athletic competition but that never stopped my teammates and I hahahaha.\n\nDecided to eat a little healthier than McDs tonight so we got some Cracker barrel for dinner because it was close to the hotel. I picked The Country Boy Special: steak, eggs, biscuits, and hash-browns. Delicious! Now we are back at the hotel and I know my baby is appreciating being outside of her car seat. Sloan if you ever read this in the future know that I'm damn grateful you are such an easy going baby. At least on road trips🤣 Something about the car seems to have a calming effect.\n\nListened to some fantastic podcasts on my drive today which I will gladly shill. Seriously listen to these episodes if you enjoy learning about freedom, liberty, Bitcoin, beef, local communities, mushrooms, kleptocrats, and how to shield yourself from the incoming \"shitstorm\".\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F489chEayb8doxqCYbrgjRs%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F489chEayb8doxqCYbrgjRs&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1faf6e66ad7f63ef63d9d36212&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F4MLPPrm6yE5yDK95nZQJ6F%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F4MLPPrm6yE5yDK95nZQJ6F&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f7153b9cc7ee2f468188dbad5&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nI was actually so moved by the Bitcoin Rapid Fire episode with Shane that I asked him to come on my show. I was honestly a bit nervous to reach out because he has quite a large following but my Dad sent me an instagram video (that I'm pretty sured was repurposed from tiktok) which contained a line that said \"If you don't ask the answer is always no\". Even if Shane decides not to come on I'm proud of myself for asking. There will be more guests in the future and my heart was in the right place. If Shane can't come on I will ask other fellow Bitcoiner/ Libertarian/ critical-thinkers on the show. As a matter of fact if you're reading this anon and enjoying chatting about anything I write about I'm always looking for more guests.\n\nThe past two episodes I did for my show were with strangers from Bitcoin Magazine and both were an incredibly enjoyable experience. Only the one with Tim is currently out, but I'll release the ones with Mikal soon. It's amazing how Bitcoin connects people and allows us hope for a better future. Anyways, that is all for today. I meant what I said about reaching out if you think a conversation would be worthwhile anon! Even if you read this years in the future and through perseverance and hardwork I've grown the show a lot I hope you still reach out anyways. If you have a pit in your stomach because you're nervous to do so know that I felt the same thing many times, including today when I was reaching out to Shane. I can't promise I'll get back to you but what I can promise is if you don't ask the answer is always going to be no ;)\n\n1/31/23\n\nConor Jay Chepenik",
  "wordCount": 688,
  "readingTime": 2.5962264150943395,
  "claps": 0,
  "voters": 0
}