{
  "id": "7f1c3e9da62",
  "title": "Day 519",
  "createdAt": "2023-08-24 04:20:16",
  "tags": [
    "media",
    "internet",
    "audience",
    "legacy-media",
    "changing-times"
  ],
  "url": "https://chepenikconor.medium.com/day-519-7f1c3e9da62",
  "content": "# Day 519\n\nTucker hosted Donald Trump and shared the recording on X/Twitter. This feels like a big deal. Not because of a single interview; it's a symbol of the changing dynamics between traditional television and digital media. It exemplifies the growing influence of content distributed across various screens.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=d04bfffea46d4aeda930ec88cc64b87c&schema=twitter&url=https%3A//twitter.com/TuckerCarlson/status/1694513603251241143%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3D4fce0568f2ce49e8b54624ef71a8a5bd\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhat we're witnessing here is emblematic of a broader transformation, where the once mighty mainstream media is fading in the face of internet-based platforms. Established news networks like Fox and CNN are grappling with disruption brought on by the surge of online video content and the popularity of streaming services. This evolution underscores the diminishing influence of conventional gatekeepers and their ability to dictate who can access large audiences.\n\nSocial media is a powerful tool that enabled public figures, such as Donald Trump, to directly communicate with their millions-strong audiences without the permission of traditional media outlets. We are witnessing a transition where the intermediary role that traditional channels once held is fading, and individuals can connect with their followers directly and instantaneously.\n\nBoth Tucker Carlson and Donald Trump possess passionate followings that traverse across multiple platforms. Regardless of personal opinions about these individuals, their ability to command large audiences without relying on mainstream media outlets is clear. The internet provides a more level playing field for anyone with a message, compared with what humanity had in the past. The internet is by no means perfect but it has diminished the necessity of seeking approval from gatekeepers.\n\n![Greek statue breaking out of tv generated with Firefly](https://miro.medium.com/1*o7BZuXE76sMO8fJMPajsOw.png)\n\nThe implications of this trend are far-reaching. It represents a democratization of media, allowing voices that might have been marginalized or excluded by the mainstream media to be heard. Presidential candidates RFK Jr and Vivek Ramaswamy come to mind. Both those guys have grown massive followings by going on long form podcasts. The power to build a substantial following is no longer reserved for a select few with access to established platforms. Now it is open to anyone with compelling content and the ability to connect with an audience.\n\nThis shift is indeed commendable, as it showcases how individuals can leverage the internet to cultivate a dedicated following without having to navigate the cumbersome pathways of traditional media gatekeepers. It's a testament to the power of innovation and adaptability in an ever-changing media landscape. If public figures like President Biden were to embrace similar strategies I would have more respect for him. I personally believe the President of the United States should be harnessing the reach and immediacy of digital platforms to share their message and connect directly with the public. Instead I see clips like this which sadden and upset me.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/disclosetv/status/1693955799197073658%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt also makes me laugh because it is so ridiculous. I'm reminded me of this [Putin interview](https://www.tiktok.com/@thechosenarmy/video/7118034034885741830) discussing the men in dark suits.\n\nI'm hopeful though because big shifts are happening. It is my belief that humanity's capacity to adapt and innovate will propel us forward. In doing so, America is poised to maintain its leadership in the ongoing global media revolution. We the people must remained committed to embracing new paradigms so we can ensure that American voices and ideas not only endure but also flourish in an ever-changing and dynamic world.\n\nOur leaders are not coming to save us. It appears we are in the hard times make strong men phase of history. I'm excited to watch America lead the way as we grapple with new technologies and navigate uncharted territories. This will craft a better world not just for the collective, but for the smallest minority: the individual.\n\n8/24/23\n\nConor Jay Chepenik\n\nIf you prefer listening here is a read of this article on Youtube\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FiSzeB2PpGlA&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DiSzeB2PpGlA&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>",
  "wordCount": 610,
  "readingTime": 2.5018867924528303,
  "claps": 3,
  "voters": 1
}