{
  "id": "80337bf98cd0",
  "title": "Day 8",
  "createdAt": "2022-03-31 00:05:05",
  "tags": [
    "rat-poison",
    "mème",
    "bitcoin",
    "stream-of-consciousness",
    "op-ed"
  ],
  "url": "https://chepenikconor.medium.com/day-8-80337bf98cd0",
  "content": "# Day 8\n\n![Society's \"narrative\" might've lost the plot](https://miro.medium.com/1*9ZGivK3r17PC7ViCzVil6w.jpeg)\n\nIt's funny how quickly humans are to group together. Makes sense considering people are a lot more resourceful when we use tools and work in groups. What developed as a biological imperative is now not as necessary in our modern-day age. It's crucial people still work together, but if you get kicked out of your \"in-group\" you are no longer likely to starve. The problem with groups is when the hive mind takes over and the individuals inside the group can no longer see nuance. Just look at the republicans and democrats in the United States. Both parties claim they want to make their constituents' lives better but the only partisan thing these groups agree on seems to be insider trading.\n\nRules, not rulers is an important way to think about how people can cooperate to create great things. Bitcoin doesn't give any holder a special advantage. Everyone must agree to its rules in order to use the network. Proof of work makes sure every user is treated according to the rules no matter how much 🌽  they might have stacked. It is likely those who adopt bitcoin early will see an increase in their purchasing power in USD terms. With a fixed supply it seems as long as demand for bitcoin goes up so will the price. Bitcoin is finite while fiat is infinite. The more people learn about how corrupt the debt based fiat system is the sooner we can tear it down and build a better one. A financial system that doesn't allow for so many parasitic businesses to drain the resourceful ones. A system where anyone can banks themselves with an internet connection and confidently know that a central banker can't and wont create money(bitcoin) out of thin air.\n\n![](https://miro.medium.com/1*NplPv72qifjWHoAY0o6X9A.jpeg)\n\nSociety should keep innovating until we live in a world of abundance and people are free to spend their time doing only what they desire to do with their time. I have no idea what this society would look like and I hope it's not a WALL-Eisk one where humans look like floating pigs. Only thing worse than that is a society run by pedohiles and morally corrupted people. Hard to believe massive corporations who make children's movies are upset that Florida passed a bill that allows parents to know what their pre K-3rd graders are being taught. My social feeds are filled with way too many people upset about this bill passing. Groomers suck.\n\nAnyways, groomers won't win in the long run. They can't meme and no one with any deceny wants to live in a world where the purest forms of joy are being taught about concepts that won't make sense to them since they are small children. Truth and love will find a way to win. Learning about the importance of being open-minded and realizing everyone is unique is great. Bitcoin will garner a society that optimizes for this. If you can't steal or print away people's money it becomes a lot harder to abuse basic human rights. Fiat will continue to create an even more pervasive and corrupted society than the one we are currently living in. Charlie Munger called bitcoin rat poison and he's right. Most people don't realize Munger and the rest of the fiat maxis are the rats. Thanks for reading my stream of consciousness op-ed anon.\n\n![](https://miro.medium.com/1*YK7JPPAbeXqqzqt0daHjJg.jpeg)\n\n3/30/22\n\nConor Jay Chepenik",
  "wordCount": 569,
  "readingTime": 2.697169811320755,
  "claps": 1,
  "voters": 1
}