{
  "id": "803bab6cea65",
  "title": "Day 827",
  "createdAt": "2024-06-27 01:45:23",
  "tags": [
    "playful"
  ],
  "url": "https://chepenikconor.medium.com/day-827-803bab6cea65",
  "content": "# Day 827\n\n![[https://x.com/ConorChepenik/status/1806138489898958987](https://x.com/ConorChepenik/status/1806138489898958987)](https://miro.medium.com/1*iREHGkZSi_2pAaGtWk-Sbw.png)\n\nLife is better when you approach it with a playful mentality. There is so much bullshit to dread over so figure out how to stay above it. I promise you that you will end up better off.\n\nI watched a long clip of Tucker just absolutely roasting journalists who asked him ridiculous questions. It's worth the 20+ minutes:\n\n![[https://x.com/TuckerCarlson/status/1806034521369776406](https://x.com/TuckerCarlson/status/1806034521369776406)](https://miro.medium.com/1*4O6gwaHCTgtIt-BJWzhiDg.png)\n\nThe whole time Tucker laughs and remains playful. This is not an easy skill especially when a journalist implies that you are responsible for mass shooters. It would have been easy for Tucker to get angry and emotional, especially in front of such a large audience. However, he kept his cool and destroyed every journalist that asked dumb questions like the ones asked in the above clip.\n\nFor those who would defend the journalist please watch the clip before doing so. I have plenty of bias but as a journalist myself, I strive for truth and substance over gotcha moments or reporting on topics I don't fully grasp. The journalists questioning Tucker seemed to operate with different priorities, to put it kindly.\n\nIt's encouraging to see social media expose those who would gladly tell a lie and carry water for legacy media organizations that are rapidly dying. By maintaining a playful attitude and commitment to truth, we can collectively elevate the quality of public discourse and journalism. It all starts with staying playful😎\n\n6/26/24\n\nConor Jay Chepenik",
  "wordCount": 237,
  "readingTime": 1.2776729559748428,
  "claps": 2,
  "voters": 1
}