{
  "id": "83eda1339ff0",
  "title": "Day 483",
  "createdAt": "2023-07-19 03:26:22",
  "tags": [
    "money",
    "children",
    "saquon-barkley",
    "jack-mallers",
    "honest-conversation"
  ],
  "url": "https://chepenikconor.medium.com/day-483-83eda1339ff0",
  "content": "# Day 483\n\n**0 to 1**\n\nThat is what it feels like watching your kid go from being completely dependent on you right after birth to bopping around and sitting up on their own in about 6 months. It is a profound experience to witness your child's development and personality unfolding before your eyes. Even more amazing to think I'm shaping it. My guidance, care, and interactions contribute to the formation of who she will become.\n\nThere is a lot for me to learn as I watch her grow up and get to experience things for the first time. Often she reacts in ways I wouldn't suspect that make perfect sense with hindsight. For example, she makes the funniest faces when trying new foods as if she does not like them. Then she will slowly keep eating this new food and by the end she is all smiles and giggles. It's a continuous process of discovery, both for her and me as a parent. It is cool to get to see the excitement of a new born trying something for the first time. I need to cherish each step of this incredible journey.\n\nOn my walk back from Boston Bitdevs tonight, I had the pleasure of listening to an incredible podcast featuring Saquon and Jack. Their conversation was truly fantastic, showcasing the remarkable talents they each possess in their respective fields. It was fascinating to witness the interconnectedness of seemingly disparate subjects and how they all tie back to the world of markets.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FczNTQjMwV6I%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DczNTQjMwV6I&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FczNTQjMwV6I%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nCoincidentally, earlier today, I engaged in a thought-provoking discussion with a knowledgeable individual named Eric, who possessed a deep understanding of markets and mathematics. While the conversation focused more on using data to make informed decisions afterwards it made me think about the importance of having more genuine and honest conversations about money. Jack and Saquon lay out a clear case about how many current markets are broken because of a \"rotting dollar\". In my own conversations today it was clear that there is a need to adapt better money in our rapidly evolving world. Better money supports individual sovereignty. By fostering open dialogue on these topics, I firmly believe that humanity can thrive. Money, being a technology, must be thoroughly understood and optimized so that we can allocate less attention to trivial matters and focus more on what truly matters - people honing their skills and passions.\n\nUltimately, money serves as a means to facilitate more efficient trade - a notion that can be summarized in a single sentence. My hope is that I can impart this valuable lesson to Sloan, empowering her to pursue her true calling and explore her passions without becoming overly fixated on financial concerns. It is undoubtedly a challenge when the value of money loses purchasing power because one group can create the technology without facing the same opportunity cost everyone else does. Which is why we can all be grateful that Satoshi Nakamoto solved the Byzantine General's double spend problem through the creation of Bitcoin :D\n\n7/18/23\n\nConor Jay Chepenik",
  "wordCount": 510,
  "readingTime": 1.9245283018867925,
  "claps": 0,
  "voters": 0
}