{
  "id": "83f11796d6bf",
  "title": "Day 605",
  "createdAt": "2023-11-18 05:03:02",
  "tags": [
    "effective-accelerationism",
    "ai",
    "openai",
    "sam-altman",
    "effective-altruism"
  ],
  "url": "https://chepenikconor.medium.com/day-605-83f11796d6bf",
  "content": "# Day 605\n\nSam Altman was outed as the CEO of OpenAI today. Still cracks me up this company was founded on the idea of having open source AI and yet it is no longer open source.\n\nI'm curious to see what this move does to OpenAI's product. From what I can gather on Twitter/X the effective altruists have taken over. Which I'm not sure if that is true but if so huge L for OpenAI. Those are the same people who blew up FTX. I don't care how good Sam's intentions were, bankster-fraud caused immense pain & suffering.\n\nSo I hope that is not the case but only time will tell. I came across this tweet and it seemed to do a good job describing what actually happened. Maybe it is completely off base so of course take it with a grain of salt. At the least it is an interesting read :)\n\n> What happened at OpenAI? > Nov 2 -> Sam was in the room, when the team demonstrated the next big improvement. 3 times before in OpenAIs history, most recently with GPT-4, they'd pushed back the veil of ignorance and pushed forward the frontier of discovery. As he watched the latest advance, he was already planning for the next moves: the funds that would have to be raised, the resources that would have to planned for > Nov 4 - Ilya was unsettled. They'd reached a threshold of autonomy that was concerning, while the alignment team was still just adding capability instead of emotion, actual love for humanity. They needed more time to figure out the research pathway instead of hurrying to deploy product. > Nov 6 - OpenAI dev day goes well. Lots of kudos. They release the announced products over the next several days After dev day, Greg and Sam are in full on fund raising mode. They're targeting 90 billion valuation, a 3x lift from 30 billion. OpenAI recruiters are already calling Google employees with 10–20 mil 4 year packages telling them if they join now they'll make it in before the valuation increase. Nov 9 > Greg meets Emanuel Macron for a photo op, afterwards take investor meetings in Paris. OpenAI is now at the sovereign wealth fund, European family money sized investment Nov 13 > in an interview with the Financial Times in London, Sam confirms for the first time that work has begun on GPT5 and that he's fundraising. Nov 14 > OpenAI pauses ChatGPT subscriptions, as they're totally out of capacity for inference. Usage has spiked post dev day. Nov 16 > APEC CEO summit, Sam confirms the Nov 4 next step up discovery By this point Ilya is pissed and scared. The fundraising tour has caught him by surprise. The usage numbers have spiked and now they don't have enough servers for the research team, meaning they have to fundraise again to support research. Events are starting to move beyond him. Nov 17 10 am > board meeting starts. Ilya produces 2 23 year old staff engineers (rumor) to describe progress and dangers to the board. Turns into a battle when he says they shouldn't be fundraising and shouldn't be expanding and that Sam was out on tour without board agreement. Sam points out that as the CEO he has to stay ahead of the team and manage news flow in advance of the team's needs. \"We're going to need more money for more data centers\" Ilya has a fit. Things come to a head. A vote is taken. Sam is out. The board demotes Greg, who is not at the meeting as Sam is authorized to cast his vote.\n\nActual Tweet here\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/8teAPi/status/1725724907722752008%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nSpeaking of OpenAI their product still slaps and I used Dalle to make this Bitcoin sunrise image. Quite happy with how it turned out.\n\n![](https://miro.medium.com/1*iLLPOlof08bJR_PUmngAHA.png)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1725663517938758104%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThought this photo was so dope I put it on a mug and a hoodie. You can get yours [here](https://chep.creator-spring.com/) if interested. Or since it is just a png file hosted on Medium you can also copy it and make your own. I will not be offended because unlike OpenAI I love the idea of open-source software.\n\nI say that facetiously. OpenAI has done some real good with chatGPT in my opinion. I'm eager to see how this all plays out. As an effective accelerationist (the idea of speeding up technological progress) I want humanity to embrace these tools. Honestly e/acc seems like a meme ideology created to combat the ridiculousness that is effective altruism and I absolutely love that.\n\nSo here is to effective accelerationist!🍻  🥂\n\n![[https://x.com/balajis/status/1725740901413380213?s=20](https://x.com/balajis/status/1725740901413380213?s=20)](https://miro.medium.com/1*XsmQO9Gyl9w_nd0qG9q1rQ.png)\n\n11/17/23\n\nConor Jay Chepenik",
  "wordCount": 771,
  "readingTime": 3.2927672955974843,
  "claps": 0,
  "voters": 0
}