{
  "id": "8434a25b921e",
  "title": "Day 783",
  "createdAt": "2024-05-14 03:33:04",
  "tags": [
    "gme",
    "bitcoin",
    "meme-stocks",
    "new",
    "paradigm-shift"
  ],
  "url": "https://chepenikconor.medium.com/day-783-8434a25b921e",
  "content": "# Day 783\n\n![[https://x.com/Cancelcloco/status/1790149359381913687](https://x.com/Cancelcloco/status/1790149359381913687)](https://miro.medium.com/1*kq44NRr7R5Igl1PjJcFByw.png)\n\n![](https://miro.medium.com/1*UYFgG1eaI5fo47oTeZ1HMA.png)\n\n![[https://www.tradingview.com/chart/AM4VvwL9/?symbol=GME%2FUSD](https://www.tradingview.com/chart/AM4VvwL9/?symbol=GME%2FUSD)](https://miro.medium.com/1*cuSwZRKyJj_IkC4FhJs1IA.png)\n\nI had forgotten about GME but Ian from the Cancel Clothing Co makes some excellent points. The central question is whether regulators and financial authorities will bend the rules in dealing with the GameStop situation, or act impartially and in good faith. History suggests the former is more likely, though it would be a pleasant surprise to see the latter ethical approach taken.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/NomadDotBTC/status/1790136610677313904&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nUltimately, we need not rely on central planners and authorities when it comes to finance and markets anymore. This is an incredibly exciting time, as human ingenuity is rapidly ushering in decentralized alternatives. We should place our trust in math, code, free speech, open discourse, and free market principles - the unbounded creative forces that drive innovation.\n\nDecentralized protocols and systems like Bitcoin represent the leading edge of this transformation. They are superior to traditional centralized finance controlled by bureaucrats prone to manipulation, fractional reserve lending, and arbitrary rule changes. The change won't happen overnight, but the pace of progress today is unprecedented in human history.\n\nI'm exhilarated thinking about what tinkerers and builders will create next with decentralized technologies. No human system should be above transparency, accountability, and the immutable rules of mathematics and physics. Using computer code Satoshi was able to discover digital scarcity. The creation of the timechain is a revolutionary thing that marks the beginning of the end for the era of privileged insiders rigging the game in their favor.\n\nThe democratizing power of open source innovation is unseating entrenched centralized powers. We are witnessing the birth of a new financial paradigm built on the core principles of decentralization, disintermediation, and individual empowerment. What an amazing time to be alive 😎\n\n5/13/24\n\nConor Jay Chepenik",
  "wordCount": 284,
  "readingTime": 1.6216981132075472,
  "claps": 4,
  "voters": 1
}