{
  "id": "84750c5ebece",
  "title": "Day 629",
  "createdAt": "2023-12-12 03:51:12",
  "tags": [
    "freedom-of-speech"
  ],
  "url": "https://chepenikconor.medium.com/day-629-84750c5ebece",
  "content": "# Day 629\n\n![Shout out Canva and DALLE](https://miro.medium.com/1*iMfzFBQamRpEnTQytcq2cQ.png)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FBEW2aYQlXo4&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DBEW2aYQlXo4&image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FBEW2aYQlXo4%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nDespite the clickbait title for this Twitter spaces which was posted on Youtube it was an amazing conversation. X (& Nostr too but it does not have the reach X does) stands as the only social media platform globally, boasting an unwavering dedication to free speech (within the confines of the law) and it is reshaping the world as we know it. The right to express one's thoughts freely is vital for humanity to thrive and prosper.\n\nWithout the freedom to articulate diverse ideas, opinions, and viewpoints, genuine exchanges simply cannot flourish. Free speech lays the groundwork for creativity and innovation, which are indispensable for advancement in all human pursuits, be it science and technology or art and culture. When the ability to express one's thoughts is stifled, everything crumbles.\n\nIt's difficult to fully capture the depth of the First Amendment in the United States. Without the liberty to voice our thoughts, we can't challenge the norm, question authority, or hold those in power responsible. Only those who desire control above all else wish to suppress critical thinking and impede our capacity to learn from past errors, ultimately stunting our growth as individuals and as a collective.\n\nMoreover, free speech is a fundamental human right that is closely linked to other rights such as freedom of thought, conscience, and religion. It is a cornerstone of democratic societies and a vital tool in the fight against oppression and tyranny.\n\nIndeed, democracy may be the worst form of governance, but it remains the best option we have. Thus, we must strive to ensure that democracy functions as optimally as possible, making the most of the hand we've been dealt.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/BradCohn/status/1734301338706563075%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nPretty funny tweet. I post it here for two reasons. Do not be the black pilled chud who thinks everything in life is hopeless. Also do not trust always verify. Brad does present some solid facts, but it's important to listen to what they are actually saying and determine if their actions align with a humanist agenda or a depopulation agenda.\n\nDo not rely on someone else to save you, but it is okay to have faith that there are people who genuinely want to do good in the world. Don't just complain about the ones you don't like; focus on supporting those who are working towards positive change.\n\n12/11/23\n\nConor Jay Chepenik",
  "wordCount": 392,
  "readingTime": 1.6792452830188678,
  "claps": 0,
  "voters": 0
}