{
  "id": "84d5e1a63585",
  "title": "Day 231",
  "createdAt": "2022-11-08 23:57:18",
  "tags": [
    "comp-sci",
    "fasting",
    "cryptotwitter",
    "binance",
    "ftx"
  ],
  "url": "https://chepenikconor.medium.com/day-231-84d5e1a63585",
  "content": "# Day 231\n\nDecided to fast today and it reminds me how much joy I take in eating. I'm honestly not even that hungry I just want to eat something for the pleasure of eating tasty food. I've been seeing a lot of people talk about the health benefits of fasting so I wanted to try it myself. Been talking about it forever but today was the day I actually followed through. I do think there is some clarity benefits. Fasting seems like it is the best way to burn the most toxic fat cells on your body. No idea if this is true but I saw a man on the internet talk about how the Japanese studied this and concluded that fasting was super helpful so I'm sold. Best case scenario I detox and worst case scenario I find fasting is not for me.\n\nPretty crazy to think about the abundance of food in developed countries. I heard somebody on this podcast say \"Human's are the first animal to be out of shape\". Or something along those lines. We have also made animals become obese via factory farming.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F1SmgvFUP1TZg6CaTAomaeh%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F1SmgvFUP1TZg6CaTAomaeh&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f913800890bf76ed436b4cdba&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nWhile I might be botching the paraphrasing there is a lot of insight in that point. You don't see any fat animals in the wild. Only once they have been domesticated do they become lazy and docile. Crazy to think that many people have an abundance of food but a majority of that food is low quality food. Modern society is great in a lot of ways and in other ways it is causing many to be neurotic, unhealthy, anxious, and annoying. I find myself constantly battling some of these feelings. Exercise, meditation, and talking with those you love seem to be the cure as far as I can tell. Writing does not hurt either.\n\nFinally, I enjoyed these comp-sci topics being explained in a short youtube video. I found it drove home many of the points I've been learning about in my own comp-sci journey. Excited to keep learning.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F-uleG_Vecis%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D-uleG_Vecis&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F-uleG_Vecis%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nAlso wild to see Binance buy FTX after CZ decided to dump FTT. Had to mention it because it was pretty funny to watch play out out on cryptotwitter.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=http%3A//twitter.com/cz_binance/status/1589374530413215744&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nHistory does not repeat but boy does it rhyme!\n\n11/8/22\n\nConor Jay Chepenik",
  "wordCount": 382,
  "readingTime": 1.441509433962264,
  "claps": 0,
  "voters": 0
}