{
  "id": "84f9acabae0d",
  "title": "Day 31",
  "createdAt": "2022-04-22 22:38:26",
  "tags": [
    "political-elite",
    "date-night",
    "leaving-your-phone",
    "comedy",
    "friday"
  ],
  "url": "https://chepenikconor.medium.com/day-31-84f9acabae0d",
  "content": "# Day 31\n\nWent on date night last night and had an incredible time. My girlfriend suggested we leave our phones and my immediate gut reaction was hell no. I quickly realized how addicting my phone is to cause a reaction like that so I agreed it was probably a good idea to disconnect. Thus, we both left our phones and had a lovely dinner. It was so much easier to engage and have a thoughtful conversation without a smartphone in my pocket to distract me. At one point my girlfriend had to get up to go to the bathroom and I joked \"What am I supposed to do while you're gone?\". We both laughed but truth be told it is kind of sad that being without entertainment for 3 minutes is something worth joking about. My girlfriend and I made a plan to go to dinner every Thursday because it's so easy to lose track of spending meaningful time with those I love because life gets busy. Truth be told we make time for the things that matter and I want to make sure I'm spending enough time with those who are dear to me. I doubt people will be standing out my funeral talking about \"he was such a good salesman\" so while I'm going to remain positive about my work I'm never going to kill myself or sacrifice my relationships for a job (unless I get a bitcoin job later on🤣).\n\nOutside of that, I'm happy it's Friday. Joked last night with my girlfriend that it's kind of ridiculous how time is a made-up construct. Like the fact people dread Mondays and cherish Fridays is kind of ridiculous when you stop and think about. I still feel these ways about Monday and Friday usually but at least I recognize it. It shouldn't make a difference and I need to rewire my brain to remember this. No easy task because when the weekend hits after a long day of work I'm usually feeling pretty good. Pretty sure one of my first posts on Medium was about how good it feels when the weekend hits.\n\n![](https://miro.medium.com/1*2AGpWDkX8W-AXF8kUIGYqQ.jpeg)\n\nSaw this meme the other day and cracked up. While I do think the U.S has an incredible history we are at a pivotal moment. Our government loves printing money to fund themselves while simultaneously kicking the can down the road for future generations. If we only had a scarce, permissionless, decentralized protocol with a fixed supply that no one individual controlled🤔\n\nDon't overthink anon. As my boy Pomp likes to say, \"Get off Zero\"!\n\n4/22/22\n\nConor Jay Chepenik",
  "wordCount": 435,
  "readingTime": 1.8415094339622642,
  "claps": 0,
  "voters": 0
}