{
  "id": "84f944d6ae7e",
  "title": "Day 861",
  "createdAt": "2024-07-31 01:41:08",
  "tags": [
    "censorship",
    "will",
    "never",
    "win",
    "freedom-will"
  ],
  "url": "https://chepenikconor.medium.com/day-861-84f944d6ae7e",
  "content": "# Day 861\n\n**Unfiltered Truth & The Futility of Censorship**\n\nCensorship has long been a tool of those in power, used to suppress dissent and control narratives. In today's digital age this tactic is not only ineffective but also counterproductive. The rise of social media has given a voice to anyone with an internet connection, allowing people to hear multiple perspectives on any given issue. While this has created a lot of noise, it has also expanded the marketplace of ideas. Just because some ideas are silly, bad, or outright wrong does not mean we should censor them. As Elon Musk humorously pointed out, parody is a protected form of expression under the First Amendment, and attempting to censor it only serves to undermine the principles of free speech.\n\n![[https://x.com/GavinNewsom/status/1817768956754788440](https://x.com/GavinNewsom/status/1817768956754788440)](https://miro.medium.com/1*UIB4RaSTQqY45ro8gBOQ-A.png)\n\n![[https://x.com/elonmusk/status/1817775398047937009](https://x.com/elonmusk/status/1817775398047937009)](https://miro.medium.com/1*a07X3tFS84d2r8oCAeeNrw.png)\n\nIt does not matter if the censorship is coming from the left, right, or center. Those who believe in free speech should maintain consistency when arguing in favor of free speech. If the roles were reversed and someone made an AI parody of a different political figure, the same principles should apply. Mocking, scorning, and criticizing those who would undermine the First Amendment for political reasons is not only acceptable but necessary. History has too many examples of dictators suppressing dissent and speech they don't like to commit atrocities. It is only by speaking truth to power and challenging the status quo does a society become more just and prosperous.\n\n![](https://miro.medium.com/0*8o1cCRzwxG-m-5-0.png)\n\nSimilarly, in the realm of economics & finance, transparency and truth are equally vital. Politics is downstream of money, because financial interests often shape political decisions and power structures. If people don't stand up then \"experts\" will assert with a straight face that [printing trillions of dollars won't cause inflation](https://www.cnbc.com/2020/07/23/why-trillions-of-dollars-in-economic-stimulus-may-not-create-inflation.html), and if it does, then it will be [transitory](https://youtu.be/Z1anoZkxHMg).\n\nThe emergence of Bitcoin makes such deception impossible. It takes the concept of unfiltered truth a step further. Unlike gold, which required centralization and was eventually corrupted, Bitcoin overcomes these shortfalls by providing a decentralized, mathematically-driven record of transactions. Bitcoin has created a new kind of history book - one written not by the mighty but by the cold, hard language of mathematics. One that can't be corrupted or revised or changed by the powerful no matter what they do.\n\nThis has far-reaching implications for our understanding of truth and reality. No longer must we rely solely on the whims of powerful institutions to tell us how we should understand the world. We don't need to trust G.D.P, C.P.I, or unemployment numbers and wait for revisions to know if we are seeing accurate results. Instead, we can [verify for ourselves using a computer and Bitcoin's open-source ledger](https://bitcoin.org/en/bitcoin-core/). While the network is pseudonymous, people can still observe the intricate web of relationships, the flow of resources, and the way power dynamics play out if we know who owns the public key associated with a wallet.\n\n![[https://x.com/parkeralewis/status/1818011021182910967](https://x.com/parkeralewis/status/1818011021182910967)](https://miro.medium.com/1*naNdvBKFHqzXfZkA5Qr5XA.png)\n\nThe power of this system is starkly illustrated in the tweet above from Parker Lewis. As he points out, the U.S. government, despite being $35 trillion in debt, was able to move the equivalent of $2 billion dollars worth of bitcoin for a mere 66 cents, and it did so outside the traditional U.S. banking system. This transaction, involving confiscated Silk Road funds, demonstrates the unprecedented efficiency and transparency of the Bitcoin network. There is nothing else on the planet that can move such vast sums of value so cheaply and easily; it is a paradigm shift in how we approach both value and truth.\n\nFor too long, people have been fed a diet of half-truths, propaganda, and spin to make us think the current system - allowing some entities to create money out of thin air - is acceptable. If you controlled the current system, then buying up media companies to run cover for your shenanigans is actually a great strategy. However, lies might be useful in the short term, but in the long term, they will cost you your audience. Trust is hard to gain and easy to lose.\n\nAs traditional systems become increasingly determined to censor and control information, people will reject such opacity and seek alternatives. The media landscape is changing rapidly. No person, company, or nation-state will get everything right, but those embracing and seeking the truth will fare much better than those willing to lie for their own personal gain. The world is complex, messy, and multifaceted. That is why there is so much value in creating a more honest understanding of the world with the digital technologies that are becoming an increasing part of our everyday life.\n\nThe challenge is that under a system based on fiat currency, censorship must increase to prevent people from rising up. As Henry Ford aptly stated:\n\n![](https://miro.medium.com/0*NPZFtCA5TKKPZsis.jpg)\n\nCensorship will always be a weak argument. Those who censor are showing you through their actions that they want to silence dissent and control narratives instead of allowing the free flow of ideas and truths.\n\nThat's why Newsom calling for censorship is both insane and a violation of the oath he took to protect the Constitution as Governor of California. If you can't take a joke, you are probably taking yourself too seriously. Humor is a powerful tool for challenging authority and questioning the status quo. Powerful people hate being mocked, so mock them if they deserve it. The worst kind of politician is one who creates new laws to ban \"bad speech,\" especially when existing laws already allow it. Such actions are extremely dangerous for democracy because they set a precedent for the suppression of free thought and expression.\n\nOur individual perspectives, experiences, and biases are the essence of our humanity. Life is inherently messy, and so are our viewpoints. However, this diversity of thought is not a weakness but a strength. By grounding our subjective perspectives in a shared, objective reality, we can construct a more comprehensive understanding of the world. Reject censorship and embrace the challenge of seeing through multiple lenses. This requires stepping into the shoes of others and acknowledging that every human being, including ourselves, is prone to distorting truth and propagating our own versions of reality. Rather than futilely attempting to bypass these human tendencies, we should strive to understand them and use this awareness as a compass in our quest for truth.\n\nTo recap, censorship is not merely ineffective - it is antithetical to the pursuit of truth and progress. We cannot silence our way to enlightenment or understanding. Instead, we must courageously embrace the raw, unfiltered reality that emerging technologies like social media, Bitcoin, AI, and others are rapidly laying bare. Our individual choices and actions hold immense power. Each time we resist censorship, each time we seek truth over an agenda, we contribute to building a world that is more free and prosperous. A world where censorship and half-truths can no longer be wielded as weapons by the powerful. The path forward is clear: embrace the chaos of diverse opinions, reject the false comfort of censorship, and together, let's build a future where the unfiltered truth illuminates our way.\n\n![](https://miro.medium.com/1*A7zLBBHVwIsgxahKTrtgHA.png)\n\n7/30/24\n\nConor Jay Chepenik",
  "wordCount": 1188,
  "readingTime": 5.433018867924528,
  "claps": 1,
  "voters": 1
}