{
  "id": "8813f75609a4",
  "title": "Day 414",
  "createdAt": "2023-05-10 20:18:29",
  "tags": [
    "money",
    "printer",
    "goes",
    "brrrrrr",
    "rrrrrr"
  ],
  "url": "https://chepenikconor.medium.com/day-414-8813f75609a4",
  "content": "# Day 414\n\nHAHAHAHAHAHAHA oh my gosh. This 14 second video is hilarious. 😂📹\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/MartyBent/status/1656381655286796301%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nBut you know what's not funny? The state of our financial systems. Both the U.S dollar and 99.9% of crypto are like big Ponzi schemes, where people literally make money out of thin air. It's a troubling realization that we can't ignore. 💸 🤔\n\nWhether you're the United States Government or a CrYpTo BrO, printing money out of thin air is simply wrong. We should be grateful to Satoshi for releasing Bitcoin in an ethical way. It's increasingly clear that money printing has negative consequences for society.\n\nWhat brings me joy is seeing politicians openly admit that we're printing money, while thinking the excuse \"We are the U.S Government\" makes it acceptable. But legality doesn't automatically make something right. There are plenty of broken and corrupt laws that only make our society worse.\n\nTake, for example, the ability for the Fed & the Treasury to work together and print money like they did in 2020. It's a clear demonstration that laws aren't always a good moral compass. We need to question and challenge these practices that harm society as a whole.\n\nSocial media is not perfect but it's great that we can use it to stay informed about the financial systems that affect us all. It's time to demand transparency, ethical practices, and a more responsible approach to money. Together, we can make a difference and build a better future.\n\n![](https://miro.medium.com/0*9CPDshWZTumxZasb.jpg)\n\n5/10/23\n\nConor Jay Chepenik",
  "wordCount": 246,
  "readingTime": 1.1283018867924528,
  "claps": 0,
  "voters": 0
}