{
  "id": "88282cb927f7",
  "title": "Day 158",
  "createdAt": "2022-08-27 23:12:02",
  "tags": [
    "information",
    "mainstream-media",
    "podcasts",
    "food-intelligence",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/day-158-88282cb927f7",
  "content": "# Day 158\n\nEnjoyed shooting some guns with my Grandfather today. It was nice to spend some quality time with the father of my father. Also humbling to go shooting and realize how challenging it is to hit a target that isn't even moving. Imagine trying to hit a moving target while under fire. I don't think many appreciate what a challenge it is to properly handle firearms and accurately hit your target. I feel exhausted after a good day of shooting and I'm even more impressed with [Elijah](https://nypost.com/2022/07/19/elisjsha-dicken-killed-indiana-mall-shooter-jonathan-sapirman/) who saved countless lives by being a patriot and carrying a firearm. It's easy to say you could do something in a certain situation, but going shooting today reminded me that proper handling of a firearm is much more difficult than it looks in the movies. Then again it depends on the movie because in certain films the shooters can't hit anything.\n\nIt is a shame we have politicians trying to ban assault rifles while at the same time arming departments like the department of agriculture and the IRS with the same weapons. Absolutely ridiculous behavior that any logical person could see as \"the government gearing up to impose their will on the people\". That is me putting it nicely. It has been really good being able to talk with my grandparents about how we see the world. They have some really interesting perspectives and provide me a lot of hope for the future. My Grandpa is convinced that the republicans can get in office and turn this country around. I'm not so convinced myself, but I do hope candidates like [Bruce Fenton](https://twitter.com/brucefenton) can get in power. I wouldn't qualify Bruce as a republican, rather a dude who had the common sense to realize he needed to pick a party to get elected otherwise he wouldn't stand a chance. Sad that the system is the way it is, but this system will be cracking soon enough if they keep trying to impose their will and end up inflicting pain on the masses. Pain is the greatest teachers and you can only push people so far before something breaks. Central planners are pompous idiots and there will be a day of reckoning. Wether that day is in the afterlife or on this earth is up for God to decide; maybe it will be both. In the meantime I am going to keep educating myself, spreading love, and seeking truth.\n\n![](https://miro.medium.com/0*IKMhpEi19TvT6C4E)\n\nSo damn true man. This meme hit different: information is powerful stuff. You know what is equally as hard, if not more difficult, to control than a gun? Information! Many bad actors use \"information\" as a way to coerce the masses to do bullshit and I'm glad to see TCP/IP making it more difficult for these people to control information. On the one hand they have gotten more power to manipulate, but for those who choose to do their own research you can find incredible conversations about almost any topic using the internet. These past 2 years specially, podcasts have helped me see the world for what it really is. I'm still young and have a lot to learn about the world. That is for sure. The more I learn the more I realize I know so little and it humbles me, but it also reminds me that the world is my oyster. I can say personally that podcasts have been an amazing white pill because I've been able to listen to some of the brightest minds in the world go on and on about topics I have almost no expertise in. Not to say some podcasts aren't bullshit, but for the most part I find it's a lot harder to bullshit in a long form conversation than it is to bullshit on a 1 minute news clip.\n\nThought this podcast with [Texas Slim](https://twitter.com/modernTman) was incredible. The man is doing his part to make the world a better place and not bitching about how it's unfair that \"big food\" is screwing over the little guy.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FtrDdMrn-sgA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DtrDdMrn-sgA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FtrDdMrn-sgA%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nPretty cool to learn about how amazing America is when it comes to beef and what my boy Texas Slim is doing to help the U S of A decentralize the production of said beef. I didn't know anything about beef outside that I like to eat it and that grass fed beef is better than grain fed beef. This podcast was so eye opening. Words can't even describe how fortunate I feel that I am living in a time with access to all these incredible resources. It's hard not to get frustrated with the matrix with all the B.S going on, but I'm also reminded that life is what YOU make of it. I need to make it worthwhile rather than bitch because I'm not in love with my job. I literally have countless resources at my fingertips. An internet full of people willing to help me learn.\n\nI've been thinking about how getting in better shape improves your sex life so much. Despite not being a biologist (been cracking that joke so much recently because everyone I know finds it hilarious and it is comical that a supreme court justice made the statement she didn't know what a woman is because she was not a biologist) I can only speak from the experience of a man. That said, getting in better shape has improved my libido, increased the size of my genitals and made my girlfriend more attracted to me. I'm not for fat shaming people, but there is a big difference between calling someone fat to be a dick and trying to help someone take control of their weight. It's amazing that society is putting obese people as models. I mean it would be funny if it wasn't so sad. I genuinely can not think of any good reason for wanting to be overweight outside of being a sumo wrestler. You don't feel as good, you aren't as attractive for a potential mate, and if you're a dude then your penis shrinks because it is surrounded by fat. Weird tangent, but it relates a lot to food. Seed oils, something Texas Slim and Pomp talks about have really done damage to people's metabolic health. I chuckled and then I felt sad when I heard Texas Slim call it metabolic bankruptcy. That is a pretty good way to think about it. Our metabolism pretty much \"goes out of business\" and people put on massive amounts of weight and feel awful. Being out of shape is hard and being in shape is hard. It's just a different kind of hard. One of them you feel like shit all day except for when you are stuffing your face. The other you feel pain when you're grinding, but much better when you aren't smashing weights or crushing a run. Anyways, I think everyone has their own journey and path to figure out what works for their own body. In general, most people overcomplicate a healthy lifestyle. I'm so far from perfect it's not even funny. I still try and eat as much meat as possible, listen to educational content like Texas Slim on Pomp's podcast so I can better understand \"food intelligence\", and I make it a habit to walk, run, and exercise. Those habits add up over time and I can confidently say it has improved my mental health, my sex life, and the way I view myself. Still a lot of work to be done, but I'm proud of building solid habits.\n\nHumans have a habit of underestimating exponential growth. Don't be one of those humans anon.\n\n8/27/22\n\nConor Jay Chepenik",
  "wordCount": 1273,
  "readingTime": 5.003773584905661,
  "claps": 0,
  "voters": 0
}