{
  "id": "88ef0544ef5b",
  "title": "Day 2",
  "createdAt": "2022-03-25 02:45:57",
  "tags": [
    "born-to-run",
    "bitcoin",
    "loving-hard-stuff",
    "day-2",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/day-2-88ef0544ef5b",
  "content": "# Day 2\n\nFlew back to the place I grew up, Jacksonville Florida, to see my youngest sister play at her senior night. It was a bittersweet moment for my entire family, especially my father who lives and breathes his kid's high school athletics. My father was adamant I show up looking nice and fortunately for him my Grandma got me my new favorite shirt. I rocked this bad boy to the game and let's just say I didn't go unnoticed.\n\n![](https://miro.medium.com/1*K3P-G3ua6RMZm3a4BacI5Q.jpeg)\n\nAll jokes aside, it was truly special to see my youngest sister dominate on the field and walk her out for Senior night before the game. Sofia will be a future lax star at Clemson, but I digress.\n\nToday want to write about is the chapter I read in _Born To Run_ by Christopher McDougall. It was chapter 15 and the TL;DR is to be great at anything you must enjoy doing it. At least that was my takeaway. I was so hyped by this chapter I decided to crush a run right after. 1.3-miles into the run I decided that was all she wrote for this performance and walked the final 2 miles. Hit some sprints in that 2-mile walk at the end, but I can confirm I don't love running like Emil Zatopek loved running. I'm not going to dive too much into who Emil Zatopek is but it's worth reading the chapter or doing a google search at the least. Emil was a long-distance Czech runner who won the 5k, 10k, and marathon at the 1952 Olympics. (His first competitive marathon was a dub) Not too bad for someone with terrible form according to the book. \"He runs as if his next step would be his last...He looks like a man wrestling with an octopus on a conveyor belt\" I couldn't even begin to imagine what that looks like so I googled Emil's form and the cat did have an interesting running form🤣. Here's the v[ideo.](https://www.youtube.com/watch?v=XdYHCSAMDr4)\n\nWhat resonated with me is how much easier hard stuff is when you love it. I don't even know if easier is the right word. It might be more appropriate to say people are willing to go through challenging tasks if it's something they care about. Clearly, Emil cared deeply about running. Despite not having nutrition coaches, fancy training facilities, and fresh Nike running shoes this guy accomplished more on his own than 99.99% of the athletes Nike signs.\n\nI try and reflect in my personal life about what I care deeply about. Right now it's Bitcoin. I've been interested in various things and these passions have come and gone. They include Pokemon, Yu-gi-oh, Football, Fortnite, Golf, Guns, and Movies. I still enjoy most of these things (not so much Yu-gi-oh or Pokemon but I was obsessed growing up) I just don't have anywhere near the same passion I once did. This seems to be a pretty common characteristic amongst humans since we never really stop learning and with increased education comes an increasing amount of questions. I want to keep this in mind so I take it with a grain of salt when I say Bitcoin is my true passion. However, I keep coming back to it because based on what I've learned I believe bitcoin can do so much good for the world. It is an incredible savings technology, it allows people to monetize energy that would otherwise go to waste, it allows the unbanked to bank themselves with an internet connection, and it offers a new form of money that can't be debased by central banks.\n\nMaybe at some point, another passion comes along and grabs my attention. Looking at you homesteading👀😂 . Until that happens I will keep stacking sats and learning as much as I possibly can because even though educating myself can be hard I truly love it.\n\nConor Jay Chepenik\n\n3/24/22",
  "wordCount": 653,
  "readingTime": 2.6641509433962267,
  "claps": 0,
  "voters": 0
}