{
  "id": "891acf34f5da",
  "title": "Day 287",
  "createdAt": "2023-01-03 18:08:47",
  "tags": [
    "meetups",
    "new-experiences",
    "hobbies",
    "bitcoin",
    "interviews"
  ],
  "url": "https://chepenikconor.medium.com/day-287-891acf34f5da",
  "content": "# Day 287\n\nFiguring out what you want to do with your life is not an easy task. Finding things that excite you is a good start. If you can make a job out of working on things that excite you well then you will probably be an overall happy person. It is not always so easy though. Sometimes the market doesn't value the thing that excites you so you can't work in the space you want to work in. Don't give up on your dreams anon. Keep working at that thing even if it's in a side hustle capacity. I'm still figuring out exactly what I want to do with my own life, but I can confidently say that working on Mass Adoption, check out massadoption.com, has been a great experience. I love meeting and connecting fellow Bitcoiners. Nothing like spending time around those who have been down the rabbit hole as well.\n\nEvery person is different. It is awesome that people have their own hobbies and interests. Making time to meet others who share those interests is worth it. I've yet to have a bad experience at a Bitcoin meetup. (Excluding the one time I almost choked on a piece of steak but that was my own doing). The meetup would've been awesome had I not had to leave because of a giant piece of steak stick in my airpipe lmao. So if you are on edge but thinking about attending a meetup (Bitcoin or whatever your interest might be) I can't recommend enough taking the chance. You will likely be pleasantly suprised.\n\nHere is a video from the previous meetup. Shoutout to the Kristina for filming & editing this whole piece.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FIoYuxTd7AXU%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DIoYuxTd7AXU&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FIoYuxTd7AXU%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nAnyways, that's all I got for today. Going to take some time to continue to learn coding and improve upon the Mass Adoption website. Also going to do some more reading. Nothing incredibly notable that has made me want to write a Twitter thread, but I do think I should be thinking about how to make Twitter threads when I read interesting stuff.\n\n1/3/23\n\nConor Jay Chepenik",
  "wordCount": 350,
  "readingTime": 1.320754716981132,
  "claps": 0,
  "voters": 0
}