{
  "id": "895e8d35a4e3",
  "title": "Day 285",
  "createdAt": "2023-01-01 20:23:54",
  "tags": [
    "bitcoin",
    "libertarian",
    "contrary-takes",
    "half-marathon",
    "new-year"
  ],
  "url": "https://chepenikconor.medium.com/day-285-895e8d35a4e3",
  "content": "# Day 285\n\nCompleted my first half marathon today. Boy am I sore right now hahahaha. Got in the first 10 miles just fine, but the last 3 and some change had me cramping. Luckily, I was able to hit a fast walk and finished within 2 hours and 30 minutes.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1609587563571838980&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFeels like a good way to kick of the New Year. On my run I listened to two interesting podcasts. The first was a on-chain analyst named Checkmate. The Blue Collar Bitcoin pod is so based because you get to see that this new form of money can be utilized by anyone. Firefighers, teachers, cops, mailmen, you name it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FXVdQ6Z0Y7jU%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DXVdQ6Z0Y7jU&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FXVdQ6Z0Y7jU%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nFantastic episode. One of the things I appreciated most is how much Checkmate had studied Ethereum which ultimately led him to become Bitcoin only in his portfolio after Ethereum merged to proof of stake. One thing I'm a little guilty of is not actually studying Ether and it's fundamentals. I decided to become Bitcoin only after trying to buy some NFTs with Ether and realizing it was such a pain in the ass to do that this thing would never take off. So I guess I did in a way try to use it, but I didn't put in anywhere near the research required to fully understand something. While I think it's important to help people realize why Bitcoin is different than all other cryptocurrencies it is also important to give people the tools to do their own research. Like Checkmate pointed out any maxi who says you can't study or participate in Ethereum needs to look in the mirror and think about what is making them say this. 99% of people who use Bitcoin and Ether will come to realize how much easier it is to use Bitcoin. Running your own node on the Bitcoin network is so simple a firefighter can do it - stealing this from the BCB podcast. Running an Ether node requires 32 Ether (which is over 32k US dollars at the time of this writing) as well as a lot of money in expensive hardware. Bitcoin nodes can be spun up on raspberry pis while if you run an ether node on a new advanced laptop good luck doing anything else with that laptop. My knowledge on running an ether node is straight from Checkmate who claimed he has done so. I have run a Bitcoin node and can confirm it is pretty easy to do. My conclusion is that Ethereum will go the way of fiat and just become completely captured by the state. Which honestly might help it moon tremendously. I just don't want to be a part of that network. I'm all about separating money and state baby. Listening to this podcast was a great reminder that I should be paying more attention to those I disagree with in order to learn more about the things I disagree so I can better steel man my own arguments. I don't like prescribing to political parties, I'm a Bitcoiner and that would be my main political view, but if I had to pick a party it would be Libertarian. So what better podcast to listen to than one that features someone who is no longer a Libertarian.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F276N9y293_k%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D276N9y293_k&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F276N9y293_k%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOne of the arguments presented is that under a Libertarian regime people could hang white only signs and the state would have no recourse to take them down. Which I guess is true if we got a fully Libertarian government. Obviously, I think this is wrong. My rebuttal would be this place would go out of business. I wouldn't spend any money at this place. If I was getting ready to eat somewhere and the restaurant was segregating people based on race I'd simply go somewhere else. Now maybe there are enough racists in certain areas to make it so these businesses persist. However, I do believe that over a long enough time horizon the critical thinkers would recognize this as wrong and move to cities that didn't support racist restaurants. I also think there is a fine line to consider with this example. Doesn't matter what color the restaurant was segregating I wouldn't eat there. However, if I saw a sign that said Bitcoiners only I'd eat there in a heartbeat. Partly because something like that could be perceived as a joke, but also because I like being around fellow Bitcoiners. It is such a slippery slope determining what would be deemed okay and what would be \"racist\". I don't have all the answers but I do think there is value in this fascinating thought experiment. Something I wouldn't have considered if I ignored this episode because I don't see the world Pedro and Mike do. Most breakthroughs come when listening to those you don't agree with.\n\nWho knows what the future holds. Become more self-sovereign, improve yourself everyday, and listen to those you disagree with so you can better hash out your own views. Life is short so don't waste too much energy studying utter bullshit, but do give ideas that you oppose enough time so you can better position yourself for the feature. I don't think democracy goes away in my lifetime, but I do think a Bitcoin society will ultimately be one based on meritocracy where people don't just get a vote because of the place they were born, but one where people get more votes based on the value they have provided to their community. Seems like a more fair system to me and it's also possible I'm missing something. Time will tell!\n\n1/1/23\n\nConor Jay Chepenik",
  "wordCount": 937,
  "readingTime": 3.5358490566037735,
  "claps": 0,
  "voters": 0
}