{
  "id": "89f9b212a2b5",
  "title": "When You Look Back And Think Damn… Now I get It",
  "createdAt": "2022-02-07 04:18:14",
  "tags": [
    "dinner",
    "family",
    "attention",
    "social-media",
    "father-was-right"
  ],
  "url": "https://chepenikconor.medium.com/when-you-look-back-and-think-damn-now-i-get-it-89f9b212a2b5",
  "content": "# When You Look Back And Think Damn... Now I get It\n\nYesterday I had a lovely dinner with my girlfriend. After the meal, I started thinking back about how my Dad would always get so mad when me and my sisters would try to skip out on family dinner. Unless you had a legitimate excuse there was no getting out of family dinner. Looking back I cherish those memories fondly, but at the time I never thought twice about how special it was to eat dinner as a family.\n\nAs an adult one of my favorite things is having a meal. Going out to bars and clubs can be fun, but usually, I end up sweaty and upset I paid 10x what I would have for a drink at home. At this point in my life I would much prefer to go out to dinner with friends, family, or just people I find interesting in general. Those family dinners growing up taught me a lot more than I had anticipated. The importance of sharing a meal, cherising quality time with loved ones, and how to hold interesting dinner conversation. I've heard many people mention how sad it is when they look around a restaurant and see everyone on their phones. It is hard to not be on the device that floods our brains with dopamine when we use social media. However, the really rewarding stuff in life has never come from an app. It's come from hard work and deep appreciation. Hard to hold an engaging conversation with someone when they are thinking about their Instagram notifications.\n\nI'm far from perfect and will admit I spend way to much time on Twitter. To help myself I deleted all social media apps from my phone. I still use Twitter on my desktop, but I have to make the conscious choice of grabbing my laptop so I don't just open Twitter every time I have a moment to kill. So many arguments online are fought over stuff that does not matter. While the common folk argue about small things the global elite are trying to strip away basic freedoms. Most people who I talk with have no idea what's going on in the world. It's easy to not think twice about all the shady shit going in when half the world is more interested in reality TV. All social media apps are basically echo chambers, but I'm grateful for Bitcoin Twitter. It's taught me to look at things analytically and not take words on a screen at face value. It has also put me on to a bunch of books that have genuinely changed my perspective on so many things. Some of the best advice I've heard came from Russel Brand on his Youtube channel. I'm paraphrasing but he basically said \"You have to read a bunch of stuff from both sides and form your own opinion because there is bias and agenda in pretty much every piece.\"\n\nBack to dinner. It's easy to get caught up in mediocre and mundane bullshit when social media floods our brain with cheap dopamine hits. If you want to be a good dinner guest delete social media apps from your phone. Not saying get rid of your social media profiles, but make it so if you want to go on them you have to take more deliberate action than just pulling your phone out of your pocket. Our brains aren't meant to be stimulated 24/7/365 even though they want to be. If you want to be an interesting person take some time to reflect on what you care about rather than occupy your mind with random social media posts. It has helped me and I hope it helps you anon.\n\nCheers!\n\n2/6/22\n\nConor Chepenik",
  "wordCount": 629,
  "readingTime": 2.3735849056603775,
  "claps": 37,
  "voters": 2
}