{
  "id": "8a65dd5a5081",
  "title": "Day 173",
  "createdAt": "2022-09-11 16:58:31",
  "tags": [
    "grateful",
    "food",
    "society",
    "ancestral-wisdom",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-173-8a65dd5a5081",
  "content": "# Day 173\n\nMy Grandma sent me this article today. Interesting to see how M&M thought about coloring their chocolates.\n\n![](https://miro.medium.com/1*fkDg78huMJNrczCL34TVDA.jpeg)\n\nNow a days kids get sick eating a variety of foods to do social media challenges. This was more of a joke about myself as I vividly remember doing the cinnamon challenge in middle school and almost throwing up. However, there is also some real world truth to my joke because our food (especially here in the U.S) is filled with chemicals of all sorts and while I'm not going to get distracted by going on Twitter and looking for the tweet I did see something about a captain crunch X aunt Jemima syrup collab where the syrup was literally blue. Executives used to be worried about making the food look unnatural with chemical food coloring and now it is encouraged and promoted as a collaboration amongst corporations.\n\nWild times. Sent this video to my Mum today. She is a pharmacist and believes that the \\/ saves lives. I got my first \\/ of J&J but due to the false advertising of 100% safe and effective I will no longer be getting anymore. Absolutely ridiculous they mandated these and falsely advertised them. A lot more can be said about the issues, but that alone should be enough for massive lawsuits against big-pharma. For Biden to recently say \"We beat big-pharma\" has got to be some of the most ridiculous double speak I've ever heard. If it wasn't so sad I'd think the man was doing a stand up comedy routine. Anyways I love my Mum and think she is a brilliant woman. I'm just worried it is hard for her to see some of the issues arising with these experimental products since she works in the industry. Wild to think these products are not FDA approved but rather authorized under emergency use authorization and are being mandated for certain things (like say entering the U.S as a foreigner) despite not stopping the user from getting said disease. Alas, I'm not a scientist and haven't done that much digging through all the trial data. I have been following this closely though and as far as I can tell it seems like a way to get digital identities ushered in so when they roll out a CBDC and start mandating whatever BS they want to mandate the public will comply. So yea watch the video below and you'll see why I'm pretty skeptical to get another \\/.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/letsgobrando45/status/1568709459567906818&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nBeen having some fun coding up a website for Mass Adoption. I love the idea of connecting people to barter for goods and services. Everyone in the world has a speciality if they are willing to work and find what they are passionate about. By connecting people and allowing them to participate in mutually beneficial exchange the world is a better place. I'm so grateful Satoshi created Bitcoin to serve as the third party network to make this happen and somehow had the humility to walk away from it all. Wild that Satoshi was able to bootstrap this network from the ground up and have the foresight to imagine a lot of the stuff that would come out of it. My mans was playing 7D chess while the rest of us are out here playing checkers. While maybe Bitcoiners are playing chess (just not at the 7D level like Mr.Nakamoto hahahaha)\n\nMy Dad connected me today with someone from RobinHood. I put in a resume for a Communications position. I would very much enjoy researching and writing about Bitcoin for a company like RobinHood. I know they got in a lot of heat for the GME and AMC stuff but they were not the only firm doing that. I also had a lot of faith restored in the company when they released wallets so people could self custody their Bitcoin if they so desired. RobinHood is also the reason all the black market trading via Citadel (and many others) got exposed so I think overall it's been a net positive. Not sure what my future holds, but after getting upset with my Dad yesterday for making me feel bad about not putting profit first I am reminded today he only has my best interest at heart and wants me to be happy. I'm lucky to have a father who cares so deeply about seeing his kids succeed. I hope one day I can do the same for my child(ren).\n\nNow to go crush a run and listen to some podcasts while doing so. Oh I'd be remiss to mention that the scramble I made this morning was top notch. First I cooked some bacon, then I sautéed some tomatoes and onion, cooked some sausage, mixed up 5 eggs in a bowl dumped that in, cut up the bacon dumped that in, scrambled it, added cheese at the end, mixed it all up and BOOM: Delicious! I added some Frank's red hot for the final touch and both my girlfriend and I crushed breakfast. Just the food I needed to get me ready to hammer a run. Like I always say when I take the time to remind myself everything I have to be grateful for: LIFE IS GOOD.\n\nFinally, rest in piece to all those who lost their lives on 9/11/2001. Sad day in the history of the United States for many reason, but by following the ethos of the U.S constitution I have the utmost faith in this country to get back on the right track, promote liberty worldwide, and provide a roadmap for the rest of the world to show what true prosperity can look like when you let the free market rule and the individual players in that market do their thing to create a world of prosperity and abundance. It is a tragedy what happened on this day in 2001 but we can honor all those who lost their lives by doing our part as U.S citizens to make sure America is a beacon of freedom rather than a police state hell bent on telling others how to live their lives.\n\n9/11/22\n\nConor Jay Chepenik",
  "wordCount": 1025,
  "readingTime": 4.067924528301886,
  "claps": 0,
  "voters": 0
}