{
  "id": "8b691f16e9b8",
  "title": "Day 659",
  "createdAt": "2024-01-11 02:53:11",
  "tags": [
    "adulthood",
    "bitcoin",
    "sec",
    "working",
    "bitcoin-etf"
  ],
  "url": "https://chepenikconor.medium.com/day-659-8b691f16e9b8",
  "content": "# Day 659\n\nToday the SEC approved a spot Bitcoin ETF. I guess they made up for their rug pull. A score for everyone who enjoys number go up technology.\n\n![](https://miro.medium.com/0*Q5AOSAdqgo3vvXGQ)\n\nI'm sure there are battles ahead but it is truly remarkable to see what Bitcoin has accomplished in ~15 years. Absolutely incredible. It makes me very proud to be working in this industry doing my part to help spread the adoption of hard money.\n\n> [**Compromised SEC X Account Announces Bitcoin ETF Approval**](https://bitcoinnews.com/compromised-sec-x-account-bitcoin-etf-approval/)\n\nI also wrote this yesterday dunking on the SEC. Maybe I should think them for holding off on the ETF for so long. It's a big reason why retail got to front run Wall Street.\n\nIt's a somewhat bizarre, yet enlightening epiphany that dawns on us in adulthood - the realization that life is essentially a large-scale improvisation. Picture this: every institution, from the glossy facades of corporate giants to the solemn corridors of governments, is actually a grand circus run by humans as fallible as you and I. Yes, even those seemingly infallible entities are manned by people who, for all we know, might have put their shirts on backwards this morning.\n\nTake companies, for instance. We grow up imagining them as these monolithic, well-oiled machines. In reality, they're more like a group of kids building a sandcastle - each one unsure if the next wave (or quarterly report) might wash it all away. There's Bob in accounting who still can't figure out Excel, and Sarah in marketing who thinks 'viral' is a type of flu. Yet somehow, between all the coffee breaks and accidental 'reply-all' emails, things get done.\n\nAnd then there are governments, those bastions of power and order. Beneath the stern faces and official titles, you'll find individuals who still can't decide what to have for lunch. These are the people who run countries, yet probably argue about the thermostat settings just like the rest of us. It's both terrifying and oddly comforting to know that national policies might be influenced by someone's inability to handle spicy food.\n\nThis realization extends to every corner of human endeavor. Even the most prestigious organizations, those we hold in awe for their expertise and efficiency, are filled with humans, each carrying their own set of quirks, insecurities, and the occasional bad hair day. The surgeon who saves lives might be terrible at assembling IKEA furniture, and the rocket scientist might forget where they parked their car.\n\nIn the end, this crazy realization is a mixed bag of terror and relief. We're all just winging it, trying to make sense of things as we go along. It's a wonder that amidst this universal fumbling, we manage to achieve anything at all. Yet, this is what makes life intriguing, isn't it? The fact that in spite of our collective clumsiness, we still manage to build, innovate, and occasionally, make our shirts match our pants.\n\nSo while I did give the SEC shit I now realize upon further reflection that they helped many Bitcoiners by delaying the ETF. For that I thank them, even if it was for fumbling the bag for Wall Street. God has a plan and it is a good one!\n\n1/10/24\n\nConor Jay Chepenik",
  "wordCount": 561,
  "readingTime": 2.316981132075472,
  "claps": 0,
  "voters": 0
}