{
  "id": "8c171622d84e",
  "title": "Day 735",
  "createdAt": "2024-03-27 02:33:17",
  "tags": [
    "people",
    "quotes",
    "money",
    "econ",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-735-8c171622d84e",
  "content": "# Day 735\n\nIn working to spoil your enemy's moral reputation, do not be subtle. Make your language and distinctions of good and evil as strong as possible; speak in terms of black and white. It is hard to get people to fight for a gray area. - Robert Green\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1772800793797620179%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nReading is so good for the mind because it helps you see things for what they are. Today I ran into my old highschool econ teacher and football coach. He asked me what I did for a living and I said I'm a Bitcoin Adoption Specialist. Which is such a dope and funny thing to say.\n\nHe didn't know much about Bitcoin but to my surprise the man who use to yell at me at football practice was very open minded about the whole thing. He actually mentioned that I should come in to his class and teach the students about Bitcoin. I would love a chance to educate a high school economics class on the concept of financial freedom.\n\nThis experience served as a poignant reminder that people have the capacity to surprise us, and that individuals can change, grow, and evolve over time. By actively seeking truth and remaining open to new perspectives, rather than stubbornly projecting our own beliefs onto others, we contribute to creating a more understanding and harmonious world. When discussing topics as complex and emotionally charged as money, it's crucial to approach conversations with empathy and flexibility. Instead of making rigid claims of moral superiority, we should strive to understand different viewpoints and find common ground. By maintaining an open and adaptable mindset, we foster an environment conducive to productive dialogue and mutual understanding.\n\n3/26/24\n\nConor Jay Chepenik",
  "wordCount": 283,
  "readingTime": 1.0679245283018868,
  "claps": 0,
  "voters": 0
}