{
  "id": "8c2d20e3be7",
  "title": "Day 418",
  "createdAt": "2023-05-15 00:17:00",
  "tags": [
    "bitcoin",
    "time-preference",
    "mothers-day"
  ],
  "url": "https://chepenikconor.medium.com/day-418-8c2d20e3be7",
  "content": "# Day 418\n\nToday I set my socks out right on top of my shoes so when I go to run tomorrow morning they are right there. I'm focusing on making my habits easier to accomplish not harder. After a run I always feels amazing. The hard part is getting out the door. The little things make a difference. Always be lowering the path of resistance so you can accomplish great things.\n\nBy consciously making efforts to simplify and streamline our daily routines, we can reduce the barriers and resistance that often deter us from reaching our goals. Placing my socks right on top of my shoes the night before a morning run is a small action that yields significant benefits. This simple act not only removes an obstacle in my path but also serves as a visual reminder of the commitment I made the night before to do a morning run. It's a gentle nudge that encourages me to follow through on my intentions.\n\nRemember, it's often the accumulation of small efforts and incremental changes that lead to significant accomplishments. By paying attention to the little things and actively finding ways to make your habits easier to accomplish, you are setting yourself up for long-term success. Embrace this philosophy in your journey towards achieving great things, and you will find yourself gradually and consistently making progress towards your goals.\n\nOne thing I would like to do is stack 100 million satoshis via value 4 value. This can be Nostr, Stacker News, Lolli, Slice, Fountain, or any other amazing app that pays me sats for my attention. Let's do some math.\n\nIf I set a goal and managed to stack 10,000 satoshis every single day I want to calculate how long it will take me to stack 100,000,000 million sats (equivalent to one whole Bitcoin). I will use use the following formula:\n\nNumber of years = Total sats needed / Sats stacked per day / Number of days in a year\n\nSince my goal is to stack 10,000 sats every day, and there are 100,000,000 million sats in one Bitcoin, I can substitute these values into the formula:\n\nNumber of years = 100,000,000 / 10,000 / 365\n\nCalculating this, I find:\n\nNumber of years ~ 27.34\n\nHere is an all time bitcoin chart up to May 14 EST ~ 8PM.\n\n![](https://miro.medium.com/1*tF_mTaCIXx9Zjuzo3fu6IQ.png)\n\nLow time preference can make you a wealthy individual. Stacking 10k sats a day is not easy but at this point in time it's very manageable. [Back in the day you could literally get 5 bitcoin for filling out a captcha.](https://watcher.guru/news/bitcoin-faucet-website-gave-away-5-free-btc-for-users-who-solved-captcha-in-2010)\n\n![](https://miro.medium.com/0*ssZj_z4xYw-cudHG)\n\nAlso Happy Mother's day to all the amazing mammas. Seriously Moms are the best ❤. I was lucky enough to spend time with both my Mom & the Mom of my child. Also my sisters which was nice. I'm grateful for family :)\n\n5/14/23\n\nConor Jay Chepenik",
  "wordCount": 478,
  "readingTime": 2.1871069182389937,
  "claps": 0,
  "voters": 0
}