{
  "id": "8dcf1a0e48de",
  "title": "Day 559",
  "createdAt": "2023-10-03 01:54:39",
  "tags": [
    "running",
    "motivation",
    "dont",
    "let",
    "the-demons-in"
  ],
  "url": "https://chepenikconor.medium.com/day-559-8dcf1a0e48de",
  "content": "# Day 559\n\nI was listening to this [podcast](https://youtu.be/JBgwF8aHByI?si=OTFhiikEDTZQXYyf) today on my run and heard the perfect nugget of motivation I needed to crush the workout. Do not even remember who they were talking about but the guest mentioned that there is someone who always does what they say they are going to do because otherwise they are letting the demons in. I set a lofty goal of running 40 miles per month in 2023, and I'm proud to say I've accomplished it every month so far this year. However, many times I will not accomplish the run I set out to do. For example, when I tell myself I'll run non stop for x number of miles there have been times when I don't reach x number of miles before walking.\n\nWas worried today might be one of those days where I take it easy but this insight about not letting your demons in resonated. So I told myself I'd run 3.5 miles (Which was 2 laps around the outdoor fields I was running at and I did it.) The whole run I kept thinking do not let the demons in. Ended up setting a new record for my fastest 5k.\n\n![I know this is not \"fast\" for true runners but as an ex nose tackle I'm quite proud of this](https://miro.medium.com/0*nijuldGVmLeGx7aA.jpg)\n\nThis experience taught me the power of small insights to motivate big accomplishments. We all have demons of doubt, fatigue, and temptation. But we also have tremendous wells of inner strength and focus. With the right mindset shift at the right moment, we can achieve more than we thought possible. I'll remember this run when I need motivation in the future.\n\nA simple mantra like \"do not lie to yourself unless you want to let the demons in\" can make the difference between giving up and breaking through. A long winded mantra but a good one lol.\n\n10/2/23\n\nConor Jay Chepenik",
  "wordCount": 302,
  "readingTime": 1.3396226415094339,
  "claps": 0,
  "voters": 0
}