{
  "id": "8e29a38e292b",
  "title": "Day 354",
  "createdAt": "2023-03-12 01:38:43",
  "tags": [
    "bitcoin",
    "education",
    "ted-talk"
  ],
  "url": "https://chepenikconor.medium.com/day-354-8e29a38e292b",
  "content": "# Day 354\n\nEducation should be as entertaining as possible. Pretty cool to learn about a phd who spends his time studying video games and how they can be used to make learning more enjoyable.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FCkFnqGHZ5tA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DCkFnqGHZ5tA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FCkFnqGHZ5tA%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIf you can enter a state of play while you are learning you are way more likely to retain the information. For me going down the Bitcoin rabbit hole has helped this. Actually playing with hardware and software to run a node helped teach me about computer science. The implications of a money with a 21 million limit and permission-less nature has helped me learn about economics. The adoption of Bitcoin has made studying human psychology fascinating. Many such cases.\n\nEveryone has their own passion. I've seen plenty use Bitcoin as a tool to enjoy learning, like I did. If Bitcoin is not what gets you excited to go down the learning rabbit hole find something else. Learning makes life more fun. Especially if you can make learning fun.\n\nOutside of that it's been nice hanging with a good friend. Talking about going out to Montana this summer with more good friends. I do enjoy reading up on the breaking news of Silicon Valley Bank going under, multiple crypto stable coins breaking the peg, and everything else. Nice cheap dopamine doom scrolling Twitter and watching the collapse. The inevitable result of a fraction reserve banking system. It's also so frustrating. People should not have to pay with their savings because banks can lend their customer's deposits out willy-nilly. Unfortunate how many will lose their jobs. Fix the money fix the world applies now more than ever. I bring this up as a reminder to focus on the things you can control and less on things you can't.\n\nEducation is the key to figuring out a positive path forward. Humanity will win. We just need to convince enough people to stop buying into horrible ideas. Like fractional reserve banking for starters. Debt based money is an oxymoron. Opt-out peacefully anon. #Bitcoin.\n\n3/11/23\n\nConor Jay Chepenik",
  "wordCount": 341,
  "readingTime": 1.2867924528301886,
  "claps": 0,
  "voters": 0
}