{
  "id": "8f1b04e6969d",
  "title": "Day 43",
  "createdAt": "2022-05-05 00:55:44",
  "tags": [
    "baby",
    "hal-finney",
    "cyperpunk",
    "bitcoin",
    "random-number-generator"
  ],
  "url": "https://chepenikconor.medium.com/day-43-8f1b04e6969d",
  "content": "# Day 43\n\nSo now that I've told my family and none of my personal friends read this I'm happy to announce I found out I'm going to be a Dad. Crazy timing with the whole Roe V. Wade thing. I feel so fortunate to have a family who I know will help me out if I'm struggling because having a child in this country is not cheap. I saw a great tweet from someone saying *paraphrasing because I can't find tweet* \"If people really cared about women in this country they would make birthing a child-free no matter how complicated the birth might be\". Obviously, abortion is a hot-button topic and I thought this graphic by Tim Urban was so spot on.\n\n![](https://miro.medium.com/1*cBk24pIht1_NSpoWx9A67g.jpeg)\n\nDidn't think about how much more these decisions will affect those in the lower socioeconomic bracket. If you are wealthy enough you will find a way to do what you want regardless of what state you live in. For those not wealthy enough you're screwed. Starting to see a trend with these government policies. They seem to either benefit or make no difference to those with money while hurting the poorest in this country. I don't think free handouts are ever the answer, but Quantitative Easing seems to be a UBI for the wealthy.\n\nAnyways, enough on that topic. I am so excited to be a Dad and it still has not fully hit me yet. I'm going to have a little me running around in 8–9 months. My father always told me how having a kid will change your life and I look forward to seeing what he means. It still has not hit me yet that I'm really having a baby. I'm quite young to be having one by the standards of modern-day society, but if you look back at history this is peak age (maybe even younger). My Dad was 24 and my mom was 23 when they had me so it's kind of funny that my girlfriend and me are the same age. I'm hopeful my child can get to know his great grandparents and hopefully I will get to have grandchildren who I can keep up with as a young Papa. I'm getting ahead of myself here. All that matters is doing everything in my power to make sure I have a healthy child and that my girlfriend comes around to the name Satoshi 😂 🤣. While the former seems likely the latter isn't looking so hot. Maybe my girlfriend will be more receptive to the name Hal. I'd love to give my kid a Bitcoin related name. Also, happy birthday to one of the goats- Hal Finney. Absolute legend and the more I learn about him the more respect I have. According to Wikipedia Cyperpunk Hal is quoted saying, \"Here we are faced with the problems of loss of privacy, creeping computerization, massive databases, more centralization- and David Chaum offers a completely different direction to go in, one which puts power into the hands of individuals rather than governments and corporations. The computer can be used as a tool to liberate and protect people, rather than to control them.\" What an absolute beast. Also check out this t[weet.](https://twitter.com/cryptorick_/status/1521888213022875652?s=20&t=XpZ_YJS-KpeAbRYHI7dkZQ) Dude has some serious legs.\n\n![](https://miro.medium.com/0*IbLt8itD2yiNjVpz)\n\nThe last part of Hal's quote resonated with me so much I ended up making it my personal Twitter header. Life is funny man. I feel so emotional about the whole thing, in the best way possible of course. This was not something my girlfriend and I planned but the second I heard the news I knew I was keeping the child. (It was my girlfriend's decision, but she felt the same way when she understood that I would do anything to support her and the kid) My family was also so supportive when I told them which really helped.\n\nOutside of that, I was shocked to see the Fed start to raise rates. Read online that the 50 basis point hike today was one of the largest since 2000. Seems like hiking into a recession is not ideal but at the same time neither is massive inflation. I don't know how this plays out but I've come around to the fact most people do not have a clue about any of this stuff. Wild times we are living through but I am excited to see Bitcoin hit new all time highs at some point in the coming years. Fireworks will be afoot and I got to imagine the Fed will just keep hiking until something breaks. Hopefully we see a slow transition to a Bitcoin standard so people do not lose their entire life savings via the 60/40 portfolio most people have their 401k allocated to, but only time will tell. The market does not give a shit about people's feelings so things are probably going to get interesting.\n\nAlso, went to a Blockchain meetup on Monday which was so awesome. People in this space are so kind and excited to talk about crypto. As a non-toxic bitcoin maxi I really enjoyed trying to get people to see why, in my opinion, Bitcoin is the only crypto that could replace fiat as money. Everything else seems like a way better and more efficient form of stocks/equity to me. Chain[link](https://chain.link/chainlink-vrf) was one of the sponsors of the event and if blockchains are going to communicate with real world data it seems like their work will be important. Some guy gave a presentation on the importance of randomness when writing smart contracts which was fascinating. I'm not a software engineer, yet, but the examples he gave made a lot of sense. If someone understands what a random number generator algorithm is doing they can game the system. Thus, we need to make sure the algorithm is generating a truly random number rather than one that can be guessed by a skilled engineer. I couldn't find the graphic he used but it made a lot more sense than this description I just gave. If this is something that interests you here is the link to the Chainlink VRF (verifiable source of randomness) he was discussing. Also was excited to see I made some of the photos featured in the LinkedIn post about the event.\n\n![](https://miro.medium.com/0*YC6OtRfU7U1BdTKi)\n\nLike I said, good will win out anon. Got a kid on the way and as cheesy as it sounds, if there wasn't bit🌽  I'd be freaking out. Since there is I'm not worried at all. My kid will likely have his college tuition paid for all with bitcoin. Life is a gift: cherish it<3\n\n5/4/22\n\nConor Jay Chepenik",
  "wordCount": 1105,
  "readingTime": 4.719811320754717,
  "claps": 0,
  "voters": 0
}