{
  "id": "912b3a0ee975",
  "title": "Day 160",
  "createdAt": "2022-08-29 22:31:30",
  "tags": [
    "life",
    "parenting",
    "stories",
    "family",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-160-912b3a0ee975",
  "content": "# Day 160\n\nArticle #2 for Bitcoin Magazine is officially published.\n\n> [**Bitcoin Aligns Incentives In The Perfect Way**](https://bitcoinmagazine.com/culture/bitcoin-aligns-incentives-in-the-perfect-way)\n\nFeels damn good to have another article published in Bitcoin Magazine. \"Freedom is what makes America great. That's what we need now\"-Bruce Fenton.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/brucefenton/status/1564259744361381888&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nCould not agree with Bruce anymore about what has made America great. That's why I'm writing articles and thinking about ways to increase my own freedoms. Humans are intuitive and can figure out ways to create incredible things. What hinders this process is a bunch of people in government who think they know better going around passing regulation on free markets that don't need said regulation to work just fine. Not saying all regulation is bullshit, but 99% seems to be. Brings me a lot of joy seeing some candidates call this out.\n\nWriting this piece in the airport as I get ready to head back to Boston. It was really nice seeing my family and friends over the weekend. My Dad is crushing work outs and doing well, but I also think he is going through a mid life crisis because my youngest sister left for college and made him an empty nester. Hahahaha he joked that he is so happy Sloan is coming so he doesn't have to be an empty nester for long. I should say half joked because I know that he wants me to move next to him. He is moving to South Carolina for a little so I hope he finds what he is looking for. I'd love for him to be close with his granddaughter but I also think that it's important he finds what he wants out of life outside of his children and grandchildren. Not to say he can't have a great impact, but I think it's important to have all sorts of things that bring your life meaning. As I reread this that seems convoluted, but I'm also not sure how to phrase it better. Maybe I mean life is about raising your kids right then letting them become their own people. Or better yet finding joy in the time you have with your children/grandchildren but not centering your entire existence around them.\n\nMy Dad and Mom both did a great job raising us and I'm proud of how my sisters and I turned out. They had very different parenting styles though and I think my Mom was much better about \"letting go\". Coming up real fast it is going to be my turn to raise a child. I'm glad my Dad is working out a lot, but even for some people working out becomes like a drug. Then again, of all the things to become addicted to in this world working out doesn't seem like the worse \"drug\" hahahaha. My Dad always talks about how having a kid changes your life in ways you can't even imagine. I should go easy on the old man because I don't know what it is like to have a kid. I do know that I want Sloan to be a self-sovereign individual and lead a life she is proud of. Hopefully Bitcoin will allow humanity to have these things. If you read my articles anon you will clearly see I think it has a good chance :D\n\nI'll get to spend some time with my Dad and girlfriend up in Maine soon so that'll be good. I'm excited to spend some quality time in a quite place. Life is precious and I'm reminded how important it is to cherish your time on this earth. I got to have breakfast with my Grandma this morning and she told me a story about how Marvin's (My Grandfather) mother told her in the beginning she hates people she can walk all over. Well it was not until my Grandma snapped at her mother-in-law that Marvin's mother respected my Grandma. Apparently my Great-Grandmother told my Grandma that she shouldn't baptize her children (My Grandpa came from a Jewish family and My Grandma came from a catholic family) and my Grandma snapped \"I will do whatever the hell I want with my children\". After that my Grandma said Marvin's mother had a much greater respect for her and came over to the house all the time. Interesting lesson. Sticking up for yourself might seem difficult but it's important to do.\n\nI want my Dad to be a part of Sloan's life very much. I'm also eager to raise her my way. No perfect way to raise a kid, but my Dad can be a little overbearing in the best way possible and I will likely need to remind him \"Dad I'm so glad you are a part of your granddaughter's life, but we are going to raise her my way and not make her do lacrosse practice at 5\" 😂 🤣🤣🤣 Unless she really wants to do it. My Dad is a master convincer though so I will make sure it's coming from Sloan.\n\nI'm truly blessed to have family who cares about me and an amazing life. I get down sometimes because I don't love my job, but visiting home is a great reminder that I A. have people that love me deeply and will help me out however I need and B. I can accomplish anything I set my mind to do. It is up to me to find a job I truly love! Time to stop waiting for the universe to give me what I want and go get it myself.\n\n8/29/22\n\nConor Jay Chepenik",
  "wordCount": 947,
  "readingTime": 3.5735849056603772,
  "claps": 15,
  "voters": 1
}