{
  "id": "912d51e7a063",
  "title": "Day 217",
  "createdAt": "2022-10-26 01:08:58",
  "tags": [
    "god-help-us-all",
    "history",
    "bitcoin",
    "urbit",
    "creating"
  ],
  "url": "https://chepenikconor.medium.com/day-217-912d51e7a063",
  "content": "# Day 217\n\nThe thing about good art is that it just provokes an emotion. When something makes me cry, wether it be a book, [song](https://twitter.com/FiveTimesAugust/status/1584373027768176640?s=20&t=bUQGoFJ_TQ5JPAkBNWAcMQ), or even podcast I consider that to be good art. This song I'm happy to say made me cry. God Help Us All.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/fivetimesaugust/status/1584373027768176640&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nComedy and music seem to be two great ways to get a message across. It is hard to grasp all the things people had to endure under tyrannical governments these past two years. If you took someone from 2019 and transported them to 2022 I don't think they would believe much of what you were telling them went down the past three years they just transported through. Especially in a place like America which is supposed to be the \"Beacon Of Freedom And Liberal Democracy\". Pain is the best teacher and if there is a silver lining I think these past two years have woken a lot of people up. It's tough losing faith in a lot of institutions that you once had deep respect for but respect is earned not given and I know I will not be \"giving\" my respect to any institution anymore unless they earn it. I'll never forget learning about segregation in school and thinking how could something like this have happened so recently. 50 years ago is not that long in the big scope of things. Well we saw segregation again in 2021 except it was over one's medical status rather than race. History doesn't repeat but boy does it rhyme. Wild man.\n\nAnyways stay safe out there anon. Lot of problems in the world but we can be the solution if we prioritize the things we know matter. I've been spending more time walking, running, and coding. These things help remind me there is a lot of hope out there. Hope to create world of abundance, prosperity, and peace. One where war isn't waged via nation-states and people are cooperating to produce value for others through mutual cooperation rather than coercion. I don't know what the next 50 years of my life looks like but I know that putting more of my energy into things like [Bitcoin](https://bitcoin.org/en/) and [Urbit](http://urbit.org) are going to help create the world I want to see for my children.\n\nBang bang. Let's go build that world Anon! Maybe Bitcoin and Urbit don't call you to them like they do me but your heart will guide you to thing you know creates the world you want to see. Listen to it❤.\n\n![](https://miro.medium.com/0*qMPbefN4ViyY2bF7)\n\nFacts Russian Dude. Big facts🫡\n\n10/25/22\n\nConor Jay Chepenik",
  "wordCount": 429,
  "readingTime": 1.818867924528302,
  "claps": 2,
  "voters": 1
}