{
  "id": "913284ec0718",
  "title": "Day 25",
  "createdAt": "2022-04-16 21:05:49",
  "tags": [
    "bitcoin",
    "humanity",
    "phd",
    "lex-fridman",
    "bad-policy"
  ],
  "url": "https://chepenikconor.medium.com/day-25-913284ec0718",
  "content": "# Day 25\n\nWho needs therapy when you have podcasts? I joke but this [episode](https://open.spotify.com/episode/4Q5AnqCrbJ3M9Yk4Kh4xjb?si=hfGbsOUoTWyg9Dpz9CjBiw) of the Lex Fridman Podcast was actually incredibly therapeutic for me. Drove down to New Jersey last night to be with my girlfriend's family for Easter weekend and it was a breeze listening to big brains, Lex and Micheal Saylor, discuss humanity. We have achieved so much as a species but we also have so much more to do in order to eliminate poverty and hunger from this world. Lex's podcast was filled with so much practical advice but one thing that stuck out to me was the role of violence in natural selection. Society has allowed people to act in a cooperative manner in order to generate wealth for themselves and their family. One might even argue that society has made people a lot kinder. If you look at pre-industrialization civilization people were typically ruthless. Makes sense considering that \"survival of the fittest\" is a classic quote used when teaching people about evolution. Thanks to nation-states most people on earth have outsourced their defense to a government. The problem is humans don't typically opt into this anymore. We are born into a jurisdiction and if you want to participate in society you will have to pay taxes and transact in that nation's currency. If a government controls both the monopoly on violence and the money they become too big to fail.\n\n![](https://miro.medium.com/1*vF9iBENOeGx1K1jHuaZjpw.jpeg)\n\nI'm hopeful that bitcoin will force governments to rethink this monopoly. No longer will they be able to impose ridiculous and draconian measures to make sure their citizens can't leave with their wealth. Thanks to bitcoin people can remember 12 words and take their lives \"value\", whatever you want to call it, with them. How do you fight someone who has unlimited money. No wonder the United States ran up a 30 trillion dollar debt. With a global reserve currency and bigger guns than anyone else in the world who the hell is going to tell the United States government no? Thankfully a random anon shadowy super coder, Satoshi Nakamoto, gave humanity a way to store their value in something that can't be controlled or debased by a single party. The people of the world are much better off now because Satoshi leveled the playing field. There are no fair fights in life. Before bitcoin, governments had near absolute control over violence. Sure people in The United States have the right to bear arms but a rifle won't hold up against an air strike. By removing the monopoly on money from the government it becomes a lot harder to coerce all your citizens into doing what you want. Yes the government still has a monopoly on violence but it's much harder to steal via force when someone stores their value in bitcoin and takes the proper security measures. Typically, governments will reserve violence for situations that threaten their control. Wars stop when governments run out of money to pay their soldiers. Thus, governments take measures to make sure they never run out of money. I doubt it was the only factor at play but the U.S had to abandon its gold backed currency status because we were printing way more money than we had to pay soldiers in Vietnam. When other countries called our bluff Nixon took us to Bretton Woods 2.0 (A debt based system where fiat is backed by nothing but the full faith and credit of their government). It wasn't until 2008 when Satoshi offered an alternative with bitcoin. A system that will do wonders for the world as far as I can tell. At this point, the only way to make sure governments stop debasing their currencies at the expense of everyone else is to build a new system outside of the legacy one.\n\nMost \"Bitcoiners\" seem to be genuinely passionate about helping others. I loved the fact that Saylor wants to do everything in his power to make education cheaper and more affordable. Education is the key to uplifting people out of poverty. It would be much more efficient for universities to offer a PHD online for a fraction of the cost of in person education. I don't see universities getting behind this because why would they want to give up the billions if not trillions of $ that pour into them from students who take out loans so they can party for four years. Before you come at me anon, understand I was one of these students, lol. The problem is few people have the means or resources to afford an education. Even if you can get a loan to receive a PHD you will likely end up in crushing debt with no guarantee of a job after you graduate. The world would be better off with more specialist but you need a PHD to be considered a true specialist in most cases. Saylor estimated it cost roughly a million dollars to get a PHD in 2022. Offering online courses where people still had to fulfill rigorous requirements, but could receive their degree once those requirements were met could do wonders to increase the amount of PHDs in the world. Screw the powers at be who might fight this. The printing press received a ton of hostility from the \"elite\" of the world but it ultimately went on to give the masses education in the form of books. TCP/IP can do the same in the form of online learning. It will likely be a slower process because not everyone is acting so altruisticly, especially massive universities who could become insolvent if something like Saylor.com became the new way to get a PHD over moving to Cambridge to attend MIT or Harvard.\n\nThis is why I love bitcoin. It forces people to think through how can we create a better world for everyone. Monopolys become a problem when they start screwing everyone else over to make sure they can remain a monopoly. The U.S government has no incentive to give up it's money printer or it's monopoly on violence. Those in power don't typically give up power willingly. On the one hand, the U.S has given its citizens an incredible society to generate massive amounts of wealth. On the other hand, it has stolen even more wealth from excess government spending, quantitative easing, and inflationary government policy. My hope is that Satoshi's invention offers people a system where money is not controlled by anyone. A system that would let people cooperate and trade without having to rely on a third party. One where everyone could audit the \"central bank\", \"network\", \"money\" whatever you want to call Bitcoin. Who knows how it will actually play out but man am I glad to be living through bitcoin's monetization process. Bless up.\n\nGod Bless Bitcoin. God Bless Satoshi. God Bless Lex and Michael. God Bless you Anon🙏\n\nConor Jay Chepenik\n\n4/16/22\n\nP.S Shitposting has become more valuable than mainstream journalists in my humble opinion.",
  "wordCount": 1164,
  "readingTime": 4.592452830188679,
  "claps": 0,
  "voters": 0
}