{
  "id": "91ce49ba5fdf",
  "title": "Day 141",
  "createdAt": "2022-08-11 00:52:37",
  "tags": [
    "jeff-booth",
    "robert-breedlove",
    "adam-curry",
    "value-for-value",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-141-91ce49ba5fdf",
  "content": "# Day 141\n\nYesterday at the Bitcoin meetup someone came who knew very little about Bitcoin. She mentioned that the technology seemed interesting but only knew the US dollar price of bitcoin is super volatile and didn't understand why. She also said it seemed like a good time to buy but that she didn't want to drop all the money to buy a bitcoin. When I told her she could buy super small amounts, like a dollars worth, she was shocked. She genuinely thought in order to buy bitcoin you needed to buy a whole coin. I had her download Muun wallet and sent her a dollars worth of bitcoin. It always brings a smile to my face and a warm tingling feeling in my heart when I show someone we don't need banks or cash anymore to send and receive value. The person got so excited they ended up asking me how to buy some and I sent my Strike signup link which got me ten free dollars of bitcoin. That's what kindness does. It returns you 10x the value. Obviously, this is just one example and it doesn't always play out so perfectly. However, in the long run being kind pays so many dividends. I didn't send that dollar with the intention of shilling my referral link. I did it because I want to show as many people as possible what Bitcoin can do. I guess one could argue it is a selfish action, but my heart is in the right place. I genuinely believe that orange pilling as many people as possible is the best way to fix the world.\n\nWas listening toBreedlove talk with Adam Curry today and I must say it was an amazing episode.\n\n> [**The \"Value for Value\" Movement with Adam Curry (WiM199) | The \"What is Money?\" Show**](https://whatismoneypodcast.com/episodes/the-value-for-value-movement-with-adam-curry-wim199)\n\nOne thing Curry talked about is how broken the current system of media (also in general) is and how we can fix it with value for value type stuff like podcasting 2.0 and also the [beef initiative](https://twitter.com/modernTman). It was funny listening to Adam spit truths about how so few understand how algorithms work or how technology operates under the hood. It is crucial that we teach this stuff to the generations coming up. Instead I find the algorithm is showing me Libsoftiktok page which shows videos of teachers talking about how they tell the kids about their personal life. It is hard to watch as malicious actors teach kids the \"woke\" agenda instead of math, science, history, etc. I was already planning on doing my best to educate my child about technology, but this podcast was a great reminder it is absolutely vital I expose Sloan to how the internet, email, social media, and technology in general operates under the hood. I've got a ton of work to do myself and because of Bitcoin I am going down those rabbit holes and enjoying it. I have a lot of respect for Adam because he saw how people were being kicked off mainstream platforms for not agreeing with the mainstream narrative and how much of a negative impact that could have on the people who depended on those things. Instead of just throwing his hands up and saying fuck it Adam doubled down and started creating podcasting 2.0 a value for value platform. He mentioned that one of the best ways to receive value for your podcasts efforts is to just ask. If you can build up a small audience that is loyal and you ask to provide whatever they think the hour spent together is worth (on a podcast or whatever medium you decide to broadcast to your audience) people are likely to support you. There is a lesson in that. While many times asking will result in a no you will never get a yes if you don't at least ask. Need to remember this in my sales gig. Life is pretty much sales. I might not always be an Account Executive but that doesn't mean I can stop selling. Hell I was selling the idea of Bitcoin last night and I think I successfully sold it. It's a lot easier to sell when you truly love something and know it's value. Maybe that is why Adam has been so successful with value for value because you can tell the guy is so genuine and really trying to provide value to his audience.\n\nTalking to an audience is another interesting thing to think through. I feel like part of me does want to create a newsletter and monetize it. Another part of me enjoys writing this on Medium and pretending to talk to my subconscious, anon. Some of these [medium](https://medium.com/@JeffBooth/finding-signal-in-a-noisy-world-57497df06a35)s are more targeted towards myself and some are more targeted for an audience. Depends on how I'm feeling that day. Part of me is scared if I try to monetize my newsletter I will fall into the trap of prioritizing monetization instead of promoting truth. Hard not to do nowadays as fiat currency is debased. This idea was exemplified very well in Jeff Booth's recent medium. Highly recommend reading.\n\n> It makes logical sense then, that 1) if money is just information and 2) money is being manipulated by Central Banks at an unprecedented rate to avoid a credit collapse of the system, then 3) Misinformation MUST be growing throughout the system (a second order derivative of that misinformation is that trust MUST be declining throughout the system).\n\n> But that is the unfortunate system we live in, and it has vastly negative consequences. Because we measure a system from within the system, for most of the population, it would make the truth virtually impossible to see. Similarly, every company, organization, and political party is made up of similar people measuring the system from the system, while every member of our society writ large believes that they can see through this misinformation better than others.\n\n> _(Caveat emptor - Although I do my personal best to go deeper on issues to understand both sides and where I might be wrong, this includes me, and the words on this page)_\n\n> By consequence, it is completely logical to see conspiracy theories, confusion, polarization, in-group, out-group bias, and social chaos reign.\n\n> That misinformation in the form of money wouldn't just create polarization. Because money connects value between people and nations, it would drive a tremendous misallocation of capital and resources as individual actors in the system all made the system worse with their actions to make enough money to escape the system. Chasing ever higher returns, it wouldn't only be the general public. Even pension plans, which need certain growth returns to stay solvent to pay liabilities in the form of retirement benefits would search for higher \"real\" returns. All of them, and us too, searching for ways to solve a growth problem to escape the very system creating the problem.\n\nSo well said. Everyone is forced out on the risk curve as our cash rapidly loses purchasing power. That said, I can't have a low time preference. I'm confident if I seek truth and continue to write everyday to improve my writing skills the money will come. It won't be a beautiful 10x tomorrow, in the way it was last night when I orange pilled that woman, but if I continue to do my best and ask for value once I've built an audience I can eventually make a living from writing and podcasting. Making a living from creating if you will. Life is full of opportunities if you take the chance and ask.\n\nThis part of Jeff's piece also stuck out to me.\n\n> Regulators in certain nations could try to slow or stop it, but in doing so, they would be making a grave mistake. Analogous to shutting down the internet from their citizens and blocking the innovation that came with it. It wouldn't stop the innovation but would instead ensure that the innovation and value derived from that innovation moved to other nations. Over time, people will realize that instead of pricing Bitcoin \"from the system\" that they live in today, Bitcoin will price _everything_ in that system.\n\nI tried explaining to the person I orange pilled yesterday Bitcoin is so amazing because it is not attached to our fiat system. Most people obsess over the USD price and it does feel good to see it go up. Like Jeff pointed out though that isn't what matters over a long enough time horizon. What matters is that blocks keep being added every 10 minutes. Bitcoin will become the unit of account eventually as fiat debases completely. It's just math and unless some black swan event comes out of nowhere it seems incredibly likely that Bitcoin will end up replacing the system and people will value satillionaires more than they value millionaires today.\n\nThus, I'm going to keep stacking sats and not saving in USD even if it is the best fiat currency. All fiat currency is programmed to debase. Bitcoin on the other hand is programmed to become more and more scarce over time. It is such a damn beautiful thing :D\n\n8/10/22\n\nConor Jay Chepenik",
  "wordCount": 1551,
  "readingTime": 5.8528301886792455,
  "claps": 0,
  "voters": 0
}