{
  "id": "9227306fb3c3",
  "title": "Day 520",
  "createdAt": "2023-08-25 02:33:40",
  "tags": [
    "haters"
  ],
  "url": "https://chepenikconor.medium.com/day-520-9227306fb3c3",
  "content": "# Day 520\n\n![nightcafe.studio](https://miro.medium.com/0*eLcAbBL1vNbtOq3V)\n\nIf you don't have any haters then you are not popping. I first heard that in a rap song but the same idea was repeated in a good podcast that I enjoyed while running today. It makes sense. If you are doing anything noteworthy or achieving any level of fame/success, you will inevitably garner some criticism or hatred. It's practically impossible to be universally liked if you put yourself out there in any capacity.\n\nHaving \"haters\" means you have reached a level of success or prominence that makes some people envious or threatened. Your success highlights their own lack of achievement. Overcoming criticism and opposition is a sign of resilience and conviction. If you can continue pursuing your goals and moving forward despite some pushback, it shows you really believe in what you're doing.\n\nThis underscores the vital importance of discovering your passion. It's improbable to sustain success in something you despise, especially if you're quick to retreat at the first sight of detractors. In a sense, these 'haters' should act as indicators that you're hitting the mark. After all, people don't direct their negativity downward. You won't find the CEO of a major corporation publicly berating the janitors in their building.\n\nA complete absence of critics or adversaries might indicate that you're playing it overly safe. If you're not stirring any feathers, it's plausible that your aspirations and actions lack the necessary ambition. Having critics shows your work or message has impacted people, even if some disagree.\n\nKind of a funny that I find myself thinking \"I need to go get some haters\" I'm going to be honest just typing that out gave me a good chuckle because it seems so insane. \"Yea I'm going to go and work so hard that people start hating on me\". What an insane thing to say. No average human would ever say something like that. Good I don't want to be average.\n\n8/24/23\n\nConor Jay Chepenik",
  "wordCount": 326,
  "readingTime": 1.430188679245283,
  "claps": 0,
  "voters": 0
}