{
  "id": "92360a548d2",
  "title": "Day 554",
  "createdAt": "2023-09-28 03:36:33",
  "tags": [
    "bitcoin",
    "apple",
    "innovation",
    "steve-jobs",
    "open-letter-to-apple"
  ],
  "url": "https://chepenikconor.medium.com/day-554-92360a548d2",
  "content": "# Day 554\n\n**An Open Letter To Apple**\n\nApple, you gained the world's largest market capitalization because you dared think different. So when you decided to [shut down zaps on Damus](https://bitcoinmagazine.com/business/damus-set-to-be-removed-from-apples-app-store) it came as a shock to someone who always appreciated Apple's rebel spirit. Removing zaps from the iOS store does not stop me from zapping. It just makes me zap in a web browser instead. Reconsider what zaps can do for your business so you don't miss the forrest for the trees.\n\n![[https://primal.net/e/note1m99khmn94j5rnwftzcjn2lvzsz3nw0payvptnnykx37uc3mh9uhst547g3](https://primal.net/e/note1m99khmn94j5rnwftzcjn2lvzsz3nw0payvptnnykx37uc3mh9uhst547g3)](https://miro.medium.com/1*9LaUJVq9twAtRAq-Fp3ILQ.png)\n\nBitcoin's underlying technology cannot be uninvented. The technology is revolutionary and irreversible. It has spawned a groundbreaking network with the potential to decentralize the ways humans organize, transforming our planet in ways we can only imagine. Many people could never have imagined giving up their phone for an iPhone until they saw an iPhone. In many ways Bitcoin is similar for money. What Satoshi created was absolute scarcity that anyone can verify for themselves. Satoshi & Steve are both visionaries.\n\nBitcoin is an extraordinary idea that transcends mere currency creation. If it becomes the foundational layer of money, it has the potential to revolutionize governments, similar to how the internet transformed businesses. Like Steve Jobs, who was passionate about pushing boundaries and introducing consumers to technologies they didn't know they wanted yet, Satoshi Nakamoto envisioned a world where individuals have control over their finances, free from the grip of traditional fiat edicts and \"too big to fail\" institutions.\n\nLike cash and digital payments, Bitcoin has its own set of trade-offs. Cash offers superior privacy and allows for peer-to-peer payments, but it cannot be sent over the internet. Credit cards and bank accounts enable convenient online payments, but they require users to give up personal information. Both are fiat currencies which means they are subject to inflation risks. Bitcoin offers the promise of secure online money transfers without the need for banks or intermediaries, but it requires users to understand its unique features and take responsibility for their finances. If you don't run a node, you introduce counter-party risk, which is the very thing Bitcoin was designed to solve. This trade-off between convenience and control is where cross-disciplinary thinking can play a vital role.\n\nSteve Jobs and Satoshi Nakamoto both embraced a first principles approach to innovation. Nakamoto's pioneering work led to the creation of a decentralized system that blended elements of computer science, cryptography, and economics. It's almost poetic that such a brilliant open system finds a home on Apple's sleek machines. Jobs had a unique vision for Apple, one where control over both hardware and software was paramount to ensure the highest quality and user experience. While this approach sometimes frustrated others, it undeniably played a crucial role in propelling Apple to its status as the world's largest company. However, innovation is an ever-evolving landscape, and there are moments when adopting groundbreaking technology becomes inevitable. Jobs' commitment to control was unwavering, but even he acknowledged the need to embrace superior technology when it emerged. In this context, the adoption of Bitcoin, a transformative network for digital money, holds significance. While Apple is a formidable company, Bitcoin operates as a simple protocol. Apple can undoubtedly benefit from integrating Bitcoin on their devices, but Bitcoin itself remains independent and resilient, not reliant on any single entity like Apple to function. Apple there is no doubt your immediate survival is not contingent on embracing Bitcoin. However, complacency breeds stagnation and over an extended timeframe the company may face increasing challenges if it fails to tap into the potential of Bitcoin.\n\nWhile I appreciate Steve Jobs' brilliance and his commitment to his vision, I believe that Satoshi Nakamoto's community-centric approach was better suited for what he was creating. Bitcoin evolves through decentralized governance, where decisions about its development are made collectively by its global user base. This ensures that the digital currency remains adaptable and responsive to the needs and preferences of its users. It also makes it difficult for people to \"move fast and break things,\" which can be disruptive and harmful in a financial system people all over the world are using as a store of value.\n\nGreat thinkers are characterized by their willingness to embrace risks and embrace lessons from failure. A notable instance of this trait is exemplified by Satoshi Nakamoto, who even stepped away from the Bitcoin project momentarily out of concern regarding WikiLeaks using Bitcoin for donations. The enduring anonymity surrounding Satoshi's identity serves as a profound testament to their humility and a genuine commitment to enhancing the world.\n\nThe enduring strength and adaptability of Bitcoin owe much of their existence to the absence of a singular target. It was not the creation of a solitary individual but rather an idea that had to surmount the trials of a free-market environment, emerging triumphant in the end.\"\n\nWhat made Steve Jobs so succesful is how he seamlessly combined art, music, and creativity into products that people emotionally connected with. Steve was excellent at evoking people's emotion.\n\n![](https://miro.medium.com/0*cmY52EVyXpFPUwK4)\n\nInnovation thrives at the crossroads of diverse disciplines. Embracing cross-disciplinary thinking is fundamental to nurturing ideas and allowing them to flourish. In the context of Bitcoin's immense potential, I'd like to propose a vision of how Apple could harness this interdisciplinary approach to not only honor its legacy but also embrace the future.\n\n1. User-Friendly Bitcoin Integration: Apple's knack for seamlessly blending technology with user experience is legendary. Collaborations between computer scientists, UX designers, and educators could yield exceptional tools and resources to demystify Bitcoin for the masses. Imagine integrating lightning payments into Apple Pay, simplifying Bitcoin transactions and potentially eliminating the need to share revenue with banks and credit card providers. The user-friendly experience could redefine digital payments.\n\n2. Regulatory Collaboration: In navigating the complex regulatory landscape, Apple could work alongside legal experts and economists to develop clear frameworks. By demonstrating a commitment to balancing innovation with consumer protection, Apple can win the trust of regulators and lawmakers. This proactive stance could pave the way for Bitcoin's wider acceptance and lessen the need for protracted litigation battles.\n\n3. Financial Services Revolution: Collaborating with fintech experts and developers, Apple could design financial products and services that harness Bitcoin's power while ensuring security and compliance. A notable challenge is the absence of chargeback mechanisms in Bitcoin. Here, Apple could innovate by exploring solutions that preserve Bitcoin's core tenets of trustlessness and immutability while offering users optional chargeback mechanisms through trusted third parties.\n\nWhile some purists may resist the idea of chargebacks, the goal is to strike a balance and let Bitcoiners decide on the tradeoffs they are willing to make. By fostering innovation in this area, Apple can help Bitcoin accommodate a wider range of users and use cases.\n\n4. Societal Impact: It's my belief that Bitcoin can be a force for societal betterment, promoting financial inclusion, economic development, and individual sovereignty. Instead of dismantling existing systems, Bitcoin offers a way to improve them. It's disheartening to see Apple, once known for its rebellious spirit, shy away from such an opportunity.\n\nThrough cross-disciplinary collaboration, we can chart a path toward a brighter future. This approach unlocks new possibilities for Bitcoin's growth and adoption. In a world where Steve Jobs melded creativity with technology to redefine industries, Satoshi Nakamoto's creation continues to reshape finance through the synergy of interdisciplinary teamwork.\n\nIf asked which will endure longer - Bitcoin or Apple - I would confidently say Bitcoin. As I near the end of Walter Isaacson's biography on Steve Jobs, it's evident that Steve's vision propelled Apple to its current stature. Yet, this doesn't guarantee Apple's everlasting success. In contrast, Bitcoin's simple mandate - adding blocks of transactions every ten minutes - sustains it without constant innovation. Ideas, like Bitcoin, possess resilience beyond that of even the mightiest corporations, regardless of their size.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/americanhodl8/status/1707085392770646018%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/Bitcoinfinity/status/1675020248511320069%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFirst draft at something. Not done with it yet but this is all a messy scratch pad which I will morph into a chiseled peace of stone that looks good by the time Bitcoin Magazine shares this writing.\n\n![](https://miro.medium.com/1*dxWSJLFoi1hoMdUZ8qzRhg.png)\n\n9/27/23\n\nConor Jay Chepenik",
  "wordCount": 1354,
  "readingTime": 5.659433962264151,
  "claps": 3,
  "voters": 2
}