{
  "id": "9284887d934d",
  "title": "Day 773",
  "createdAt": "2024-05-04 02:12:52",
  "tags": [
    "god"
  ],
  "url": "https://chepenikconor.medium.com/day-773-9284887d934d",
  "content": "# Day 773\n\n\"When we deprived the the masses of their belief in God, ruling authority was thrown into the gutter, where it became public property, and we seized it\" - Protocol 5\n\nThis quote is from The Protocols of the Elders of Zion. If you do a Google search it will show this is a false made up anti-Semitic piece of writing. Which scares me because I hope that The Protocols of the Elders of Zion is indeed a false, anti-Semitic piece of writing. Yet, it's hard to trust Google or other sources when they have been caught lying so many times.\n\nSo with that caveat noted I'd like to just discuss the quote. I don't know if this is a made up document or not. What I do know is regardless of who actually wrote that quote it contains a lot of insights into why one should not give up on God.\n\nIf you leave a God size hole in your heart it will be replaced with something else. It's that simple. Sadly, for many that thing becomes the Gov which is a truly awful thing to replace God with. History has many examples of secular totalitarian regimes taking on a semi-religious zeal and cult of personality. If you have faith in a higher power you will live your life as a better person. For many, this spiritual grounding fosters ethical living and virtuous conduct because looking inward and connecting with something greater than ourselves has the potential to make us kinder, more principled people. On a large scale that is much better for society than placing your higher power as the Government which is constantly gaslighting its population.\n\nAs someone with a jewish Grandfather who I know is an amazing man and has been such an incredible Grandpa to me and my sisters the idea that Jewish people are evil is comical. That said, it's essential to recognize that no group is a monolith with uniform beliefs. This includes various groups, whether they be Satanists, secular Jews, globalists, atheists, or any other. The quote and protocols mentioned serve as a reminder not to let anything usurp the place of God in our lives, as there will always be those who aim to seize that higher power for themselves. The world may indeed contain a small group of individuals conspiring to consolidate as much power as possible, and I find this tweet relevant because it sheds light on such machinations.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/MichaelInTruth/status/1785056500349821248&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nScreenshot here in case the tweet link rots:\n\n![[https://x.com/MichaelInTruth/status/1785056500349821248](https://x.com/MichaelInTruth/status/1785056500349821248)](https://miro.medium.com/1*tCav-DqYQT4UcNszjyc-xw.png)\n\nWhat I find way better than just blasting someone as racist for bringing up these documents is to live by a set of principles. Elon Musk is a flawed man and I've seen that reading his biography. But guess what? So is every other human on this planet. Why I respect Elon based on what I've learned (which is really not much as I don't know the man personally) is because he seems to have principles that he lives by. Here is a perfect example of those principles in action.\n\n![](https://miro.medium.com/1*QDw_aseywDlM_YbE4teMPA.png)\n\n![](https://miro.medium.com/1*WXQDkcLf4nyqgU6b2s5t3A.png)\n\n![[https://x.com/LegendaryEnergy/status/1786095712876507340](https://x.com/LegendaryEnergy/status/1786095712876507340)](https://miro.medium.com/1*n8en2JIAAqBPEHuxL5AtzQ.png)\n\nTruth is like a lion it does not need to be defended. I will leave it at that. Anyways, it's not exactly fun to try and figure out why a small group of corrupt power hungry people are trying to control the world. Especially not when people are quick to label you a racist or anti-Semite for pointing out unfortunate truths.\n\nI'll end this Medium with some things I enjoyed about my time in NYC yesterday. I got to go to Pubkey and see the CEO of a Bitcoin wallet company named Zeus speak. That was dope and when I rode the subway I thought these Mulvad VPN ads were cool.\n\n![](https://miro.medium.com/0*ykTIcWwXbFBW_9ar.jpg)\n\n![](https://miro.medium.com/0*qksAYz4tvJ3SewE6.jpg)\n\nI also wrote this note on Nostr which I believe to be true.\n\n![](https://miro.medium.com/1*0OJb4Ss017WzrQ2P4qvmYA.png)\n\nI will finish this post with an even more based note I read on the Notes & Other Stuff Transmitted by Relay (Nostr check out primal.net) if you haven't used it!\n\n![](https://miro.medium.com/1*_s327W79F5zMsG_SSBX0JA.png)\n\nIf you can get your relationship right with the Higher Power up there watching over us, I promise you will feel at peace regardless of what is happening in the world. Future looks damn bright!\n\n5/3/24\n\nConor Jay Chepenik",
  "wordCount": 707,
  "readingTime": 3.80125786163522,
  "claps": 0,
  "voters": 0
}