{
  "id": "9529dae36bc9",
  "title": "Day 151",
  "createdAt": "2022-08-20 20:40:25",
  "tags": [
    "taxes",
    "rant",
    "government",
    "constitution",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-151-9529dae36bc9",
  "content": "# Day 151\n\nWas reading _The Sovereign Individual_ this morning and it helped me realize that the Nation-State is a chronic abuser. I was super fortunate to grow up in a household that didn't experience domestic violence. I'll joke with my Dad that he was too obsessed with his children's athletics but overall he was an incredible Father who just wanted his kids to succeed in their endeavors. While I didn't agree with every method he used to motivate us, overall it was a net positive on my life and I'm proud of the athletic career I had. Without my Father there is no way I would've gone on to play football at the collegiate level. My Nation-State though, can't say the same thing. It has stolen from me via taxes my entire life and mandated I get a vaxxine that was promoted as something that would prevent its user from getting the vid. Well that turned out to be false advertising. Watch this [video](https://twitter.com/iansmithfitness/status/1560748464710897665?s=20&t=MBh1s0Z7XdpRB2SOjTNn0A). Hard not to be pissed when you see what a big farse these past 2 years have been.\n\nAnyways, back to what a chronic abuser the Nation-State is on its citizens. America literally revolted and came into existence over a 2% tax on tea. Now this country is hiring 87k people to work at the IRS and tax the middle class even more. Evil people are working behind closed doors to screw over the little guy. People deserve a right to life, liberty, and the pursuit of happiness. Adults should be able to transact voluntarily without an egregious nanny state being at the middle of every transaction. I feel deeply sorry for anyone who experiences legitimate domestic violence in their home. I've yet to experience it myself so keep that in mind as you read my opinions, but one thing I've noticed as an observer is it is often hard to admit to yourself that your partner is an abuser. Our brains are very good at lying to ourself. Ironically, we seem to be much better at coming up with 1000s of excuses rather than confronting the issue. I'm generalizing but I think that this is happening to many people living within a country. People who still wear masks, line up for a 4th booster, and don't see the problem with a Government printing 80 billion to pay 87k more tax agents to go after people who are getting taxed ridiculous amounts already are clearly coming up with excuses rather than facing the music. As much as I would love to not pay any taxes I understand there will be a gun in my face and a jail cell waiting for me if I skip out on paying taxes to the Government. It already gets taken out of my W2 anyways so there is not much I can do to avoid paying my taxes. Despite this I will still write pieces like this and talk shit on Twitter about what a joke our country has become with its policies. I'm not perfect, but I'm doing my best to recognize what a terrible abuser the Government is becoming as we near the end of the American empire.\n\nI'll also continue spreading the good word of Bitcoin to show people there is a more fair system. One outside the reach of Government control where we get taxed on our paychecks and via inflation from money printing. This current administration is going to cause some serious problems on the path they are on. While many will come up with ridiculous excuses about how the IRS needs more people (the reality is the IRS needs to be disbanded) it won't change the fact there is a larger group of people waking up. A group of people that just want to be left alone. Good, honest, law-abiding citizens who are thinking to themself \"Why the fuck is the price of everything going up at unseen rates\". The U.S can export its inflation onto other countries because we have had global reserve currency status since Bretton Woods. That is quickly coming to an end as more countries see the farce we have been running and are realizing the U.S is happy to sanction anyone who doesn't stay on good terms with the U.S. I love the ethos of the U.S constitution, but the more I learn about how the world really works the clearer it becomes the Federal Government is a chronic abuser and one of the biggest threats to its citizens. I'm so glad protocols like TCP/IP & LNP/BP are helping to break up the propaganda machine and monetary rails that have allowed Nation-States to be chronic abusers while at the same time convincing its citizens the welfare state is here to save them.\n\nThis [video](https://twitter.com/BTCGandalf/status/1560923812698509313?s=20&t=7aAQxSXc2jp-NVz-gbyrkA) from the BBC was pretty funny. It summed up how ridiculous the woke ideology has become. One of my favorite parts is when the group leader goes \"And just remember it doesn't really matter because by the time you hit your thirties most of you are going to be massively right wing anyways\". Hahahahaha so true. I don't think either party will save us. Bitcoin is the way out of this dysfunctional system. That said, I understand that people lean right because its easy to say \"Oh we should share and help the needy\" but when your own money is taken to pay for this people wake up real quick. It is easy to say yea I want help people, but those same people stop talking about how nice it would be if everyone had their basic necessities met once they realize the government will pay for it with their money. My old high school economics teacher had a great story. He said his friend had a daughter who was a staunch liberal. She was always critiquing her father growing up for not leaning left until after she finally graduated law school, got a job, and upon receiving her first \"big girl paycheck\" saw how much in taxes got pulled out. Real quick she started leaning right when she realized the Government takes a ton in taxes and provides crap services in return. Like I said earlier I don't like paying taxes, but I would be a lot less pissed off about it if I knew that money was being used to fund decent projects like infrastructure, education, and other parts of the community rather than to launder money in Ukraine, subsidize unreliable energy, and let a bunch of pedophiles in Washington D.C lie every day to the public.\n\nWe the people deserve better period.\n\n![Photo by Rachel Claire: [https://www.pexels.com/photo/people-rowing-in-kayak-in-mountain-landscape-7276654/](https://www.pexels.com/photo/people-rowing-in-kayak-in-mountain-landscape-7276654/)](https://miro.medium.com/0*j7ZNu_5pPfvKkRsn)\n\n8/20/22\n\nConor Jay Chepenik",
  "wordCount": 1109,
  "readingTime": 4.384905660377359,
  "claps": 0,
  "voters": 0
}