{
  "id": "95b3980c6cba",
  "title": "Day 83",
  "createdAt": "2022-06-13 22:37:52",
  "tags": [
    "computer-science",
    "cramer",
    "recession",
    "unions",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-83-95b3980c6cba",
  "content": "# Day 83\n\nBeen doing a little coding on the side and man is computer science humbling. I'm taking a really helpful class about front-end development on Udemy which I appreciate. Got to start somewhere. Been using codepen.io to help which is nice because you can see the changes right after you make them. It really is amazing how computers are able to compute incredible applications that are pretty much a bunch of 0s and 1s being calculated. It's funny that the type of computer code used is called \"language\". I do feel like I'm learning a new language as I slowly but surely figure out how to command a computer to do stuff so it checks out.\n\nI felt much better at work today. Barely checked Twitter which was actually incredibly helpful. It is way too easy to get caught up reading tweets and let 15 minutes pass. The number of times I've gone to the bathroom and been M.I.A for 15–30 minutes at work because of Twitter is a lot. Bitcoin crashed below 23k today so it looks like I will be able to get a full coin much sooner rather than later. You love to see it. Obviously, I don't like seeing the fiat purchasing power of my bitcoin go down, but I think the price drop has more to do with the macro backdrop. Shout out Pomp for the hopium piece that morning showing all the metrics of the Bitcoin network are up and to the right, besides the spot price of course. Outside of that, I got a pretty exciting week ahead. Playoff soccer game tonight for the adult league I play in. It's pretty low-key and laidback but it's an enjoyable feeling getting in the flow state from adult sports. I think a big problem in our modern society is most people don't get to experience flow states enough. I really do believe humans would be much happier in general if they exercised more and did activities that helped them reach the flow state. Tuesday, I'm back for my stand-up comedy class and then Wednesday my grandparents are coming into town. An action-packed week and I look forward to it.\n\nFor all those who are worried about bitcoin right now, I remind you we are going to see a recession, unlike anything we've seen before. You know things are bad when Cramer is predicting a bull market. This is not financial advice, but my personal recommendation would be to secure your own coins, get them off an exchange, and stay the hell away from leverage. It is not worth getting rekt for a lil extra yield. Keep dollar-cost averaging and stacking. Everything lil thing is going to be alright 🎶 . Except maybe the economy🤣. Hopefully, it doesn't get too bad to the point where we see another great depression, but damn do I get nervous when Cramer starts making predictions.\n\n![](https://miro.medium.com/0*9I1p8q8p8-jAGDwU)\n\nFinally, I've been reading more of _The Sovereign Individual_ and it is an eye-opening piece of literature. Today I read about how unions were able to use 'violence' to barter for above market wages. Lots of assembly lines led to workers having the same economic output regardless of skill. This is a gross over simplifaction but the idea that all these factory workers were in it together against a corporation held true since it didn't matter how smart you were if you just did the same thing on an assembly line. Thus, these unskilled laborers were motivated to band together and stop working which would cost these corporations a fortune. This resulted in unions getting their way and workers getting above market rates for their pay. As information technology blossoms, it is much easier to outsource work and since ones skill does have a large impact on their output it is much less likely workers will band together to attack their employer. The talented will simply ask for a raise or go seek employment elsewhere. Fascinating stuff how many variables go into unions, jobs, and employment. Moral of the story is the hive mind can be powerful and you don't want to be its enemy. I love you bitcoin and I will continue fighting for you so the hive mind of fiat normies don't come after the hive mind of Bitcoiners. Luckily, we got truth and reality on our side, something those in the fiat world seem to constantly forget.\n\nGot a good feeling about the coming years. From the ashes a phoenix will rise or some shit.\n\n6/13/22\n\nConor Jay Chepenik",
  "wordCount": 763,
  "readingTime": 3.079245283018868,
  "claps": 0,
  "voters": 0
}