{
  "id": "979c116f5b5a",
  "title": "Day 462",
  "createdAt": "2023-06-28 01:32:21",
  "tags": [
    "fasting",
    "health",
    "freedom",
    "podcasting",
    "selling"
  ],
  "url": "https://chepenikconor.medium.com/day-462-979c116f5b5a",
  "content": "# Day 462\n\n![](https://miro.medium.com/1*V_TiHPFkbekrDxamVrY58A.png)\n\nI just enjoyed one of the best podcast rips I've ever done with a friend of mine who goes by the nym Caribou. He played a pivotal role in the Freedom Convoy that took place in Canada. When he was speaking about the experience I felt some tears of joy starting to form. I'm jazzed to get this rip edited and released, but for today I'd like to reflect on my main takeaways.\n\nDon't sell to people; hone in on their pain points instead. Figure out what challenges someone is facing by asking them questions to discover the root of the problem which is causing them said pain. Once you have done that then you can offer a solution. This applies to both orange pilling people about Bitcoin as well as traditional sales. This customer-centric approach will yield better results than merely highlighting product features or benefits without understanding someone's motivations for seeking a solution to their problems. Ignoring the why behind someone's desire for action can lead to undesirable outcomes.\n\nSubtract things to become healthier. It is really that simple. The more you add into your routine the more overwhelming it becomes. We all have limited bandwidth so subtract all the things that don't improve your life. This applies to food, friendships, possessions, and arguably everything in between.\n\nSuccess isn't handed to us; we must actively pursue it. However, this doesn't imply resorting to violence or harming others to achieve our desires. Instead, it means having the courage to assertively pursue our goals. In my case, I am determined to transform my podcast into a global phenomenon. I understand that no one will simply hand me that level of success. Therefore, I have set a clear objective and am fully committed to leveraging every possible resource and effort to accomplish it.\n\nFinally, fasting is a great idea and a super powerful tool. Fasting can apply to more than just food. You can fast from digital things. You can fast from masturbation. You can even fast from chairs. If you find you are addicted to something then maybe there is some value in fasting. Fasting from chairs might seem ridiculous but I think you would find that you end up moving more without chairs to plop in.\n\n6/27/23\n\nConor Jay Chepenik",
  "wordCount": 384,
  "readingTime": 1.6490566037735848,
  "claps": 1,
  "voters": 1
}