{
  "id": "97e4bc58d98",
  "title": "Day 364",
  "createdAt": "2023-03-22 02:46:13",
  "tags": [
    "writing",
    "compounding",
    "coding",
    "journalism",
    "corn"
  ],
  "url": "https://chepenikconor.medium.com/day-364-97e4bc58d98",
  "content": "# Day 364\n\nIt is incredible to think that tomorrow will have been a year since I started writing everyday on here. There were many days I did not want to write or have anything to write about when I first sat down. It feels so damn good to know I put in that proof of work. I've still got so much work to do in order to improve my writing skills. After proving to myself I can write everyday for a year straight I'm confident I will do that work. There is still one more day for me to officially hit a year. Just know if I don't make that yearly post mañana it's because something horrific happened. There is no way I'm not writing on the final day of this challenge!\n\nOne of the most powerful takeaways from all this is that building good habits matter. I'm sure there are plenty of posts in the 363 days before this that are dogshit. Doesn't matter. Dogshit writing > not writing. No one is being forced to read these posts. At least I hope not lol. Anything worthwhile I've written is because I kept practicing the craft of writing. I'm two days into this coding bootcamp and I can already tell it's going to be a similar thing. At this point I am a very mediocre coder and that is putting it nicely. I'm proud of myself for bootstrapping the knowledge to build massadoption.net and binmucker.com but I can already tell from the stuff I have learned so far there are so many best practices I missed when building those websites. Of course breaking proper syntax in writing (& maybe coding) is okay sometimes but in most cases it's something to be avoided. If you are not a skilled writer (or coder) you are likely to be better off not trying to get fancy.\n\nSimple is sweet and sweet is simple. I don't even know what that means. Just wanted an example to show why in most cases you should learn the basics before jumping into the advanced stuff. Kind of reminds me of the statement love is love. Yea shit is shit. People are people. Defining a word by it's name is not very helpful.\n\nToday during my coding bootcamp we were tasked with building an app from the command line that would allow for a card game to be played. When my partner and I first started with the code it seemed incredibly daunting. After spending some time with the code and working our way through it seemed to be incredibly rewarding. Taking time to breath, sit with, and explain the problem out loud is very useful. Whenever you get frustrated take a deep breath.\n\nI'll end tonight by pointing out another habbit I commited to doing is running at least 40 miles every month for 2023. So far I've done this. I'm at 33 miles after my run late tonight which means I am on pace for 40 again. Wasn't going to run today but my boy Keenan logged one and posted about it in our proof of work group chat so I had to get after it. Find people to hold you accountable and establish those habits anon. Become the best version of you.\n\nCompounding is a powerful force that can lead to significant changes over time. The reason why 1.0¹³⁶⁵ is so much more powerful than 0.9⁹³⁶⁵ is precisely because of the effects of compounding. When a number is raised to a power greater than 1, each multiplication leads to a larger number than the previous one, which magnifies the effects of compounding. In contrast, when a number is less than 1, as is the case with 0.99, each multiplication leads to a smaller number than the previous one, which works against the effects of compounding.\n\nSo, when you make small improvements consistently, such as getting 1% better every day, you harness the power of compounding. Each incremental change builds upon the previous one, leading to a significant increase in the final result over time. This is why small, consistent actions can lead to life-changing results that may seem unimaginable at first.\n\nSince starting this year long experiment I've been published in Satoshi's Journal, bitcoinnews & Bitcoin Magazine. I also got published in the print version for Bitcoin Magazine. I'm a journaliissstttt now.\n\n![](https://miro.medium.com/0*8RgX6jhdhTuP1tGs.png)\n\nI guess you could say that Film & Media degree partially paid off hahahahah. Jokes aside, I enjoy writing about Bitcoin because it gives me hope and with this coding bootcamp I hope to add value in the Bitcoin space outside of just writing articles and essays. I want to write some of the mf logic to these applications that will be built on top of the soundest money protocol the world has ever seen.\n\nAnd I'm going to do it thanks to compounding. So note to self: next time you are stressed, pissed off, worried, frustrated, or any emotion in between (remember compounding) => {\n\ntake a breath\n\n}\n\nconsole.log(\"keep going\")\n\n3/21/23\n\nConor Jay Chepenik",
  "wordCount": 844,
  "readingTime": 3.384905660377359,
  "claps": 0,
  "voters": 0
}