{
  "id": "98f120b7146c",
  "title": "Day 296",
  "createdAt": "2023-01-12 20:54:44",
  "tags": [
    "meetups"
  ],
  "url": "https://chepenikconor.medium.com/day-296-98f120b7146c",
  "content": "# Day 296\n\nMan last night was special. Truly specialðŸ˜¤ ðŸ¤\n\n![](https://miro.medium.com/0*IjdBFlpAZ1--MQrb)\n\nGreg Foss joked that we have a special opportunity here in Boston to become one of the next financial hubs of the world. Especially considering that Boston and New York hate each other. As New York continues to shoot itself in the foot with their horrible bitcoin policies (think mining ban and bit-license) entrepreneurs will go elsewhere. It makes absolutely no sense why Boston can't become one of the greatest Bitcoin hubs in the United States. Feeling the energy in that room last night was insane. We are building something special with Mass Adoption and I can't wait to see what happens. The meetup tonight should be fun. Looking forward to hearing both Jason and Greg give some more long-winded talks.\n\nSloan is getting better about sleeping longer. She is not sleeping through the night just yet but we are getting there. She wakes at various points to breastfeed but after getting nice and milk drunk she goes right back to sleep. Looking forward to the day I get a full 8 hours of sleep in. I don't think that will happen for a couple of years though hahaha.\n\nI read a great substack from Cernovich about Puss & Boots. I agree it was a fantastic movie.\n\n> [**Puss in Boots: You Can't Run From Yourself**](https://open.substack.com/pub/mikecernovich/p/puss-in-boots-you-cant-run-from-yourself?r=1rxdni&utm_campaign=post&utm_medium=web)\n\nLike Cerno points out we can't run from ourselves no matter how hard we try. Learning to accept who we are is they key to a building a happy life. In this movie the disgruntled dog who has had arguably the worst life of any character turns out to be the most at peace with himself. Obviously, it is just a kids movie but there is a good lesson in that. Sometimes those who get dealt the worst hand learn to deal with life the best. You have to go through the shit to become a beast. No matter how bad it gets life is what you make of it :)\n\nWas feeling distracted this morning and when that happens I have a bad habit of just scrolling social media. So to break it I crushed a run. I always feel better after getting outside the house. I do recommend anon.\n\nGoing to be writing a big substack after tonight's meetup so a few points I'd like to hit include:\n\n- War is permissionless. You don't ask to shoot at someone. Trying to negotiate during a battle is like trying to dry off while swimming. It is not going to happen.\n\n- Empires fall when they get complacent. The United States has an incredible opportunity to stay an empire if we embrace Bitcoin.\n\n- Life is better when you spend time around things you love; family, passions, and friends.\n\n- New technologies balance the playing field. They give the little guy an opportunity to compete.\n\n- I can't wait to go spend more time learning about Bitcoin. Reminder to myself to enjoy these meetups; I'm going to look back after hyperbitcoinization and think to myself those meetups were the good ol days:D\n\n1/12/23\n\nConor Jay Chepenik",
  "wordCount": 540,
  "readingTime": 2.237735849056604,
  "claps": 0,
  "voters": 0
}