{
  "id": "9b03516c5ca7",
  "title": "Day 197",
  "createdAt": "2022-10-05 23:25:14",
  "tags": [
    "pretzels",
    "finance",
    "bitcoin",
    "proof-of-work",
    "doctors"
  ],
  "url": "https://chepenikconor.medium.com/day-197-9b03516c5ca7",
  "content": "# Day 197\n\nToday I was eating chocolate pretzels at work and had a funny realization when I started stacking them on top of each other. The more pretzels I stacked the less stable the structure become. I was able to stack them about 8 high after some trial and error, but the more I tried to stacked the more my structure kept falling over. Naturally since I think about Bitcoin vs fiat all day this reminded me of leverage in our financial system. I have a lot to learn about how derivatives actually work but thinking about all the different kinds of derivatives in our current monetary system makes me a little uneasy. Leverage on top of leverage on top of leverage. Central Bankers are trying to play God in the system by planning interest rates but they can only keep the system stable for so long until it crashes. It was so similar to me stacking these delicious chocolate pretzels that they keep in the kitchen at my day job. It is much simpler with the pretzels because cleaning up the crash just involves picking them up and putting them back on top of each other. In the real world fixing the system is a lot more expensive and complicated.\n\n![](https://miro.medium.com/0*RlMtnpRZ5mUTs_Pt)\n\nFunny how we can realize things just by observing the most random stuff in our day to day life. I am reminded of Isaac Newton discovering gravity when an apple fell on his head. My discovery is nowhere near as groundbreaking but I hadn't thought about how layer on top of layer of leverage just serves to make a system more and more unstable. Especially a system that is based on debt. Call that ish debt jubilee. The fact Bitcoin doesn't require debt to settle is such an amazing breakthrough. It minimizes trust while allowing us to trust others to a much greater degree. It's paradoxical because by removing the need for trust in humans we can create a much greater degree of trust amongst humanity. Outsourcing our trust to a protocol instead of a private banker is fantastic because throughout history the human desire to start expanding the money supply (counterfeiting those who hold money at the bank) has always proved too great a temptation for the bankers. While placing trust in a protocol instead of a banker is smart, it is also smart to audit the Bitcoin protocol for yourself. That is part of the reason I've gone down such a big computer science rabbit hole recently. However, the longer this network exists the more bullish I become about a protocol making banking irrelevant. Or at least banking in the sense of having a third party like Wells Fargo, J.P Morgan, Bank of America, or whatever Bank someone banks with hold your money.\n\nHumans are amazing but a majority of our decisions are driven by emotion. I don't think all bankers are evil. I think they just all fall prey to the same thing that every human does: emotion. The Bitcoin protocol has no emotion. It just runs the logic programmed on to it. The protocol is not tempted to lend out money it does not have so it can charge interest on that loan. There is no credit in the Bitcoin network. Everything on the layer 1 blockchain is final settlement. Listened to this Podcast with Jason Lowrey today and it was worth the listen.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F3JnMMuThRj70s7UIUcPrU5%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F3JnMMuThRj70s7UIUcPrU5&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f3c465a363857459678c42d67&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nHe is right about not trusting a financier to fill you in on the implications of the Bitcoin protocol. I love the example he used about how gun powder was medicine initially because a Doctor discovered it. Over a long enough time horizon it became very clear that a Doctor had no business figuring out the strategic implications of gun powder but at first people simply didn't know any better. Sounds a lot like the Bankers talking about how Bitcoin is a ponzi scheme. Except in this case the banking system is the ponzi scheme with their fractional reserve methods. At least the Doctors were just ignorant rather than malicious hahahaha. Then again maybe some Bankers truly are ignorant. What's that quote about not attributing malice to incompetence?\n\n10/5/22\n\nConor Jay Chepenik",
  "wordCount": 701,
  "readingTime": 2.845283018867925,
  "claps": 0,
  "voters": 0
}