{
  "id": "9b62bcca1bf5",
  "title": "The Joy Of Not Assuming",
  "createdAt": "2021-11-07 15:54:53",
  "tags": [
    "finite",
    "pepe",
    "bitcoin",
    "finance",
    "teaching"
  ],
  "url": "https://chepenikconor.medium.com/the-joy-of-not-assuming-9b62bcca1bf5",
  "content": "# The Joy Of Not Assuming\n\nFriday night I got to have dinner with my girlfriend's best friend and her boyfriend. It was my first time meeting the boyfriend and about an hour into dinner the topic of Bitcoin came up. Will call him John for anon's sake and he asked me if Bitcoin is something he would be stupid to ignore. I was pleasantly surprised because all I had known about John before the dinner was that he worked on robots for a living. I answered \"You should learn about Bitcoin first, but you will be missing out on a bunch of alpha if you don't invest\" and then quickly explained alpha means profit when I remembered I was not on Bitcoin Twitter.\n\n![](https://miro.medium.com/0*ne_CsixwpO09BmeE)\n\n(Me when the topic of crypto comes up ^)\n\nI went on to explain the many use-cases and reasons I believe Bitcoin is so important. Such as, Bitcoin is the first time money has been separated from the state and the Bitcoin network allows you to transact with anyone in the world without using a third party. I tried to explain how running a node gives you the freedom to do this, but you can also use \"Bitcoin banks\" like [Coinbase](https://www.coinbase.com/join/chepen_g), [Gemini](https://www.gemini.com/share/www7ad4te), and many others to buy, sell, and hold coins. My girlfriend rolled her eyes because she gets annoyed when I constantly talk about Bitcoin but both John and his girlfriend felt like they had a much better understanding of Bitcoin at the end of our conversation. John even mentioned he is going to do more research because I sparked his interest.\n\nIt's amazing how good it feels to teach other people, especially when you are teaching things you are passionate about. I mentioned to John I used a Raspberry Pi and a 1 TB hardrive to run a Bitcoin node and I could see in his eye something clicked. John mentioned he works with Raspberry Pis all the time and had no idea you could use one to run your own full node. I'm hopeful that John does go on to invest, but I'm even more hopeful he goes down the rabbit hole himself and starts getting other people to look into Bitcoin. It's amazing how niave most people are when it comes to finance because we've been fed a narrative in the United States that money is taboo to discuss, it's not taught to us in k-12th grade, and typically handled by people in suit and ties who got their MBAs at prestigious colleges. This narrative is bullshit. Every weekday I tune into [Anthony Pompliano](None)'s Best Business Show and he is either wearing a hoodie or a t-shirt while he gives detailed analysis of what's happening in the world and how you can position yourself to benefit. I trust Pomp because he is open about his investments and he explains his reasoning constantly. I haven't watched too much CNBC, but I see all the memes talking about how if you just faded their advice you would be up a massive percentage. This is sad. The fact the mainstream media would rather spew bullshit than help people is a big indicator the current system is broken. I heard Michael Saylor say on a recent Twitter spaces \"The only reason more institutions have not gone all in on Bitcoin is because of institutional inertia.\" I'm paraphrasing what Saylor said, but I agree with his point. Humans are hesitant to change and many people will stick with the status quo as long as it means they can remain lazy. Our financial system has done an excellent job keeping a small percentage of people very wealthy. That's not to say it's all bad; the current system in the U.S has given our citizens a lot of faith that when they go to the bank their money is safe and that'a a powerful thing most people take for granted. It is probably why this brilliant engineer I met over the weekend didn't have a clue about Bitcoin. Luckily, I don't watch people in suits to learn about money. I watch people in comfy fitting clothes who give me the facts, are open about what they invest in, and give out fiat money, Bitcoin, and cool stuff for tuning into their show and participating in the comments. (I recently won 50 USD to get Dinner from the Best Business Show) Would love to hear the last time any of CNBC's viewer got dinner paid for by CNBC.\n\nAll jokes aside, not assuming things can do wonders for your life. What started as a mildly awkward dinner turned into a lovely evening because I asked questions rather than assuming John knew as much about crypto as I did. It's important to be patient and explain your ideas without assuming your audience knows as much as you do. I'm far from a crypto expert, but after observing what's going on in the world I got motivated to get educated about finance. Based on my findings Bitcoin seems like the best bet to get the world back on an even playing field. Bitcoin might be like a ponzi scheme in the sense that the people who get in first will likely have a big advantage over the people who arrive late. However, in the Bitcoin ecosystem anyone can participate, no one can create more Bitcoin, and no third parties are required to transact if you run your own full node. Nothing is ever perfect in this world, but Bitcoin is the best monetary network, system, protocol I've ever seen and it is not even close in my humble opinion. I strive to remain open-minded and if someone can present me with new facts and finding I will gladly consider them and change my mind accordingly. In the meantime, I will continue to advocate for Bitcoin to anyone willing to listen because money shouldn't be controlled by any one person, state, or institution. It should be decentralized and finite.\n\n11/7/21\n\nConor Chepenik",
  "wordCount": 1002,
  "readingTime": 3.9811320754716983,
  "claps": 0,
  "voters": 0
}