{
  "id": "9bef976cd2b5",
  "title": "Day 244",
  "createdAt": "2022-11-21 22:15:29",
  "tags": [
    "habits",
    "cryptography",
    "secrets",
    "coding",
    "grinding"
  ],
  "url": "https://chepenikconor.medium.com/day-244-9bef976cd2b5",
  "content": "# Day 244\n\nOne thing that doesn't get enough attention in my opinion is cryptography. Cryptography is the science of creating secrets. It has been around long before we had modern day computers. Without cryptography modern day computers would be a whole lot less useful because nothing would be private or secure. Bitcoin couldn't exist without cryptography and it is interesting to learn that over time cryptography gets better and better (by better I mean to say = harder to break). I learned today that humans would shave a slaves head, tattoo secrets on their heads, and let their hair grow back to cover up the secret. Sounds like a good way to store your own private keys if you can wear a hat while your hair grows back and find a trustworthy (or really dumb) tattoo artist to give you that tattoo. Jokes aside, I'm grateful to live in a time where slavery has been abolished in the developed world. Man what an insane way to store a secret; just tattoo it on someone's head. SHA-256 seems to be a much more effective piece of cryptography than tattooing your secret on someone's head since all you need to do to break the cryptographic seal is shave that person's head lol. This video gives a great overview of crypto and taught me a lot of the things that I distilled in today's post.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FNuyzuNBFWxQ%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DNuyzuNBFWxQ&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FNuyzuNBFWxQ%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI enjoyed that video so much I decided to watch another one. This fireship account is pretty good. His website fireship.io is also pretty well done based on the 30 seconds I gave it clicking around before coming back to finish this post. One of the ideas that resonated with me in his second video was about building in public so you can fail in public and then show you found a way to succeed (in public of course). You can do this by blogging, creating videos online, using github, and posting content everyday on whatever social media you fancy.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FXg9ihH15Uto&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DXg9ihH15Uto&image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FXg9ihH15Uto%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nWhen he said \"one way to put yourself out there is by blogging\" I thought to myself hell yea. HAHAHAHAHAHA. As silly as that sounds it does feel good to know I'm at least trying here. Of course there are days where I'm like that was a stupid post and there are other days when I'm like SHEEEEESH am I Tolstoy? The reality is most days are probably somewhere in between those two polar extremes but if I can better by just .1% everyday that is a 36.5% improvement over the course of the year. Not bad considering that if you stick with these habits that can add up over the years. My Grandpa is an accountant and one of his clients was a former Tight End in the NFL. Grandpa loves telling the story of how the Tight End got so used to training everyday that even when he retired from football he never stopped working out because it was just one of his habits. Life is long anon: learn to develop quality habits or you will look back on your life with regret.\n\nPart of me is pretty eager to find a software development gig and another part of me is ready to go work on a farm. The good news is deep down I've always felt that fate is a very real thing. Thus I am confident that I will end up where I'm meant to be. I do plan on using Github more. One of the best points made in that 100k a year coding video was that if you aren't coding everyday then you might not enjoy being a software engineer. It is time to get on my git grind! Luckily, I need to actually spend some time creating Mass Adoption's website since I've finished creating my own site @ [conorchepenik.com](http://conorchepenik.com) and feel like I'm starting to get the hang of making these personal sites. Go check it out I'm way more proud of it than I should be hahahha, that meme section though>>>>>.\n\nFinal thought, anything great takes a lot of hard work. Sometimes I really don't want to write but the truth is when I start writing and get in that good work flow it feels amazing. I kind of feel like coding will be a lot like that. I'm sure there will be days when I'm like this is sooo boring but after getting in the zone it feels amazing. I won't know until I give it some effort so maybe I'll make it a habit like this writing thing. Not sure what I'm going to commit to just yet but I'm putting these words on the interwebs so I let myself know I'm seriously thinking about what habit I should commit too (and I should probably make it something more intense than to do mimo once per day). Exciting times :D\n\n![](https://miro.medium.com/1*u698s10jmoMKP1znzh6BEw.png)\n\n11/21/22\n\nConor Jay Chepenik",
  "wordCount": 817,
  "readingTime": 3.2830188679245285,
  "claps": 0,
  "voters": 0
}