{
  "id": "9cb92225127f",
  "title": "Day 189",
  "createdAt": "2022-09-27 17:24:33",
  "tags": [
    "the-power-of-now",
    "focus",
    "energy"
  ],
  "url": "https://chepenikconor.medium.com/day-189-9cb92225127f",
  "content": "# Day 189\n\nToday I noticed that when I pee with the toilet seat down all of my pee goes in the bowl. By narrowing my focus I can pay attention better. What a funny listen to learn from going to the bathroom. Saylor was right about losing energy when expanding your scope. I'll never forgot a quote in a forwarded email from my Dad that read, \"Millionaires don't leave piss droplets around the toilet.\" I believe it was Andy Frisella who said that and I haven't been able to stop thinking about it since. That random email has been a great reminder to clean up after myself when I miss the toilet. Today has been a reminder to narrow my scope in all areas of life if I want to succeed.\n\nHappy to say I finished _The Power Of Now_ by Eckhart Tolle. Great read and a reminder to surrender to the current moment. SPOILER ALERT*\n\nThe last five sentences of the book read\n\n> And how do I get to that point of realization?\n\n> When you surrender to what is and so become fully present, the past ceases to have any power. You do not need it anymore. Presence is the key. The Now is the key.\n\n> How will I know when I have surrendered?\n\n> When you no longer need to ask the question.\n\nFantastic writing by Eckhart. It seems obvious in hindsight but enlightenment is not found in the past or the future. There are humorous, amazing, and weird discoveries to be made every second of every day. Many times I find my brain racing about 10 different things I need to get done only to realize none of them matter in the short term. Only by prioritizing what I'm doing in the current moment, stopping to smell the roses if you will, can I get any of these tasks down anyway.\n\nEasier said than done but I think it is possible. Friendly reminder good habits compound. If I can focus on the here and now I can amplify the value I create and stop worrying about things out of my control.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F2GsBmpjWAx4MPtObnC0hg1%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F2GsBmpjWAx4MPtObnC0hg1&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1ff35cff845b11ff9d7d820461&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"207\" width=\"368\"></iframe>\n\nThis podcast was pretty good and I'm glad a Bitcoiner friend recommended it because usually I would not listen to a crypto podcast. It was kind of doomish but also featured many interesting perspectives. I felt both scared and connected with everything after listening. The general human psyche is very important and reminds me of how connected everything in the universe is. There are so many things out of my control that my ego likes to pretend it can impact. Especially considering the internet makes it so people can access real world news 24/7/365. The reality is I can only control my own actions and seemingly the best way to help the human psyche is to learn to love yourself or surrender to the now. After reading Tolle's book I'm personally convinced that those phrases mean the same thing.\n\n![Photo by [Jonathan Borba](https://www.pexels.com/@jonathanborba?utm_content=attributionCopyText&utm_medium=referral&utm_source=pexels) from [Pexels](https://www.pexels.com/photo/brown-house-under-a-night-sky-2888492/?utm_content=attributionCopyText&utm_medium=referral&utm_source=pexels)](https://miro.medium.com/0*wr0lmMZqNdxqadnS)\n\n9/27/22\n\nConor Jay Chepenik",
  "wordCount": 496,
  "readingTime": 2.0716981132075474,
  "claps": 0,
  "voters": 0
}