{
  "id": "9d1be3ca73d0",
  "title": "Day 698",
  "createdAt": "2024-02-19 02:29:52",
  "tags": [
    "hypocrites",
    "luxury-beliefs"
  ],
  "url": "https://chepenikconor.medium.com/day-698-9d1be3ca73d0",
  "content": "# Day 698\n\nToday I was listening to a podcast that was talking about luxury beliefs. A fascinating term that refers to certain ideologies embraced by the upper echelons of society for the sake of status, which paradoxically tend to undermine the quality of life for those less privileged. The podcast highlighted a particularly ironic example that perfectly encapsulates this phenomenon: a neighbor proudly displays a 'Defund the Police' sign in their yard, yet their windows bear stickers for private security services. The stark contradiction between advocating for the removal of public safety measures while ensuring personal security through private means is both humorous and thought-provoking, shedding light on the complex interplay between social status, beliefs, and real-world implications. There are plenty other examples like those who shriek about climate change then fly on private jets.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F3XMmLbHR7MUJsvrs3pmDWx%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F3XMmLbHR7MUJsvrs3pmDWx&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f908a0c817b3be3f8dc9e8d16&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nThese people need to be mocked for their ridiculous opinions. It is one thing to actually care about something and have your actions align with said thing. However, if you expect others to do something you can't give up, then you are a hypocrite and can go **** yourself.\n\nIt's really that simple. Society can be a better place. We just need to continually mock and point out hypocrites. If you call these people on their bluffs others will see the light of day. Truth and common sense always win out in the long run. The question is how bad does it have to get to wake up the majority. I have faith that podcasts like the JRE and plenty others are helping with this a lot and it makes me bullish on humanity :)\n\n![Luxury belief things ....](https://miro.medium.com/0*57tpl7goT7bNvj9S)\n\n2/18/24\n\nConor Jay Chepenik",
  "wordCount": 276,
  "readingTime": 1.241509433962264,
  "claps": 0,
  "voters": 0
}