{
  "id": "9df806416739",
  "title": "Day 325",
  "createdAt": "2023-02-11 05:11:01",
  "tags": [
    "north-korea",
    "horseshoe-theory",
    "joe-rogan",
    "filipino-food",
    "yeonmi-park"
  ],
  "url": "https://chepenikconor.medium.com/day-325-9df806416739",
  "content": "# Day 325\n\nDrove from Jacksonville to Atlanta today. On the way my partner and I finished the Yeonmi Park J.R.E episode which was excellent. Hearing Yeonmi talk about her experience while getting her education at Colomnia University in New York was insane. There is a clear double standard at most Universities in America in regards to what you can and can not believe. If you are on the left you get a pass and are allowed to be \"triggered\" about almost anything. If you are on the right good luck. Joe Rogan called it treating your oppression like a commodity. Brilliant point. Yeonmi mentioned that this is insane because truly oppressed people are so oppressed they don't even realize they are oppressed. The people in North Korea have literally no idea that there are better ways to live. Most of these people are starving to death because their leader is a madman dictator who is propped up by the CCP. Respect to Yeonmi for taking on such a ruthless totalitarian nation-state in both North Korea and China. The fact she has not backed down despite constant death threats is remarkable. An incredibly brave soul with a powerful story. Also respect to Joe Rogan for giving her a major platform to spread her message. As someone who leans libertarian I am under no illusion that the GOP or the Democrats will save this country. However, I do think it's ridiculous that you can get away with most things if you just claim to be progressive while conservatives get attacked for their views. It reminds of the horse shoe theory.\n\n![](https://miro.medium.com/0*kVNNJtiwB-nmB4tA.jpg)\n\nMost people who lean right or left have a lot more in common than they realize, but many get polarized because of our digital echo chambers. Hearing Yeonmi point out she got grief for going on Fox to tell her story, but then CNN or The Washington Post or The New York Times wouldn't give her a platform is pretty eye opening.\n\n![](https://miro.medium.com/0*DmVVzqvKzRUk_-Id)\n\nJoe Rogan has historically leaned left as well but was deemed \"a right wing conspiracy theorist\" for questioning the official narrative. They tried to cancel him hard during covid and luckily the streisand effect just boosted his message more. People need to be able to think for themselves and this means not questioning everything through the lense of your ideology. There is bias in everything. The more people you can listen to the better. People need to seek out alternative perspectives and stop acting like their side knows better. There are endless variables to this life thing and we are always guessing. Risk can't be avoided just mitagated. Thus, the more perspectives, cultures, and opinions you can experience the better educated your guesses will become. I am fascinated by North Korea and this podcast peaked my interest enough to watch for 10 minutes at 11:30 PM on a Friday as I try to get this blog post finished.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FdhS3fRkJraQ%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DdhS3fRkJraQ&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FdhS3fRkJraQ%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nWill definitely watch the rest later but it's absolutely insane that being a millionaire in North Korea means you get the privilege of being able to bribe your way out of trouble. You can't buy perfume, but you can buy your way out of problems from corrupt cops according to Mr. Malice. It saddens me and also makes me grateful. I'm not a millionaire yet but I know that I have access to markets that the citizens of North Korea will never have access to. The United States has issues we need to work on improving but thank God we have an idea what life can look like when you have some semblance of a free market economy and a bunch of people with the desire to improve their natural state; which is poverty for those unaware. Humans are not born wealthy. Most of human history has been brutal and modern times and the current standard of living for most people are up tremendously because of human innovation. Like the fact I can drive across state lines and visit family all over the east coast is truly a blessing. Yet, it is something we take for granted because I've been riding in cars my whole life. I don't know what life without vehicles is like.\n\nWhen I got to Atlanta I got to visit my freshmen year roommate Q. He is going through chemo to fight cancer right now and I have so much respect for his tenacity to keep fighting. Insane to think someone younger than me is battling one of the most difficult diseases on the planet. His Grandma and Aunt made some filipino food. Holy shit mate what a delicious spread they had. Some type of delicious pork that melted right off the bone, some type of noodle jambalaya, some type of amazing tasting egg rolls, and this delicious dessert that was like the cookie dough of a sugar cookie. I wish I knew how to make all this stuff and got to eat it more. I love filipino food and I'm so damn grateful for other cultures.\n\nThe fact America is this big ass melting pot is so dope. Yea we have too much seed oil in our food, we have an obesity epidemic, and I think high school students could come up with a better healthcare system than the ass backwards one we have today. However, what we do have in the United States that no one else in the world has emulated as well as us is a culture that allows hard workers to thrive and be rewarded for their efforts. As well as be admired by those who are not lazy pieces of crap jealous about anyone's elses success. As long as America is able to keep the people who rejoice in their friends success the better off we will be. Long winded way of saying I'm grateful as fuck to have a friend like Q who introduces me to some of the most amazing food out there and who I will proudly watch from the sidelines as he crushes cancer and goes on to achieve great things.\n\nIt's time to wrap this up because I'm exhausted but I wanted to share a post that made me laugh.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/LysanderBoomer/status/1624115369416790016%3Fs%3D20%26t%3DzBLaOI_kKbEIdT6kfVQVsg&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI don't want to fight authoritarians at all. I'd like to trade in mutually beneficial ways with other market actors and live peacefully for the rest of my life. However, I will die fighting Kleptocrats who would strip away the rights owed to my children and their children one day. I pray to God none of that happens and we can go on peacefully. I am hopeful Bitcoin can fix a lot of the problems that are arising because money is so broken we are seeing nation-states lose trust in their ability to peacefully cooperate with each other. The people hold a lot of power in the U.S because of the 2nd amendment. Yeonmi made the point 75% of people in Hong Kong were out in the streets asking for independence and they still got bull dozed over because of the CCP. I'm not sure exactly what went done in Hong Kong and what the future holds but I agree with Yeonmi that the 2nd amendment is important to make sure tyrants can do their bidding regardless. Believe me America has its problems but I know there are a lot of patriots who aren't just going to roll over to tyrants. I'm grateful to live in a country with the right to defend yourself and to be reminded by Yeonmi that oppression means being so oppressed you don't even realize its happening.\n\n2/11/23\n\nConor Jay Chepenik",
  "wordCount": 1271,
  "readingTime": 5.179559748427673,
  "claps": 0,
  "voters": 0
}