{
  "id": "9e9e21879ace",
  "title": "Day 242",
  "createdAt": "2022-11-19 23:30:37",
  "tags": [
    "farming",
    "raw-milk",
    "city",
    "rural",
    "christmas-tree-shopping"
  ],
  "url": "https://chepenikconor.medium.com/day-242-9e9e21879ace",
  "content": "# Day 242\n\nToday has been an awesome Saturday. Got a Christmas tree, found a small farm to buy ingredients for Shepherds (better yet Chepperds) pie, and almost bought some raw milk. Both places we tried which happened to be right up the road from each other were sold out. It is a good sign that so many people are seeking the non-pasteurized dairy. Makes me think all these Twitter anons are on to something with the raw milk. My girl also snapped a picture of this cow that was on the farm.\n\n![](https://miro.medium.com/1*y4P95RPKK0Kk7zbWs7j5dQ.png)\n\nIt was pretty cool to check out these dairy farms. The second place we went to just had an open barn area that was being run on the honor system. Plenty of food inside and it asked for cash or venmo next to a sheet of paper to write your name. Seeing these farms gives me a renowned since of hope for the world. I do love Twitter but all these social media sites are filled with so much doom and gloom that the default is to think the world is going to collapse any day. The truth is our world is a special place and if we can take the time to get outside our online echo chambers there is so much to be grateful and excited for.\n\nI felt a lot of nostalgia as I was deciding what Christmas tree I wanted with my girlfriend. It's amazing how many people were at this tree lot even though Thanksgiving hasn't even happened. What was cool about this place was you got to saw the tree down yourself. I was impressed how easy it was to saw the tree. They also played great Christmas music and had free hot chocolate which was the cherry on top.\n\nDriving through some of the more rural parts of Massachusetts is awesome. New England will always hold a special place in my heart. Being in a city has its perks like comedy venues, cool coffee shops and plenty of movie theaters. Being in rural places also has its own perks like plenty of land, farm animals, and raw milk. I'm so torn about what to do when my lease is up in April. My girl seems to be leaning towards getting out of the city so we will see. I do think I could be pretty happy in a rural place that wasn't too far from the city. That way I can get back if I'm really itching to see a movie or something. Only time will tell but I'm proud that my girl found us a raw milk spot. We didn't leave empty handed either. We at least got some quality chicken eggs and pasteurized chocolate milk. Plus the joy of seeing more of Massachusetts.\n\nFinally, I might need to try this grounding thing. Hard to do in a city so I must give farm land another point. Seems homie is on to something👀 . I cracked up when one of the dudes in this clip said, \"Like most massive discoveries no one was taking this guy seriously\".\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/xx17965797n/status/1594043688912420865&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n11/19/22\n\nConor Jay Chepenik",
  "wordCount": 521,
  "readingTime": 2.1660377358490566,
  "claps": 0,
  "voters": 0
}