{
  "id": "9fcb2b5a7148",
  "title": "Day 381",
  "createdAt": "2023-04-07 23:02:50",
  "tags": [
    "road-trips"
  ],
  "url": "https://chepenikconor.medium.com/day-381-9fcb2b5a7148",
  "content": "# Day 381\n\nI miss my girls so much I'm driving down to Jersey tonight. 3 and a half hours in the car alone is not bad. I like to podcasts too much to mind; plus driving through open roads, when traffic isn't bad, is always nice to me.\n\nMy Sister said she would start a blog because she is so proud of me blogging everyday. LFG! I haven't been posting on blogspot. Lmao I'm being dramatic. I missed one day and now that I think about it, itll be two days. Not going to post this on blogspot anymore. I'd rather save that for more curated articles. I enjoy using Medium as the platform to post. Like I said on day 365 *I think* my goal is now to post until Medium goes out of business or loses all my data! :D\n\nI've been working on my Habit-Chain app and made a little progress. Got a working prototype. So many things in life seem tedious, hard, and annoying until you actually start doing them. Put one foot after the other even when you don't want to move.\n\nAction over inaction baby.\n\nToday on my walk home from coding bootcamp I picked a random Joe Rogan podcast. I don't even remember the name of the guest but the episode was hilarious. It was a red headed man with long hair and they talked about Waffle House. God bless Waffle House.\n\nThere is so much stuff out there in the Universe. Hell even in the World. It's insane when you think about it. Work towards what you love and remain open enough to have the patience to find out what that is. No one has figured out this game of life but if you spend more time focusing on yourself than on others you will probably have a good time. Control the controllables.\n\nBe present.\n\n![](https://miro.medium.com/0*XgjPjAZrHNon-WZR)\n\n4/7/23\n\nConor Jay Chepenik",
  "wordCount": 318,
  "readingTime": 1.4,
  "claps": 1,
  "voters": 1
}