{
  "id": "9fd8c50f2c0b",
  "title": "Day 477",
  "createdAt": "2023-07-13 00:56:30",
  "tags": [
    "fasting",
    "discipline",
    "leading-by-example"
  ],
  "url": "https://chepenikconor.medium.com/day-477-9fd8c50f2c0b",
  "content": "# Day 477\n\nDiscipline is something succesful people have. I need to be better about refining my own ability to stay disciplined. I find the internet to be one massive rabbit hole where I can get distracted very easily. Ironically enough I was distracted after I started writing this😂  perfect is the enemy of good though.\n\nI'll keep working on my discipline. I must say it's improving after proving to myself I can do this fast. I'm on day 4 out of 7 and surprisingly I don't feel an intense sense of hunger. The past two nights I cooked steak for my partner and had the will power to not eat them. Even sat with her and our child as she ate. We also gave Sloan some steak and she loved chewing on it.\n\n![Steak Dinner in front of some tower in France generated by firefly](https://miro.medium.com/1*AMSBQlNFY-dwaACixpDcCg.png)\n\nI discussed it in my short today, but it's cool to see my desire to fast where off on my sister Grace. She only made it to 8 PM that day before breaking her fast, but it's a start. I did 3 full day fasts before having the discipline to do this fast. Sometimes you got to build your way up. It's also noteworthy what encouraged me to fast was Russel Okung. Amazing to see his journey and the discipline that man has to go without eating for 40 days.\n\nSo two takeaways. Our actions can have meaningful impact on those we love. Leading by example is incredibly powerful. Discipline is a major key to being succesful. If you can practice discipline you can go far in life.\n\n> [**Day 4/7 Fasting**](https://www.youtube.com/shorts/XpDF2IuUTF8)\n\nTake some time today to reflect on how you can lead a more positive life that will impact others. Figure out what's important in your life and be discipline about following through with those things.",
  "wordCount": 301,
  "readingTime": 1.3358490566037735,
  "claps": 2,
  "voters": 2
}