{
  "id": "a14484af962",
  "title": "Day 155",
  "createdAt": "2022-08-25 03:27:06",
  "tags": [
    "pepe",
    "life",
    "bitcoin",
    "short-sighted",
    "student-loans"
  ],
  "url": "https://chepenikconor.medium.com/day-155-a14484af962",
  "content": "# Day 155\n\nSuper proud of my girlfriend for continuing to learn more about pregnancy. It's kind of scary how demoralizing our hospital system can be. Most women are terrified of pregnancy and the hospital does nothing to alleviate this fear. They put women on their back and rush them through having a child. Every body is different and people will have different needs. Treating most women the same way and telling them they aren't pushing fast enough seems like a ridiculous way to go about treating all patients. I'm being very exaggerated here, but this are the stories I hear my girlfriend mentioning from the podcasts that she listens to. Do keep in mind I'm not a medical professional; I just believe that for education, medical issues, and life in general one size fits all rarely works well. Luckily, my girlfriend has taken a lot of time to do some research and I feel very confident she is going to be an amazing mother and have a great pregnancy wherever she ends up having our baby.\n\nSuper excited to go back to Jax and visit my hometown tomorrow. I am looking forward to some time off work. Also to golf and enjoy nice dinners with my family. Work has been long this week. Which is kind of funny to think about it because it was a 3 day week. I think I'm just excited for the time off so I've been looking forward to the end of today for so long. Need to be better about living in the moment rather than looking to the future. All we got is the now.\n\n![[https://www.instagram.com/p/ChXkxerJcOx/](https://www.instagram.com/p/ChXkxerJcOx/)](https://miro.medium.com/1*BzP8SxUJlu1p9tpXwbzOQA.png)\n\nPretty incredible all the headlines I saw on Twitter. Student loan being forgiven will age like the stimulus check. It's nice for the moment because the majority of my debt is wiped out, but I know that in the long run this is horrible. It's incredibly unfair to those without student loan debt and will set a horrible example for those who did the right thing and paid off their loans. Hard to believe 🤡 🌎  can be this short sighted. Thank god for Bitcoin.\n\nI also read a Robert Malone article about crickets being put in a ton of junk food. All the more reason to eat more meat and fruit. Might be time to give up crap food. Can not believe we are are at the point of fiat where we need to resort to bugs to make food less inflationary. Embarrassing.\n\n> [**Eating Bugs: Let's Dig into It!**](https://rwmalonemd.substack.com/p/eating-bugs-lets-dig-into-it?utm_source=email)\n\nTime for me to go shake a rancher's hand. Fr fr no cap.\n\n![](https://miro.medium.com/1*mVc-HxP_332AuomqCKyatg.png)\n\n8/24/22\n\nConor Jay Chepenik",
  "wordCount": 462,
  "readingTime": 2.1267295597484277,
  "claps": 0,
  "voters": 0
}