{
  "id": "a1848cd3b74",
  "title": "Peaceful Revolutions Might Be Plausible",
  "createdAt": "2021-12-09 01:01:51",
  "tags": [
    "peaceful-revolution",
    "bitcoin",
    "atlas-shrugged",
    "orange-pill",
    "pepe"
  ],
  "url": "https://chepenikconor.medium.com/peaceful-revolutions-might-be-plausible-a1848cd3b74",
  "content": "# Peaceful Revolutions Might Be Plausible\n\n![](https://miro.medium.com/1*AwiFa3fPFI37zn5kwHujKA.jpeg)\n\nIt's hard to take power from those who wield power without using violence. It's also hard to wake up and not be concerned by the atrocities governments across the world are committing in the name of \"citizen's health\". The one thing that gives me hope is Bitcoin. A permissionless, peer-to-peer, and decentralized currency optimized so none its users get special advantages. Satoshi, Bitcoin's founder, is M.I.A so there is no one to critique on their personal shortcomings to make their creation seem less promising. Satoshi understood incentives well and lined them up so nicely with Bitcoin that a decentralized protocol launched in 2009 has turned into just under a trillion-dollar asset class at the time of this writing in December of 2021.\n\nIt was shitty realizing all fiat currencies in the world are backed by the violence. Glad to be in the U.S.A because we have the strongest fiat, but it still sucks and has been rapidly deflating (especially this year) due to quantitative easing which is a fancy way of saying money printing. Crazy to think the people who get to decide how much money is printed are also backing that money with violence. It has led to a world optimized for profit at all costs and the common man is the one who suffers due to the obesity, mental health issues, and brainwashing this growth at all costs mentality major corporations have.\n\nI'm starting to see an alarming amount of people who would rather have you lie to their face than tell them the hard truth. If this isn't the case than I don't understand why anyone puts up with all the gaslighting and half truths the mainstream media puts out. I'm not for being intentionally rude, but to just completely ignore the facts because you don't want to admit you've been lied to is ridiculous. The woke mob ain't it and neither is this two party system were each side of the government claims to be for the people, but in reality they look out for one thing and that's themselves. Elon Musk put it beautifully the other day when he said \"The government is the biggest corporation and they have a monopoly on violence\". I don't think every politician in congress and the senate is a horrible person, but I'd be surprised if more than 5% of them could tell me the price of a gallon of milk. I'm sure politics in D.C is a brutal, cut-throat game, but its egregious how many times our representatives claim to know what's good for the everyday citizen when many of them have no clue what it's like to start a business, go bankrupt, or try and pay healthcare bills without insurance. This centralizition of power has reached a point where the elites of the world are going completely unchecked. I can't speak to the rest of the world, but in the U.S.A anyone who works in a government organizations and tries to blow the whistle gets prosecuted. Don't believe me? Watch this [video](https://twitter.com/60Minutes/status/1468269878926880784?s=20) from 60 minutes.\n\nRead a great [article](https://tftc.io/martys-bent/issue-1125/) from Marty Bent this morning pointing out the Whitehouse held a meeting with various newsrooms across America to brief them on what they can tell the public about inflation. Corruption is blatant and obvious, the system has become toxic. I'm reading Ayn Rand's _Atlas Shrugged_ right now and I feel like I'm watching the looters ruin the world in real time. Taking away from the productive members of society with ever growing censorship, taxation, and inflation. I don't think the government set out as evil and I love the foundation of what the U.S.A is built on. The idea that people can be self-sovereign and as a nation we hold the values that every human should have basic rights. The problem is the money is broken and they will keep printing more money to bail out the people who hold bonds and U.S treasuries in their retirement accounts. If everyone's retirement account crashed 50% there would probably be riots, but the relentless quantitative easing is causing brutal levels of inflation. Bitcoin seems to be the only way out. This is what Atlantis in _Atlas Shrugged_ for the productive members of society. They only used gold to trade in the book, but I believe had Ayn Rand been born the same time as me and written her book she would've had them using Bitcoin. Actually orange pilled my grandmother on the phone today by relating Bitcoin to _Atlas Shrugged_ and she was thrilled to hear I'm almost finished with Ayn Rand's master work. (Great book btw if you haven't read it.)\n\nAnyways, I do remain hopeful. I think there are people in our system who want everyone to have a shot at happiness, freedom, and the American dream. Problem is my generation is being priced out of everything so quickly that the idea of buying a house and raising a family has become unplausable for most and becoming increasingly expensive for anyone who saves in fiat. If you are reading this I encourage you to use love and knowledge to convince your friends and family to take the orange pill. We can have a peaceful revolution by embracing Bitcoin and having it become the world reserve currency. This technology can cut out so many greedy middlemen and allow more fair, open, and transparent peer-to-peer trade for both individual citizens and nation-states. Don't underestimate the power you have to change the world for the better. I'm looking at this from the lens of someone born and raised in the states and I think we as a country have gotten complacent. However, it's not too late to steer this ship back in the right direction by embracing Bitcoin: a technology that goes hand in hand with the Ethos this country was built upon. If you live in another part of the world you can also use Bitcoin to make sure your government can't take your money. Bitcoin is freedom go up technology every time someone uses it. Be your own bank. Opt-out of the fiat system. It's not a quick transition, but it's one I've started on and hopefully I'll reach the day where I don't even need a bank account because I just use my Bitcoin. Lot of legacy products I currently use for rent, insurance, healthcare, etc but as Bitcoin becomes more and more integrated into the world I believe it will be easier and easier to depend less on the legacy institutions of the past. Plus, plebs like myself get to orange pill a bunch of people along the way in the same way I was orange pilled by plebs I found online. The internet can give us a peaceful revolution where instead of opting out with violence we opt out of their whole fiat system. PLEBS UNITE🤝.\n\n12/8/21\n\nConor J. Chepenik",
  "wordCount": 1158,
  "readingTime": 4.5698113207547175,
  "claps": 0,
  "voters": 0
}