{
  "id": "a22c3a95ed4",
  "title": "Day 111",
  "createdAt": "2022-07-12 01:08:18",
  "tags": [
    "bitcoin",
    "fiat",
    "perspective",
    "games",
    "incentives"
  ],
  "url": "https://chepenikconor.medium.com/day-111-a22c3a95ed4",
  "content": "# Day 111\n\nWas listening to the [wake-up Pod with Svetski](https://open.spotify.com/episode/09l7aB59uuO0ObkQ3lMjPx?si=ukliHU9CRjGrdlkf2eHo7A&context=spotify%3Ashow%3A6POdgh4pgd7G63CnCYwDBm) and he had on John Carvalho who has a very unique perspective on Bitcoin. His idea was that Bitcoin is a game that breeds fair competition. The more people we have playing this game the better because it's a game that can't be cheated by those at the top. Bitcoin has a fixed supply and rules that have been set in \"cyber-stone\" since Satoshi mined the first block. This metaphor of calling Bitcoin a game made me think of fiat money as a game. The big difference is in the fiat game, those at the top can change the rules of the game to enrich themselves and their buddies. It's like playing Monopoly and the dude who is playing banker just changes the rules as the game goes on. The banker changes them subtly, but over time he and his buddies become disgustingly rich as everyone else struggles to pay enough money just to rent a roof over their head. As the game goes on like this it stifles competition because making \"money\" no longer becomes about adding value but instead aligning yourself close to those who can manipulate the rules of the game. Under a Bitcoin standard, the idea is you would have to provide actual value in order to get more of the token bitcoin that the Bitcoin network uses to keep score of the players. Obviously, there is no perfect way to distribute bitcoin, but the network seems to be doing a pretty damn good job. It is becoming more decentralized as more miners and node operators come online. It's also being sold off from weak hands who over-leveraged themself or haven't taken the time to understand it. Hell, some bitcoin is probably being sold from whales who have held for long amounts of time and want to cash in on their reward. Whatever the case may be it's the fact this game just has rules and not rulers that make it so special. I know I've written about this many times and will continue to write about it because it's so important. I'm sick of seeing those who do nothing to help society make large amounts off the poorest who don't understand how the games work. I understand it takes money to make money, but there is a big difference between providing value via a legit service or product vs. taking value because of regulatory capture, aligning closely with powerful politicians, or other B.S I don't know about because those doing it want to keep it that way.\n\nWhile I don't agree with John on the usefulness of metaphors I do think he is spot on about Bitcoin being a game. A game that will propel humanity forward and give billions the confidence to know their money is actually their money. I think metaphors will help onboard the masses, but I think John is right about being wary of the metaphors used. It's often easy to exaggerate or tell a half-truth when using metaphors. Thus, it's important to stress to people always D.Y.O.R, but one thing that resonated with me is X, Y, & Z about Bitcoin. Not everyone who has been able to live a privileged financial life will get why Bitcoin is so important. It's often the less privileged communities that understand why Bitcoin is so vital to the world, but that's part of the beauty of this new form of money. The small guy can dollar cost average and constantly save their value in a game they know won't be changed to screw them out of their hard-earned money via inflation, taxation, or straight theft. I have been pretty lucky to have a bank my whole life and just been tech-savvy so Bitcoin seemed like a good idea when I first heard of it in 2017. That said, I didn't fully grasp why it was such a big deal and articles like the one below from Bitcoin Magazine are a great reminder of why this is so important to the world.\n\n> [**How Bitcoin Helps Survivors Of The Prison Industrial Complex**](https://bitcoinmagazine.com/culture/bitcoin-helps-former-prisoners)\n\nI'm a firm believer that people deserve second chances. It's hard when the system is constantly fighting against you, but clearly, Bitcoin offers a second chance for money. A \"banking system\" (using this term very loosely) that doesn't need credentials besides your private and public key and could care less whether or not you caught a charge. It's a great thing and while I do think there is no perfectly fair way to distribute a money system it's amazing that those who will flee to Bitcoin are the ones who need it most. The parasites who want to keep the fiat system propped up so they can make money without providing value will likely be some of the last to adopt Bitcoin until it becomes clear their system is failing and they smash buy some corn to preserve their purchasing power. Incentives are an incredible thing and I'm so happy to see them aligned to create a new monetary system that is arguably as fair as it comes. No premines, no central authority forcing people to use it, just a network bootstrapped by plebs who were tired of a fiat system that requires trust and doesn't offer its players a way to verify the rules are being enforced fairly amongst the participants. Humans copy other humans. It's not good to see people at the top cheating because it just encourages more bad actors. Luckily, Bitcoin fixes this. Remember anon, don't trust me; go and verify for yourself.\n\nP.S shit I forgot to get a free icee today. Just realized it was 7/11😂\n\n7/11/22\n\nConor Jay Chepenik",
  "wordCount": 976,
  "readingTime": 3.6830188679245284,
  "claps": 0,
  "voters": 0
}