{
  "id": "a2a018de2e2f",
  "title": "Day 589",
  "createdAt": "2023-11-02 02:40:12",
  "tags": [
    "finance",
    "fidelity",
    "career",
    "star-method",
    "giving-back"
  ],
  "url": "https://chepenikconor.medium.com/day-589-a2a018de2e2f",
  "content": "# Day 589\n\n![](https://miro.medium.com/0*X-VIaK83-Uqxk9OJ)\n\nTomorrow I have an interview for a finance job at Fidelity. I'd like to land this job so today's Medium will help me prepare for it.\n\n**Why Finance?**\n\nFinance fascinates me because it operates at the intersection of data and human behavior, influencing global economies and individual lives alike. It's a field where strategic analysis leads to tangible outcomes, and I am drawn to the challenge of navigating complex financial systems to drive positive change. The prospect of helping individuals and businesses understand and manage their finances to achieve their goals is deeply motivating. Moreover, my analytical aptitude and attention to detail prime me for success in such a nuanced and impactful domain.\n\n**Why Fidelity?**\n\nFidelity stands out as an innovative leader in the financial services sector, a place where I can align my passion for finance with a firm that leads with forward-thinking research and client-centric solutions. The company's pioneering insights, particularly on bitcoin, show a commitment to guiding investors through emerging markets with intelligence and integrity. Fidelity champions growth and innovation, providing an environment where I can align my passion for finance with the firm's pioneering, client-focused solutions. I am eager to contribute my talents to further developing Fidelity's thought leadership and empowering clients' financial success.\n\n**What is the Series 7 Exam?**\n\nThe Series 7 exam is a cornerstone of financial industry qualifications, assessing a candidate's knowledge of investment risks, sales practices, and market mechanics. It serves as a rigorous evaluation of one's grasp on essential financial principles and regulations. With my strong foundation in finance and meticulous preparation, I anticipate not only passing this exam but also leveraging the expertise it signifies to provide comprehensive investment advice and services to clients.\n\n**What is the Series 63 Exam?**\n\nSimilarly, the Series 63 exam complements the Series 7 by focusing on state securities regulations, underscoring the importance of compliance with state law in the conduct of securities business. My methodical approach to study and inherent interest in regulatory frameworks will facilitate my success in this examination as well, ensuring that I operate with the utmost integrity within the legal boundaries set by state authorities.\n\nI was told I need to use the STAR method to ace the interview. For those who do not know this is a structured manner of responding to a behavioral-based interview question by discussing the specific situation, task, action, and result of the situation you are describing.\n\n**A Potential Question:**\n\nTell me about a time you showcased great customer service!\n\n**A Refined Answer Using The STAR Method:**\n\nSituation: I worked at Reveneer who did outbound sales on behalf of other companies and as a sales representative selling web development services I was responsible for expanding our clientele. So i targeted small businesses that could significantly benefit from enhancing their online presence.\n\nTask: My objective was to engage with new potential clients, particularly those whose online platforms were not fully leveraged, to introduce the comprehensive web development solutions offered by my client.\n\nAction: I conducted thorough research on local small businesses and identified a coffee company in Wisconsin with an outdated website that didn't reflect their unique offerings. To capture the CEO's attention, I placed an order for one of their most distinctive beverages, a rum raisin mocha, and captured this moment with a photo. I then composed a personalized message to the CEO, illustrating how my client's services could revitalize their website and sent it along with the photo to create a memorable first impression.\n\nResult: This innovative outreach approach was successful; the CEO was impressed and agreed to a meeting. The conversation that ensued was fruitful, resulting in a decision to utilize our web development services, which significantly contributed to my client's business growth and reinforced the value of creative, personalized marketing strategies in generating new business.\n\nBy applying the STAR method my answer will become more structured and impactful, clearly showcasing my problem-solving and innovative thinking skills. I'd like to do another because I believe it is great practice.\n\n**The Question:**\n\nWhat is the most proud moment in my career?\n\n**The Answer:**\n\nSituation: Early in my career, I was given the responsibility to mentor a sales representative who was underperforming and at risk of being let go. His ability to meet his targets was crucial not only for his career but also for the morale of the team.\n\nTask: My task was to devise an effective coaching plan that would help the sales rep meet the expectations outlined in his Performance Improvement Plan. The objective was not just to prevent his termination but to transform him into a valuable asset for the sales team.\n\nAction: I initiated a comprehensive training program that focused on role-playing exercises, which emphasized the human aspect of sales calls. The core principle I instilled was that people love purchasing but dislike being sold to, and that understanding the client's needs through active listening and personalizing interactions would yield better results. We spent hours on role-playing scenarios, refining his approach, and I encouraged him to conduct thorough research on each potential client to tailor his pitch before he cold called them.\n\nResult: The training paid off. The representative not only met the requirements of his Performance Improvement Plan but exceeded them. His newfound confidence and skills turned his performance around, and he continued to excel in his role. He is now recognized as one of the top performers on the sales team, and his story is one I often share as my proudest moment as a mentor, demonstrating the profound impact of dedicated coaching and the importance of empathy and personalization in sales. What helped me succeed in sales was the people who coached me and to give back the same way felt really great.\n\n11/1/23\n\nConor Jay Chepenik",
  "wordCount": 969,
  "readingTime": 3.8566037735849057,
  "claps": 0,
  "voters": 0
}