{
  "id": "a2dbf4f798cd",
  "title": "Day 44",
  "createdAt": "2022-05-06 01:22:14",
  "tags": [
    "lifeboat",
    "smell-the-roses"
  ],
  "url": "https://chepenikconor.medium.com/day-44-a2dbf4f798cd",
  "content": "# Day 44\n\nIn my new gig, the office is located in a building in downtown Boston so I get some nice views when I'm making cold calls and crafting sales emails. When I look out the window I see birds flying around downtown Boston and I feel a twinge of jealousy. These animals don't worry about menial bullshit. They seem to just exist in a flow state as they fly around. I know that my job is a cakewalk compared to some of the other stuff out there. That doesn't stop me from getting a melancholy feeling like what I'm doing is so menial. It seems that as any organization scales up it is so hard to maintain good practices for hiring and whatnot. Obviously, some organizations are better than others but scaling typically breaks stuff. Both software and your process for hiring good people hahahaha. Not a knock on my current company. For a massive company, I think they do a good job, but this is just my observation for any organization.\n\nTruth be told there are opportunities everywhere and most situations are what you make of them. I bet more writers block could be solved if your forced people into an office and made them do menial tasks hahaha. Then again writing these medium posts that basically have no rules makes writing easier. I know some think that the broader the subject you can write on the harder, but not when it comes to writing about your own life and opinions. What's cool about these posts is that it can serve almost as a bibliography. I'm sure when I look back many years some posts will be insightful and many more will be super cringe. That just means I'm growing as a person and expanding my perspective. I love the quote there is 3 truths, each person's perspective, and what actually happened. Our bias and perception will always have an influence over how we perceive stuff. This doesn't stop people from seeking the truth, but it does make it more difficult to agree on the truth with others.\n\nOne thing that is easy to lose sight of when doing menial tasks is how lucky we are to be on this planet. While I was doing my prospecting today I came across someone named Shawn who had this on his personal website.\n\n\"Here's the truth: People, even regular people, are never just any one person with one set of attributes. It's not that simple. We're all at the mercy of the limbic system, clouds of electricity drifting through the brain. Every man is broken into twenty-four-hour fractions, and then again within those twenty-four hours. It's a daily pantomime, one man yielding control to the next: a backstage crowded with old hacks clamoring for their turn in the spotlight. Every week, every day. The angry man hands the baton over to the sulking man, and in turn to the sex addict, the introvert, the conversationalist. Every man is a mob, a chain gang of idiots.\n\nThis is the tragedy of life. Because for a few minutes of every day, every man becomes a genius. Moments of clarity, insight, whatever you want to call them. The clouds part, the planets get in a neat little line, and everything becomes obvious. I should quit smoking, maybe, or here's how I could make a fast million, or such and such is the key to eternal happiness. That's the miserable truth. For a few moments, the secrets of the universe are opened to us. Life is a cheap parlor trick. But then the genius, the savant, has to hand over the controls to the next guy down the pike, most likely the guy who just wants to eat potato chips, and insight and brilliance and salvation are all entrusted to a moron or a hedonist or a narcoleptic.\n\n-Earl\n\nMemento Mori\"\n\nThis shit hit. Our brains run on the same electricity that powers the Bitcoin network. Fitting that humans found a way to create a form of money backed by the same energy that powers pretty much everything. There are other forms of energy like fossil fuels but even those can be used to generate electrical power. Also that last line about how we have these moments of clarity only to have to pass the keys back to the dude who wants to eat chips and watch TV. Maybe I'm interpreting it wrong but what I took from that is the guy in the story is the same person. Some parts of my day I can't do anything wrong and in other parts I'm being a lazy shit. It reminds me of Golf. When I have a good shot I feel like an absolute king. When I shank the next shot I'm wondering what the hell happened to the stud who just piped his 3 wood 300 yards. That is one reason I love the Bitcoin rabbit hole so much. It is full of those moments where the clouds part. God damn man. That passage hit so hard and I only came across it because I was sourcing people in my sales gig. Life is full of cool moments when you stop and \"smell the roses\".\n\n![](https://miro.medium.com/1*lSVZSuzopieg09GHbZSKqg.jpeg)\n\nDaily reminder to learn and educate yourself about Bitcoin. Love you anon. Until tomorrow.\n\n5/5/22\n\nConor Jay Chepenik",
  "wordCount": 893,
  "readingTime": 3.569811320754717,
  "claps": 0,
  "voters": 0
}