{
  "id": "a646217f6763",
  "title": "Day 214",
  "createdAt": "2022-10-23 01:43:03",
  "tags": [
    "personal-sites",
    "torque",
    "design",
    "bitcoin",
    "writing"
  ],
  "url": "https://chepenikconor.medium.com/day-214-a646217f6763",
  "content": "# Day 214\n\nBeen thinking what I want to do in order to optimize my website and thought this was a really helpful article to spark my thinking. It's amazing all the articles you can find online with a google query.\n\n> [**10 Highly Effective Web Design Tips Backed by Research**](https://torquemag.io/2018/07/web-design-tips/)\n\nHere are the ten tips outlined. I'm going to write in my own take on what this Author presented but it is worth reading the article to see the original thoughts.\n\n## 1. Make Site Speed an Absolute Priority\n\nThis makes me think about what features I want on my website. It's pretty amazing how fancy you can get with the Javascript functions, but having a site that just works vs one that tries to do too much will be important. I want my personal site to load up right away and not cause users to leave because something isn't loading properly. After inspecting this websites source code I noticed the person was using [https://wp-rocket.me/](https://wp-rocket.me/) to make sure it loaded super fast. Didn't even know there were plug ins like this and I honestly feel pretty good about myself learning this by inspecting the source code 😂 . Learning is fun if you do it your own way!\n\n## 2. Leverage the Fold\n\nHad to google search what this meant. As far as I can tell \"the Fold\" is the main part of your website. The article is full of good advice about how to use this space to clarify your call to action and it has me thinking about what I want to get out of my website. After some thought I've decided I would like to grow my following online so I will make that my main call to action \"check out my work\". I'd also like to make a section that mentions every one of my articles and blog post is free to read. That said, if you found my writing valuable tips are greatly appreciated. Adam Curry has talked about this with the value to value thing. I understand why people charge for their premium Substack subscriptions or newsletter because I'm sure a lot of work goes into it. However, I've never decided to buy one (at least not yet anyways) so I would prefer to just throw it out there that tips are appreciated, link up a Bitcoin wallet, and take donations that way instead. If I ever get really good at writing maybe I'll do a book and get some money that way but for my own personal site I don't ever want to charge for my blogging.\n\nI did appreciate how the article made all his own call to actions super colorful while the other stuff was black or white. It made the links to his stuff POP and looked pleasing to the eye. Good to see people practicing what they preach.\n\n## 3. Take Advantage of Hick's Law\n\nThis one was interesting and basically states the more choices that are available the less likely people are to make a decision. There was a picture that show cased this point pretty well.\n\n![](https://miro.medium.com/0*snJEYiJ6fgX9vLQ4.png)\n\nWhile I do want to have like one cool function on my website that lets people use their mouse to do something unique I think the lesson here is just have a few things to choose from. At the moment all I can think of for me is check out my articles, Medium, Twitter, and Podcast. Make it easy for people to access and don't overload them with random \"flavors of jam\" hahaha. Less is more as they say.\n\n## 4. Keep it Simple\n\nPretty much echoing the rest of the earlier 3 points but if the author felt the need to keep echoing these points there is likely a reason. I've been experimenting with all this color in my sites so I think I need to go back to the drawing board and really think about why I'm using color when I do. The clean black and white on a website looks good and if I'm going to use color I should make it pop.\n\n## 5. Avoid Carousels, Sliders, Tabs and Accordions\n\nA simple site doesn't need to leverage all these things. Maybe worth having a contact me button, but outside of that most people are going to scroll so I can save myself the hassle of coming up with all these fancy buttons it seems. I think I've made a good bit of progress already in terms of what I want out of my website.\n\n## 6. Prioritize Scrolling Over Clicking\n\nIt seems that there was one study where the person increased how long their sales page was and it resulted in 30% more sales conversions. Big lesson in that and I think it has to do with the fact social media has people very used to scrolling. Rather than having users go on complex journeys to get to your \"buy now\" button they can scroll and read through all your stuff. I know personally that if something is super complicated I will put it down unless it is of the utmost importance to me. The only way to drive more traffic for the people who aren't as committed as say \"your mega fans\" seems to be the scrolling method so they can build trust. This might apply more to courses, companies, and long form content but still some good lessons to take away for a simple personal website. Especially if I turn my website into a blog style forum after I write on here for 365 days and decide to use my own hosting platform. I'm glad I finally decided to put in the proof of work to go down the Bitcoin rabbit hole and reading about this has me thinking about what a long, tedious, and challenging rabbit hole Bitcoin is. No wonder more people aren't completely bought in to this new form of money that is beautifully engineered and much more fair, reliable, and robust than fiat money. Pain and time will fix this but SHEESH. Many people are missing out because they don't want to put in the work and now I'm reminded that while tips and an increased following are great I also need to remind people why Bitcoin is important. I guess pointing them to my articles will do that :). A win-win for Chep and whoever anon is that decides to go down the Bitcoin rabbit hole!\n\n## 7. Direct Attention with Visual Cues\n\nI'm not going to copy in all the photos but I did appreciate how this section came with a lot of photos. My takeaway: do not be afraid to point people in the direction you want them to look! For example, if you found any of this stuff valuable tips are greatly appreciated.\n\n>>>>>bc1qfx254gz5270ncsq83jwze5qhynmex75p9kyasc<<<<<\n\nI also understand I am likely a complete stranger to the person reading this so if you don't want to give me a tip that's also cool. I just wanted to draw attention to the advice mentioned above and show people it is pretty cool what you can do with Bitcoin. I guess for other Americans I could put my venmo, but considering I hope Bitcoin replaces fiat in the long run I figured that would be lame. I'd much prefer the hardest form of money than the one our Government can create out of thin air. If you don't have bitcoin yet and want to tip me on venmo I'm sure you can find me with enough effort, but I'd prefer you save your money and invest your TIME in going down the Bitcoin rabbit hole.\n\nFor those who have put in the work to understand Bitcoin or are currently in the process check out mempool.space You can use this site to see if anyone decided to tip me bitcoin as well as check other transactions. I find the more I use Bitcoin the more real it feels. I don't know just my experience. I didn't wake up a Bitcoin maxi it took a lot of work to understand why BTC is so important! Feels good understanding why Bitcoin can fix so many problems in the world.\n\n## 8. Use People in Pictures (But Avoid Stock Photos)\n\nI need a real solid photo of myself to put on my website. Maybe on the bottom after all my CTAs I will include some random photos I enjoy which will include pictures of me but also memes. I like memes a lot. They are a big part of how I think honestly. It's pretty wild how many times I go to explain something and end up talking about memes lol.\n\n## 9. Use the Right List Order\n\nThe photo for this one was spot on.\n\n![](https://miro.medium.com/0*vfUxM5VpHcz45l1p.png)\n\nIf you are going to use a list put the important stuff first and last. The middle will go largely unforgotten.\n\n## 10. Leverage Social Proof\n\nOne of the best forms of advertising is word of mouth because people trust their peers. If they have something good to say about your business then it is likely you will find new customers as people go around evangelizing whatever you do to their friends. I think today this translates to one's following online. Not that it is by any means a perfect way to judge someone's worth, talent, and skill considering all the bots but it is still a big factor. It's like judging a book by its cover.; you shouldn't do it, but I still do it all the time.\n\nAnyways, I want to shoutout the Author of this piece who can be found on Twitter [here](https://twitter.com/nschaeferhoff). I've never met this Nick dude but I found his article super helpful and I stole the main ideas to write my own blog today so cheers brother. Hopefully one anon finds my work helpful and from it finds your work.\n\nWhile I am convinced that the internet is a frankenstack and things like Urbit can help make it more a beautiful universe I'm also amazed at how incredible of a tool this frankenstack is. If you know where to look the internet is full of so many incredible things. It is also filled with mostly porn. I forget the exact amount but I remember hearing somewhere that the internet is like 60% porn. Pretty sure porn played a major role in making the internet blow up. All that to say the internet is what you make of it. You can use to be a low T beta or you can become a better version of yourself. The choice is yours anon. I hope you pick the latter but I also understand that we all have our own paths :p\n\n10/22/22\n\nConor Jay Chepenik",
  "wordCount": 1803,
  "readingTime": 7.187106918238994,
  "claps": 0,
  "voters": 0
}