{
  "id": "a69b782fbfe6",
  "title": "Day 680",
  "createdAt": "2024-02-01 04:58:07",
  "tags": [
    "europa",
    "world-war-ii",
    "globalism",
    "history",
    "lies"
  ],
  "url": "https://chepenikconor.medium.com/day-680-a69b782fbfe6",
  "content": "# Day 680\n\nTook a trip down to SoFlo (South Florida) tonight and thought hey I'll get started on this 12 hour documentary I've been meaning to watch. If even half of what these people claim is true I feel as if I've been lied to in every history class that I have taken.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fodysee.com%2F%2524%2Fembed%2F%2540coronamirror%253Ad%252Feuropa-the-last-battle-full-documentary-2019%253A6%3Fr%3DGGZKp1XsYJFprxTD6nXKBD9AnKj2iVF7&display_name=Odysee&url=https%3A%2F%2Fodysee.com%2F%40coronamirror%3Ad%2Feuropa-the-last-battle-full-documentary-2019%3A6%3Fr%3DGGZKp1XsYJFprxTD6nXKBD9AnKj2iVF7&image=https%3A%2F%2Fthumbnails.odycdn.com%2Fcard%2Fs%3A1280%3A720%2Fquality%3A85%2Fplain%2Fhttps%3A%2F%2Fspee.ch%2Fa%2Fcc10b8b7b88a6c06.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=odysee\" title=\"\" height=\"315\" width=\"560\"></iframe>\n\nAbsolutely terrifying film. I knew things were harsh in Russia under Stalin and those that came before him, but hearing the stories in this film are gut wrenching. It doesn't make much sense to me why most of my education only taught me about Germany's atrocities but not Russias.\n\nHere is the IMDB for this documentary.\n\n[https://www.imdb.com/title/tt7528992/](https://www.imdb.com/title/tt7528992/)\n\nIt honestly depresses me but sometimes you have to go through the darkness to see the light. I don't want to believe this information. As a matter of fact I don't believe all this information. I don't like how this film points out that it is one religion that is trying to rule the world. This seems wrong. My Grandpa is jewish and I love that man with all my heart. I would not be here without him obviously.\n\n![](https://miro.medium.com/0*vFC5QsEzDlogS58u)\n\nThat said, I do believe there is a globalist cabal that corrupts nation-states by monopolizing credit in that country. I would not call them a jewish cabal. I will call them a globalist cabal who thinks they are above nation-states. I also believe this quote from the movie.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1752885651983196247%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nHere is what Grok had to say about the documentary:\n\n> Europa: The Last Battle is a 2017 documentary that has gained significant attention in recent years. The film covers a wide range of historical events, particularly focusing on World War II and the events leading up to it. The documentary has sparked both praise and controversy, with some viewers finding it informative and thought-provoking while others criticize it for historical inaccuracies and biased perspectives.\n\n> The film's title, \"The Last Battle,\" refers to the idea that World War II was a pivotal moment in history, with the fate of Europe hanging in the balance. It explores various aspects of the conflict, including the political and social climate leading up to the war, the rise of various political ideologies, and the consequences of the war on the European continent.\n\n> The documentary has been praised for its detailed examination of historical events and its attempt to present a comprehensive view of World War II. However, it has also been criticized for its alleged inaccuracies and for promoting a particular perspective on history. Some viewers have raised concerns about the film's objectivity and its potential to spread misinformation.\n\n> In conclusion, Europa: The Last Battle is a controversial documentary that has generated a lot of interest and debate. It offers a unique perspective on World War II and the events leading up to it, but viewers should be aware of the potential for bias and inaccuracies. As with any historical account, it is important to approach the film with a critical eye and to consider multiple perspectives on the events it covers.\n\nAnyways, I don't know. My head kind of feels like it's spinning so I'm going to sleep on this.\n\nI know two things: Good will win and those who have faith in God will get to experience his treasures. May God have mercy on our fallen souls. 🙏\n\n1/31/24\n\nConor Jay Chepenik",
  "wordCount": 559,
  "readingTime": 2.3094339622641513,
  "claps": 1,
  "voters": 1
}