{
  "id": "a799fa669a15",
  "title": "Day 396",
  "createdAt": "2023-04-23 02:31:05",
  "tags": [
    "travel",
    "nostr",
    "signal"
  ],
  "url": "https://chepenikconor.medium.com/day-396-a799fa669a15",
  "content": "# Day 396\n\nReflecting time: I remember writing last year about how Urbit was going to be this massive thing after hearing about it on a podcast. Urbit got my attention for a moment but that quickly wained when I struggled to figure out how it works. I've got nothing against Urbit it's just difficult for a beginner. Habit-Chain is an app I've been talking about building for a minute but have not finished yet. Bitcoin has my heart completely and Nostr is getting to that point quickly as well. In a good way. My heart longs for human peer-to-peer connection and permissionless systems. FREEDOM *Bells ringing in the background* I haven't kept my New Years promise of reading 10 pages everyday, but I have kept my promise of running 40 miles every month (so far) and writing this blog EVERY SINGLE DAY! I tried to blog on Nostr for two days, but it just didn't seem right. For everyday writing anyways. I love Medium's simple sleek and easy to use design. I enjoy sharing my daily thoughts here.\n\nTakeaways from the start of Q2 personal reflections 🫡 : Bitcoin & Nostr are signal. I need to spend more time coding with my hands on the keys. There are many things for me to explore, but focus is important. Medium might never go out of business, and that means I'll blog everyday for the rest of my life. At the least a lot of training data to feed an AI for a virtual me. I hope one day Medium integrates with Nostr. Imagine writing everyday for your entire life and getting to a point where people are zapping you sats for your daily thoughts. Of course I want that for myself, but I also want that for the world. So much value given back to the individual. Getting zapped for quality essays is amazing. Maybe I will put more formal pieces on Nostr, but I like using Medium specifically as my public scratchpad for ideas. I feel like my attention has been scattered recently because there is a massive amount of cool things happening on the internet 24/7/365. The sheer amount of information you can find online is insane. Way more data than you would ever be able to go through even with 1000 lives The world wide web is cool and it should remain open and decentralized. I want to do so many things yet focus is required to do anything worthwhile. I'm human. I'll figure it out. Proud of myself for writing, running, and coding.\n\nI attended the MIT Bitcoin conference today and saw some amazing talks. One of them was on Nostr which was dope. I zapped the presenter 69 satoshis because his presentation was 21/21. Few. So cool to witness people creating amazing protocols for building in this space. I knew Fiatjaf created Nostr but I didn't realize he was a part of ZBD, leading the open source No Big Deal project. Nostr lets people talk to each other on the internet without having to go through a big company like Facebook or Twitter. It's like the internet, but without the gatekeepers. One thing I've been thinking about in regards to Nostr is what innovations will come on this platform. The incentives are on Nostr are much different than legacy systems. For influencers there is no algorithm to hack which makes distributing quality content much more difficult. However, there are no ads so you can have way more organic and welcoming conversations. Sending zaps for funny memes has never been more frictionless. MATH TIME!\n\n> [**binmucker on Iris**](https://iris.to/note137mdpv5u6feh520ua6urdt2mm46jfg53g0f0gg73qjn6rr2q2slsf5hqxz)\n\nThe math is as follows:\n\nIf you get zapped 69 sats by ten different people every day for posting quality memes, you will have 25,185,000 sats in 10 years. A quarter Bitcoin in 10 years is not terrible for shitposting.\n\nHowever, this is just a theoretical calculation. In reality, it is unlikely that you will be able to get zapped 69 sats by ten different people every day. The number of people who are willing to zap you will depend on the quality of your memes and the popularity of Nostr and how it grows over time. My guess is that it will grow exponentially in a positive feedback loop where people enjoy the value 4 value model so much that almost all web apps come onto protocols like Nostr.\n\nWe must have a low time preference because there is no guarantee that the value of Bitcoin will remain the same over the next ten years (in fiat terms). 25 million sats could be generational wealth. *25 million sats will always equal 25 million sats if your unit of account is bitcoin*\n\nIf you are looking to make a quick profit, then zapping memes is probably not the best way to do it. However, if you are patient and have a good sense of humor, then it could be a fun way to earn some Bitcoin.\n\nOne more goal which I may or may not get to is build this app but on Nostr.\n\n> [**BeWelcome - Join the largest free hospitality community!**](https://www.bewelcome.org/)\n\nI should get to it!\n\n4/22/23\n\nConor Jay Chepenik",
  "wordCount": 907,
  "readingTime": 3.422641509433962,
  "claps": 0,
  "voters": 0
}