{
  "id": "a81779f51371",
  "title": "Day 166",
  "createdAt": "2022-09-04 17:46:12",
  "tags": [
    "family",
    "money",
    "beliefs",
    "coffee",
    "goods-and-services"
  ],
  "url": "https://chepenikconor.medium.com/day-166-a81779f51371",
  "content": "# Day 166\n\nGot to enjoy a nice coffee and pastry with my parents before they returned to Jacksonville. I feel so fortunate they came to visit me and my girlfriend for the weekend. Getting to spend time with your parents as an adult is special. As a kid they have a lot of control over your life and you live with them so you take it for granted. At least that was my experience. Moving away from them has made me realize how special it is to spend time with those who loved you and raised you. I'm sad to see them go, but I'm glad for the advice and time spent together. I got to talk with my Stepdad for about an hour this morning about one of my favorite topics: money. He made that the point that the fiat units we used to calculate stuff is arbitrary and the real goods & services are what matter. One hour of labor is one hour of labor. What makes it messy is the fiat units we use to give that hour of a labor a price. The same can be said for one ounce of gold, or one cow, or one barrel of oil, or my favorite example one bitcoin. We both agreed that as they print more fiat units it becomes hard to value things and decide what the true cost of all those things are. I made the argument that Bitcoin can help alleviate some of these issues since everyone using that system can rest assured the monetary policy will do what it is programmed to do rather than wait for 12 people to centrally plan the supply of money. For the most part my Stepfather agreed but one thing that I believe he struggled to understand is that Bitcoin is not a debt based system. You don't have to trust people you can verify for yourself. My Stepdad has an MBA and has successfully launched and still runs two businesses. I say this because running a business is not an easy task and clearly my Stepfather is a bright dude for being able to run and own 2 businesses. It was funny to me though because it is very hard for him to comprehend a system that is not based in debt(credit).\n\nIn a sense, I am fortunate to not have gotten an MBA because it is hard to unlearn something. I forget what study mentioned it but I saw somewhere that humans are prone to believing the first thing we learn. I'll admit Bitcoin has helped unwind some of the stuff I've learned but it has also been a challenge to unlearn things. It's not easy giving up my deeply held beliefs. A quick example of this is how American's viewed World War 2. I saw a thread on Twitter talking about how there were a ton of draft dodgers and people trying to find ways to cheat the military out of their resources for personal gain. In school I was taught every American citizen was gun-ho about going to war to fight the Nazis. That it was the patriotic thing and that it was widely supported. Well some new facts presented themself and it really challenged the way I had thought about this topic.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/radicallib/status/1565899809344700417&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhen I think about it from a first principals perspective it makes sense very few people wanted to go fight in this war. For one I don't think many Americans could've understood what an evil force the Nazis were. Not like they were doom scrolling Twitter in the 1940s lol. They also didn't want to help the British or the Soviet Union win a war. Both of these things make sense as I think about them, but my whole life I've been taught what a patriotic thing it was to go fight. I have the utmost respect for the veterans that did fight and I'm glad the USA did help defeat the Nazis. It just blows my mind how much propaganda I've been fed and likely how different the feelings or \"will of the people\" was about this war.\n\nI think the same can be said for our current credit based system. It's hard to imagine a different system when you have grown up in one system and worked hard to succeed in that system. I'm not hoping for the complete break down of the system, but it does appear that we are getting closer and closer to a breakdown every time governments print gross amounts of arbitrary fiat units. I've used this quote before but I think Jeff Booth was right \"An abundance of money leads to a scarcity of goods and a scarcity of money leads to an abundance of goods\". Might've messed up the exact quote but the idea rings very true. If you print all this money it distorts the true cost of stuff and the free markets ability to price stuff is hindered. However, if you give people a clear set of rules and don't manipulate and change the rules to benefit a select few who have the power to change the rules then the free market can operate effectively and provide an abundance of goods. Technology makes people more productive so these goods will deflate over time.\n\nAt least that is how I see the world at this point in time. I sure hope Bitcoin can prove my hypothesis correct so humanity can thrive and flourish rather than deal with seemingly man made energy, monetary, and societal issues. Alas, I'm just one pleb and we need many plebs to hop on board to help realize this future. Optimism wins out anon. Stay smiling :)\n\nI also would like to challenge myself to keep an open mind as I learn more. At this point in time it seems clear Bitcoin is our best bet but maybe a new fact can present itself that will change my opinion. Thinking Bitcoin is the only way to fix this is likely to get me in trouble because things can change rapidly. The best way to test your hypothesis is to try and refute it as best as possible. Thus, I need to look for weaknesses in Bitcoin and I really appreciated talking with my Stepfather because he reminded me what matters at the end of the day is the actual hard good or service(labor). Not the fiat unit. Without goods or services Bitcoin is kind of pointless. Over a long enough time frame if bitcoins can become the unit of account I do believe it can help cause a deflationary flourishing where almost no one in the world lives in poverty because everyone can have confidence that the money isn't being tampered with. However, we still need economic actors creating these goods and services. Without that bitcoin is just a network with some arbitrary numbers.\n\n9/4/22\n\nConor Jay Chepenik",
  "wordCount": 1151,
  "readingTime": 4.343396226415094,
  "claps": 0,
  "voters": 0
}