{
  "id": "a91b0f58f49",
  "title": "Day 92",
  "createdAt": "2022-06-23 01:24:07",
  "tags": [
    "twitter",
    "dopamine",
    "bitcoin",
    "comedy",
    "practice"
  ],
  "url": "https://chepenikconor.medium.com/day-92-a91b0f58f49",
  "content": "# Day 92\n\nDecided to give up Twitter until July 21 to reset my dopamine levels. The app is amazing, but I spend way too much time on it so I need a reset. Watched a great Youtube [video](https://www.youtube.com/watch?v=aEfkx3DsXjs) discussing how pleasure and pain are in the same area of the brain. The video described it as a seesaw where when one side gets overloaded the brain will compensate and lean the seesaw back in the other direction. This goes for both pain and pleasure and one of the most glaring examples I can give is exercise. While during the course of a workout it's usually a grind, afterward I always feel really good. Another example could be video games. It's always fun playing, but after so many hours my eyes hurt and I usually have a headache. This idea pain and pleasure are a seesaw is fascinating to me. It was encouraging because the professor who made the video said she used to prescribe SSRI's to her patients, but now she recommends taking dopamine withdrawals from whatever is causing the excess pleasure. She mentioned in rich countries depression and anxiety are through the roof because we live with the tyranny of convenience. Since we always have entertainment a click away with our smartphones on us it's hard to not constantly flood our brains with dopamine. I think this tyranny of convenience is exactly why I've been so down. While I already miss Twitter I am looking forward to a month of not using it.\n\nI have one more stand-up comedy class until the big show. Tried to wing it last night and kind of bombed to be perfectly honest. Need to come in more prepared so I'm going to take a stab at writing out my set for today's post. Reminder this is for a comedy stand up show and many things are fabricated in order to get laughs.\n\nI've always been a big believer in being open-minded. It's a fine line though because in today's world it's near impossible to tell who the snake oil salesmen are and who are the ones providing value. Anyone with a smart phone has all of human history at the tip of our fingers and most of us use it to watch videos of people popping pimples or have food delivered to our door. Humanity is wild but as far as I can tell this tyranny of convenience our phones provide make it difficult to remain open-minded. Luckily, my father taught me that life is too short to give a shit what other thinks. Yea from a young age my Dad installed in me the importance of pursuing your passion no matter what. Even if it means getting child protective services called on you because you made your son run 5 miles and give up water for 24 hours to make sure he made pop Warner football weigh ins. What doesn't kill you makes you stronger though amirite? You know some people might've thought this was borderline child abuse, but they just didn't understand my Dad's passion was his children's sports. Yea my Dad liked living a little too vicariously through his children and their sporting events. At my JV football games he was on the sidelines drinking a vodka red bull yelling PICK A SPOT!!! PICK A SPOT CONOR! Needless to say my teammates always knew who my Dad was. My Dad taught me a lot of important lessons like make sure you put your mixie in a big gulp before entering the high school football game, that having a child is unlike anything you've ever experienced, and that your happiness can only be achieved if you pursue your passion. Despite these great lessons he taught me I do sometimes worry the last one we both took too literally. Life is about having a plethora of experiences. It's not good to become completely immersed in anything which for my Dad was his children's sports and for me it's Bitcoin. Yea I'm freaking obsessed with this magic internet money that has slashed half my purchasing power in USD terms and led my family to think I'm crazy. Luckily, my Dad taught me that it's not important to worry about what others think. That goes for your family though not your partner. I bring this up because I recently found out I'm going to be a Dad and when my girlfriend told me the first thing that ran through my head was \"Thank God For Bitcoin\". That's not what I told her though. I said \"What do you think of the name Satoshi?\" Quickly I realized I would've just been better off saying my original thought.\n\nThat's all for today anon. Going to be continually reworking this all week until I got it ready for the big show. Bang bang lets go!!!!!\n\n6/22/22\n\nConor Jay Chepenik",
  "wordCount": 815,
  "readingTime": 3.0754716981132075,
  "claps": 0,
  "voters": 0
}