{
  "id": "a9b766aa7d88",
  "title": "Day 208",
  "createdAt": "2022-10-16 14:28:48",
  "tags": [
    "coding",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-208-a9b766aa7d88",
  "content": "# Day 208\n\nToday I woke up and resisted the urge of a cheap dopamine by doing Mimo instead of Twitter. Checking my phone first thing in the morning is not great. I should be getting sunlight and walking around. However, if I am going to check my phone it's better that I use it to continue my coding skills than using it for social media. After enhancing my skills on While Loops in JavaScript this morning I'm going to make today's post about coding.\n\nOne site that is incredibly useful to learn web development is w3schools.com For anyone with good coding skills I'd like to warn that the rest of this piece is going to be very basic just going over definitions so this might not be the best article to increase your skills. That said, sometimes going back to the basics is exactly what you need. So let's begin!\n\n> The JavaScript Array Object\n\n> The Array object is used to store multiple values in a single variable:\n\nI think about an array as a [] thing that can store a bunch of data. This data is stored in these brackets [] and I'll fill this array with 5 pieces of data [0,1,2,3,4]. Arrays start from 0 so if you wanted to call the first number in this array set you would need to use 0 not 1 to call it.\n\n> JavaScript Strings\n\n> A JavaScript string stores a series of characters like \"John Doe\".\n\n> A string can be any text inside double or single quotes:\n\nStrings are always inside quotes and can include numbers like say \"5\". It's important to remember that a variable becomes a string and is no longer considered a number by the computer if you give it quotes.\n\n> JavaScript Numbers\n\n> JavaScript has only one type of number.\n\n> Numbers can be written with, or without, decimals:\n\nThere isn't much for me to say on this one so I mention you can use this method [toString()](https://www.w3schools.com/jsref/jsref_tostring_number.asp) which converts a number to a string. The more I learn about coding the more impressed I am that computers can do such incredibly things with some 0s and 1s. I'm also impressed with humans ability to come up with abstract ideas and turn them into working applications with code. It's an incredible thing.\n\n> Math Object\n\n> The Math object allows you to perform mathematical tasks.\n\n> Math is not a constructor. All properties/methods of Math can be called by using Math as an object, without creating it:\n\nThis one sent me down a googling rabbit hole and I still have nothing intelligent to say on it. So I'll say don't trust me, go and verify stuff for yourself because I'm still learning and even when I become an expert I'll still be trying to learn.\n\n> JavaScript Objects\n\n> Objects are one of JavaScript's data types.\n\n> Objects are used to store key/value (name/value) collections.\n\nI'm going to end with this one and I liked the example w3schools gave to show objects in action.\n\nconst person = {\n firstName: \"John\",\n lastName: \"Doe\",\n age: 50,\n eyeColor: \"blue\"\n};\n\nThe person is the object and his four key properties are John, Doe, 50, blue eyes.\n\nCoding is pretty cool. I'm enjoying this process and if you took the time to read this anon maybe you should think about it as well. We need more people writing code to help keep Bitcoin secure. Now that I think about it the Bitcoin protocol is secure. We need more people coding creating cool applications for people to use on top of the Bitcoin protocol. I'm reminded of this picture from Jesse Myers [substack](https://jessemyers.substack.com/p/coming-out-as-a-bitcoin-maximalist).\n\n![](https://miro.medium.com/0*JVAK0r0TQMENraHq.jpeg)\n\n10/16/22\n\nConor Jay Chepenik",
  "wordCount": 605,
  "readingTime": 2.4830188679245286,
  "claps": 0,
  "voters": 0
}