{
  "id": "aaa1721e7d9d",
  "title": "Day 117",
  "createdAt": "2022-07-17 19:23:25",
  "tags": [
    "states",
    "views",
    "mountains",
    "vermont",
    "big-maple"
  ],
  "url": "https://chepenikconor.medium.com/day-117-aaa1721e7d9d",
  "content": "# Day 117\n\nVermont has been incredible. Small-town America has a charm that is hard to describe without actually experiencing it. The owner of the Inn my girlfriend and me are staying at has been so helpful when it comes to planning an itinerary for today. He also helped us get reservations last night, and is incredibly knowledgeable about the area. 10/10 experience staying at this charming Vermont Inn near Windsor, VT.\n\nWent for a small hike and this was the view. Most of getting up the mountain was driving which was cool but the last .7 mile (felt longer hahaha) was hiking.\n\n![](https://miro.medium.com/1*dTkAf8J9reiY7p_NDFhzQQ.jpeg)\n\nIt was a 360 view because there was a little platform at the very top of the mountain. It was awesome getting to see New Hamshpire, Vermont, and Massachusetts from the top of this mountain. After the hike my girlfriend and I visited Woodstock Vermont and had a lovely brunch. Vermont is awesome, but I found out last night talking to the owner of this Inn that apparently the state government of Vermont has a thing against any big industry. Was confused by what this meant and he told us that you can't get an uber in Vermont because the Government was going to charge Uber a massive tax to operate here so if you want to get around it's got to be a cab or your own whip. While I do think Uber has had some sketchy business practices there service is pretty solid. It kind of sucks that the Government won't let companies operate without taxing them egregious amounts so they just choose not to operate in the state. The same goes for Doordash or Ubereats. Those services are not offered in Vermont. The biggest industries in this state are Maple Syrup, Tourism, and Logging. I joked that \"Big Maple\" must not like competition.\n\nIt was funny to hear that many just go over to New Hampshire to shop for stuff because they don't want to pay taxes on goods bought in Vermont. Many in Mass do the same thing. This arbitrage created by different state governments probably has a lot to do with why America was able to be so successful. Obviously, every state is different but by allowing 50 different states to experiment with policy it gives people a good idea what does and does not work. Maybe if I end up staying in New England I'll move to NH and pop over to Vermont when I want to go for awesome hikes or ski (or divulge big maple and get some delicious syrup). NH also has some cool mountains for skiing but Vermont eeks it out slightly in regards to charm.\n\nTook the scenic way back from Woodstock to the Inn I'm staying. Ended up driving through dirt roads and passed all these awesome farms. The more I see homes with lots of land, animals, and beautiful/unique designs the more I'm tempted to get out of the city. I don't know what the future holds but my god I love it around here. Final thought, this Snap felt has me looking a scary amount like my Dad. My Grandma literally didn't believe it was not my Dad in this picture😂 .\n\n![](https://miro.medium.com/1*QpmHXLMVRLkGifEPDSuaiQ.jpeg)\n\nWonder what my kid is going to look like. Saw some cute baby shirts today with cows on them, but told my girlfriend we need to let the baby be born before we start loading up on swag for the kid😂 . Once th kids is born I will def be buying my child some Bitcoin shirts tho👀 🤣\n\n7/17/22\n\nConor Jay Chepenik",
  "wordCount": 599,
  "readingTime": 2.6437106918238995,
  "claps": 0,
  "voters": 0
}