{
  "id": "ab03e9357b3a",
  "title": "Day 645",
  "createdAt": "2023-12-28 02:26:34",
  "tags": [
    "words"
  ],
  "url": "https://chepenikconor.medium.com/day-645-ab03e9357b3a",
  "content": "# Day 645\n\n![](https://miro.medium.com/0*TLl3nriJzbJeO-f5)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/JoeyMannarinoUS/status/1740128805853753732%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLanguage is a powerful thing. Proverbs 18:21 - \"Death and life are in the power of the tongue, and those who love it will eat its fruits.\" I love this idea of not allowing the government to call things free. There is no free lunch. When a service is offered by the government the funding either comes from taxpayer's money or freshly printed money which results in the hidden tax of inflation.\n\nLet's call inflation: currency debasement, abortion: child murdering, euthanasia: mercy killing, enhanced interrogation: torture, and collateral damage: civilian casualties. When language is manipulated to hide the truth it serves the interests of those who wish to mislead or soften the impact of their actions. This distortion can enable harmful policies and behaviors by concealing their true nature and consequences. Therefore, a commitment to precise and honest language is not just about semantics. It's how we resist the manipulation of discourse and ensure that discussions and decisions are based on reality, not rhetoric.\n\nIt's heartening to witness a politician recognizing the crucial need to address and legislate against the misuse of language to deceive. Growing up, we were often told, 'sticks and stones may break my bones, but words will never hurt me.' With time, I've realized how flawed this advice is. While the intent was to empower and protect, the reality is far different. Words wield immense power. Misunderstanding their impact doesn't shield us; it leaves us unprepared for the profound consequences they can have.\n\nDo not underestimate the power of your tongue!\n\n12/27/23\n\nConor Jay Chepenik",
  "wordCount": 261,
  "readingTime": 1.1849056603773584,
  "claps": 0,
  "voters": 0
}