{
  "id": "abecc5c5ca1f",
  "title": "Day 219",
  "createdAt": "2022-10-28 01:29:55",
  "tags": [
    "podcasts",
    "kanye",
    "lex",
    "ghost-randon",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-219-abecc5c5ca1f",
  "content": "# Day 219\n\nThis article by Ghost Rando cracked me up.\n\n[https://www.rand0mguest2.com/eternalseptember.html](https://www.rand0mguest2.com/eternalseptember.html)\n\nMy mans is also a good [Twitter follow](https://twitter.com/ghost_rando). My biggest takeaway from that article is Ayn Rand was right. Society will collapse for the freeloaders when the ones providing value have enough and stop producing for the looters. I don't know what this looks like in the 21st century but I imagine it results in pain for many with a collective flourishing for humanity at the end of the tunnel. If you spend a lot of time on Bitcoin Twitter like I do the piece above by Ghost Rando was super entertaining. I'm not sure if today Galt's Gulch could be possible to create with the technology the Government has. They would find it pretty quickly thanks to the military industrial complex. Luckily, we don't need to have Galt's Gulch since we got Bitcoin. A way to store our wealth in a system that isn't corrupted by the Central Bank's monopoly.\n\nFiat money makes people do ****** up shit. The internet is full of this stuff and this video serves as a reminder that humanity has a dark side.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/obianuju/status/1546179935731175425&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nKanye once said\n\n> If it's a good idea it's a God idea and no VC can own it.\n\nThat one hit deep the second I heard it on Lex Fridman's [podcast](https://open.spotify.com/episode/1g7MJlQbBHjZoVjo9b980q?si=7f774100f4ff4a01) and paused the show to write that down. I'm glad there aren't VC backed companies making profit from eugenics, but then again maybe I just don't know about them. Kind of wild to think about how little I know in the big scheme of things. The internet is so blighted yet I also love what technology can create because it helps me learn things, both good and bad, that I wouldn't have been able to had I been born earlier.\n\nI believe we humans are both individual actors as well as a larger collectively. While we each make our own choices, these choices are heavily influenced by what we see other humans doing, especially the ones we trust. Listening to Kanye and Lex talk felt like a super meaningful conversation. I felt intense emotion just from listening. It helped make my walk to pick up General Tso's chicken extremely enjoyable.\n\nI hope more conversations going forward are rooted in love and the pursuit of greatness like the conversation between Lex and Kanye was. Both people let their ego's flare but that is human nature and they worked through challenging issues to come out the end better. This is how we get the greater collective to rid itself of the neurotic bullshit we all feel in the air. I believe fiat money is the cause of many of these problems and as a write that I also realize that's what I blame most of my bullshit on. We have to work together to overcome our individual bullshit to heal the collective. I felt like I got some of that while listening to Lex and Kanye converse. It still blows my mind I can just get that from a magic glass screen in my pocket. All day I just pull out my screen and say \"Dopamine please\". How do you measure that as part of GDP? I guess you could take an average phone bill which according to according to CNBC \"the average cell phone bill per month for the typical American is $127.37\". Plus $1000 for the new iPhone. So that phone bill X 12 + the iPhone would equal = 2528.44 for the year. Which seems a little high but you get the content for free since Spotify, Kanye, and Lex have allowed the collective to get that part for free. I guess you pay in a way with your attention because there are ads. Your attention, in part, is currency. I bring all this up because it's kind of ridiculous to measure the GDP of these things when all value is subjective. At least it should be in my opinion. When humans can cooperate best to get the most out of each other is when people can exchange goods, services, products, and most importantly, ideas freely. When a VC gets involved there are incentives that end up corrupting or exploiting the idea for money. The best ideas need to be freed from centralization and have fair rules. Money is not inherently bad but if one party can manipulate it in ways that others cant then things will get distorted.\n\nI got to quote Kanye again, \"If it's a good idea it's a God idea and no VC can own it\". Bitcoin is from God and I believe it will free us and allow humanity to flourish in a way humanity has never experienced. In conclusion, share your ideas; don't hoard them. Humanity's collective depends on it.\n\n10/27/22\n\nConor Jay Chepenik",
  "wordCount": 802,
  "readingTime": 3.026415094339623,
  "claps": 0,
  "voters": 0
}