{
  "id": "ac1165e81d03",
  "title": "Day 416",
  "createdAt": "2023-05-13 01:17:57",
  "tags": [
    "family",
    "social-media"
  ],
  "url": "https://chepenikconor.medium.com/day-416-ac1165e81d03",
  "content": "# Day 416\n\nYou know the feeling when you know that you need to stop scrolling social media but keep scrolling anyways. I'm not proud to say I've been experiencing that all day. Lot of news on the bird app about Elon hiring a WEF lady to run the bird app. Part of me thinks this is ridiculous because he has publicly commented about the fact the WEF is acting more and more like an unelected world government. Another part of me thinks this is par for the course and expecting one man to solve all the world's problems is ridiculous.\n\nWho knows. I'm grateful for Nostr and other platforms being built. Like Stacker News for example which I will keep shilling because it's actually insane how dope the value 4 value model is becoming.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1657149915192016896%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI really believe that. One simple comment made someone a satillionaire.\n\nIn other news my family came up for Mother's day which was special. So nice visiting with them and having Sloan finally get to meet all her Aunts.\n\n![](https://miro.medium.com/1*-kszPYJ5_iEvXCKmjCYVWQ.jpeg)\n\nHere is the lil lady with my Mother. Special moments man. Family is everything and I need to remember this next time I'm triggered by some random event in the world that shows up on my social media feed. I'm not saying we can't make a difference, I'm saying we can't make a difference by doom scrolling.\n\nFinally, I would like to end today's Medium by mentioning a convo I had with one of my classmates from China. This woman is immigrating from China into the U.S.A and she mentioned that the Chinese president was evil. We worked together on a group project for our coding class and I was eager to ask her about China, but I was not sure how to ask. Well when she made this comment about the president I jumped at the chance and said as an American I know I have had enough \"the CCP is bad\" brainwashing so I wanted to see if there was another perspective I was missing. So I asked her what the main opinion of the CCP in China was and she said that most people in China are okay with the CCP because they've been brainwashed and can't speak English. This point was interesting because without English they are very limited to the media they get exposed to. Since they only read in their native tongue they only get journalism controlled by the CCP. I mentioned that most people in the United States are also brainwashed and we shared a laugh. It brings me a lot of hope to know that more individuals are waking up and tired of putting up with corrupt governments. We will win :)\n\n5/12/23\n\nConor Jay Chepenik",
  "wordCount": 457,
  "readingTime": 1.9245283018867925,
  "claps": 0,
  "voters": 0
}