{
  "id": "ac8840eeca1b",
  "title": "Day 529",
  "createdAt": "2023-09-03 01:22:33",
  "tags": [
    "fiat",
    "bitcoin",
    "republican",
    "democrat",
    "anti-establishment"
  ],
  "url": "https://chepenikconor.medium.com/day-529-ac8840eeca1b",
  "content": "# Day 529\n\n![Nightcafe.studio](https://miro.medium.com/1*P9ipkZFmmlKQEbqdvzdwmw.png)\n\nFiat currency is the currency of waging war. Some true words spoken by RFK Jr in this video.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/BitcoinMagazine/status/1698103626151940224%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLately, I've found myself delving into the realm of political candidates, an irony in itself, as politics isn't where I wish to channel my energy. I have a finite amount of time on this planet and I've come to the realization long ago that no politician holds the key to my salvation. Nevertheless, speculating on the political landscape can be intriguing, especially as I hold hope for a candidate who challenges the status quo. It's becoming evident that those in power [(Let's Go Brandon)](https://twitter.com/PapiTrumpo/status/1698056045417971834?s=20) are rapidly losing their grip on the dwindling support they once had.\n\nFor those wondering my political stance I'm not a democrat or republican, it is much worse than that: I'm a Bitcoiner. Hahahaha that joke never gets old. In all seriousness, my political leanings will never be bound by the traditional red or blue spectrum; they're firmly grounded in the anti-establishment realm. I pay little heed to which side someone aligns with, as long as they stand in opposition to the entrenched views of the establishment. The urgency of our times demands that we put an end to our involvement in wars, halt the insane amount of money printing, and confront the looming specter of a biometric technocratic security state that has many within the establishment eagerly drooling in anticipation. Now if the establishment view becomes hard money, personal freedom, and respect for private property then I will become a staunch establishment supporter, but until that day comes you can mark me off as anti-establishment.\n\nAmerica will do the right thing but as usual first we must exhaust all other options. While the odds may appear against RFK Jr.'s victory, we should remember that many dismissed the possibility of Trump's success as well. I mentioned this yesterday, and it continues to occupy my thoughts, so I'll reiterate: the most unexpected outcomes often turn out to be the reality. While I intend to refocus my attention on honing my personal skills, I can't help but feel a sense of excitement as I anticipate the unfolding drama of 2024. It's bound to be a cinematic spectacle.🎥\n\n![](https://miro.medium.com/0*9QGCl-7qP-y61pVE.jpg)\n\n9/2/23\n\nConor Jay Chepenik",
  "wordCount": 375,
  "readingTime": 1.7984276729559747,
  "claps": 5,
  "voters": 1
}