{
  "id": "acb847d96db8",
  "title": "Day 583",
  "createdAt": "2023-10-27 03:09:49",
  "tags": [
    "prosperity",
    "abundance",
    "dead-internet-theory",
    "tcp-ip",
    "artificial-intelligence"
  ],
  "url": "https://chepenikconor.medium.com/day-583-acb847d96db8",
  "content": "# Day 583\n\nLet's talk about the Dead Internet Theory.\n\nIn the archives of internet folklore, the Dead Internet Theory stands out as a particularly provocative notion. Some years ago, it captured the collective imagination, suggesting that the vast expanse of the internet we navigate daily is but a barren wasteland, dominated by bots and an intricate tapestry of deception. At its core, the theory was dismissed by many as an exaggerated claim, a hyperbolic vision of a digital dystopia. But what if this theory, while prematurely presented, was not as far-fetched as it seemed?\n\nThe evolution of technology, especially in the realm of artificial intelligence, paints a fascinating picture. Advanced AI generation models are here, promising a deluge of content - text, images, and videos - that, while impressive, could be potentially harmful. The consequences of this technological tsunami are a double-edged sword. It could render certain professions obsolete, like the majority of customer service jobs, while birthing new roles such as AI data curation specialists. It is unclear the true impact AI will have on the world, but I am for one am excited to deal with a whole new set of problems once humanity figures out how to create even more amounts of incredible abundance.\n\n![](https://miro.medium.com/0*O1S5HfdgxDiPQmfK)\n\nAt first glance, the landscape of social media might paint a grim picture, rife with graphic content, explicit material, and the extreme events of our world. Yet, upon reflection, we find ourselves at a remarkably progressive juncture in history. The vast majority of us have our essential needs addressed, with countless individuals lifted from the clutches of poverty. A century ago, the notion that an average individual would have access to round-the-clock entertainment, the comfort of air conditioning, and a pantry brimming with sustenance would have been unfathomable.\n\nGiven these advancements and conveniences, one might assume a surge in collective happiness. Yet, as our basic needs are satisfied, our aspirations climb higher on the hierarchy of desires. The promise of AI holds the potential to elevate the entire globe from poverty, but with this rise, new challenges will undoubtedly emerge.\n\nThe most insightful interviews feature formerly poor people who later obtained wealth. When asked about money, these individuals reveal a telling transition. In poverty, finances rarely occupied their thoughts. But with abundance, money often dominates their mental space.\n\nThis contrast illuminates the evolving nature of life's challenges. When struggling to meet basic needs, we focus less on wealth itself. Once furnished with comfort, attention shifts to managing, maintaining and increasing fortunes. The contentment money can provide proves fleeting. Our goals recalibrate - yesterday's luxuries become today's necessities.\n\nThese interviews contain an important lesson. Satisfaction and purpose seldom stem from wealth alone. By reflecting on their shifted mindsets, we gain wisdom. Material success alone does not guarantee perpetual happiness or fulfillment. Our challenges and priorities change, but inner peace remains elusive. It's crucial to recognize that the value of money isn't just in its possession, but in the opportunities and experiences it can unlock, which would be inaccessible without it.\n\nOur modern lives often obscure the physical beings we truly are. But I find that primal activities like running tap into our core animal nature. They remind us that beneath the trappings of civilization, we inhabit animal bodies evolved over millions of years.\n\nI love running and exercising for this very reason. It connects me with the physicality that makes me human. At a biological level, I'm basically a big-brained primate. Yet I'm fortunate enough to live in an era when such primates devised astonishing technologies.\n\nThe internet amazes me as one such innovation. It relies on cables laid under seas and a protocol called TCP/IP. That infrastructure connects people across the globe, enabling new ways to communicate, share, and learn. When I run or work out, I'm reminded of the contrast. My body's primal needs meet my species' digital achievements. I am an animal, but one who can now explore virtual worlds from a tiny device. My big-brained ancestors might see this as magic.\n\n![](https://miro.medium.com/0*igR1pJ4XyIp8to1B)\n\nI love the harmony of blending old and new. Exercise invokes my inner primate, then technology reconnects me to humanity's advances. Running provides perspective on how far we've come by showing how much is still the same. Our networks and devices are incredible accomplishments, but we mustn't forget our origin point as beings of flesh, muscle and instinct. Awareness of both sides - the primal and the virtual - creates balance. My mind expands via pixels, but my feet keep me grounded in real earth. That equilibrium makes me appreciate how amazing yet animalistic we humans remain, no matter how far technology takes us.\n\nAs these powerful technologies proliferate, society approaches a pivotal juncture. Many will remain oblivious, preoccupied with daily life, until the impacts become apparent. When the abundance materializes many will lose their jobs as those jobs simply will not be needed but the lucky thing is a rising tide lefts all ships.\n\nI'm sure that teenagers will continue trying to flex on social media. The blind will never stop trying to lead the blind and if you get burnt because you followed the financial advice of an 18 year old who has no idea what he is talking about, well pain is the best teacher. Marketing agencies will leverage these tools to craft more compelling, and probably more manipulative campaigns. Nation-states will probably try and leverage these tools to control the masses, but now that the masses have them their advantage will be incredibly hard to keep. Even if the governments around the world builds some death star of censorship it will not succeed in the long run. Truth has a stubborn resilience.\n\nThe real question is whether we are ready. The actors and incentives stay the same, but capabilities escalate exponentially. We stand at the precipice of a new era, where knowledge and creation are democratized. Some see this as Pandora's box, but it need not be so. Those who approach it with discernment and care can unlock its positive potential.\n\nThe dead internet theory has merit as cautionary tale, reminding us that vigilance is mandatory. With an aware, active citizenry, we can constructively guide the digital landscape. There are hazards ahead but incredible opportunities too. If we cultivate wisdom and empathy alongside technological flair, the light can outshine the dark. The future remains unwritten; our choices determine the narrative. Together we can greet the challenges in this dawn of abundance, not with fear, but hope.\n\n10/26/23\n\nConor Jay Chepenik",
  "wordCount": 1092,
  "readingTime": 4.504088050314466,
  "claps": 4,
  "voters": 2
}