{
  "id": "aed93903d515",
  "title": "Day 204",
  "createdAt": "2022-10-13 01:03:50",
  "tags": [
    "bitcoin",
    "federal-reserve",
    "marta",
    "kleptocracy",
    "conference"
  ],
  "url": "https://chepenikconor.medium.com/day-204-aed93903d515",
  "content": "# Day 204\n\nAttended the Atlanta Bitcoin Conference today which was a cool experience. Going to a conference alone can be intimidating and I did have the thought \"Do I just go catch a movie\" because today was builder day and there were no speeches or normal conference stuff. Despite being a bit overwhelming I decided I would stay and participate and it turned out to be a great decision. I worked on an app called Bitcoin Butler that would be like an Alexa but for Bitcoin needs. So you could tell the Butler \"Hey send 10,000 sats to Johnny\" and it would send the sats. There is still a lot of work to be done for this Butler but it was fun to work on this and we had a prototype going because we used [Twilio](https://www.twilio.com/).\n\nI also rode the MARTA today which is cool to see. I like noticing the little differences between public transportation in the various parts of the world. MARTA was useful and dropped me off right near the conference. It was also a bigger train, but I prefer Boston's T. On my way to the conference I passed the Atlanta Federal Reserve Bank Of Boston and there was a sign right up the road with the national debt on it.\n\n![](https://miro.medium.com/0*BDjph2dZbNzaWevw)\n\n![](https://miro.medium.com/0*nhbiIHLnx_nLX6SB)\n\nWhoever put that sign there...RESPECT! It was interesting to see they put The State Bar Of Georgia in the same building as the FED but I digress. I'm looking forward to going to the conference tomorrow and hearing some people speak. It's a special thing being around so many Bitcoiners. The passion, the excitement, the energy. Sometimes I feel like I'm going crazy when I talk about Bitcoin with people who aren't as far down the rabbit hole. Bitcoin Twitter helps with this and so do podcasts. However, nothing beats seeing other Bitcoiners in person.\n\nWe are going to win. Plain and simple. Listened to this [podcast](https://open.spotify.com/episode/4Knj4El2l9I6klRgMURgFC?si=BpuNtPtmRyWCkMcLKao56w) while riding the MARTA today and that is why I'm writing WE ARE GOING TO WIN because I'm reminded that the people in charge are Kleptocrats and evil will not win out in the long run.\n\nAlso THERE IS NO SECOND BEST. Showed my boy Q this video and while he still dabbles in the broader crypto space I know my Bitcoin Maximalism is wearing off on him.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FMNf97XgBdTc%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DMNf97XgBdTc&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FMNf97XgBdTc%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nStay strong anon. The kleptocracy is dying and breathing its final breaths. Humanity is going to flourish on a Bitcoin standard. Today was an excellent reminder of that.\n\n10/12/22\n\nConor Jay Chepenik",
  "wordCount": 422,
  "readingTime": 1.9757861635220126,
  "claps": 0,
  "voters": 0
}