{
  "id": "af78fe09866d",
  "title": "Day 175",
  "createdAt": "2022-09-13 22:02:03",
  "tags": [
    "net-zero",
    "starbucks",
    "web-3",
    "bitcoin",
    "anon"
  ],
  "url": "https://chepenikconor.medium.com/day-175-af78fe09866d",
  "content": "# Day 175\n\n![Photo by Artem Saranin: [https://www.pexels.com/photo/shallow-focus-photography-of-water-droplets-1202841/](https://www.pexels.com/photo/shallow-focus-photography-of-water-droplets-1202841/)](https://miro.medium.com/0*jLqbvMxnP3OpUTfn)\n\nI felt sad today. I'm doing much better now and have a podcast with MacroJack later that I'm really excited about. However, the majority of today was a slog. I saw a quote from Alan Watts about going into the forest and realizing how connected everything is. I'm sure there is a lot of truth to that and people are also probably sad today seeing inflation run this hot while the President brags about passing a massive spending bill, while inflation is so out of control that the Fed is raising rates in what will likely be a massive depression. The fact this bill is called the inflation reduction act is honestly one of the most ridiculous things I've ever heard.\n\nAlas, I'm not an economist. Which if anything should make me more credible considering Keynesian economists almost always miss with their expectations hahahaha. I'm going up to Maine Thursday to hang with my Dad and spend some time with my girlfriend in nature. Should be a fun trip.\n\nWas going to go protest a parking ticket I didn't deserve but the date is of course this Friday so I won't be able to fight \"the man\". Disappointing indeed. Was looking forward to seeing if I could get the ticket overturned.\n\nOutside of that I need to find a muse. One of the challenges with this writing everyday thing is some days I do not feel like writing. Alas, those are probably the best days to write. Making something out of nothing. Turning my thoughts into a bunch of hodge podge via a digital medium.\n\nSaw Starbucks is going to start doing NFTs on polygon in their app. It is interesting the idea of giving people an NFT for their loyalty to Starbs. That said, I think many will treat it like an investment and since NFTs are not scarce I don't know how it will play out. My guess: poorly. I keep hearing the metaphor that anything not built on Bitcoin is like building on quick sand and I tend to agree as a Bitcoiner. It is cool to be rewarded though by a brand you love. Lot of people love their Starbucks, even me sometimes. Not sure how much it will boost their sales but I do imagine they will get people to spend money to collect coffee NFTs and what not. I mean look at how Bitcoin dropped nearly 10% on the news that inflation was above expectations. The point I'm making is the market is so distorted by central planners at this point that many don't realize what they are holding in Bitcoin. Most people are to \"I''ll be nice and use ignorant\" to realize Bitcoin is the ultimate risk-off asset even though they are treating it like a risk-on asset. This Podcast is worth the listen and I'm attaching it because what happened today in regards to Bitcoin's USD price reminds me of what Max & Stacy said on this podcast. Excuse my poor paraphrasing but it was essentially a story about a woman who had a masterpiece in her Kitchen and ate dinner under it every night not realizing it was an incredibly expensive painting and then made the comparison to Bitcoin when they first got some not realizing what a valuable thing this asset was. Bad paraphrasing but fantastic podcast I do recommend listening to if you want to hear from some OGs in the space.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F7pjG0R79GLauf2ocyFEsc7%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F7pjG0R79GLauf2ocyFEsc7&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f9ca5797da773ef6d2cd36e99&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nStarbucks, in my opinion, would've just been better off accepting Bitcoin like Chipotle did and putting it on their own balance sheet. I'm not a Starbucks exec though and only time will tell. It did kind of irk me though the net-zero stuff in the announcement post about joining web 3. To claim Polygon is going net-zero and is going to have its carbon footprint reduced even more when Eth goes to proof of stake makes me want to scream in a pillow. It is Bitcoin's POW and difficulty adjustment mechanism that makes Bitcoin valuable. Plus, Bitcoin mining can do so much to help the world achieve more sustainable grids and sources of energy. So many people who believe in net-zero are the same people who buy an electric car so they can act like they did something while having no clue their electric car is powered by a coal-burning electric grid. I digress, can't control 🤡 🌎  so ima just stick to talking shit about them on my Medium.\n\nFeeling better after begrudgingly writing today. See ya tomorrow Anon.\n\n9/13/22\n\nConor Jay Chepenik",
  "wordCount": 765,
  "readingTime": 3.086792452830189,
  "claps": 0,
  "voters": 0
}