{
  "id": "affcc44a3b63",
  "title": "Day 603",
  "createdAt": "2023-11-16 04:53:30",
  "tags": [
    "bang",
    "bảng"
  ],
  "url": "https://chepenikconor.medium.com/day-603-affcc44a3b63",
  "content": "# Day 603\n\nIt's amazing how much we can learn from others. Today I sat with an AI engineer friend of mine for like two hours and we trained some data, made a Mr. Nakamoto GPT, and shared it with our fellow MassAdoption team members. It is amazing what you can do once you have trained a model on good data.\n\nI also made a tip jar for my binmucker website. When you click on the buttons there is a nice confetti animation.\n\n![](https://miro.medium.com/1*q1Z0CTWhiGuLzEzRrIUtIw.png)\n\n> [**Magical Tip Jar**](https://binmucker.com/tip.html)\n\nIf you want to see how I made it zap me some sats and leave in the description you want to see a video. I can be convinced ;D\n\nAfter the call tonight with my AI engineer friend I snuggled with my child. Sloan is so funny. That little girl has such an incredible personality and I thank God for the privilege of getting to be her Father. There is something deeply visceral about being a parent that is also empowering. It gives me the hope to build a better world because I refuse to fail my kid. It is not an option. Every day I exist is a chance to do my small part to get better which in turn makes the world a better place.\n\nI know that sounds backwards but there is a lot of truth in that. Hear me out. Strong men create good times. Fat depressed people do not give off good vibes. Might be harsh but it's the truth. Fit positive people give off great vibes. If you can take care of yourself you can help spread joy to others.\n\nI've noticed this a lot in Bitcoin. Many of the Bitcoiners I know and listen to take great care of their health, family, and career. It is very commendable to see! Speaking of I loved this podcast from a man named Oliver. He is a good Twitter follow and I'm very glad I came across this originally as a Twitter space and then listened to the rest later.\n\n> [**Bitcoin Unleashed - Why Earning Interest Is A Scam - Listen on Fountain**](https://fountain.fm/episode/xZKTQS8ECRvp3VKeZLlY)\n\nAfter Sloan fell asleep this is what I crushed on my walk. Then I returned home poured a nice glass of water with trace minerals and it feels great to type this after a nice long walk.\n\nI'll end today's post with a random AI tool a found for creating acronyms I found. So random I stumbled upon this but it is kind of cool.\n\n> [_**TextFX**_](https://textfx.withgoogle.com/)\n\n![](https://miro.medium.com/1*Ivcyg30sj3HvGh1fmJrHLw.png)\n\nHonestly kind of fun to play with. Anyways, I love you Anon. Aleksandr Solzhenitsyn has written \"The line dividing good and evil cuts through the heart of every human being.\" Now you might be thinking my dear anon there is no way you can love me because we have never met. And as Gavin Newsom says [\"That is true because it's true\"](https://x.com/PirateWires/status/1724821445220745424?s=20). I don't love you the way I have unconditional love for my kid, but I do love all humans despite having evil in my heart like everyone else. If I don't take care of myself that evil will prevail. If I do take care of myself I'll let that love in my heart flourish.\n\nFix yourself; fix the world. BANG BANG\n\n11/15/23\n\nConor Jay Chepenik",
  "wordCount": 562,
  "readingTime": 2.5040880503144654,
  "claps": 0,
  "voters": 0
}