{
  "id": "b124db034bd8",
  "title": "Day 198",
  "createdAt": "2022-10-07 00:58:49",
  "tags": [
    "pets",
    "work",
    "tech",
    "public-speaking",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-198-b124db034bd8",
  "content": "# Day 198\n\nToday at work I spent all day at a Quarterly Sales Review. A lot of people don't like corporate reviews and I can understand why. However, today was pretty insightful and I have a lot of respect for those who had to present and do some public speaking. It's not an easy task to deliver a speech/presentation/performance in front of a large audience. I could see some peoples hands were literally shaking when they presented and it reminded me of the nerves I had before doing stand up comedy earlier this year. It also reminded me of giving various presentations throughout college. It's a good feeling to deliver a public speech though. RESPECT to my fellow co-workers. I feel a renewed sense of purpose in the gig. I'm impressed with the VP who spoke at the event and his ability to get an entire group of people excited to sell some software. I also noticed that the majority of people who did really well with their public speaking were people who made the audience laugh with their first words. BIG BRAIN MOVE ALERT. Lot of tension in those corporate events and the ability to break the ice with a joke is a great way to get people receptive to your speech. Also, those who are able to enhance the vibes are able to move up in their career.\n\nGot sushi tonight with the girlfriend. Now I'm getting ready to walk and get ice cream with her. Going to go 9 days without seeing each other since she is taking a trip to Bermuda and I'm going to Atlanta for a BTC conference. It will be good though because there is nothing like being reminded how fond you are of someone until you aren't with that person for a little. Not that I don't love spending every day with her. I just know that when I take a break from something it always feel better coming back to it. Something about delayed gratification. I'll miss her though. I'm sure discussing my favorite topic with strangers and getting some time to see family will help me cope.\n\nFinally, I'd like to point out how wild and cool it is this dude has a pet Frog.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jadethetrapper/status/1577694750404132871&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nNot something I'd personally go for but do you KING! I would like a puppy one day when I move out of a city. Who knows though, maybe I will expand my scope when I get some property. I'm sure there are many more exotic pets I had not even thought of. Shout out to the protocol that is TCP/IP and the application that is Twitter for showing me this pet.\n\n10/6/22\n\nConor Jay Chepenik",
  "wordCount": 451,
  "readingTime": 1.7018867924528303,
  "claps": 0,
  "voters": 0
}