{
  "id": "b40381b260b",
  "title": "Day 537",
  "createdAt": "2023-09-11 02:28:16",
  "tags": [
    "fiat",
    "vivek-ramaswamy",
    "bitcoin",
    "technology",
    "money"
  ],
  "url": "https://chepenikconor.medium.com/day-537-b40381b260b",
  "content": "# Day 537\n\nWent to New Hampshire today with the family and got to see [Vivek Ramaswamy](https://twitter.com/VivekGRamaswamy) speak as well as shake the man's hand. Putting your faith in politicians is a recipe to get rekt but I do appreciate what he is saying. A refreshing break from the neocons on both side of the aisle who are pushing humanity closer to World War III every time they send more money to Ukraine.\n\n![](https://miro.medium.com/1*WpJhOVPkaNDTamuDOT8SgQ.jpeg)\n\nOne of the questions Vivek asked the crowd is \"what does it mean to be an American?\" This is a question I had to reflect on for more time than I am proud to admit. To me, it means you practice [civil disobedience](https://twitter.com/FordFischer/status/1700996328799773109?s=20) when the government tries to violate our constitution, being an American means you believe in supporting your family, you believe in a higher power who is good, and you want to provide value for others in order to make money. While I'm not 100% sure it is historically accurate I love this quote from Atlas Shrugged,\n\n> If you ask me to name the proudest distinction of Americans, I would choose - because it contains all the others - the fact that they were the people who created the phrase 'to make money.' No other language or nation had ever used these words before; men had always thought of wealth as a static quantity - to be seized, begged, inherited, shared, looted or obtained as a favor. Americans were the first to understand that wealth has to be created. The words 'to make money' hold the essence of human morality.\n\nOn the campaign website [vivek2024.com](https://www.vivek2024.com/) there are ten tenants for Vivek's Presidency.\n\n> _**\"We hold these truths to be\nsacred and undeniable.\"**_\n\n> _**- Thomas Jefferson**_\n\n> **God is real.**\n\n> **There are two genders.**\n\n> **Human flourishing requires fossil fuels.**\n\n> **Reverse racism is racism.**\n\n> **An open border is no border.**\n\n> **Parents determine the education of their children.**\n\n> **The nuclear family is the greatest form of governance known to mankind.**\n\n> **Capitalism lifts people up from poverty.**\n\n> **There are three branches of the U.S. government, not four.**\n\n> **The U.S. constitution is the strongest guarantor of freedoms in history.**\n\nPersonally, all these statements resonate with me. If you don't believe in God you will replace God with Government. Men have penises, women have vaginas. Energy is vital to human flourishing. Racism is racism no matter the adjective that comes before it. Private property, both on an individual and national level, is incredibly important. Parents should always be the first to decide what their children learn. Making money comes from providing value. Blackrock, Vanguard, State Street are rent-seekers who use fiat money to get the government to do their bidding. I was published in print edition of Bitcoin Magazine for talking about how based the U.S constitution is. ([Here is a read of that piece](https://youtu.be/M2iUVllAKSI?si=S7_ZHBLZVvhPOh3h))\n\nI wanted to ask Vivek about how he would work with the Fed to fix fiat currency but did not get the chance today because lots of people wanted to ask questions and there was only so much time. Not to mention, I don't think fiat can be fixed so I'm not sure there is a correct answer to my question. I just enjoy getting people to think about money. Luckily, I did my own research and found this quality video.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FhBDED2SZhGo%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DhBDED2SZhGo&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FhBDED2SZhGo%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nVijay is brilliant and he taught me about Aristotle in this episode. Aristotle believed that good money should have the following characteristics:\n\n- Durability: Money should be able to withstand the test of time and the elements. It should not fade, corrode, or change through time.\n\n- Portability: Good money should be easy to carry around. It should not be too heavy or bulky.\n\n- Divisibility: Good money should be easily divisible into smaller units. This makes it easier to make exchanges for goods and services of different values.\n\n- Fungible: Good money should be interchangeable with other units of money of the same value. This means that one coin should be worth the same as another coin of the same denomination.\n\n- Scarcity: Good money should be scarce, so that it retains its value. If there is too much money in circulation, its value will decrease.\n\n- Acceptability: Good money should be accepted by everyone as a medium of exchange. This means that it should be widely used and trusted.\n\nAristotle believed that money should be used for its intended purpose, which is to facilitate exchanges of goods and services. He argued that it is wrong to use money to make a profit, or to lend it out at interest, as this would be unnatural and lead to social problems.\n\n![Bitcoin laser eye Aristotle](https://miro.medium.com/1*HUKsrSvE3Y-FEBoJp3VJ-A.jpeg)\n\nAristotle's views on money are still relevant today. We still use money to facilitate exchanges of goods and services, but we have also developed new forms of money, such as fiat money and bitcoin. These new forms of money have many of the same characteristics as the money that Aristotle described, but they also bring new features. For example, paper money is not as durable as metal coins, but it is more portable. Electronic fiat money is not as scarce as physical money, but it is more easily divisible. Bitcoin is both scarce and perfectly divisible, but it is not as widely accepted as fiat money yet.\n\nThe characteristics of good money are still important today. We need money that is durable, portable, divisible, fungible, scarce, and acceptable. We also need money that is used for its intended purpose, which is to facilitate exchanges of goods and services, not to enrich those who control credit.\n\nIt's cool to meet politicians, as it serves as a reminder that politics often flows downstream from economics. Throughout history, capitalism and politics have remained deeply interconnected. However, with the advent of Bitcoin, I am optimistic that we have an opportunity to reshape this dynamic. Bitcoin has the potential to disentangle political influence from the grasp of rent-seeking financial elites, reducing their significance and allowing value-driven leaders to wield money for the betterment of humanity.\n\nI'm eager to see candidates who will accelerate this trend get elected, but I'm also not sure if there is a candidate out there who has the willpower to concede the ability to print money out of thin air. Fiat money is powerful, and I'm sure it has a trick up its sleeve. Only time will tell.\n\n9/10/23\n\nConor Jay Chepenik",
  "wordCount": 1060,
  "readingTime": 4.383333333333334,
  "claps": 0,
  "voters": 0
}