{
  "id": "b4169984be8b",
  "title": "Day 857",
  "createdAt": "2024-07-27 02:27:15",
  "tags": [
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-857-b4169984be8b",
  "content": "# Day 857\n\n![[https://x.com/AutismCapital/status/1816951410728317217](https://x.com/AutismCapital/status/1816951410728317217)](https://miro.medium.com/1*uN9Vi5iHD06X0_3k4HKsMw.png)\n\n**Why RFK Jr.'s Bitcoin Reserve Idea is Great, but Doomed to Fall Short**\n\nPresidential Candidate RFK Jr. made waves in the Bitcoin community by announcing a plan to build a 4 million Bitcoin reserve for the United States. The idea of signing an executive order directing the US Treasury to purchase 550 Bitcoin daily until the country has amassed a staggering 4,000,000 Bitcoins is great on it's face. However, the goal is unlikely to materialize as other countries would not wait around to catch up. The game theory at that point would become to compelling to not join in.\n\nBy accumulating a massive Bitcoin reserve, the US would be able to extend the dollar a lot longer as it would be backed by the hardest money on earth. It would provide a legit hedge against inflation, currency devaluation, and other economic uncertainties. Moreover, it would be a bold statement of support for the emerging Bitcoin industry, potentially attracting more businesses, talent, and innovation to the US.\n\nHowever, there's a catch. A big one. If the US were to attempt to buy up such a massive amount of Bitcoin, the consequences would be predictable: the price would skyrocket. As the US Treasury enters the market, buying up 550 Bitcoin daily, the increased demand would lead to a surge in prices. This, in turn, would make it increasingly difficult for the US to continue purchasing Bitcoin at a reasonable price especially as the other nations piled on.\n\nImagine the scenario: the US Treasury starts buying Bitcoin, and the price doubles. Suddenly, the dollars you were using to make your daily purchase of 550 Bitcoin only buys you 275 Bitcoin. As the price continues to rise, the cost of acquiring each additional Bitcoin would become prohibitively expensive. The US would be pumping billions of dollars into the market, only to see the price of Bitcoin inflate to insane levels.\n\nIn reality, it's unlikely that the US could even accumulate 1 million Bitcoin, let alone 4 million. The market would simply become too expensive, and the US would be forced to abandon its plans or drastically reduce its purchasing targets. The irony is that the very act of trying to dominate the market would ultimately make it impossible to do so.\n\n![[https://x.com/ConorChepenik/status/1816996707848081850](https://x.com/ConorChepenik/status/1816996707848081850)](https://miro.medium.com/1*F0Usm4lYoC2dZDwtlOsGAQ.png)\n\nDespite this, RFK Jr.'s idea is still a great one. The concept of building a national Bitcoin reserve is forward-thinking and recognizes the growing importance of Bitcoin in the global economy. It's a nod to the future, acknowledging that Bitcoin will play an increasingly significant role in international trade, finance, and economic stability.\n\nExcited to see what promises Trump will offer tomorrow at the conference. While RFK Jr.'s plan to build a massive Bitcoin reserve is unlikely to succeed in its current form, it's a bold and visionary idea. I hope Trump talks about ending the Fed.\n\n![[https://x.com/AutismCapital/status/1816988463255945273](https://x.com/AutismCapital/status/1816988463255945273)](https://miro.medium.com/1*B3UWEf0MjmGY4mxmnGR3QA.png)\n\nJokes aside Bitcoin is important. Get some or regret it later.\n\n![](https://miro.medium.com/1*t_ce_uzQndueTR7yOTY_uQ.png)\n\nOf course we love a good joke on my Medium! This one is just to fitting not to share:)\n\n![The unstacksinated](https://miro.medium.com/1*Q9xoUtTAvSfmFNTKpo4gRg.png)\n\n7/26/24\n\nConor Jay Chepenik",
  "wordCount": 511,
  "readingTime": 2.761635220125786,
  "claps": 0,
  "voters": 0
}