{
  "id": "b47b980d6906",
  "title": "Day 109",
  "createdAt": "2022-07-10 02:06:12",
  "tags": [
    "golf",
    "silver",
    "gold",
    "eth",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-109-b47b980d6906",
  "content": "# Day 109\n\nGot to play 18 today at Trull Brook Golf Course which was nice. Won 5 bucks as well which made the round that much sweeter. Golf is such a nice sport. While I know it can be both frustrating and difficult on bad days it's also amazing to be out in nature for hours. It definitely helps to play with people of your same skill level so you don't get as frustrated when hitting them poorly. Plus, you can actually wager fairly with your partner. Only had one par today but it was a good par.\n\n![](https://miro.medium.com/0*t1nZ3l-LIi6WeVnn)\n\nSaw the _Minions Rise of Gru_ after golf and that was actually a really well-done movie. Sometimes simple kid's movies with good animation and family-friendly jokes are all you need. Might as well get used to watching kid's movies again 🤣.\n\nWhen I was showering after Golf today I was thinking about how Ethereum is to Bitcoin what silver is to gold. Only one thing can truly win out as money and of course central banks didn't end up valuing silver like they did gold. While a lot of B.S has been pulled to suppress gold's price it is still considered money to most; a good you can exchange for almost any other good. Silver was adopted as a sort of money by the market because people couldn't just trade a full gold bar for a sandwich so the free market needed something of less value to trade for smaller goods. Now think about Ether which is used for jpeg pictures of animals, to make shitcoins, or write smart contracts. I know Bitcoin just had taproot come online which might be able to do some smart contract-type stuff. Not sure how it plays out exactly over the long haul but I think Eth will continue to be used for less important things like showing proof of ownership for monkey jpegs and other stuff while Bitcoin will become money. This is not to shit on Eth or say it will fail. Just pointing out that in 10–20–30 years it will not be anywhere near as valued as Bitcoin which I believe will win out as a medium of exchange, store of value, and unit of account in the free market.\n\nTo some people, I think Eth could serve the function of dealing with the smaller stuff like tokens for play-to-earn sites or a test layer for complex smart contracts. I just don't think Eth could ever take the placeholder as global money as Bitcoin can. The free market always picks the best form of money over long periods of time. The silver-gold metaphor isn't perfect and cyber money can be divided unlike metals ever could so who knows exactly what Eth is used for if it sticks around. It is fitting that Eth's gray looks like silver and Bitcoin's orange is more goldish.\n\nMetaphors are good shit. They help us compare stuff and understand ideas better. A good quote I saw [commented](https://www.linkedin.com/feed/update/urn:li:activity:6951352392038723584?commentUrn=urn%3Ali%3Acomment%3A%28activity%3A6951352392038723584%2C6951359023346581504%29) on Jimmy Song's LinkedIn post,\n\n> I can't claim to know perfectly, but the way the story seems to go is thus:\n\n> Once upon a time, Satoshi Nakamoto said: \"I'm sure that in 20 years there will either be very large transaction volume or no volume\" referring to Bitcoin. Thus altcoins were born as everyone was ready to compete on fair grounds to become the best most widely adopted money. Bitcoiners loved it. Bitcoiners were also altcoiners. No one really felt like they knew who would win in the end.\n\n> There was still ridiculousness of course, dogecoin was invented at this time afterall, an altcoin to make fun of altcoiners, but still there was a sense that at least some projects were seriously trying to compete on merit.\n\n> Then, came Ethereum and altcoins no longer focused on being money. All the competitors to Bitcoin fell off to the wayside. Bitcoin had won, no one is trying to be money anymore. The ridiculousness increased. Coins that enabled the easy creation of new coins were created and coins were being made out of the pure sake of making coins. When the bear market hit, this large base of new onboarders understood that only one coin mattered. The one that lost them the least amount of money at this time, Bitcoin.\n\nMan do I love me some 🌽\n\n7/9/22\n\nConor Jay Chepenik",
  "wordCount": 733,
  "readingTime": 2.966037735849057,
  "claps": 0,
  "voters": 0
}