{
  "id": "b59e10af5308",
  "title": "Day 625",
  "createdAt": "2023-12-08 04:41:11",
  "tags": [
    "bitcoin",
    "economics",
    "jamie-dimon",
    "elizabeth-warren",
    "god-bless-the-usa"
  ],
  "url": "https://chepenikconor.medium.com/day-625-b59e10af5308",
  "content": "# Day 625\n\n**The Price Of Progress**\n\nImagine a world where the gadgets and gizmos we covet don't just magically appear on store shelves but evolve through a fascinating dance of economics. It's a world where each tick of the clock and each leap in technology nudges prices downward, like leaves gently falling to the ground in autumn. This is the realm of deflation, a concept that economics whispers to those who listen.\n\nYou see the marginal cost of production plays the lead role. It's the cost of breathing life into one more unit of whatever treasure we desire, be it a smartphone or a solar panel. As our technological prowess grows and our processes sharpen, producing that extra unit becomes less and less expensive.\n\nIt's like a skilled baker who, over time, finds quicker and more efficient ways to bake a perfect loaf of bread. Now, imagine the journey of electronics, once a luxury for the few, now a staple for the many. Years ago, creating these marvels was an expensive odyssey. But as our knowledge expanded and our factories grew smarter, the cost tumbled down a hill, making these devices accessible to more people.\n\nThis isn't just a win for the consumers, who now wield the power of technology in their palms; it's a testament to the relentless march of progress. This story of deflation and marginal costs isn't just a dry economic theory; it's a narrative of human ingenuity and its gifts to society. It's about how the relentless pursuit of efficiency and innovation turns yesterday's luxuries into today's commodities, expanding our horizons and enriching our lives.\n\nHowever, this natural deflationary trend is often disrupted in our current economic system, largely due to the fractional reserve banking system. Under this system, banks are only required to keep a small fraction of their deposits in reserve, allowing them to lend out most of the deposited money. This practice significantly increases the money supply, leading to inflation rather than deflation.\n\nImagine a world where an ever-growing stream of money chases a limited bounty of goods. In this world, the inevitable result is a climb in the prices of these coveted items. This phenomenon, known as inflation, acts like a silent thief, gradually eroding the purchasing power of money. It's a relentless tide that keeps prices afloat, preventing them from gently descending to their true cost of production. At its heart, inflation is a story of money's abundance distorting the natural rhythm of pricing, like an overeager conductor rushing the tempo of an orchestra.\n\nThis background knowledge is essential to highlight that in a genuinely free market, monopolies cannot maintain control indefinitely. Competition and innovation continuously challenge market leaders, preventing them from setting artificially high prices. If an entrepreneur sees an opportunity to make a profit, they will enter the market and compete to disrupt the monopoly. However, current market conditions are often distorted by regulatory barriers and government interventions, which can inadvertently protect monopolies or oligopolies.\n\nConsider Jamie Dimon, the CEO of JP Morgan Chase, a titan in the traditional banking world. Dimon, with his sharp, discerning eye firmly on the financial horizon, has never shied away from expressing his deep skepticism about Bitcoin. \"I've always been deeply opposed to crypto,\" he asserted, painting a grim picture of its uses: \"the true use case for it is criminals ... because it is somewhat anonymous and you can move money instantaneously ... if I was the government, I'd close it down.\" While it would be nice if someone could explain to Jamie why Bitcoin is not crypto there is no guarantee Dimon would be willing to listen. Like the late Charlie Munger wisely observed \"Show me the incentive and I'll show you the outcome\".\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/TFTC21/status/1732451652635160776&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFor those who still have faith in the Ponzi scheme that is fractional reserve banking, they may see Dimon as a guardian concerned about his customers. However, Dimon is more akin to a King who fears losing his throne. His rhetoric is less about an objective assessment of digital currencies and more a strategic chess move to protect the towering ramparts of traditional banking.\n\nAs we've pointed out earlier, no monopoly can maintain itself in a truly free market. a 'free market' isn't a lawless arena; it's like a football game where rules are essential, but the referees - in this analogy, the regulators - don't determine the game's outcome. Sadly, America's journey has veered off the path of its foundational principles and financial giants and political powerhouses often dictate the course of economic evolution.\n\nWith the emergence of Bitcoin, many in positions of power are scared. This new digital asset has stirred a whirlwind of debate, controversy, and, most intriguingly, unlikely alliances. At the heart of this financial drama are two pivotal figures: Jamie Dimon and Senator Elizabeth Warren, a voice often heard on the progressive side of politics. Their joint stance against Bitcoin isn't just a superficial alignment. It represents a deeper narrative, one interwoven with personal interests and political maneuvering. More significantly, it's a direct challenge to the principles of democracy and innovation, questioning the very framework that has made the United States such a powerful country.\n\nBitcoin represents a paradigm shift towards a more open and competitive market. It operates on a decentralized network, free from government control and manipulation, ensuring a level playing field. In a Bitcoin-dominated economy, the natural deflationary trend could be restored, as the limited supply of Bitcoin counters the inflationary tendencies of fiat currencies, promoting fairer and more competitive market conditions.\n\nThere is no denying what attracts most people to Bitcoin is the number go up technology of 1 bitcoin being worth more fiat in the future. However, there is also a case to be made that Bitcoin can make war unaffordable. For example, there is no way [Congress could send over 75 billion to Ukraine](https://www.cfr.org/article/how-much-aid-has-us-sent-ukraine-here-are-six-charts#:~:text=Since%20the%20war%20began%2C%20the,Economy%2C%20a%20German%20research%20institute.) if they had to tax the population for that money. Luckily for the U.S government they have a money printer. Bitcoin fixes this. Good luck taxing Americans directly to send taxpayer money to fund wars which are not popular with the public.\n\nNo wonder Bitcoin is being bashed by powerful people. Senator Elizabeth Warren, known for her opposition to big banks, ironically shares the same view about Bitcoin as Jamie Dimon. Her crusade against Bitcoin, which might initially appear as a knight's charge for consumer protection, is clearly more politically motivated than genuinely consumer-focused upon closer inspection.\n\nThe campaign waged by Dimon and Warren against Bitcoin is not just a financial tug-of-war; they are striking at the heart of privacy and freedom - principles that form the bedrock of the US Constitution. Their stance overlooks Bitcoin's potential to financially empower individuals and tread on rights to privacy and property.\n\nThis alliance between a banking giant and a political figurehead also casts a long shadow on the free market. The notion of a free market is predicated on competition and innovation, yet here we see a convergence of forces seemingly aimed at maintaining a monopolistic grip over financial systems. This contradiction should raise eyebrows and make people really consider if we have a truly free market, or if it is a stage managed by those holding the reins?\n\nThere is an old saying \"the enemy of my enemy is my friend\". The collaboration between Jamie Dimon and Elizabeth Warren is a fascinating study in contrasts and converging interests. On the surface, they are unlikely comrades-in-arms, but their joint opposition to Bitcoin peels back layers to reveal a shared agenda: to preserve their respective spheres of influence. This partnership, traditionally unheard of between a Wall Street titan and a progressive senator, betrays a deeper self-interest.\n\nAs the curtain falls on this act of the financial drama, what becomes clear is that the efforts of figures like Dimon and Warren to regulate or ban cryptocurrencies are less about public protection and more about self-preservation. In their shadowboxing with digital currencies, they inadvertently pose a threat not just to financial innovation but to the very freedom and empowerment that Bitcoin promises. The real question then emerges: Are we witnessing a defense against criminality and instability, or a veiled crusade against the winds of change that threaten established bastions of power and influence? One must note that it is ironic to hear Jamie Dimon bash about the illicit use of Bitcoin when JP Morgan was banking Jeffery Epstein.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/MartyBent/status/1732453875624415579&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nBitcoin represents a peaceful revolution in the digital age, akin to a declaration for granting rights comparable to those enshrined in the U.S. Constitution for the people of the United States. It's a beacon of financial autonomy and transparency in an era where leadership can sometimes be less than forthright. When faced with leaders who discuss banning such competition, it's prudent to apply common sense and look beyond their self-serving rhetoric.\n\n![](https://miro.medium.com/0*E647zeuRR9VMdHnY)\n\n12/7/23\n\nConor Jay Chepenik",
  "wordCount": 1486,
  "readingTime": 5.807547169811321,
  "claps": 3,
  "voters": 1
}