{
  "id": "b5bf0f4b68ad",
  "title": "Big Vibes In The Big City",
  "createdAt": "2021-11-19 22:28:58",
  "tags": [
    "new-york-city",
    "comedy",
    "fi-di",
    "binmucker",
    "vibes"
  ],
  "url": "https://chepenikconor.medium.com/big-vibes-in-the-big-city-b5bf0f4b68ad",
  "content": "# Big Vibes In The Big City\n\nLast weekend I had the opportunity to go visit my old roommate and fellow Tuft's football defensive linemen, Bom Taker, in New York's financial district or as he called it \"FI-DI\". Something about the big apple is so surreal. It's exciting, scary, and humbling to walk through the streets of Manhattan and see Skyscrapers surrounding you. I've heard people call NYC the city that never sleeps, but until I got to visit NYC as an adult with some actual spending money I had no clue this was actually the case. The first night in the city we went to some 2000's rock concert which was fun but so packed in a random basement I could barely move. We followed this up by going across the street to some late-night bar getting more drinks then ended the night in FI-DI playing chess only to pass out after I botched any easy win to my other fellow defensive linemen, Q. Woke up 4–5 hours later hit a nice long walk and started drinking again a little after 1 o'clock when we were forced to go into the closet bar (a pretty cool Irish one) because a hail storm started and we didn't want to remain outside. Pretty crazy that we ended up experiencing a hail storm in New York of all places. The first time I ever experienced a hail storm and I can confidently say it wasn't pleasant.\n\nOnce the storm stopped the day drinking continued and we ended up meeting multiple friends from college in midtown because multiple people we knew from college also moved to New York. It turned out to be a very enjoyable day and when the night rolled around we hit up a comedy club. This was one of the coolest experiences I've ever had watching stand-up comedy. While it was not my first stand-up show it was definitely my favorite. Shout out [The New York Comedy Club](http://newyorkcomedyclub.com). The comedians were awesome and I have so much respect for the art of stand-up. Anyone who is hesitant to call stand up \"art\" I encourage you to go watch a live show. These people have to feel out the crowd, feed off the energy in the room, and adjust their jokes accordingly. I'm sure some crowds are better than others which makes the life of a comedian easier when the crowd is electric, but still, it's no easy task to get in front of a group of people who paid money to see you and make them laugh at your jokes.\n\nI ended the weekend on a casual note by visiting some family on Sunday because I was exhausted and did not want to drink anymore. I tell you what though: the city is enthralling. Even visiting family and seeing the views from my Aunt's apartment was so cool. Sipping black coffee, eating eggs benedict (something I never eat but had to in New York bcuz boujee) was incredible. I love the internet very much. It has brought me so much enjoy and also polarized me in ways. Overall though it's done incredible things for me. I bring this up though because nothing compares to going out and experiencing life in other places. Something so incredible about traveling, especially to large metropolitans. So much to do, so much to see, and so little time on this earth. Enjoy every second anon because as they say \"The days are long and the years are short\". Before we know it we will be dead and gone so leave the world a better place than you found it.\n\n11/19/21\n\nConor J Chepenik",
  "wordCount": 614,
  "readingTime": 2.3169811320754716,
  "claps": 5,
  "voters": 1
}