{
  "id": "b6fec02d3822",
  "title": "Day 58",
  "createdAt": "2022-05-19 21:07:05",
  "tags": [
    "the-mandibles",
    "the-fed",
    "teaching",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-58-b6fec02d3822",
  "content": "# Day 58\n\nSurgery takes it out of you. I'm sore and exhausted, but happy to have some time off work. In no position to leave my house, but I can play online, write, and read good books. I'm almost done with T_he Mandibles_ by Lionel Shriver. Incredible book and one that could possibly play out if we don't see a Bitcoin Standard adopted globally in the coming years. The whole premise is the demise of the United States after we default on all of our debt. The book also points this out, but it's funny how many seem to think that U.S debt is owed to other countries. While a lot of it is a big portion of U.S treasuries is held in traditional retirement accounts owned by U.S citizens. Thus, both citizens and other countries will be screwed out of trillions if the U.S ever defaults. Not something I want to see happen, but god damn is our debt getting big. On the one hand, we can print as much money as we need to pay it off, but this has horrible second and third effects. Thought this meme I made today was pretty funny.\n\n![](https://miro.medium.com/1*_MB4_dr0H3ErDyi40t3DMw.jpeg)\n\nI've also been able to make some good progress on that paper I'm writing for Bitcoin Magazine. Still needs some work, but excited to share it with the editors over there and gather their thoughts. Writing about Bitcoin is a lot more fun than writing about stuff I don't particularly care for. Our school system would be a lot better if we optimized to let kids learn about stuff they are passionate about. I understand that children will have many fads, but this whole one size fits all teaching is not it. I'm also not a teacher and understand that it is not easy to make a lesson for 20 small children full of energy. I just think we could create a much better world if we focused on things that got children excited to learn rather than taught them how to be good obedient little servants who sit and stare for 8 hours a day. Anyways, that is all I'm writing for today. Need some more rest and recovery. Plus, I've been editing and rewriting parts of the essay I'm calling _Pick Your White Paper Wisely_ so I'm tired of writing. Until tomorrow anon ❤\n\n5/19/22\n\nConor Jay Chepenik",
  "wordCount": 396,
  "readingTime": 1.6943396226415093,
  "claps": 0,
  "voters": 0
}