{
  "id": "b7248c96ecfa",
  "title": "Day 206",
  "createdAt": "2022-10-14 21:19:07",
  "tags": [
    "atlanta",
    "estate-planning",
    "seminars",
    "bitcoin",
    "bitcoin-conference"
  ],
  "url": "https://chepenikconor.medium.com/day-206-b7248c96ecfa",
  "content": "# Day 206\n\nThis morning I attended The Atlanta Bitcoin conference again. I've enjoyed todays conference especially because I got to hear more seminar style events with people just talking. Not that I didn't enjoy the technical demos but it was nice to sit through some podcast style conversations. That is what most of these seminars felt like to me anyways: in person podcasts. One that really stood out to me was the financial planning one which happened to be the first seminar I attended. There were some pretty notable names in the Bitcoin space talking including Josh Jalinski, Justine Harper, Jared Pierce, and Terrence Yang. They spoke about inheritance planning and what to do in the off chance you die and your Bitcoin (amongst other assets) needs to be passed on to your family. As a 25 year old I have not spent much time thinking through this. I don't exactly have a massive net worth so it has never been a pressing topic for me. One thing I learned today that I have not been able to get out of my head is that if you don't plan it will cost your family at least 25k in probate to figure out what to do with your financial assets. This is absolutely wild. 25K is the number Jared Pierce mentioned his law firm charges clients who hire them to figure out someone's estate if that person didn't do any planning for their assets after death. 25K being the minimum not the maximum. It sounds like it could get a lot more expensive for high net worth individuals with many different heirs to their fortune.\n\nThe speakers did a great job mentioning some of the tools out there available to help like charitable trusts, and other things. It was also funny hearing them recognize that many Bitcoiners have this F*** the state mentality and don't want to deal with estate planning. I appreciated the fact that these panelists recognized the Bitcoin ethos but also pointed out that while us Bitcoiners might be die hard freedom maximalists are spouses and extended family might not have the same knowledge and skillset about Bitcoin. Thus, in the unfortunate event we do pass away we could save a lot of headache for our partners and families by being proactive about our estate plannings. Everyone's situation is different and while some couples might trust their spouse to go ahead and share private keys other couples might not understand how to use private keys. I'm going to think through these things and look into setting up an estate plan. The speakers mentioned this is especially important if you have children so soon enough here this will be highly relevant to myself. Hopefully I can live to an old age and see my child grow up but god forbid if something happens I want to make sure she is provided for until she can become an independent adult.\n\nAnother interesting panel I sat through was discussing how to build a Bitcoin company. There are many challenges and legal requirements that many do not think through when spinning up a Bitcoin LLC. I can tell there are more resources than ever and many funds starting to become Bitcoin only which is fantastic. It's also becoming an increasingly hostile environment with many lawmakers trying to regulate something they just don't understand. One thing that gives me hope came from the CTO of _Noah._ who is named Hussein Badakhchani. He mentioned that it's very important we get politicians to recognize Bitcoin from the bottom up rather than just throwing money at lobbyists. This got brought up in the first place because someone asked what good does it do (and how much money would it require) to hire lobbyists to support Bitcoin when the big banks, like big tobacco, and many other industries already pay millions, if not billions, of dollars to lobbyists every year to support their own agenda. Hussein pointed out that the more people we can get to adopt Bitcoin will end up becoming the next set of swing votes for politicians. Thus, over time politicians will come to realize if they oppose Bitcoin with their policies they will lose millions of voters and if they support it they will gain millions of voters. I have no clue how much money it would take to lobby D.C for pro-bitcoin regulation that separates Bitcoin from the broader crypto space rife with unregistered securities. I also think the S.E.C has done very little to protect investors and instead is on a manhunt to regulate through litigation. It ultimately doesn't matter that much though if we can get more and more people to adopt Bitcoin because Bitcoiners can become the next swing vote.\n\nI truly believe over a long enough time horizon the countries that embrace Bitcoin will thrive while the countries that oppose it will limp along with their shot up foot that they shot themselves. I agree with Hussein that the best way to drive positive Bitcoin policy is to get as many people to adopt it as possible. I also believe that for my own families sake it would do them well to take advantage of the estate planning laws out there so they don't have to pay a law firm 25k or get squeezed by the state every year via an audit because I wanted to go full cypherpunk when my family wasn't ready for that yet. I'm glad my girlfriend believes in Bitcoin but she is nowhere near as obsessed as I am and I know that it is not worth trying to skirt the state and give her all my private keys. I would just be better off getting in a tax advantaged estate and having a third party handle the passing down of my wealth in a way that minimizes the amount that will be lost to third parties.\n\nOverall, today was a great reminder that every situation and decision has many tradeoffs. While it's impossible to pick the perfect one it is a great start to begin thinking through what's important for your own situation and what tradeoffs you are willing to accept. After attending TABconf I can confidently say many Bitcoiners are light years ahead of no-coiners who don't think about any of this stuff as the state steals their money via both taxation and inflation. Maybe I'm being harsh because there are clearly some brilliant no-coiners out there still. I'm just saying if we are generalizing and you took 100 random Bitcoiners and 100 random no-coiners I'd be willing to bet a big portion of my own stack that the Bitcoiners spent a lot more time thinking through all of the tradeoffs I've written about above. 🤣🤝\n\n![](https://miro.medium.com/0*Kr5aJbCL4E6fJCj9)\n\n10/14/22\n\nConor Jay Chepenik",
  "wordCount": 1133,
  "readingTime": 4.475471698113208,
  "claps": 0,
  "voters": 0
}