{
  "id": "b793a4113fc6",
  "title": "Day 245",
  "createdAt": "2022-11-22 17:01:56",
  "tags": [
    "steve-jobs",
    "tools",
    "humanity",
    "pennywise",
    "michael-myers"
  ],
  "url": "https://chepenikconor.medium.com/day-245-b793a4113fc6",
  "content": "# Day 245\n\nSteve Jobs nailed it with this one. Man isn't some incredible animal because of our strength or physique. We are the most powerful species on the planet because of the way we harness tools.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/colecalfee/status/1594816105138331673&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nTools can be used to free us or enslave us. We need to work hard to make sure they are used for the former. The internet is subsidized by the ad revenue model and it seems to me this results in a lot of companies being motivated to do everything they can to keep us scrolling on their application. Building tools that prioritize keeping people's attention at all costs doesn't seem to be something that is helpful for personal freedom. I'm encouraged to see Elon try and let the content creator monetize their Twitter and charge 8 bucks for the service so they can move off the advertising revenue model. Like anything this change won't happen over night but it appears to me that it is a step in the right direction. If the product is free then it is likely that you are the actual product. (Think 99.9% of social media platforms)\n\nI have not listened to the Lex Fridman Podcast in awhile but I thought this conversation with Chamath was eye-opening. Went for a walk and learned a lot about professional investing this morning.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F5ERMYzdlZFDPyQ71IqoNCo%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F5ERMYzdlZFDPyQ71IqoNCo&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f563ebb538d297875b10114b7&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nChamath thinks the next two big things are going to be content creators monetizing themself online which fits right in with what Elon is doing. He also think that AGI (Artificial General Intelligence) will become massive and algorithms will be created to recommend even more personalized content to the end user. The example of the top of my head is you get in your Tesla and it drives you to a restaurant you don't even know about because the AGI knows what you like, where you often eat, and why this restaurant is right up your alley. I think this could be incredibly useful and also kind of scary. Imagine how naked people are going to feel without their AGI when they get accustomed to it. I mean just think about how it feels now when you don't have your phone on you in public. Our phones are already super customized and from what I heard in this podcast it sounds like AGI could take the customization to another level. Which in some ways sounds great and in other ways I feel like you miss out on cool experiences like just blindly wandering a city and stumbling upon an amazing whole in the wall food venue. Then again, that is already kind of lost for the majority of people since we all just pop open our maps app and look for restaurants with good reviews on yelp when we get hungry. The world is changing wether we like it or not.\n\nFinally, I'm going to end this post with some comedy. I think I might have shared this video in a much earlier medium but it cracks me up so it's worth sharing again.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/gritcult/status/1594988791969861632&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n\"Pennywise talking about OHHH I'M BIG TIME...YOU LIVING IN THE SEWER! My condo is 4800 a month you not moving like me\" Man I love a good joke.\n\n11/22/22\n\nConor Jay Chepenik",
  "wordCount": 539,
  "readingTime": 2.0339622641509436,
  "claps": 0,
  "voters": 0
}