{
  "id": "b7c408eb80c9",
  "title": "Day 646",
  "createdAt": "2023-12-29 02:42:39",
  "tags": [
    "democracy",
    "truth",
    "fear",
    "doomers",
    "trump"
  ],
  "url": "https://chepenikconor.medium.com/day-646-b7c408eb80c9",
  "content": "# Day 646\n\n![](https://miro.medium.com/0*3rCqOiV5WJjJBFmU)\n\nToday I was reading about how the greatest war time leaders were those willing to lead from the front. People are naturally driven by self-interest, and the most effective way to inspire is by setting an example. Anyone can bark orders, but it takes a true studmuffin to command while actively engaging in combat.\n\nAnother insight I gained from the book WAR by Robert Greene highlights that men will fight significantly harder when they are faced with a binary choice: fight or die. Sun Tzu seemed to be the one who originally wrote about this. The same principle can be applied to the business world. When the only options are triumph or downfall, individuals are more likely to push themselves to the limits of their capabilities. When failure is not an option strong men don't fail.\n\nAnyways, might be a good time to be reading about war. Given that algorithms often curate the content we consume, it's wise to maintain a healthy dose of skepticism. The internet, while a treasure trove of fascinating and wondrous information, also harbors a darker side, brimming with disturbing and unsettling material. Of course people have been spreading fear to manipulate others long before I was born and they will continue to do so long after I am gone. That said, it's truly astonishing to witness the events unfolding in our world today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/MaajidNawaz/status/1740407495326040486%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWell with just over a year until 2025 things are getting spicy. After the Colorado supreme court voted to remove Trump we now have Maine following suite. Except, as I understand it so far, it was the secretary of state who made the decision? I don't know how that is possible but I hope the supreme court takes this up ASAP and gets this situation corrected.\n\n> [**Maine kicks Trump off ballot under 14th Amendment**](https://www.politico.com/news/2023/12/28/maine-kicks-trump-off-ballot-under-14th-amendment-00133294)\n\nHere is a direct quote from the article.\n\n> Unlike the Colorado ruling, this one comes from an individual officeholder affiliated with the Democratic Party. And Maine, unlike Colorado, has been a presidential battleground in recent years; under an unusual state law, it cast one of its Electoral College votes for Trump in both 2016 and 2020.\n\nThere is only so much I can change. Worrying about these things is trivial in some ways because I am not working in law or on the supreme court. Seeing this though is a good reminder to get my shit in order. I'm very hopeful that the fear porn and doomers are wrong. Yet, it is better to be prepared and not need the prep than it is to be caught wishing you had been prepared.\n\n2024 is going to be an amazing year. I'm confident of that. It feels surreal be living through such historic times. I plan on leading from the front and doing everything in my power to make sure my family is provided for. I know algorithms are influencing everyone who uses social media so I am hoping and planning for the best but also prepping for civil war 2.0 just to have some peace of mind😂\n\nI'll end this with a cool picture I had chatGPT generate for me because focusing on the positive is based. For this image I asked GPT's Dalle to visualize a DMT trip.\n\n![](https://miro.medium.com/1*cdYdYbFix_1MppMzBv15mQ.png)\n\n12/28/23\n\nConor Jay Chepenik",
  "wordCount": 567,
  "readingTime": 2.5229559748427675,
  "claps": 3,
  "voters": 3
}