{
  "id": "b7edea4a04a6",
  "title": "Day 7",
  "createdAt": "2022-03-30 03:05:57",
  "tags": [
    "clown-world",
    "clothing",
    "mindset",
    "bitcoin",
    "bad-advertising"
  ],
  "url": "https://chepenikconor.medium.com/day-7-b7edea4a04a6",
  "content": "# Day 7\n\nThere are few things I like better than putting on comfy clothes. However, dressing up nice always makes me feel more productive. It's amazing the difference in mindset that arises from the simple act of clothing ourself. On the one hand, if I put on sweats and a baggy long sleeve the majority of my day is likely getting spent on the couch listening to bitcoin podcasts and playing PGA 2k21 or whatever video game has my attention at the time. If I throw on a nice shirt and pants usually I'm more motivated to work on productive tasks. Growing up I despised getting dressed nicely. It seemed like a bunch of work for clothes I was going to rip off the second I no longer needed to wear them. This changed when I realized 99% of people judge a book by its cover.\n\nOur world is changing fast and it's amazing to see the dynamic tension between clown world and the decentralized one emerging. Everyday people can make ridiculous claims online and waste [5 million on the dumbest ad campaign](https://twitter.com/chrislarsensf/status/1508657053442580480?s=20&t=k8MAbGN2skVrQ9j0Gf-fEg) I have ever seen. Historians will look back and laugh at Chris for being so naive or be in awe of the guys frugal attempt for more control under the guise of morality. Either way 🤡 🌎  doesn't seem to disappoint.\n\n![](https://miro.medium.com/1*pvxDQucAJaXUi5GtKxT2qA.jpeg)\n\nWhen Will Smith slapped Chris Rock I legitimately thought to myself \"wow not sure what's going to top that this year\". It took one day for me to see something that topped it. The founder of Ripple claiming bitcoin needs to switch to proof of stake is asinine. I know very little about Chris Larsen, but I don't understand how he became that successful. (if you consider wealth earned a proxy for success which for better or worse most do in the United States) I really believe for anyone to have studied bitcoin for at least 1000 hours they would understand why proof of work is crucial. If someone puts in 1k hours and doesn't think P.O.W is critical to bitcoin they have likely fallen prey to a Psy-Op, not studied long enough, or are disingenuous. Anyways, can't wait to see what you bring tomorrow 🤡 🌍  . Underestimating you I will not.\n\n3/29/22\n\nConor Jay Chepenik",
  "wordCount": 382,
  "readingTime": 1.641509433962264,
  "claps": 0,
  "voters": 0
}