{
  "id": "b8284fa0bb3d",
  "title": "Day 74",
  "createdAt": "2022-06-04 15:07:27",
  "tags": [
    "small-business",
    "littleton-nh",
    "cantillon-effect",
    "change",
    "pride"
  ],
  "url": "https://chepenikconor.medium.com/day-74-b8284fa0bb3d",
  "content": "# Day 74\n\nLittleton has not disappointed. This town has an incredible charm and everyone is so friendly. Went and got breakfast at a little diner called The Coffee Pot and the food was incredible, the service was fantastic, and it only cost 23 bucks after giving the waiter a 5$ tip. It usually costs me at least 40 after tip to go eat breakfast anywhere in Boston. Wild how much more expensive food in the city is considering that the small town food was much better. I'm leaning on moving to a small town when my lease in Cambridge is up in April. I want to be a part of a nice community and have space for a garden. I'd also like to have the peace of mind to go let my child play outside knowing they won't be harassed by a homeless person. Boston is a great city and I will always have a lot of love for the time I spent there, but I think my time is up come the end of my current lease. Check out these photos I got of Littleton.\n\n![](https://miro.medium.com/1*nOeotLiK_-zI6uYa0MbUSA.jpeg)\n\n![](https://miro.medium.com/1*AAc3GtYr-wx4kI6qXsIdMg.jpeg)\n\nSuch a peaceful town. It is amazing walking around downtown and seeing all these unique small businesses. Of course, there are some franchises like Dunkin Donuts around Littleton, but for the most part, it is random small businesses. Boston seems to be increasingly commercialized. Don't get me wrong, I drink way too much Starbucks burnt coffee, but that is because it is the easiest and most convenient coffee to get. I'm also not proud to admit I am a sucker for their rewards program lmao. I much prefer unique little coffee shops. I think franchises lose a lot of the charm that makes small businesses so great. For example, when I used to work at Reveneer there was this Indian place called Punjab my coworkers and I would fancy. Pretty sure I've written about this spot in previous posts, but my brain always goes back to it when I think about the difference between a franchise and a small business. The owner was so nice and one of my coworkers, Dave, would always speak to him in their native language. The owner loved us and would always hook us up with delicious food. It felt good supporting local businesses and I'm confident that no Indian restaurant franchise could match the experience. I'm not sure how many Indian franchises there are, but comparing Punjab with the days I would go to Chipotle it was such a different experience. Workers at franchises typically could care less. I once had a Chipotle employee literally take steak out of my bowl after putting it in. Even if she gave me a bigger scoop than she was supposed to WTF! I'm a big dude who likes to eat. Legit have not been back to Chipotle since that day. It was such a small thing, but it irked me beyond belief. I think I want to open my own small business in a quaint town so I can get to know the locals and take pride in the food I offer. Incentives are everything and someone who owns their own restaurant is likely to care a lot more than someone who is franchising a restaurant. (Except maybe...keyword maybe Chick Fil A. Something about Chick Fil A always makes it a nice experience. Maybe it is the Christian values that make kind people want to open Chick Fil A franchises. I do appreciate how kind the workers are.)\n\nAlso the quality of the goods. So much shit on Amazon is cheap Chinese plastic trinkets. Since getting into Bitcoin I've really tried to hold off on purchasing stuff from massive businesses like Amazon. I did order a bidet which is a cheap piece of plastic, but very handy for cleaning myself. I've also ordered many books because of the convenience, but whenever I visit a cool small business, book shop, or antique store with unique trinkets I'm reminded of how much better quality the stuff is. Antique stores are badass because most stuff is made with glass instead of plastic. Came across a dope golf club bottle opener in one of the stores my girlfriend and I checked out today. I don't need a bottle opener because I already have one on my keychain, but I was tempted because it was a really nice and unique golf club opener.\n\nIn short, I think small businesses should be the backbone of America and I wish our government was doing stuff to prop them up rather than printing trillions which benefits the massive companies since they can get fresh access to the printed money for cheap since people are confident to lone to them. I don't how this plays out over the coming years, but I think the lower and middle class would benefit tremendously if small businesses made a roaring come back. What's the saying? Be the change you want to see in this world:D! I need to take that advice to heart. I am glad the 3000+ person company I work for pays me well, but I don't feel very much pride whenever I make a sale. It is a short-lived rush when I convince someone to take a meeting. Thus, I will start to think more about what type of business I want to open, where, and how I can make a positive impact on the community I decide to settle. Life is short and I understand I have to grind in my early years, but it's a lot easier to not get burnt out when you truly care about the work you are doing.\n\n6/4/22\n\nConor Jay Chepenik",
  "wordCount": 949,
  "readingTime": 3.9644654088050313,
  "claps": 0,
  "voters": 0
}