{
  "id": "bc36f14907e",
  "title": "Day 188",
  "createdAt": "2022-09-27 00:49:32",
  "tags": [
    "eth",
    "btc",
    "bulls",
    "breedlove",
    "jason-lowery"
  ],
  "url": "https://chepenikconor.medium.com/day-188-bc36f14907e",
  "content": "# Day 188\n\nWent for a lunch time walk and Jason Lowery gave me one of the coolest and funniest insights I've had in a long time. While talking with Robert Breedlove on The What Is Money show he made the point that if you take an Apex predator type species and put them in a cage where they can't impose their physical power on other animals they become weak and docile. Lowery made this point after being asked what he thinks the downfall of proof of stake will be. This immediately made me think of Bitcoin Twitter vs Crypto Twitter. It also brought to mind Vitalik's April fools post.\n\n> [**In Defense of Bitcoin Maximalism**](https://vitalik.ca/general/2022/04/01/maximalist.html)\n\nMost Bitcoin maxis are happy to \"lash out\" and speak their minds. I think this for the most part is great. (I do appreciate Saylor's point of you don't tell a billionaire have fun staying poor if they express a slight interest in Bitcoin but this is usually not the case on Twitter) Maixs get a lot of shit but its because they feel confident in their assertion that Bitcoin is the Apex Predator money. People in the broader crypto/web 3 space are more concerned about ~the vibe~ and building a community. A lion doesn't ask other animals how it feels or if they want to build a community. It takes what it pleases and does what it wants to do. If it feels threatened it will impose its will on whatever is threatening it.\n\nThis is also quite a stretch of a metaphor but I just found it so fitting that after Eth switched to proof of stake how ironic it is no one is complaining about Eth Maxis (as far as I can tell). Bitcoin maxis are much more aggressive and quick to hurt other peoples feelings because they know there will be very minimal consequences for pushing people away from Bitcoin. While I do like the idea of bringing in as many people as possible, pain will do that over a long enough time horizon. Ether is in a very different boat. The communities and \"the vibes\" are used to draw people in. Over a long enough time horizon my guess is it will crash and burn like our current fiat system is experiencing now. Maybe I'm wrong but I was laughing so hard when Jason made this point because it immediately reminded me of how much more docile crypto people are compared with true Bitcoiners.\n\nI'm proud to be part of the Bitcoin community and I would rather be peers with those who will tell me the hard truth regardless of how it makes me feel vs those who would lie to me to either A. Exploit me or B. Because they don't want to hurt my feelings. Only time will tell how it plays out but I tend to side with Jason and Robert that switching to proof of stake was a bad move. Proof of work is the creation and like they mentioned in the podcast you can't put gun powder back in the proverbial bag, you can't put air travel back in the bag, and you sure as hell can't put Bitcoin back in the bag. The future is bright thanks to Satoshi Nakamoto!\n\n![](https://miro.medium.com/1*IR9KYAG-WjSivLZUqSFchQ.jpeg)\n\n9/26/22\n\nConor Jay Chepenik",
  "wordCount": 570,
  "readingTime": 2.3509433962264152,
  "claps": 0,
  "voters": 0
}