{
  "id": "bcef26934837",
  "title": "Day 618",
  "createdAt": "2023-11-30 20:52:09",
  "tags": [
    "x",
    "twitter",
    "gfy",
    "free-speech",
    "elon-musk"
  ],
  "url": "https://chepenikconor.medium.com/day-618-bcef26934837",
  "content": "# Day 618\n\nWatched Elon Musk tell advertisers to GFY if they try and blackmail him with money this morning. Mad respect to big bro.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F2BfMuHDfGJI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D2BfMuHDfGJI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F2BfMuHDfGJI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIt takes some serious brass cojones to stand up to companies (and the individuals running those companies) and say GFY I don't want or need your ad money. It really feels like the west is at a critical juncture and it's refreshing to see a high-profile business leader like Elon Musk take a stand against the pressure advertisers can apply to censor certain types of content or political opinions. Withdrawing ads has become a common tactic to financially squeeze platforms into removing controversial voices, even if no hate speech or illegal activities were involved.\n\n![](https://miro.medium.com/0*n1WBt86KoSuYTe1k)\n\nThis kind of economic coercion represents a worrisome trend that could have chilling effects on free speech. It encourages knee-jerk reactions around delicate or complex issues to appease the outrage-of-the-week rather than facilitating thoughtful debate and discussion. Over time, it can deaden discourse by eliminating ideas outside the mainstream consensus simply because they prove \"controversial.\"\n\nKudos to Musk for refusing to cave to such pressure tactics. While advertising revenue is the lifeblood of platforms like Twitter(now X), preserving the ideal of open discourse enables human progress. Throughout history, many groundbreaking innovations and social reforms began as unpopular minority perspectives, sometimes even deemed dangerous, before broader acceptance. A healthy society welcomes dissenting thought, guided by principles rather than raw economic threats.\n\nThis front in the culture wars really embodies deeper questions about pluralism, tolerance, and respect for divergent opinions in the modern public square. Here's hoping more leaders across industry and politics find the courage to push back against the creeping specter of enforced ideological conformity being foisted upon private discussion spaces by virtue signaling individuals who don't actually care about the greater good of society. The future of freedom, on both the left and right, depends on the 1st amendment. Like Elon said there is profound wisdom in the amendments of the constitution.\n\nMoreover, X's approach to monetization, with premium features like blue checks and the new AI model Grok, offers tangible benefits, making the platform attractive for reasons beyond the principle of free speech. Such a diversified revenue model not only resists external pressure but also enhances user choice, empowering them to support what they value.\n\nEconomic freedom forms the bedrock of all other freedoms. With Twitter's evolution into X, users can now express their opinions not only through words but also through their financial choices, rendering cancellation threats obsolete. This convergence of shared principles and shared profits sets the stage for the cultivation of vibrant communities that transcend mere profitability.\n\nMusk's vision of Twitter as a global town square, a hub for unfettered discourse and community notes as the tool to provide as much truth as possible, will likely be remembered as a pivotal moment in Western history. By empowering individuals to champion their beliefs and support the platforms they cherish, X/Twitter is poised to revitalize the spirit of the West and usher in a new era of open dialogue and collective action.\n\n![](https://miro.medium.com/0*fe72sHM3JA_SSJIe)\n\n11/30/23\n\nConor Jay Chepenik",
  "wordCount": 522,
  "readingTime": 2.3531446540880503,
  "claps": 0,
  "voters": 0
}