{
  "id": "bd0116256fcb",
  "title": "Day 403",
  "createdAt": "2023-04-30 01:27:50",
  "tags": [
    "low",
    "time",
    "preference"
  ],
  "url": "https://chepenikconor.medium.com/day-403-bd0116256fcb",
  "content": "# Day 403\n\nToday I saw that I had been paid for my labor via bitcoin. I'm not talking about 25 sats from a fantastic shitpost on Nostr, but an actual decent amount of bitcoin. It felt good.\n\nI started writing because it was something I enjoyed. Not something I felt obliged to do. There were no expectations to get paid for my work when I started writing. To be honest the piece of writing I got paid for I did not realize I was going to get paid for when I submitted it. So it feels truly euphoric to have my hard work rewarded. Find what you enjoy doing and do it.\n\nSimple advice. Of course there are days when I feel obliged to write this blog because if you don't feel writers block then well good for you. I get writers block all the time. Thus, I got in the habit of forcing myself to write. especially when I did not want to, because I knew I enjoyed writing and if I had to do it everyday I'd get better at doing it.\n\nA bit of an oxymoron there, but it's true. Just because you like doing something does not mean you want to do it everyday. The novelty can wear off. Take drinking, sex, video games, and a variety of other habits. Focus on the ones you know will make your life better in the long run, like running. Which speaking of I am also happy to announce I just hit 40 miles in April today. In the era of the internet sometimes I feel like I'm not doing enough. That's why it's important to remember that your greatest competitor in life is you. Comparing yourself to others is a fools game. It's never been easier to compare when you can check out other people's profiles, but it won't help you. Look how many people on the forbes 30 for 30 turned out to be frauds. Not all of them, but plenty have.\n\nKeep loving yourself anon. Keep trusting the process. Keep stacking those positive habits. There are plenty of things I need to improve upon but I can say that after over a year of writing everyday I've officially become a professional writer and that was something I did not expect. Have a low time preference and you will be blown away by what you can accomplish in life.\n\n4/29/23\n\nConor Jay Chepenik",
  "wordCount": 406,
  "readingTime": 1.5320754716981133,
  "claps": 0,
  "voters": 0
}