{
  "id": "bd1d4f4e87b9",
  "title": "Day 230",
  "createdAt": "2022-11-08 00:56:48",
  "tags": [
    "twitter",
    "kyc",
    "jordan-peterson",
    "social-media",
    "algos"
  ],
  "url": "https://chepenikconor.medium.com/day-230-bd1d4f4e87b9",
  "content": "# Day 230\n\nMan social media algorithms rule the world. Not literally but a big majority of what people see, hear, and think about stems from what their social media apps show them. It's important to remember it was other humans who built these apps and algos. It will be humans who have to undergo the hard work of fixing them.\n\n> And, for the any employees still at Twitter, don't underestimate the power of a pocket veto.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/stevekrenzel/status/1589700721121058817&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThis thread gave me a lot of hope. Thank you Steve for writing it. Had no clue who this guy was until he showed up on my feed because of the algorithims lol. This thread inspired today's post. Sometimes I'm like wtf why are these algos so good at making me scroll and deplete my dopamine. Other times I'm like damn I don't know what to write about why I don't I have a little scroll, BOOM! Just what I needed to write today.\n\nHahahahahaha life is a trip man. Don't take it too seriously because before we know it our life is going to be over. Have babies; pass on your legacy. In part I blame my Twitter algorithm for why my girlfriend is pregnant. Sloan if you ever read this know you were not an accident but you also weren't exactly planned. The algorithms had me worried I might be infertile. I definitely lurk in the parts of Twitter that are full of what NPCs would call \"conspiracy theories\". That said, I also saw a lot of these so called conspiracy theories turn out to be fact 6 months later. Luckily, my infertility was not one of them. The idea of not being able to have kids terrified me so I had to test out if I was infertile. I'm not and I'm excited to have a baby.\n\nSo yea. Don't underestimate the power of social media and algorithms. Be careful and curate your feed accordingly. Sometimes it can deliver miracles like having a kid. Other times it can drive you mad staring into the abyss. For example, Jordan Peterson is so wrong on this take. Twitter does not need KYC. I will say I like a lot of Peterson's work and I think he is a smart dude. I also think this one take in particular is asinine and homie needs to learn how to use the mute button or only turn on replies for people he follows. Know your customer laws would only make Twitter worse.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/_joerodgers/status/1587999654150537219&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThat's just one take though. No one is perfect and we all have bad takes. Hell we all have plenty of bad takes. I just bring this up because I know there are times when social media makes me feel crazy and clearly the same can happen for people who have become wildly successfully helping others. Don't forget the human is my point...I think lol. The bigger point is have fun and don't take stuff too seriously because before you know it you will be decomposed by fungus and if you're lucky you will have children to pass on your legacy. The circle of life baby.\n\n11/7/22\n\nConor Jay Chepenik",
  "wordCount": 526,
  "readingTime": 1.9849056603773585,
  "claps": 0,
  "voters": 0
}