{
  "id": "bde972d33268",
  "title": "Day 50",
  "createdAt": "2022-05-12 01:08:51",
  "tags": [
    "auditthefed",
    "rand-paul",
    "bitcoin",
    "life",
    "children"
  ],
  "url": "https://chepenikconor.medium.com/day-50-bde972d33268",
  "content": "# Day 50\n\nProof of work is an incredible thing. Feels good to write every day for the past 50 days. Lot of occasions when I did not feel like writing, but the work had to be done because I didn't want to break the chain. Hahahaha chain. Time chain, blockchain, habit chain; once you start putting the work in the less likely it becomes the chain will be broken. Nothing is guaranteed but Vince Lombardi said it best, \"The harder you work the harder it becomes to quit\". Same can be said for Bitcoin. The more people on the network who store their life value in the only blockchain that really matters the less likely it ever is to be broken. Loved this picture featuring a Greg Foss quote.\n\n![](https://miro.medium.com/0*vlvIug_Lh8clg79k)\n\nHad the pleasure of listening to Preston and Gigi chat it up while the market freaked out about Bitcoin dipping below 30k. This [podcast](https://open.spotify.com/episode/55m6b6F7qie94xbHUhXyeh?si=fG65lyReQzW8FX8cVR84mA) was incredible and I can't recommend enough. It can not be understated how important it is that a monetary network be built from the bottom up. Every time humanity has had a top down system of money those in charge abused their privilege. Saifedean did a great job talking about this in the Bitcoin Standard. Rome ultimately collapsed because they debased their currency. The British had a history of debasing their currency. Good ol America just sent 40 billion in freshly printed money to Ukraine that we don't technically have, but since we can print money out of thin air we do have. We need diplomacy, not debasement of the world reserve currency.\n\nGod bless Satoshi. My girlfriend keeps getting pissed because I can't stop joking about naming our child Satoshi. I understand two white people with a kid named Satoshi is unorthodox but I'm so happy that Mr. Nakamoto was able to create a form of money that seems to be changing the world for the better. It is truly incredible to see Bitcoin take hold in a bottom up fashion. No one is being forced to use Bitcoin, those who do just realize the current system is broken. To date there has been no way to debase the hard cap of 21 million bitcoin. I can run a node from my house and verify that the Bitcoin network has a fixed supply. No one can plug into the internet and just audit the Fed. That SQL database is controlled by those actually at the Fed and there is no way they just willingly give up that control so anyone with an internet connection can verify the legitimacy of their database without a third party. Bitcoin is such a beautiful thing and I'm honestly grateful the price is dropping. More sats for your boy and those who have taken the time to see why the world needs a censorship resistant, fixed supply, fair form of money, that does not have rulers (or bankers tripping over each other ready to devalue the currency). Also, wanted to make sure I wasn't talking out my ass so I searched \"audit the Fed\" and found this [bill](https://www.paul.senate.gov/sites/default/files/page-attachments/Federal%20Reserve%20Transparency%20Act_1.pdf) by Rand Paul. \"A BILL To require a full audit of the Board of Governors of the Federal Reserve System and the Federal reserve banks by the Comptroller General of the United States, and for other purposes.\" That's good shit Rand.\n\nMy girl is warming up to Hal or Finny and since Hal Finney was also pivotal to Bitcoin becoming a thing I wouldn't mind that name either. Anyways, I'm getting ahead of myself. What I ultimately want is a healthy child. Bitcoin will make the world a better place for my kid, but I need to make sure this kid is healthy first. Excited to (help) bring life into this world. My father has told me that having a child is a truly special thing. I can only imagine how I will feel when I stare that little me in his or her eyes. At that point, I will have two obsessions: Bitcoin and making sure my child is raised the right way.\n\nCheers Anon! Despite the world seeming crazier everyday us humans always find a way :)\n\n5/11/22",
  "wordCount": 697,
  "readingTime": 2.8301886792452833,
  "claps": 0,
  "voters": 0
}