{
  "id": "be2c3140ba14",
  "title": "Day 542",
  "createdAt": "2023-09-16 01:11:53",
  "tags": [
    "running",
    "bruce-lee",
    "twitter",
    "half-marathon",
    "marathon"
  ],
  "url": "https://chepenikconor.medium.com/day-542-be2c3140ba14",
  "content": "# Day 542\n\n![[https://x.com/MASSExpedition/status/1702694656398463440?s=20](https://x.com/MASSExpedition/status/1702694656398463440?s=20)](https://miro.medium.com/1*wLU-bXwTSivq5dS-5MomSw.png)\n\nThis tweet goes hard. It reminded me of the first time I did a half marathon. Which was in the beginning of this year (2023). 13.1 miles was ~double my previous record of 6.78 miles run.\n\nWhen I attempted the half-marathon I ended up running 10 miles and then walking the remaining 3.1 miles because my calfs started cramping. My first thought after finishing was how do people run marathons? One foot after the other foot I guess😂\n\nThe story of the marathon itself is a testament to the indomitable human spirit. Legend has it that the first marathon run took place in ancient Greece, when a messenger named Pheidippides ran approximately 25 miles from the battlefield of Marathon to Athens to deliver news of victory. Sadly, Pheidippides paid the ultimate price for his feat, succumbing to exhaustion upon delivering his message. However, his sacrifice ignited a movement, inspiring countless others to take on the challenge and complete marathons in his memory.\n\nI asked the fact checkers if this was true and got told that the story of Pheidippides running the marathon is a legend, but it is not entirely accurate. The earliest account of the story comes from the Greek historian Herodotus, who wrote about it in his book _The Histories_. However, Herodotus does not mention the marathon run, and he only says that Pheidippides ran from Athens to Sparta to ask for help.\n\nThe story of Pheidippides running the marathon first appeared in a poem by the Greek writer Lucian in the 2nd century AD. Lucian's poem is not a historical account, and it is likely that he embellished the story to make it more dramatic.\n\nThere is no doubt that Pheidippides was a real person, and he did run from Athens to Sparta. However, there is no evidence that he ran the marathon, and it is unlikely that he died from exhaustion after delivering the message.\n\nThe modern marathon is a tribute to Pheidippides's courage and determination, but it is not a reenactment of his actual run. The modern marathon is 26.2 miles long, which is about twice the distance that Pheidippides is said to have run.\n\nSo, the statement that Pheidippides ran the marathon is allegedly a legend, but it is a legend that has inspired countless people to run marathons in his memory. Whatever the truth may be the final lesson of today's Medium is that you should push yourself beyond what you think you are capable.\n\n9/15/23\n\nConor Jay Chepenik",
  "wordCount": 419,
  "readingTime": 1.7811320754716982,
  "claps": 3,
  "voters": 3
}