{
  "id": "be7d769ca22f",
  "title": "Day 152",
  "createdAt": "2022-08-21 21:37:44",
  "tags": [
    "podcasts",
    "tcp-ip",
    "central-banks",
    "bitcoin",
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-152-be7d769ca22f",
  "content": "# Day 152\n\nPlayed 18 this morning with some nice fellows from Ireland. I love Irish accents. Honestly all accents from the English, Scottish, & Irish crack me up. Hopefully I never break this streak, but every time I play Golf as a solo with 3 randoms they always turn out to be nice people. Golf truly is a gentleman's sport.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F3EZllG2RYa8E9KyITuuJjW%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F3EZllG2RYa8E9KyITuuJjW&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fb70cce9b2346d83bbe914169f2df52d329d59a53&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nListened to this short Podcast and I think Jeff has the right idea. Ask people \"Is tech deflationary?\". What a perfect question to get someone's gears turning and have them go down the Bitcoin rabbit hole. Once you have gotten someone to admit that tech is deflationary you just follow it with a simple \"Well if tech is deflationary and should be giving people time back why is the cost of everything going up like crazy?\" Could it be our shat monetary police? Our broken incentive system? Fiat money?! If you have read enough of these mediums I think you know where I stand.\n\nI also appreciated Jeff's point about being the problem solver you want to see in the world rather than the person bitching about how it is all going to hell. Noted. While I do believe that there is value in calling out bullshit, that is much different than complaining about why I have it rough. I've got more productivity tools and access to TCP/IP which grants me the ability to learn from some of the greatest minds alive. Seriously, podcasts allow me to listen to brilliant people like Jeff Booth, Jordan Peterson, Lex Fridman, Joe Rogan, Andrew Huberman, Robert Breedlove, and so many more incredibly talented people. I feel so fortunate that I can listen to great philosophers, comedians, neuroscientists, and whoever else I want at the click of a button on my iPhone. It's truly remarkable.\n\nI guess I feel bad because there is someone out there right now listening to the ECB's podcast. Imagine thinking you are going to find signal in a podcast that comes from a central bank. HAHAHHAHAHAHHAHAHHAHA. I don't know why I find that so funny, but it absolutely kills me to think there is someone out there listening to the European Central Bank's podcast. I can only imagine the Keynesian brainwashing contained in that podcast. Honestly, part of me wants to listen so I can at least see the ridiculousness they must be preaching and come up with ways to rebut it, but I feel like even that would be a waste. God I hope the Fed never publishes a podcast.\n\nAnyways, that is enough central bank shit talking. Jeff has reminded me that a new system is going to be arising and will eventually make central banks a thing of the past when anyone who wants can be their own central bank with a computer. I've been doing some good reading and learning this weekend. Mimo is a fantastic app to dip your feet in coding. Hopefully my child enjoys using Mimo and becomes a great coder. Also making some good progress on Dalio's _The Changing World Order, & The Sovereign Individual._ Words on paper tend to be much more educating than words on a screen; as I type words on a screen. Case and point maybe.\n\nI was also listening to Jordan Peterson talking on the Lex Fridman podcast recently. Not finished with it, but what I've heard so far is great. Jordan just started crying at one point in the podcast. Not a lil kid cry, but a grown ass man grappling with an important topic cry. Might be the best way I could describe it. Can't even remember exactly what is was that made him cry, but when I heard him cry I got emotional because I could tell homie was really trying to think critically and seek truth. It gave me goosebumps, that type of shit is rare nowadays. It's why Jordan is one of the greatest thinkers of our time. It is not easy to just digest and grapple with complex topics. I appreciated that Jordan said when he is on flights without wifi he will type stuff on his laptop. What a great use of time indeed. I love writing these mediums, but I'm often distracted when I pull up a Twitter post or another article to link here. The amount of times I've opened up a tab to grab a source and then get distracted is large. Not easy to focus when you got a million things at the tip of your fingers. It's great because I have so many paths and things I can learn from, but also terrifying because it is hard to pick something to focus on.\n\nFocus. Important stuff requires it and bullshit wants to steal that focus away. We got this anon. Our focus is valuable; treat it with respect.\n\n8/21/22\n\nConor Jay Chepenik",
  "wordCount": 808,
  "readingTime": 3.049056603773585,
  "claps": 0,
  "voters": 0
}