{
  "id": "bebe86eed2d5",
  "title": "Day 704",
  "createdAt": "2024-02-25 03:13:51",
  "tags": [
    "one-love"
  ],
  "url": "https://chepenikconor.medium.com/day-704-bebe86eed2d5",
  "content": "# Day 704\n\nI'm redoing binmucker.com and today I'm going to write out a plan for what I want the site to be/feature on it:\n\nColor Scheme: Adopt a sophisticated and modern palette of near white and dark blue, ensuring the website feels welcoming and easy to navigate.\n\nFramework: Utilize Next.js and TypeScript for building the site, leveraging the benefits of server-side rendering and static site generation for faster load times and improved SEO.\n\nFeatures:\n\n1. Meme Collection: A dynamic gallery showcasing a selection of memes, memes will be very important on this new website.\n\n2. Photos That Matter: A personal gallery section dedicated to meaningful photographs. Maybe consider including descriptions or stories behind each photo for a personal touch.\n\n3. Tip Jar: Integrate a digital tip jar to allow visitors to show their appreciation. Will likely offer BTC links because fiat is a hassle.\n\n4. NOSTR Link: Provide a linkto connect with me on NOSTR profile, encouraging community interaction.\n\n5. Cool Quote Modal: Feature a modal or pop-up that displays a random cool quote each time a user visits the site.\n\n6. Linktree-Type Page: A centralized hub for all my social media and external links, making it easy for visitors to connect with meacross platforms.\n\n7. About Me Section: A place to share myinterests, and the journey behind binmucker.com. This section can also highlight my engagement with coding and AI.\n\nI'll use AI to enhance my website often. My goal is to make this a fun hobby of mine to build the most stunning website I can.\n\nI've been playing around with it today and it feels good to get back into playing around with code. Maybe I'll try and share some cool easy to use code effects as I write more of the website. A great time to learn how to code, it's never been easier to learn than now with AI.\n\n![](https://miro.medium.com/0*WSQdUm9nDIBrjrt9)\n\nOn another note I saw the new Bob Marley movie today. It was a very enjoyable film to watch. I'm sure I'll be listening to more reggae music in the future.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1761561992735649939%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI didn't know how much violence was going on in Jamaica but it seemed to be a brutal amount. I got a lot of respect for passing on a message of love when it would be so easy to just spread more hate. The world is full of problems but being a hateful person about it won't fix any of them!\n\n2/24/24\n\nConor Jay Chepenik",
  "wordCount": 405,
  "readingTime": 1.728301886792453,
  "claps": 0,
  "voters": 0
}