{
  "id": "bee590c33ee7",
  "title": "Day 302",
  "createdAt": "2023-01-19 04:45:44",
  "tags": [
    "bitcoin",
    "thomas-paine",
    "common-sense",
    "music",
    "children"
  ],
  "url": "https://chepenikconor.medium.com/day-302-bee590c33ee7",
  "content": "# Day 302\n\nGood songs for those interested in Bitcoin themed songs.\n\n> [**Wavlake * Player**](https://player.wavlake.com/richard)\n\nI've been watching the 3 part Atlas Shrugged series on Amazon Prime. I'm not going to lie I almost stopped because I was upset they recast for every part but I decided to go on anyways because of this tweet.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/zachherbert/status/1615570700806377473&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nZach was right. Part 2 was pretty dope when you get past the fact they recast. It's amazing how ridiculous close our government seems to becoming like the one in Atlas Shrugged. The idea you can centrally complex systems is asinine, but here we are. We need more common sense in this country so I went and wrote a thread about it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1615753413790146560&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWell worth the read anon. I'm sure it's because I spend a lot of time in Bitcoin, but every single one of those quotes I could find a way to tie to Bitcoin. As a matter of fact that would be a fine writing experience for today SO LETS DO IT.\n\n![](https://miro.medium.com/0*4Hmo9XLTcm0B8EU6.png)\n\n1 \"Society in every state is a blessing, but Government, even in its best state, is but a necessary evil; in its worst state an intolerable one.\"\n\nWhat if there was a way to limit Government? I mean after all their whole purpose is to protect private property. Would be a shame if a network came along and did that better by automating it to code 🤔 Scarce, permissionless, digital private property...#Bitcoin!\n\n2 \"The harder the conflict, the more glorious the triumph. What we obtain too cheap, we esteem too lightly: it is dearness only that gives every thing its value.\"\n\nIt's not going to be easy convincing the world to tranisition to a better monetary standard, but it will be worthwhile. Going through this transition will be challenging for many and make it well worth it on the other side.\n\n3 \"A long habit of not thinking a thing wrong, gives it a superficial appearance of being right.\"\n\nLike say Central Banks around the world? Most people just accept them because they have been around forever. Hard to realize what an awful, parasitical, marxist institution the Central Bank actually is. It makes no sense we live in a capitalist system with a Federal Reserve and Treasury that has a monopoly on credit. I reject this premise as a good thing. These central planners loot us of our time and money.\n\n4 \"It is the good fortune of many to live distant from the scene of sorrow; the evil is not sufficiently brought to their doors to make them feel the precariousness with which all human things hang.\"\n\nPeople in developed countries haven't thought much about Bitcoin because their financial rails have always been pretty solid, but with recent inflation surges more people are waking up. Pain is the best teacher and likely what will drive HYPERBITCOINIZATION!\n\n5 \"The mind once enlightened cannot again become dark.\"\n\nOnce you realize how fake things have become because of fiat you can't unsee it. Bitcoin starts to be the lense that you see everything through and at that point Bitcoin fixes literally everything. People look at you crazy for saying it, but it's the damn truth.\n\n6 \"The strength and power of despotism consists wholly in the fear of resistance.\"\n\nThe emperor has no clothes. They talk of CBDCs because they are scared of losing their ability to rob you. Good. Opt-out of their bullshit game.\n\n7 \"Until an independence is declared, the Continent will feel itself like a man who continues putting off some unpleasant business from day to day, yet knows it must be done, hates to set about it, wishes it over, and is continually haunted with the thoughts of its necessity.\"\n\nThe last one is one of my favorites. I'd say this reminded me of getting a hardware wallet. Felt good after I finally did that. Now my next step that I'm lowkey dreading figuring out but that I know is absolutely necessary is multi-sig.\n\nIn other news I had a great time at the Boston bit-devs meetup tonight. Looking forward to continuing to go to more of those in the future. We discussed Bitcoin privacy amongst other things. Unfortunately, I wasn't able to hit the bars afterwards because baby Sloan was being a bit fussy. Took her for a daughter/daddy walk and that calmed her down so she could go to sleep. This quote can also apply to raising a kid. \"The harder the conflict, the more glorious the triumph. What we obtain too cheap, we esteem too lightly: it is dearness only that gives every thing its value.\"\n\n1/18/23\n\nConor Jay Chepenik",
  "wordCount": 777,
  "readingTime": 3.1320754716981134,
  "claps": 0,
  "voters": 0
}