{
  "id": "bf612eeb882b",
  "title": "Day 187",
  "createdAt": "2022-09-25 14:50:58",
  "tags": [
    "sunday-thoughts",
    "bitcoin",
    "eth",
    "italian-politics",
    "federal-governments"
  ],
  "url": "https://chepenikconor.medium.com/day-187-bf612eeb882b",
  "content": "# Day 187\n\nThis morning I saw Italy was set to elect a new parliament so I did some googling. Unfortunately, it directed me to one of the least credible sources on this plant: The Washington Post. I used to have respect for this publication then the last two years happened and any credibility they had in my eyes were lost. Good to read those you don't agree with though because if you know they are spewing propaganda it is easy to see what they are afraid of. I'm honestly kind of excited to see what this \"far-right\" government can do for the people of Italy. I know nearly nothing about Italian politics but I like the idea of breaking up the EU and being anti-woke.\n\n> [**Italy poised for glass ceiling-shattering vote, hard right turn**](https://www.washingtonpost.com/world/2022/09/25/italy-election-results-meloni-right/)\n\nLike Italy, I don't know too much about the EU but the videos and clips I've seen of that parliament on Twitter hasn't given me much hope they represent the people of Europe. I thought Saylor said it best \"When you broaden your scope you lose energy\". Thus, there is no way the EU can actually help the vast majority of people in Europe like they claim. Even in the U.S.A, which has a much better system in my opinion, we are running into problems between the Federal Government and the states. Luckily we have a much stronger constitution but while many in the Federal Government claim to want to help the nation most of their actions are incredibly hindering. Small local government seems to be the way. There doesn't seem to be any policy that the Federal Government or the EU can enact that will help left people out of poverty and into a world of abundance except get the hell out of the way and let the free market do its thing. The sanctions coming out of the Fed and EU (which I guess at this point in time is called NATO) is going to lead a lot of people in the West into misery. Energy is incredibly important and we are destroying our citizens ability to access cheap and abundant energy.\n\nI read that whole WaPo article and while they make it seem like the end of the world that an \"alt-right\" person might get in I think that is far from the truth. My guess is that the establishment is scared of this new Government coming in and crippling the establishment. I mean watch this [video](https://twitter.com/BernieSpofforth/status/1573240191745425408?s=20&t=_A8f7PD6RdveGEFAF0h2Aw) of the EU leader Ursula. This chick is evil man.\n\nAnyways, I don't know enough about European politics to really have a well thought opinion on this. I would just like to see everyone in the world be able to have sovereignty and liberty. While the current regime in charge is tightening on people's freedoms it seems more \"alt-right\" groups will come to power because they are fed up with BS like this veiled video from Ursula. It's supposed to be a democracy not a pick who we want or we will hurt you. Then again democracy is the god that failed. I forget who said that but it sounds right.\n\nGoing to go for a run now. Got to get my mind right. Also looking forward to listening to this podcast which I hear is a banger.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F5YrC5TqeeVFBUFdnD1ah9F%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F5YrC5TqeeVFBUFdnD1ah9F&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f551526a072b2bb6e2eb1c304&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nThe mEth heads don't want you to listen to this because they are busy creating virtual rules for a virtual money that has no ties to the real world. Lmao imagine calling ether ultra sound money after they transitioned to proof of stake and severed their tie to the real world. Wild man. I know I shitcoined when I first got into crypto but boy am I glad I cut that crap.\n\n9/25/22\n\nConor Jay Chepenik",
  "wordCount": 654,
  "readingTime": 2.4679245283018867,
  "claps": 0,
  "voters": 0
}