{
  "id": "bf9b0960d990",
  "title": "Day 33",
  "createdAt": "2022-04-25 00:19:43",
  "tags": [
    "understanding",
    "parks",
    "nature",
    "bitcoin",
    "marketing"
  ],
  "url": "https://chepenikconor.medium.com/day-33-bf9b0960d990",
  "content": "# Day 33\n\nGot some golf later today which I am looking forward to. Spent some time yesterday hanging out in parks with my girlfriend and it felt really good. Doesn't always take money to enjoy a nice Saturday. Being in nature and looking at trees has become an underrated activity. Do recommend.\n\nOutside of that just crushing bitcoin podcasts as usual. Been really enjoying listening to [Preston Pysh](None) recently. Highly recommend, just google \"The Investor's Podcast\". To hear someone who has been around the legacy finance world talk about bitcoin is always refreshing. There are too many podcasters who I love to name in this medium post, but to hear from someone who has a deep understanding of legacy markets and why bitcoin is the best shot to fix them is...well soothing. It's easy to see what's happening in 🤡 🌍  and think yea it's bitcoin or bust. However, the reality is the majority of people will take the path of least resistance and won't adopt bitcoin until it's easier to use than something like Venmo. Thus, we need more people like Preston educating the masses so they can benefit in some of this a-symmetric upside before institutions and nation-states start piling in. The beautiful thing about bitcoin is everyone who gets involved gets to put their own spin on how they can help the eco system. For me it's writing these obsecure Medium posts, shit posting on Twitter, and running a full node. Some people will mine at home, build a bitcoin business, start a podcast to educate the masses, convince their local city to adopt it as legal tender, and millions of other things including innovations in Bitcoin core development. Bitcoin is so great because once someone gets hooked it seems like this \"Bitcoin hobby\" could last a life time. One of the things that makes me most bullish is the fact that those who go down the Bitcoin rabbit hole almost always join the Bitcoin marketing team. Here is a meme dump to articulate my thoughts on what joining the Bitcoin marketing team means.\n\n![](https://miro.medium.com/1*VBI9ynv71TU461DkWTiNVA.jpeg)\n\n![](https://miro.medium.com/1*8UclI_52T_JU8Mi06OkCHw.jpeg)\n\n![](https://miro.medium.com/1*21GtiCPtAK69eWdTR3CWdg.jpeg)\n\nThe memes are so powerful in bitcoin. Thank god because nothing conveys the truth like a good meme. From a first principals perspective it is mind blowing to think bitcoin has surpassed a one trillion dollar market cap during its existence without ever forcing anyone to use the network. Fiat money can not say the same. Anyone who has ever used Bitcoin has done so with their own free will. Human beings are not puppets to be controlled by a select few. We are sentient beings who have god given rights and the ability to decide what we value. So choose wisely what you do with your time, attention, and money anon. Got Bitcoin?\n\n![Whoever made this just forgot to add (while saving in bitcoin🤣)](https://miro.medium.com/1*DueucHoSzEfPzKUTmdMQng.jpeg)\n\n4/24/22\n\nConor Jay Chepenik",
  "wordCount": 467,
  "readingTime": 2.4622641509433962,
  "claps": 0,
  "voters": 0
}