{
  "id": "bfdfff57a9cb",
  "title": "Day 137",
  "createdAt": "2022-08-06 14:27:16",
  "tags": [
    "golf",
    "bitcoin",
    "dinner",
    "saturday",
    "kindness"
  ],
  "url": "https://chepenikconor.medium.com/day-137-bfdfff57a9cb",
  "content": "# Day 137\n\n![Photo by Martin Magnemyr: [https://www.pexels.com/photo/man-wearing-long-sleeves-playing-golf-5018277/](https://www.pexels.com/photo/man-wearing-long-sleeves-playing-golf-5018277/)](https://miro.medium.com/0*_JCEBDJSPilI8jL3)\n\nToday I woke up and was thinking how convenient it would be if my phone was more like a bracelet that could project a hologram. A hologram I could control by flicking my wrist or using my mind. It would also have an AI bot that could help me filter and find whatever I was looking for online. I don't know exactly how the future of technology will play out, but I don't think that what I'm describing now is so far away. When I was taking my web development course doing some coding last night my girlfriend made the point that most people aren't even looking for web developers anymore. The reason being many sites like wix, sqaurespace, and plenty more have created software that makes it so you can create websites without even having to touch a command line. I'm still trying to learn how to code because software engineers are going to be heavily in demand, but her point is well taken. Looks like I will need to go past just basic web development.\n\nSearching the internet is going to be revolutionized by AI. I just hope it's for the better. Machine learning can be incredibly powerful and I hope \"they\" don't use these algorithms to enhance the propaganda machine and increase censorship. Probably shouldn't hold my breath after what we saw these past 2 years.\n\nGot a round of Golf today at 11:10 then a Bitcoin dinner at Tias. It's going to be a solid Saturday. Excited to finally break 💯  (fingers crossed) and meet more Boston area Bitcoiners. If I'm not exhausted after all that I also have an invitation to my buddy Kevin's to hang out. Solid Saturday.\n\nFinal thought: kill them with kindness.\n\n![](https://miro.medium.com/1*gHvXd7B7WAlsmhe7zZNlXg.png)\n\n![](https://miro.medium.com/1*fALsbs3MGe9XfSSZ7qfgBA.png)\n\nHahahahaha arguing the definition of words and then calling me a child. It is not worth snooping down to the level, but rather learning. I've been meaning to read the Fountainhead at some point and this is a great reminder to do so. Ayn Rand is the 🐐  and I really did enjoy Atlas Shrugged. Thank you for the reminder Sean! :D\n\n8/6/22\n\nConor Jay Chepenik",
  "wordCount": 358,
  "readingTime": 1.900943396226415,
  "claps": 0,
  "voters": 0
}