{
  "id": "c09e14a7496c",
  "title": "Day 436",
  "createdAt": "2023-06-01 23:52:45",
  "tags": [
    "politics",
    "uniparty",
    "corruption",
    "bitcoin",
    "fiat"
  ],
  "url": "https://chepenikconor.medium.com/day-436-c09e14a7496c",
  "content": "# Day 436\n\nI came across an interesting statistic today that left me feeling both hopeful and jaded. A paradoxical statistic if you will!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1664385336187731974%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe article I found which featured this graphic discusses how a record number of Americans identify as politically independent, signaling a shift away from the traditional two-party system. The author's thesis suggests that younger generations are becoming disillusioned with the current paradigm and recognizing that it resembles more of a uniparty system with an illusion of choice. This sentiment resonates with me, as it often feels like we're faced with two unfavorable options during elections.\n\n> [**Record number of Americans say they're politically \"independent\"**](https://www.axios.com/2023/04/17/poll-americans-independent-republican-democrat)\n\nAfter reading the article I am reminded of this meme. I'd be willing to argue memes have played a big role in showing younger generations how corrupt and ridiculous our two party system has become.\n\n![](https://miro.medium.com/0*3WqzIsh4aDUjkek_)\n\nThis is where Bitcoin holds significance for me. It provides individuals with a means to vote that can truly make an impact - a vote with your money. When the choices presented at the ballot box are limited and unappealing, the ability to accumulate wealth through alternative means becomes crucial. While it's impossible to gather comprehensive data on people's satisfaction with specific candidates, I believe the percentage of individuals who are genuinely content with the choices, like Joe Biden or Donald Trump, would not be substantial.\n\nThis lack of choice also hinders our ability to bring about meaningful change. Governments wield power through tools like money printing and military force. However, if they had to provide value for the goods and services they offer instead of resorting to citizen exploitation through money printing, their power would be challenged. I also hold the view that taxation, with its inherent threat of violence for non-compliance, can be seen as a form of extortion. While some arguments support the necessity of taxation, I personally find it difficult to accept. In a true democracy, where leaders are elected based on merit, I could perhaps tolerate taxation more easily. Nevertheless, the act of money printing remains an undeniable form of theft.\n\nSo we Bitcoin! Younger generations will get it one way or another. Either through the pain of being censored on fiat rails or via ridiculous inflation. An unfortunate truth, but one I suspect will play a large role in one of the many reasons why the kids growing up will opt to use money not controlled by a clearly corrupt government. I'm bullish on future generations.\n\n6/1/23\n\nConor Jay Chepenik",
  "wordCount": 442,
  "readingTime": 1.8679245283018868,
  "claps": 0,
  "voters": 0
}