{
  "id": "c15cd643e025",
  "title": "Day 284",
  "createdAt": "2023-01-01 00:06:21",
  "tags": [
    "nostr",
    "happy-new-year"
  ],
  "url": "https://chepenikconor.medium.com/day-284-c15cd643e025",
  "content": "# Day 284\n\nThis morning a stranger bought me coffee from Dunkin Donuts. Not sure why he did so but it made my day. I do think there is wisdom in the old Murphy's law \"No good deed goes unpunished\" and I also think there is immense value in never underestimating the power of one small act of kindness. That coffee purchase put me in such a hopeful mood. I need to think of a way to pay it back somehow.\n\nCrazy to think today is already the end of 2022. The year really has flown by. Then again, starting march 2020 everything has been a blur. I'm excited for what 2023 is going to bring. Being a father is exciting. I'm planning on turning binmucker.com into a Dad blog. Need to brainstorm ideas for the website. A meme section, a section for my blogs, another section where when you hover over stuff it changes in a psychedelic manner (for both dads and their kids lmfao), and a shop/merch page. Hostinger has been pretty clutch for web hosting but I still have much to learn.\n\nI'm also excited about Nostr and what it can do for free speech. I'm not sure it can reach the network effects of Twitter, but the mere fact people have the option is incredible. I've been playing with on it my iPhone using the Damus app. There is still a lot of work to be done, but this thing is cool. Someone sent me some sats so I sent some random people sats. I like what the simple interface looks like when posting a lightning invoice.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jb55/status/1607133141181038592&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGoing to do a raising funds for my fresh baby kicks, when Sloan gets old enough to wear cool shoes. Might have to try this coffee thing as well hahaha. Pretty awesome to see people helping other people. While Nostr obviously doesn't have Twitter's UI yet it does have a real cool vibe once you get the hang of it. Do recommend giving it a try.\n\nAnyways, HAPPY NEW YEAR ANON! Make 2023 an even better year and don't quit pursuing your goals. The world is your oyster, just start that step towards building a better future :) If anyone tells you the hope is lost they are wrong. Don't ever let anyone tell you the hope is lost!!!!\n\n12/31/22\n\nConor Jay",
  "wordCount": 392,
  "readingTime": 1.4792452830188678,
  "claps": 0,
  "voters": 0
}