{
  "id": "c26a84a95958",
  "title": "Day 543",
  "createdAt": "2023-09-16 16:55:14",
  "tags": [
    "incentives",
    "charlie-munger",
    "warren-buffett",
    "network",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-543-c26a84a95958",
  "content": "# Day 543\n\nIn a world driven by desires, motivations, and actions, incentives hold a unique position as the driving force behind human behavior. Here are ten thought-provoking insights on incentives:\n\n1. Individuals who stand to benefit from a specific decision may not always provide impartial advice. Our perceptions and judgments are often influenced by incentives, underscoring the importance of understanding the motivations behind the guidance we receive. For instance, consider a financial advisor compensated through commissions; they may be inclined to recommend products or services that may not align with your best interests but ensure their continued compensation for managing your finances. In contrast, if you choose to purchase and self-custody bitcoin, you may not require a financial advisor's assistance unless you are dealing with exceptionally large amounts and seek guidance. In such cases, it is advisable to collaborate with companies that uphold principles of fairness, honesty, and transparency in their incentive structures.\n\n2. Warren Buffett's proposed solution to the colossal US debt problem illustrates the power of incentives in governance. His idea of making sitting members of Congress ineligible for re-election when a deficit exceeds 3% of GDP is a clear example of how altering incentives can reshape political decision-making. If members of Congress were personally penalized for running up the deficit, they would be more likely to make fiscally responsible decisions.\n\n3. In the 1700s, a staggering 33% of British criminals were dying en route to Australia. This shocking statistic highlights the life-and-death consequences of incentives. When the British government shifted its payment structure for sea captains from boarding passengers onto the ships to disembarking them safely in Australia, the survival rate skyrocketed to 99%. This transformation underscores how incentives can literally be a matter of life and death.\n\n4. Video games have long understood the psychology of motivation. They teach us that frequent rewards are far more addicting than one-off rewards. This concept can be applied to various aspects of life, emphasizing the importance of consistent positive reinforcement to drive desired behaviors. For example, parents can use this principle to motivate their children to do their homework by rewarding them with small breaks or privileges throughout the study session. I'm a big fan of Patrick Bet-David's method of using books as a form of currency in his household. If the kids want to play with a toy then they need to read X amount of books to get the privelage to play with that toy.\n\n5. Naval Ravikant's aphorism, \"Never attribute to conspiracy what is more easily explained by incentives and incompetence,\" serves as a reminder to favor simpler explanations over complex conspiracy theories. Many times, human behavior becomes clearer when we analyze the incentives at play. For instance, it is often more reasonable to assume that a CEO made a poor decision due to incompetence rather than being involved in an elaborate conspiracy to defraud investors. While this principle generally holds true, there are exceptions, as illustrated by the case of SBF and FTX. Examining the situation from an incentives standpoint sheds light on the dynamics at play. It may not be surprising that SBF believed he was immune to consequences after donating substantial sums to politicians, as this could create an incentive for those politicians to protect him. Ravikant's aphorism encourages us to start with the simplest explanations rooted in incentives and incompetence when analyzing human behavior, while recognizing that exceptions exist where more complex factors may be at play.\n\n6. Warren Buffett's warning about rewarding profits alone carries significant implications for businesses. When employees are solely incentivized by profits, they may prioritize short-term gains over long-term sustainability. This can lead to unethical behavior, such as cutting corners or exploiting customers. Businesses should strive to align employee incentives with the broader objectives of the company, such as customer satisfaction and long-term profitability.\n\n7. Charlie Munger's has many profound quotes about incentives. Yet, even someone as astute as Munger has consistently underestimated the power of incentives. Munger is quoted saying \"I think I've been in the top 5% of my age cohort all my life in understanding the power of incentives, and all my life I've underestimated it. And never a year passes but I get some surprise that pushes my limit a little farther.\"\n\n8. When someone shares why they believe their city, relationship, or job is wonderful, approach it with a degree of skepticism. Conversely, if they express why they find it challenging or disappointing, treat their words as if they're offering you a precious gold nugget of insight. When an individual goes against the current of their identity or incentives, it often reveals a profound truth worth paying attention to.\n\n9. \"Incentives are like magnets. An invisible but powerful pull.\" - Andrew Wilkinson. Incentives are rarely overt, they tend to operate invisibly, guiding our choices in ways we may not even be consciously aware of. For example, we may be more likely to choose a restaurant that is offering a discount or a product that is displayed prominently on the shelf.\n\n10. Skinner's Law offers practical advice for tackling procrastination. By adjusting the relative pain or pleasure associated with taking action or remaining idle, individuals can motivate themselves to overcome inertia. This principle underscores the role of incentives in driving personal productivity. For example, a student who is procrastinating on a paper can motivate themselves to start writing by breaking down the task into smaller, more manageable steps and rewarding themselves for each completed step.\n\nIn conclusion, never underestimate the power of incentives. They are the unnoticeable threads woven into the tapestry of human behavior, quietly shaping our decisions and actions. Bitcoin's security relies on individual's incentives to act in their own self-interest, which is a key reason why I believe it will succeed in the long run. Of course, I am biased so don't trust me; go verify for yourself!\n\n![](https://miro.medium.com/1*_3VIObKXLE73pdqwplWFgA.png)\n\n9/16/23\n\nConor Jay Chepenik",
  "wordCount": 984,
  "readingTime": 3.9132075471698116,
  "claps": 0,
  "voters": 0
}