{
  "id": "c29792f98c2",
  "title": "Has My Whole Life Been A Psy-Op?",
  "createdAt": "2022-02-23 16:42:55",
  "tags": [
    "psychological-operation",
    "finance",
    "living-healthy",
    "open-mindedness",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/has-my-whole-life-been-a-psy-op-c29792f98c2",
  "content": "# Has My Whole Life Been A Psy-Op?\n\nThis Quote from _The Fiat Standard_ by Saifedean Ammous made me want to write.\n\n\"The fiat standard first destroyed the ability of individuals to save, then forced them to treat their home as a savings account.With low salability and divisibility, houses constitute terrible savings vehicles, but by excluding it from the C.P.I, and teaching people to treat it as a savings account, inflation magically appears beneficial.\"\n\nFor those who don't know the C.P.I stands for Consumer Price Index and it's a tool used by Economists to measure inflation/how much the price of \"goods\" change year to year. The equation used to calculate the C.P.I changes so many think it is heavily manipulated, but for the sake of argument will go with the Government issued number of [7.5%](https://www.bls.gov/opub/ted/2022/consumer-prices-up-7-5-percent-over-year-ended-january-2022.htm). This means in a year you lost 7.5% of your purchasing power. This incentives people to have high time preferences and spend rather than save. If you try and save money it loses its purchasing power rapidly. This is ridiculous since people should be incentivized to save and have low time preferences. Unless you were born as some freak of nature most people require at least 10,000 hours to become an expert at something. However, in this highly inflationary climate the majority of people just start looking for get rich quick schemes and everyone gets pushed out on the risk curve. I believe this is one of the many reasons things like Dogecoin and Shiba Inu had riduclous gains followed by huge losses.\n\nAnyways, thinking back on the lessons I learned growing up many of them seem flawed as I continue to expand my education. For example, it is crazy that when cooking people have become so comfortable using vegetable oils. The stuff is marketed as good for your heart, but in reality, it causes inflamation by introducing way too many omega-6 fatty acids and not enough omega 3. According to this [article](https://draxe.com/nutrition/vegetable-oil/), humans are supposed to have a 1:1 ratio of omega 6 and 3 fatty acids and the average western diet is closer to 15:1. The reason vegetable oils are so widely used is because they are much cheaper to mass produce than their healthier substitutes.\n\nAnother lesson most people are taught is buy a home as early as possible. As Saifedean pointed out many Americans treat their house/mortgage like a savings account. My whole life I've thought of this as normal, but Saifedean has convinced me that a home is a horrible savings account. Most people my age can't even afford a home because prices keep skyrocketing in desirable areas. Of course as Government's inflate fiat at a ridiculous rate harder assets will appreciate. Unlike paper/digital money issued by a central bank homes can't just be issued for an I.O.U by the Federal Reserve. (I mean they kind of can if you think about mortgages, but the home has to have already been built unlike freshly issued debt which the Fed creates when it prints money in the form of \"Quantitave Easing\") Houses requires a great deal of capital and human labor. Homes also depreciate over time and require money/human labor to fix their structure. Throw in yearly property taxes and all of a sudden the paper gains on your home appreciating don't seem so great in most cases. Plus, if you want to sell your home 3–6% is likely going to a Realtor and it could take a couple months before you sell.\n\nAll this is not to say my parents didn't give me great advice growing up. They were giving advice based on the environment they grew up in. Times are changing though and they are changing fast. I went to Tufts University and made friends with some incredible people. Many got solid jobs and yet none of my friends are even considering buying a home right now because it is too expensive. Anyone reading this is in luck though because Bitcoin is getting monetized for the first time in history. It was hard to accept that fiat money is issued by the Federal Reserve and they have a monopoly on the supply and cost of said fiat money. Once I accepted the fact most dollars were just a part of an SQL database held at the Federal Reserve the more comfortable I became putting all my extra money into Bitcoin.\n\nNo one taught me about the importance of personal finance in school. I was lucky to have a Grandpa that's an accountant and a growing interest in finance since college. I was initially attracted to Bitcoin out of speculation. After going down the rabbit hole I've made many changes in my life such as eating, exercise, and spending habits. I've also started consuming much more long-form content like podcasts and books while cutting back on TV. The more I learn the lower my time preference becomes and the more I want to stack sats and chill. I'm happy to spend money on traveling and experiences, but most consumer stuff seems like a waste of money when I can buy a truly hard asset that is only getting priced once.\n\nIt's crazy to think that many Keynesian economists argue that inflation is a good thing. The Federal Reserve even gave itself a 2% target inflation rate. (Which it is 5.5% over currently) I guess I'd be arguing for the merits of inflation as well if my job depended on it. I actually convinced my stepfather to buy some 🌽  and he encouraged me to go work for the Federal Reserve. While I appreciate his sentiment of creating change from the inside this advice is about as solid as \"eat more vegetable oils\". People will look back and laugh about how men in nice clothes used to sit around and plan the price of money. The truth is humans finally have a hard asset in Bitcoin and as this thing continues to be monetized many central banks will become obsolete. Thus, I will not be working for the Federal Reserve. Instead, I will keep stacking sats until one day I can spend my sats almost anywhere.\n\nI'm not an expert and one could even argue this piece is a Psy-Op to orange pill 🍊💊  my fellow humans. None of this should be considered financial advice. That said, based on my own research I have become convinced that a decentralized, permissionless ledger maintained by random anons will be the best thing to happen to humanity since the printing press. Many \"elites\" viewed the printing press as a negative because it allowed the common man to educate themselves, but luckily the printing press was inevitable. Bitcoin is like this for the 4th turning: inevitable.\n\nIf you take away one thing from this piece it should be that everyone has some sort of agenda and bias. This is not to say that everyone's bias/agenda is bad. I believe many people have good motives and want to help others. My point is once you realize that everyone is pushing something for their own reasons it becomes much easier to see through the manipulation. E.S.G, D.E.I, and so many other concepts that seem like morally good things are actually quite destructive and a net negative on humanity. Do yourself a favor anon: read as many things from both sides as possible and form your own opinion. It is nearly impossible to avoid all the Psy-Ops going on in the world. Thus, if you want to put yourself way ahead of the curve take everything with a grain of salt, approach every topic with an open mind, and realize almost everything out there is meant to make you think a certain way.\n\nConor Jay Chepenik\n\n2/23/2022",
  "wordCount": 1293,
  "readingTime": 4.879245283018868,
  "claps": 0,
  "voters": 0
}