{
  "id": "c2f5762b19f3",
  "title": "Day 224",
  "createdAt": "2022-11-01 21:06:08",
  "tags": [
    "coding",
    "html",
    "css",
    "js",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-224-c2f5762b19f3",
  "content": "# Day 224\n\nI'm going to use todays post to detail some of the important things I learn in my web development course. Starting out I'm just learning the basics of front end web development so languages like HTML, CSS, & JS. HTML stands for hyper text markup language and can be thought of as the nouns of the website. CSS stands for cascading style sheets and is the adjectives of the website. JS stands for java script and makes up the verbs of the website.\n\nIt's amazing how much you can do with these three languages and it is becoming apparent that two resources are going to be crucial on my journey; MDN and W3schools.\n\n> [**MDN Web Docs**](https://developer.mozilla.org/en-US/)\n\n> [**W3Schools Free Online Web Tutorials**](https://www.w3schools.com/)\n\nIt seems that the best developers are amazing google searchers. Being able to get yourself unstuck and find an answer is the key to becoming a good computer scientist as far as I can tell. I've completed the HTML sections and am currently learning CSS so that is what I am going to primarily focus on today. Today I learned that you can use * to select everything. I like styling my CSS in it's own page so the index.html file doesn't look so messy. When you style stuff on the CSS page it usually looks like this\n\nselector {\n\nproperty: value;\n\n}\n\nSo if you wanted to make your webpage pink you could put\n\nbody {\n\nbackground-color: pink;\n\n}\n\nPretty easy concept to grasp but obviously you can do a lot more in terms of styling than just make the webpage pink. I also learned that if you wanted to style 2 different elements similiary you can use a comma to do so. For example, say you wanted both your h1 and h2 tags to have a magenta color\n\nh1,h2 {\n\ncolor: magenta;\n\n}\n\nSay you have the opposite problem. You have two h1 tags in your HTML and you want them to have different styles. Well you can use id=\"X\" to give the CSS a heads up about which h1 you want to style. I'll write out the HTML code first for this example and follow it up with the CSS.\n\n<h1 id=\"blueheader\">I Be Writing</h1>\n\n<h1 id=\"redheader\">I Be Reading</h1>\n\nSo when I style these in my CSS page I would put\n\n#blueheader {\n\ncolor: blue;\n\n}\n\n#redheader {\n\ncolor: red;\n\n}\n\nYou can also do something similar with classes. So if you wanted half your paragraph tags to be 100 pixels and the other half to be 500 pixels you could put <p class=\"onehundo\">Text you put in your p tag</p> and for the other half <p class=\"fivehundo\">Text you put in your p tag</p> While I'm not sure what the exact difference between class and id are you could use MDN or W3schools to figure out the exact difference. I do know that if you want to style class selectors in CSS you need to use a . instead of a # so it would look like this\n\n.onehundo {\n\nfont-size: 100px;\n\n}\n\n.fivehundo {\n\nfont-size: 500px;\n\n}\n\nThe web developer course I'm watching said it's important to understand both but you will likely be using classes more often. Biggest thing (so I'll repeat it for my own sake so I can remember) is classes use . and ID use # when you go to use them in your css file.\n\nEnough coding lessons for one day. To a skilled developer this all might be redundant but to someone who has never coded maybe you learned something. I'd like to finish today by talking about a great Bitcoin Magazine article I was reading. The company has been putting out some great articles recently.\n\n> [**The U.S. Will Weaponize The Dollar By Backing It With Bitcoin**](https://t.co/t6NsbG0VjE)\n\nI'd recommend reading the article for yourself. A lot stood out to me and as a huge Bitcoin bull and citizen of the United States I like where he took things. Obviously these are my own biases showing but this quote really stuck out to me. If this can't convince you to read the Bitcoin magazine article I'm not sure what can.\n\n> For thousands of years, money has been backed by trust and gold, and protected by ships. However, in this millennium, money will now be backed by encryption and math, and protected by chips.\n\nComputer science is the future. Not a bad idea to study up on it anon. Also, I bet you the author of that article wrote that line and was like fuck yea; that is a banger. I feel like that line could go hard in a rap song.\n\n11/1/22\n\nConor Jay Chepenik",
  "wordCount": 836,
  "readingTime": 3.1547169811320757,
  "claps": 0,
  "voters": 0
}