{
  "id": "c2f75b22a746",
  "title": "Day 393",
  "createdAt": "2023-04-20 00:28:02",
  "tags": [
    "central-planners",
    "cucks",
    "bitcoin",
    "winners",
    "nature"
  ],
  "url": "https://chepenikconor.medium.com/day-393-c2f75b22a746",
  "content": "# Day 393\n\nI've been sick as a dog these past two days and it sucks. GOOD!\n\nAdversity must be overcome. Momma did not raise a lil bitch. I went for a run today and that helped a little. I also drank some tea and honey. Anyways, all that is not highly relevant to anyone besides myself. I just wanted to point it out so if you read the article I'm trying to get in the next print edition of Bitcoin Magazine & you think wow Chep wrote that while sick...nice\n\n...\n\nI've often heard people compare the traditional financial system to a crackhead looking for his next hit. I find this to be a rather harsh analogy because at least the crackhead has a chance to overcome his addiction. The legacy financial system on the other hand seems beyond repair. As we approach a point where liquidity can no longer satisfy the systems needs, it becomes increasingly clear that the foundation of money used for trade should be solid and dependable. However, fiat currency is built on trust, coercion, and debt. The concept of debt-based money is a paradox, so it's remarkable that central planners have managed to maintain this charade for so long. Over 50 years have passed since Nixon severed money's connection to reality by abandoning the gold standard, and it is now time for us to demand a stable and reliable method for conducting economic transactions.\n\nThe Federal Reserve (Fed) plays the role of a central planner in our current fiat money system. It has the authority to create currency and designate winners and losers in the economy. This can lead to problems when the Fed's choices benefit certain groups at the expense of others.\n\nFor example, the Fed may choose to bail out zombie companies that would otherwise fail, rather than letting them go bankrupt. This can prevent the market from allocating resources efficiently and can lead to higher costs for consumers.\n\nIn the current fiat money system, the Fed's selection of winners results in the loser being the ordinary dollar user. The holder of the currency gets screwed twice. Not only is there less reliable goods and services when the Fed props up zombie companies, but the freshly printed dollars dilute the purchasing power of everyone else's dollars.\n\nUpon implementing a soft version of universal basic income through stimulus checks by the Fed and Treasury in 2020, we observed inflation soar to heights not seen since the gold standard's abandonment in 1971. At this point everyone was upset because it was so clear they were losing. However, inflation has been a persistent issue in our financial markets. Quantitative easing, while not directly impacting everyday goods, has fueled inflation as the newly created dollars were primarily concentrated within the securities market.\n\nWith the Fed choosing winners and leaving dollar users to bear the brunt, zombie companies stay afloat, market participants pursue riskier ventures, and the market's invisible hand is rendered ineffective. This is because decision-making relies on the opinions of a select few, rather than a decentralized market. Depending on the traditional financial system is like relying on an untrustworthy translator in a foreign land. The Fed, in its role as translator, frequently offers flawed guidance, breeding confusion and distrust. Nevertheless, having a flawed translator is better than having none, which is the reality for those without political connections to entities like the IMF, World Bank, and other major central banks worldwide.\n\nPolicies like zero interest rates highlight the absurdity of the legacy financial system. Designed to stimulate economic growth by lowering borrowing costs, these policies have led to excessive risk-taking and asset bubbles, ultimately threatening the system's stability.\n\nThe traditional financial system's complexity arises from its opaque nature and the difficulty in verifying asset ownership and transfers. Intermediaries like banks and clearinghouses are meant to validate and settle transactions, but their vulnerability to corruption and compromise results in even more financial instability. This is exacerbated by the ongoing issue of fractional reserve banking, which, while granting certain advantages, ultimately erodes public trust and precipitates financial crises.\n\nFor the majority of recorded history humans chose gold as money. For all its flaw gold has held up pretty well as money because it's not easy to produce. The problem is you can't verify gold with a computer. In our increasingly digital world bank runs don't happen via people asking a teller for their money. They happen through A.P.Is. While gold will hold its purchasing power in the event of hyperinflation there is no way we get on another gold standard in our modern world. It just doesn't scale. Luckily, Satoshi blessed humanity with a digital asset that is hard to produce. Bitcoin offers a more transparent and verifiable system devoid of intermediaries. Transactions are recorded on a public, immutable ledger called the blockchain (or as myself and Satoshi prefer the timechain), which anyone can access and verify. This eliminates the need for intermediaries and reduces the potential for corruption and fraud.\n\nMoreover, Bitcoin operates with a fixed supply and a predictable inflation rate, preventing the unchecked money printing seen in the traditional financial system. This helps preserve the currency's value and enables a monetary policy that is both known and immutable.\n\nBitcoin can be viewed as the ideal translator, as it is based on mathematics - a universal language that everyone can comprehend. This ensures that there is no room for misinterpretation or manipulation. It is our best hope for providing humanity with a financial system built on a solid foundation - a system that fosters trust and stability by allowing mutually beneficial transactions to occur among market participants.\n\nAs the traditional financial system continues to grapple with the \"translator effect,\" an increasing number of people are turning to Bitcoin as a more reliable, transparent, and verifiable alternative. One of nature's inherent strength and resilience stem from its decentralized structure. No single entity holds dominion over its vast, interconnected web of ecosystems. Each component operates autonomously, adapting and evolving in response to its surroundings. Similarly, Bitcoin is decentralized and grows stronger with every attack on the network. All Bitcoin has to do to become money for the world is keep adding blocks. All the Federal Reserve's attempts to manipulate reality through zero interest rate policies, money printing, quantitative easing, yield curve control, and other obscure methods of selecting winners like the BTFP program will ultimately prove unsustainable. As with nature, reality has a way of humbling those who seek to control it, revealing the futility of centralized systems. Embracing decentralized systems not only aligns us more closely with the wisdom of nature but also serves as a safeguard against the inevitable failure of centralized structures. By adopting decentralized solutions, we can foster a more resilient and adaptable financial future, free from the constraints and vulnerabilities of centralized control.\n\n...\n\nOk going to need another crack at this tomorrow but I see a paper starting to come together.\n\n![](https://miro.medium.com/0*amo-HrWd3kncIXp_)\n\n4/19/23\n\nConor Jay Chepenik",
  "wordCount": 1167,
  "readingTime": 4.60377358490566,
  "claps": 0,
  "voters": 0
}