{
  "id": "c41a4d8106f0",
  "title": "Day 668",
  "createdAt": "2024-01-20 04:38:32",
  "tags": [
    "war",
    "sales"
  ],
  "url": "https://chepenikconor.medium.com/day-668-c41a4d8106f0",
  "content": "# Day 668\n\nFrom Robert Greene's [War](https://amzn.to/48ZZn0f)\n\n> The ability to read people was a critical survival skill for Japanese samurai and was particularly emphasized by the Shinkage school of swordsmanship. One of the school's earliest masters was the seventeenth-century samurai Yagyu Munenori. One spring afternoon in his later years, Munenori was taking a peaceful walk through his gardens, admiring the cherry blossoms. He was accompanied by a page/protector, who walked behind him, sword raised, as was the custom. Suddenly Munenori stopped in his tracks. He had a feeling of danger. Looking around, he saw nothing to warrant this feeling, but he was so troubled by it that he returned to his house and sat with his back against a post to prevent a surprise attack.\n\n> After Munenori had sat there for a while, his page asked him what was the matter. The samurai confessed that while looking at the cherry blossoms he had had an intimation of imminent danger, of an enemy on the attack. What troubled him now was that the danger had apparently been imaginary - he must have hallucinated it. A samurai depended on his keen instincts to anticipate attack. If Munenori had lost that power, his life as a warrior was over.\n\n> Suddenly the page threw himself to the ground and confessed: as Munenori walked in the garden, the thought had come to the page that if he were to strike at his master while the samurai was lost in admiration of the cherry blossoms, not even this gifted swordsman could have parried his attack. Munenori had not lost his skill at all; quite the contrary - his incomparable sensitivity to other people's emotions and thoughts had allowed him to pick up sensations from someone behind his back, rather as a horse senses the energy of its rider or a dog the movements of its owner. An animal has that sensitivity because it pays complete attention.\n\n> Similarly, the Shinkage school taught warriors to empty their minds, centering themselves in the moment as animals did and keeping themselves from getting derailed by any particular thought. This would allow the Shinkage warrior to read in his opponent's elbow or hand the slight tension that signaled an attack; he could look through his opponent's eyes and sense the coming blow or notice the nervous shuffle of the feet that indicated fear or confusion. A master like Munenori could virtually read someone's thoughts when the other person wasn't even visible.\n\n![](https://miro.medium.com/0*xwKs1ejda_nB2q5R)\n\nWhen I used to cold people all the time in my first BDR role I could feel someone's energy on the other side of the line. It became super clear in the first 10 seconds of a cold call if the person was going to give me a chance or shut me down. This passage reminded me of that. Not that I was by any means a master cold caller, but I always felt you could even pick up on someone's body language based on the way they spoke if you paid attention. People slouched over in their chairs sounded annoyed, people with excellent body language sounded in a hurry, eager to know if you were calling about something relevant, and people who were uptight were always the ones who enjoyed ripping me a new one for doing my job.\n\nIt really is amazing how much we can discern from others when we simply pay attention. In my current role I don't do much cold calling but one of the things I miss the most about cold calling all the time was that feeling right before I landed a meeting. I could sense it. Going for the close and landing it felt euphoric.\n\nSales are a huge part of life. We are constantly selling ourselves and it is fitting that a book on War is so insightful about how to sell. Simply pay more attention. Also trust your instincts🤝\n\n1/19/24\n\nConor Jay Chepenik",
  "wordCount": 653,
  "readingTime": 2.6641509433962267,
  "claps": 0,
  "voters": 0
}