{
  "id": "c5ad7c60db05",
  "title": "Day 267",
  "createdAt": "2022-12-14 16:11:55",
  "tags": [
    "senator",
    "congress",
    "bitcoin",
    "outreach",
    "orange-pill"
  ],
  "url": "https://chepenikconor.medium.com/day-267-c5ad7c60db05",
  "content": "# Day 267\n\nToday I saw Senator Warren was looking to pass a new bill. This bill is called the Digital Asset Anti-Money Laundering Act. Not sure if it will pass but some of the requirements are heinous so I decided to reach out and see if I could make a difference. Not holding my breath but it feels too good be proactive. Here is the link Senator Warren shared on her Twitter.\n\n> [**Elizabeth Warren unveils bipartisan bill to crack down on crypto money laundering | CNN Business**](https://www.cnn.com/2022/12/14/business/elizabeth-warren-bipartisan-crypto-crackdown/index.html?utm_medium=social&utm_source=twCNN&utm_term=link&utm_content=2022-12-14T11%3A54%3A07)\n\nHere was my message to her.\n\nSenator Warren,\n\nI am a blue collar worker located in Cambridge Mass. I currently work as a package handler at UPS and inflation has been very challenging to deal with. Based on what you shared from your Twitter I see you are looking to pass a new bill, \"called the Digital Asset Anti-Money Laundering Act, that would attack money laundering by attempting to bring the digital asset ecosystem into compliance with the existing system of anti-money laundering in the worldwide financial system. The legislation would direct the Financial Crimes Enforcement Network (FinCEN) within the Treasury Department to designate digital asset wallet providers, miners, validators and others as money service businesses. That in turn would extend responsibilities in the Bank Secrecy Act to the crypto industry, including Know-Your-Customer (KYC) requirements.\"\n\nI ask you to reconsider this bill and learn why this is not feasible for those in the cryptocurrency ecosystem. I am strong believer that Bitcoin is separate from crypto. Bitcoin offers a better store of value (over 4 year periods) than the US dollar which can be printed out of thin air to pay for government spending. Crypto is full of ponzi schemes and bad actors. We are definitely in agreement on that. For the most part all cryptocurrencies are just unregistered securities. However, Bitcoin is different. The monetary system is fixed, there will only be 21 million, and it offers the world a neutral global reserve currency that can not be manipulated by any Central Bank. While we might have our disagreements it seems clear (based on your op-eds asking the Fed to stop raising rates) that we both agree Central Banks are not doing a good job helping the American people during the worst inflation in 40 years. Thus, I constantly try and do my part to help educate my fellow Americans that Bitcoin is going to be a great tool for savings. Your bill would ask digital asset wallet providers, miners, validators to do things that they wouldn't be able to do even if they so desired. It goes against the constitution of our great country and is something you would see in fascist governments like China and Russia. I've spent a lot of time and effort learning why Bitcoin is different than crypto and our current fiat monetary system. Technology is changing things quickly and as I'm sure you know Government's have a hard time keeping up because of partisan politics. That said, this bill would just push innovation and progress outside of the U.S. It would also make our great nation seem more like a fascist regime comparable to the likes of China and Russia.\n\nI want to see the U.S continue to be the greatest nation on this planet. It's important people follow the laws, but this bill would not stop bad actors in the space like S.B.F amongst many others. This bill would hinder innovation, create a honeypot for hackers to try and steal data, as well as drive economic growth outside this country. I am happy to answer any questions and have a long conversation about Bitcoin if you want to hear how it's helping blue collar workers in your district. Please do not hesitate to reach out.\n\nThank you for reading my message.\n\nCheers,\nConor\n\nNot holding my breath on this one but it makes me feel better to actually write her and try to cause the Massachusetts Senator to think twice. It is also encouraging to see other Congress members talk about the importance of self custody.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/warrendavidson/status/1603047788891279360&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWill see how this plays out but I'm doing my part as an American to at least open the dialogue with my Senator. I would cherish an opportunity to try and orange pill Senator Warren even if I am very unlikely to get the chance. Time will tell, you never know. I do believe that Bitcoin will eventually reach a point where all congressmen will either be for it or stop talking about it because if they go against Bitcoin they will be guaranteed to lose their seat. There are many like me who could care less about right or left. Bitcoin is our main issue. Money is so important to a functioning economy and the idea Governments should be able to spend an unlimited amount and pay for it with money printing is deeply wrong.\n\nIn better news someone decided to do a podcast read of my most recent article and it was pretty cool to listen. I appreciate you Mr. Nomad for the kind words. You can find the read here.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/nomad_twentyone/status/1603031438521245696&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWrite, create, put yourself out there anon. The internet is a powerful tool and if you take the time to create something it can be very rewarding!\n\n12/14/22\n\nConor Jay Chepenik",
  "wordCount": 908,
  "readingTime": 3.4264150943396228,
  "claps": 29,
  "voters": 1
}