{
  "id": "c600eb5d82d2",
  "title": "Day 17",
  "createdAt": "2022-04-08 17:34:26",
  "tags": [
    "navy-ships",
    "bitcoin",
    "incentives",
    "ubi",
    "truth"
  ],
  "url": "https://chepenikconor.medium.com/day-17-c600eb5d82d2",
  "content": "# Day 17\n\nWoke up to a stunning view this morning. I can not get over how cool my sister's apartment is. Located in Downtown Norfolk right next to the river, it's awesome watching big ass ships float by. Stole the photo below from Google but I can see these ships from the windows.\n\n![](https://miro.medium.com/0*Sn5ZmG21Xc3NqUi1)\n\nStarted my morning with some nice cold brew and the Bitcoin conference live stream on Youtube. Two things on my mind: Truth and Incentives. Watching most of these bitcoiners talk I get the feeling they are genuine people seeking truth. [BTC sessions](https://www.btcsessions.ca/), one of the commentators, talked about how many of his friends who got into bitcoin went on to improve their lives...(and not just financially). By lowering their time preferences and reevaluating their priorities they ushered in a healthier lifestyle. One where they ate better and didn't spend money on goods they didn't think would bring them actual value. Going down the Bitcoin rabbit hole is humbling. So many of the \"truths\" I took for granted were dispelled. It's hard to find objective truth and agree on it with other people. Bitcoin helps this problem a lot.\n\nMany people in my life joke I relate every conversation back to bitcoin and that is because once you see the connection between incentives and outcomes the world makes a whole lot more sense. Rules not rulers is something I will never be able to write enough on this medium. This is how humanity wins. This is how people work together and create wealth for themselves and their family. Profit is not a dirty word. Politicians should be though. People should be allowed the room to innovate, to lower their time preferences, and an ability to save for their future so they can leave the world better than they found it. Most politicians want to centrally plan and top down control innovation. They went to increase their power and bend the world according to their bias and agenda. Lukcily, Bitcoin is a honey badger and will force and incentivize people to adopt the underlying technology no matter how much they may hate bitcoin because the incentives of the network are so well constructed. Profit should not be something people are ashamed to make. Profit it what allows a business to grow and flourish. The problem is not with profits. Th problem lies in politicians passing legislation that ruins the incentives of businesses and cause bad outcomes. Take [Prop 47 in California](https://apnews.com/article/fact-checking-160551360299) that lowered the felony charge to a misdemeanor for thieves whoe stole under $950. This seemed to lead to less people being prosecuted and more theft. Whoever passed that law probably had good intentions but it doesn't matter. People are incentivized to do the thing that benefits themselves. No no laws are going to change this. If you are broke and don't know when you're next meal is coming it's understandable why stealing food might be something you do. Making theft easier isn't the answer and neither is a universal basic income so we are even more dependent on \"big brother\".\n\nMy personal opinion is we need societal incentive structures that promote education and give people opportunity while letting them fall on their face if they don't pursue the opportunities available. To some decree humans need a set of rules of rules to agree upon, but we also can't remove the parts of a system that show people if you start a business and don't provide value with your good or service you will go out of business. In the same way Strike made Bitcoin de-facto legal tender with their announcement yesterday, California maybe petty thought a de-facto legal action. I hope to see the State make clear rules so people can innovate and experiment. Let the free market decide. Don't print trillions and give the poor billions. Inflation will hurt the poorest in society more than the stimulus/ UBI/ whatever form of \"free money\" the government gives out claiming to help the people. Second and third order effects are real, but D.C seems to be blind when it comes to addressing them. Human's are not tax farms. Removing the control of money from politicians will do wonders, in my humble opinion. I'm convinced it will create a more fair, sustainable, and equal world that still allows for the incentives of capitalism that allows human to acquire and grow wealth. Typically the more certainty people can have in the future, the more they are willing to save and participate in low time preference activities.\n\nIncentives and truth. Neither will ever be perfect but if you seek truth and set up win-win incentive structures in your life you will likely be better off. Thanks for reading anon. Until tomorrow.\n\n4/8/22\n\nConor Jay Chepenik",
  "wordCount": 797,
  "readingTime": 3.207547169811321,
  "claps": 0,
  "voters": 0
}