{
  "id": "c63ec923447b",
  "title": "Day 148",
  "createdAt": "2022-08-18 03:26:23",
  "tags": [
    "wealth",
    "sales",
    "life",
    "poker",
    "grateful"
  ],
  "url": "https://chepenikconor.medium.com/day-14-c63ec923447b",
  "content": "# Day 148\n\n![](https://miro.medium.com/0*9YdG5iYt6HeF941s)\n\nSaw something that was super powerful today. Someone said the sign of a wealthy person is they don't have to set an alarm clock in the morning. This resonated with for me to a couple of reasons. The main one being that wealthy people don't have to live life on other people's time. They can do as they please and wake up on their own schedule. Most people think of wealth as money in a bank account, but this statement reminded me to reframe what wealth means. There are people who make millions every year and they still have to wake up to an alarm clock. They have massive material wealth, but they aren't truly wealthy if they still have to live life on other people's time. I would like to reach a point where I don't need an alarm clock to wake up. No easy task but a very possible one especially because of bitcoin.\n\nWealth can be measured in many ways, but I think this metric of do you need an alarm clock to wake up is one of the most clever ways. True wealth to have complete freedom and autonomy over what to do everyday seems like one of the most ideal form of wealth. Money enables this to a degree so you aren't worried about paying your bills and putting food on the table. However, many get lost in the day to day trying to get as much money as possible. Outside of being able to buy you goods, services, and influence money is pretty mid. No amount will ever make someone truly happy. True euphoria comes from spending time with the ones you love. Forming great relationships with people you genuinely care about. Money can help provide you time and cool experiences to build a bond with those people. What money can't do is make those relationships meaningful. That requires proof of work. P.O.W to show the other person you actually care about them.\n\nI think this also resonated with me because I woke up and all I wanted to do was go back to sleep. I did for 20 minutes today, but got up eventually at 7:10. The way I rearranged my apartment is by turning the main living room into the master bedroom and having the other 2 rooms be a TV and a reading room. I like having a master with a ton of space. Definitely an unorthodox layout but it feels really good having all that space.\n\nHeld a solo discovery call today at work which felt pretty good. No manager to jump in and start asking questions after I ran out of stuff to ask. I have a lot more work to do, but I don't think it should be underestimated how powerful trial by fire can be. People learn a lot when they don't have a crutch to fall back on. I believe this happens a lot in sports when people are playing down to their competition or the competition is playing up. Humans are funny things. Also helped that the guy who joined my disco call today was a genuinely nice dude. Much easier talking with IT professionals who are kind.\n\nPlayed some poker tonight which was fun. Ended up coming in second and since it was winner take all I still lost 25 bucks, but it was really fun. I like playing poker for reasonable amounts. Life is good. I feel very blessed to be alive and look forward to what the future holds. Also looking forward to returning to my hometown of Jacksonville at the end of August and spending some more quality time with people I love and care about.\n\n8/17/22\n\nConor Jay Chepenik",
  "wordCount": 621,
  "readingTime": 2.5433962264150947,
  "claps": 1,
  "voters": 1
}