{
  "id": "c6b34d405f6e",
  "title": "Day 260",
  "createdAt": "2022-12-08 01:42:18",
  "tags": [
    "mandates",
    "bitcoin",
    "mass-adoption"
  ],
  "url": "https://chepenikconor.medium.com/day-260-c6b34d405f6e",
  "content": "# Day 260\n\nThe dog was found this morning; God is good! Other good news is that the military vax mandate was also reversed and articles like the two below seem to be popping up more and more.\n\n> [**4 Takeaways From Sen. Johnson's Panel On COVID-19 Vaccines**](https://www.zerohedge.com/medical/4-takeaways-sen-johnsons-panel-covid-19-vaccines)\n\n> [**New Autopsy Report Reveals Those Who Died Suddenly Were Likely Killed by the Covid Vaccine ⋆...**](https://brownstone.org/articles/new-autopsy-report-reveals-those-who-died-suddenly-were-likely-killed-by-the-covid-vaccine/)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/gopleader/status/1600317568790589441&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nBig sign that truth will win in the end. You can try and suppress the truth but it will only come back to bite you. Kleptocrats seem hell bent on learning this the hard way. So be it.\n\nSpent some time today learning how to push github commits from the terminal to the actual repository. That was pretty cool. I need to make a resources page on the massadoption.net website. Things I'm thinking about including are [https://lookingglasseducation.com/](https://lookingglasseducation.com/) Breedlove's podcast, Preston's Podcast, maybe start a Mass Adoption podcast? and [https://www.lopp.net/bitcoin-information/full-node.html](https://www.lopp.net/bitcoin-information/full-node.html). I'm going to need to include more stuff but this is a good start. Maybe swan.com as well.\n\nImportant to make the page easy for beginners to navigate. Wouldn't be a bad idea to write up some of my own articles on good ways to earn sats via lolli, fountain, thndr games, etc. So many ways to get involved now.\n\nIn other news the birth is getting closer. My partner is handling it like an absolute champion and I can't wait to meet my granddaughter. Got a lot to brainstorm.\n\n12/7/22\n\nConor Jay Chepenik",
  "wordCount": 289,
  "readingTime": 1.090566037735849,
  "claps": 0,
  "voters": 0
}