{
  "id": "c6dccc02d5ec",
  "title": "Day 342",
  "createdAt": "2023-02-27 19:19:52",
  "tags": [
    "learn",
    "learning-how-to-learn",
    "learning",
    "education",
    "elite"
  ],
  "url": "https://chepenikconor.medium.com/day-342-c6dccc02d5ec",
  "content": "# Day 342\n\n**Learn How To Learn**\n\n![Generated with nightcafe.studio](https://miro.medium.com/0*IknSXrWXHpbPQrKL)\n\nI listen to a lot of podcasts. To the point where I have a hard time watching tv or movies unless the cinema is truly spectacular because otherwise I'd rather just be listening to a podcast. So when I say this is up there as one of the best podcasts I've ever heard my sample size for podcasts is not small. Highly recommend checking this out for ways to improve your productivity.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FlknBxBNyd9k%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DlknBxBNyd9k&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FlknBxBNyd9k%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nEmerson estimates most people retain about 10% of what you hear in a podcast. That means for every 10 words you understand 1 of them on average. Wild stat if true. Emerson also pointed out that there is science backing up the idea people will pay more attention if a test or quiz is going to come up after reading, listening, or engaging with certain material. So what better way to see how much I retained from this podcast then to lay out the things I found valuable.\n\n- Take the 80–20 rule to extremes. If you can find the 1% thing that generates 50% of the results you end up with 50x leverage instead of 4x. Of course start small and find the 20% if you haven't done so already. Once you hone in on the 20% of your time that produces 80% of the result try and dig into the 1% of that initial 20% that is producing all the results.\n\n- Read books and listen at the same time. The brain is a muscle and it will force you to be more present when reading. Might seem weird at first but trying it for 5 hours is worthwhile. Also use clickers or pens to either click when you lose focus or keep a pen hovering over the part your reading as a way to make sure you stay on track. I like how Emerson used the metaphor of a car driving and when you lose focus it's like you drove your car off the road. (or a better metaphor in my opinion is that you stopped to get gas/ir al bano). By using a clicker or pen you can spend more time on the highway rather than getting distracted by bathroom breaks/ gas stops.\n\n- Take your niche of skills, combine them, and become the best at something unique. A great Naval quote was brought up that was \"Do what to others feels like work but to you feels like play\". This ties in with my post the other day about being the one to come up with the framework that helps people find value. Find the framework you enjoy and teach others how to do it. Stop spending your entire life trying someone else's framework. There is value in trying many frameworks but you must iterate until you find the one you are amazing at completing. That way you can be the map maker rather than the map follower.\n\n- Finally, reflect more. Learning how to learn is an underrated skill. If you think back everyday on what did I do correct, what did I struggle with, and how can I improve going forward you will learn a lot. This ties in with the 80–20 rule. The only way to find that 20% and then eventually that 1% is by thinking about your processes.\n\nThese were my main takeaways. There is plenty more nuggets of information in that podcast to learn from. I like \"taking my own medicine\" so I'm going to reflect on my own life and ways I can improve things.\n\n1. Having a title in bold for some of these posts going forward might make sense. I won't stop putting day \"x\" but under it I like the idea of bolding what I would title a piece. This way Medium users can better see if this article would interest them. I also enjoy prompting AI art generators for pictures to put on my blog so coming up with a title will help me decide what to prompt.\n\n2. Quality > quantity with my Twitter threads. Some will flop and some will crush. I should spend more time looking back over what did well and which one's struggled. I enjoyed learning about Coke, Apple, & Nike but these three threads were kind of duds in regards to likes, views, and retweets.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1629886082765529088%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1629860472148176898%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1629545126191046657%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThree threads that did well were on Andrew Jackson & Central Banks, George Orwell's 1984, and Thomas Paine's Common Sense.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1615753413790146560%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1628198446896226308%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1618426720830521349%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt seems people prefer history and books > corporations and their stories. Can't blame them. One thing I will note is Nike liked the tweet I tagged them in which resulted in over 18,100 views at the time of this writing. Considering it only got 4 likes on the first tweet and next tweet in the thread only got 37 views it is a clear indicator I need a better hook on my thread to get people's interest. So going forward I need to focus more on books, history, and maybe less commentary. Just getting the facts out there rather than putting my opinion on them seems to do well. It is amazing how many views you can get if a big company like Nike favorites your tweet. The algo showed my tweet to 10s of thousands of people because Nike liked it. Next time I do write about a company I need to tag them, have a better hook, and make sure the thread is of incredible quality.\n\nThanks for reading. Never stop learning how to learn, or learning in general for that matter!\n\n2/27/23\n\nConor Jay Chepenik",
  "wordCount": 928,
  "readingTime": 3.7018867924528305,
  "claps": 0,
  "voters": 0
}