{
  "id": "c794c7a2f620",
  "title": "Day 355",
  "createdAt": "2023-03-13 01:28:43",
  "tags": [
    "massadoption",
    "fractional-reserve"
  ],
  "url": "https://chepenikconor.medium.com/day-355-c794c7a2f620",
  "content": "# Day 355\n\nMassachusetts has played a significant role in shaping America's history and culture, earning it the nickname \"Spirit of America.\" The state has a rich history, with events such as the Boston Tea Party and the Battle of Bunker Hill playing a crucial role in America's independence from Britain. Despite the progress made over the past 250 years since America secured its sovereignty in 1776, the current state of freedom in America is uncertain due to recent political polarization, social unrest, and restrictions social media platforms have been placing on free speech. The COVID-19 pandemic made it clear that there are many tyrants walking in the halls of our capital.\n\nTo ensure America's prosperity and freedom for another 250 years, we need to demand a non-corrupted monetary system that cannot be taxed through inflation. The current system has led to economic inequality, leaving many Americans struggling to make ends meet while a few benefit disproportionately. As long as the Federal Reserve can print money, there is no way our democracy can continue to function properly. The principles of freedom and self-governance that inspired the birth of America remain as relevant today as they were 250 years ago. Let me remind the reader that the second paragraph of the Declaration of Independence famously states,\n\n> _We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. - That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, - That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness._\n\nWar is undoubtedly one of the most destructive forces in human history, causing incalculable damage to societies and leaving long-lasting scars. While there are times when war may be deemed necessary, it should always be considered as a last resort. In the case of the American Revolution, it may have been unavoidable. In modern times with technological advancements we should strive to find peaceful solutions to conflicts. Economic disparities and competition for resources have often been a cause of war, which is why it is imperative to address these underlying issues. One way to achieve this is by demanding better money, as conflicts arise from the current economic system where the money printer is controlled by a select few. Bitcoin offers a solution by providing a more decentralized and fair system. If we fix the money, we can mitigate the root causes of war and build a more peaceful world.\n\nIt is important to note that central planners have taken steps to protect bank depositors, such as through the establishment of the FDIC. The problem is that these measures won't fix the systemic risks caused by fractional reserve banking. We must alter the system or risk devastating conflict. The FDIC was established in the United States in 1933, in response to the Great Depression, to provide deposit insurance and protect bank depositors against the loss of their deposits if an insured bank fails. Since its inception, no depositor has lost a single penny of FDIC insured funds. However, the root cause of bank failures is not addressed by the FDIC, which is fractional reserve banking.\n\nFractional reserve banking is a system where banks only hold a fraction of the deposits they receive and lend out the rest. This system creates credit and liquidity in the economy, but it also creates systemic risk. There is a reason FDIC insurance protects 100x more today than it did when it first started out. Sadly, 250k today has a lot less purchasing power than it did in 1934.\n\n![[https://americandeposits.com/history-and-timeline-of-changes-to-fdic-coverage-limits/](https://americandeposits.com/history-and-timeline-of-changes-to-fdic-coverage-limits/)](https://miro.medium.com/0*JTshcL71VF-03j93.jpg)\n\nWe must acknowledge that systems are constantly evolving, and it's crucial to recognize that the current monetary system may no longer be suitable for the digital age we live in. This is evident in various systems, including computers, energy infrastructure, roads, and even money. In today's interconnected world, a few tweets from prominent people can cause a bank run, highlighting the vulnerability of the current system. Although the current monetary system has been in place for centuries and has undergone many changes, fractional reserve banking has completely undermined our ability to thrive as a species, despite the best efforts of central planners.\n\nTo address the root causes of economic conflicts, we need to recognize that sometimes systems can get so messy that it just makes sense to start over. It's like writing computer code, where the more patches and fixes you add, the more tangled and convoluted it becomes. Eventually, it's more efficient to scrap the old code and start fresh. Similarly, the current monetary system has undergone many changes and patches over the centuries, but fractional reserve banking has created systemic risks that are becoming increasingly untenable. The FDIC was established as a temporary fix for a system that had a little hemorrhaging, but now it's clear the patient is gushing blood. We need a significant overhaul before the system bleeds out completely. With Bitcoin we can evolve the systems we've built to maintain our financial sovereignty and ensure that our children aren't paying for the mistakes of previous generations for many years to come.\n\nFractional reserve banking chips away at the things that made America great. We love to preach about free markets here in the U.S, but in reality, it's like a game of Jenga where every block we pull out weakens the foundation until the whole structure falls apart. The cost of capital in a true free market should be determined by supply and demand, not a group of 12 people on the FDIC. When banks create credit out of thin air, they distort the supply of money and credit, which distorts prices. This creates malinvestments, bubbles, and busts, just like how too many Jenga blocks pulled from the bottom can cause the whole tower to collapse. Fractional reserve banking is not free market capitalism, it is a form of central planning that risks destabilizing the entire system. Imagine trying to build a Jenga tower, but the blocks you were using were constantly changing size and shape. It would be nearly impossible to maintain stability and predictability. This is a crude example, but it helps to illustrate how fractional reserve banking can lead to erratic behavior and instability in the economy.\n\nNow, compared to the U.S. Treasury market, Bitcoin is still incredibly small and illiquid, which means that now is the time we should be trying to get the American economy on a Bitcoin standard. El Salvador is leading the way in nation-state adoption, but while we retain the world reserve currency, it might make sense to put some of the next world reserve currency on our balance sheet. The fractional reserve system is bound to blow up one day. Even if we manage to kick the debt can down the road one more time, it cannot go on forever. The game theory makes it pretty clear that money not controlled by any central authority or government is going to be valuable in a future where more people are spending the majority of their time online. By opting out of the current financial system and using Bitcoin instead, we can reclaim our financial sovereignty and ensure that our unalienable rights of Life, Liberty, and the pursuit of Happiness are secured for generations to come.\n\nThat is the goal of MassAdoption. MassAdoption is aimed at helping businesses in the New England area realize that we can be the change we want to see in this world. The organization aims to show as many people as possible that we do not need to ask permission from tyrants to secure the unalienable rights our founding fathers granted to us when they signed the constitution. New England is a special place, and we must work together to keep it that way for generations to come.\n\nThe history and culture of Massachusetts is special. We have played a vital role in shaping America's identity and democratic values. Our founding fathers gave us a clear guide of what to do when the current state of freedom in America is uncertain. Fortunately we don't need to take up arms to alter the Government anymore. To ensure America's prosperity and freedom for the next 250 years, we just need to demand a non-corrupted monetary system that cannot be taxed through inflation. By opting out of the current financial system and using Bitcoin instead, we can reclaim what made America the world's beacon of hope.\n\nMassachusetts has a unique opportunity to lead the way in promoting Bitcoin adoption and securing financial sovereignty for its citizens. Let's ensure that the 'Spirit of America' remains strong and vibrant for generations to come.\n\n...\n\nOk feels like I made some progress on this draft for the Print Edition of MassAdoption. Going to send this to fellow editor Dawdu now and see how I can keep improving this essay.\n\n3/12/23\n\nConor Jay Chepenik",
  "wordCount": 1551,
  "readingTime": 6.052830188679246,
  "claps": 1,
  "voters": 0
}