{
  "id": "c7db023d66d8",
  "title": "Day 700",
  "createdAt": "2024-02-21 03:29:15",
  "tags": [
    "common-sense"
  ],
  "url": "https://chepenikconor.medium.com/day-700-c7db023d66d8",
  "content": "# Day 700\n\nBeen meaning to write something for the Common Sense Movement and I must say it feels very good to finish this article:\n\n**Equality Under Law: The Foundation of Order**\n\nIf people know they are in a place where the law won't be enforced they are more likely to break said law. This might be hard for the governor of California to understand yet it is evidently clear to everyday citizens, such as a Target cashier.\n\n![](https://miro.medium.com/0*icRjD4suVx_LeK8l)\n\n[https://x.com/ggreschler/status/1752759720363065387](https://x.com/ggreschler/status/1752759720363065387?s=46)\n\nSome people might claim the Newson's policies are equitable and just, but history shows that enforcing total equality requires oppressive policies that lead to universal misery. This is evident from the numerous failed experiments with communism over the past century. In every attempt to build a communist utopia founded on the principle of equality between all citizens, the result has been an equality of poverty, deprivation, and suffering rather than prosperity. From the Soviet Union to Maoist China to Cuba and Venezuela, communism has inevitably proven incompatible with thriving societies. Communist systems descend into authoritarianism and economic dysfunction in the vain attempt to enforce parity between all members of society.\n\nThe real equality we should aim for is judicial fairness, where everyone, regardless of status, wealth, or personality, is seen equally in the eyes of the law. This ideal, while challenging due to inherent human biases, represents a fundamental goal for a judiciary that truly values its role in society. Acknowledging our imperfections, striving for impartiality and fairness is the mark of a legal system committed to justice and equity, even if achieving perfection is an unattainable standard.\n\nOn the other hand, policies that practically promote criminal behavior stand as a profound misstep for any government. Manipulating legal frameworks to exempt genuine offenders from prosecution, coupled with proclaiming ideals of equality while concurrently showcasing preferential legal treatment based on political affiliations is an insanely flawed approach for a country's judiciary. Such actions not only undermine the foundational principles of justice but also erode public trust in the rule of law. No one with common sense wants to foster a climate where lawfulness is diminished and societal division is exacerbated.\n\n**Winner States Vs Loser States**\n\n![](https://miro.medium.com/0*xgroWu2eQWbM_QCE)\n\n[https://x.com/kevinolearytv/status/1759658499733151993](https://x.com/kevinolearytv/status/1759658499733151993?s=46)\n\nRegardless of what you think about Donald Trump, seeing him get fined hundreds of millions of dollars in New York for a victimless crime is an atrocity. It's as anti American as Elon not getting the compensation package that shareholders thought was impossible but ended up being achieved.\n\n![](https://miro.medium.com/0*bzd5mctlzoRzVwky)\n\n[https://x.com/andrewrsorkin/status/1752872326536831064](https://x.com/andrewrsorkin/status/1752872326536831064?s=20)\n\nElon is not even a republican but because he believes in freedom of speech, like the US constitution grants, he is under attack. Despite what the legacy media wants you to believe the prevailing division in politics transcends partisan labels of Democrat or Conservative. The real crux is establishment versus anti-establishment. On one side are those who prioritize rent-seeking, corruption, money, and power accumulation. On the other are champions of liberty who advocate for individual rights and true democratic values.\n\n![](https://miro.medium.com/0*K7y2AAqmxSa4e50W)\n\nFortunately, there is hope as visionaries go where innovation is encouraged rather than stifled. As Kevin O'Leary discerns, there are 'winner states' and 'loser states' emerging. States embracing free enterprise, competition, and disruptive ideas draw pioneers in business, technology, and society. Those clinging to old models end up pushing them away. Elon Musk looks ready to strategically shift his business headquarters from a loser state to a pro-freedom winner state.\n\n![](https://miro.medium.com/0*u3fWBH7P3QuO_HTq)\n\n[https://x.com/elonmusk/status/1752922071229722990](https://x.com/elonmusk/status/1752922071229722990?s=46)\n\nThis exemplifies the innovative spirit at the heart of capitalism, where competition to provide the most compelling goods and services at the lowest costs breeds dynamism. Companies that cease offering quality and value fall behind. States that constrain the conditions for visionaries to take risks and challenge conventions similarly falter.\n\nWhen traditional political labels fail, people like Musk and O'Leary reveal that the fundamental clash is between those protecting the status quo and those forging new frontiers of human progress through the power of competitive capitalism to lift all boats. In this, the beauty of competition shows itself as the spark that drives people to create, improve and maximize prosperity.\n\nRelocating a publicly listed company is an immensely challenging task, so one must commend Elon for doing something rather than whining about an [unfair ruling](https://www.theguardian.com/technology/2024/jan/30/elon-musk-tesla-pay-package-too-much-judge-rules#:~:text=A%20Delaware%20judge%20has%20ruled,and%20struck%20down%20the%20package.) and doing nothing. However, the shadow of concern looms large when judicial decisions seem to sidestep reason in favor of apparent corruption. Such choices, while perhaps overlooked in the short term, are likely to reveal their folly over time.\n\n**Decentralization Is What Helped Make America So Special**\n\n_**'Many forms of Government have been tried, and will be tried in this world of sin and woe. No one pretends that democracy is perfect or all-wise. Indeed it has been said that democracy is the worst form of Government except for all those other forms that have been tried from time to time....' Winston Churchill**_\n\nDecentralization has been a cornerstone of what makes the American journey into democracy uniquely enduring and dynamic. This grand experiment in governance has navigated through its imperfections with remarkable resilience, largely due to the thoughtful distribution of power and a robust system of checks and balances. These mechanisms have safeguarded the democratic ethos from potential erosion by power-hungry entities, ensuring a balance that fosters progress and stability.\n\nHowever, the commitment to the rule of law showcases glaring disparities across the nation, revealing a concerning inconsistency in our governance system. While some states rigorously enforce laws, championing justice, others deviate from these principles, exposing a divide in our national ethos towards fairness and effective governance. Such discrepancies not only test the strength of our democratic experiment but also raise critical questions about the long-term viability of our foundational ideals amid growing divergence.\n\nThis situation underscores the importance of civic engagement and moral courage. Witnessing injustice - whether it's an act of violence or systemic corruption - and remaining silent makes one complicit in the problem. The belief that individual action is futile is a misconception; influence begins at home and even affecting change within one's immediate circle can have a ripple effect. It's imperative to challenge apathy and engage actively in the collective effort to uphold the principles of democracy and integrity.\n\n**Learning From Those That Helped Create America**\n\nThere is a lot we can learn from the seminal works that guided the inception of the American republic. [The Federalist Papers](https://amzn.to/3ONXEmY) and [Thomas Paine's \"Common Sense\"](https://amzn.to/3OQtcZM) are two great examples. These documents, born from the revolutionary zeal for freedom, champion a system of governance that not only amplifies a multitude of voices but also enshrines the safeguarding against the tyranny of unchecked power. They advocate for a vision of democracy as a vibrant theater of competing ideas, where governance is an ongoing dialogue aimed at the common good, fundamentally anchored in the consent of the governed.\n\nCentral to this vision is the recognition that the smallest minority is the individual. The American experiment's success lay in its foundational commitment to protect individual rights, thereby ensuring that the collective thrives. This individual-centric approach fostered a society where personal liberty and responsibility were paramount, creating a fertile ground for innovation, ambition, and progress.\n\nToday's political climate, with its careerism and judicial corruption, strays from this founding vision, emphasizing the urgency to revisit these foundational texts. They remind us that democracy relies on governing with the people's consent and underscore our duty to uphold the principled governance that marked America's beginnings.\n\n**Ultimately Common Sense Will Prevail**\n\nNapoleon Bonaparte famously stated, \"Never interrupt your opponent while he is making a mistake,\" and this resonates profoundly in the context of today. With the clarity that comes from retrospection and the collective voice of dissent, it will become increasingly evident to those paying attention that the establishment does not serve their interests. By boldly calling out their missteps, we can ensure they unravel through their actions. This approach isn't just about criticism: it's about holding onto the belief that transparency, accountability, and active participation can restore the foundational values that make America great.\n\nVote with your money. Move to states that respect private property. When confronted with irrationality, whether face-to-face or online, take a stand against it. There's a narrative pushed by those with malevolent intentions, suggesting that efforts to effect change are futile. However, this couldn't be further from the truth. The very fabric of America was woven by determined individuals who placed the ideals of liberty above their own survival. It's time to rekindle that indomitable American spirit.\n\n— - - -\n\nReally did not feel like writing tonight, but I couldn't break a now 700 day streak. Pretty incredible to think I've been at this for almost 2 years now. Proud of how far I've come as a writer. The only way to achieve mastery at anything is to put in the work and I'm just getting started. Many more days to come😤😤😤😤\n\n2/20/24\n\nConor Jay Chepenik",
  "wordCount": 1483,
  "readingTime": 6.429559748427673,
  "claps": 1,
  "voters": 1
}