{
  "id": "c9a07ccd3667",
  "title": "Day 349",
  "createdAt": "2023-03-07 02:55:33",
  "tags": [
    "bis",
    "health",
    "mass",
    "print-magazine",
    "grit"
  ],
  "url": "https://chepenikconor.medium.com/day-349-c9a07ccd3667",
  "content": "# Day 349\n\nI'm planning on creating a print magazine for MassAdoption with my friend Dawdu and it's going to be dope. The theme will be 'The Spirit Of America' and will incorporate themes about Paul Revere, (or the modern day equivalent who is warning people about the CBDCs coming). I'm trying to think about how to create a modern day Boston Tea Party 2.0 type ordeal with this.\n\nToday's post is going to be about planning out the article I want to write. So I'll start by writing about all the things I appreciate about Boston.\n\n- It's history for starters.\n\n- The old buildings and incredible architecture around the city.\n\n- The Boston Tea Party, which despite not being popular with some of the founding fathers because it was the destruction of private property, did help spark the revolution that led to our independence.\n\n- The spirit of America being here since it was one of the first settled places.\n\n- I've got my doubts about the future worthiness of higher education in a digital world where people can teach themselves almost anything online, but it is pretty cool that Boston is home to some of the greatest colleges in the country.\n\n- The grit of the first settlers who came here despite everyone telling them they couldn't.\n\nI'll be honest right now. I feel like I have way too many things going on at the moment. Trying to do a podcast, going through coding bootcamp, having a baby, writing, working on this MassAdoption stuff. Guess what? Good.\n\nWhen things get overwhelming I just got to keep putting one foot in front of another. I finished listening to that Joe Rogan pod with Russel Brand while running today. When I set out on the run I had intentions to only run for 1 or 2 miles tops. I went 4.77 instead. Why? Well because I got so inspired by those two and the conversation they were having. So many people today are depressed because they don't do anything. The people who are comfortable with themselves, their careers, their families, etc don't want to tell other people how to live. They want to get on with their lives and keep doing their thing because they actually take action. They do the hard work life requires to be successful and they realize their time is not well spent trying to tell other complex human beings how to live. The fat, lazy, piece of shits who do nothing but rent seek are the type of people trying to control how others live. Ignore them. Keep listening to enlightened people. I mean seriously look at these two.\n\n![](https://miro.medium.com/0*Dn3NocmnjzN1cszT.jpg)\n\n![](https://miro.medium.com/0*sBCEunxH1NW8ZNmf.jpg)\n\nOne works for the Bank Of International Settlements pretending he has a right to control the money for the globe and the other is the Belgium health minister. These people can't even take care of themselves, how the hell should they be expected to control A. The global monetary system or B. The Belgium health system. For those who haven't figured it out yet: they can't. They are leeches on society who rent seek, drain resources, and detract value from the productive members of society. There are plenty of podcasts out there with enlightened people. Spend your free time with those people, not people like the two above. Joe Rogan and Russel Brand are far from perfect, but they are two great examples of enlightened people in my opinion. There are 1000s more. Hell maybe there are 10,000+ enlightened people. Maybe even 100,000+. I really don't know but I'd define enlightened as those who just wish to contribute value to the world, accept they are flawed, and get on with their lives without imposing their views on others. It's fine to share your views and have conversations. It is a whole other thing to demand people inject their bodies with pharma products or declare money has to be backed by a Government. LOL. I am obviously a Bitcoiner for anyone who has read my posts, not a gold bug, but gold is what the free market chose as money for thousands of years. We've been running a fiat currency experiment for 50 years and it's been a shit show to say the least. Needless to say money is what the free market deems money. Not what kleptocrats deem money.\n\nAnyways, that is not what I wanted to write about for this print magazine. I just felt a little overwhelmed because of all the stuff I need to get done for the future and after this rant I feel better about it. I can already tell this piece for the Mag is going to be like my football piece for Bitcoin magazine. It's going to take me some time to get it out there, but draft after draft on this Medium and I will. Got a hard deadline of Sunday to get it over to my guy Dawdu so the gears are already turning in my mind. Got some great feedback on the Bitcoin Magazine article and not going to lie there were moments when I thought I'd never get the piece published. The power of putting one foot after the other.\n\nWill write more tomorrow, but I'm pretty content after that whole rant about the fatasses who think they can tell others what to do because they work for tHe GoVeRnMeNt. Or whatever the hell you want to deem an organization like the BIS. I will say I think that theme is what I want to hone in on for my piece. This idea America is founded by badasses. By men who take action. Not those who try and decree other people do their bidding. No men and women who go out and inspire others. Those who lead by example. These people are the trojan horse that will wake up the 60% of people on the fence unsure if they should trust big brother or stand up when tyranny starts taking place. Yea that's a good framework to consider. I am excited to see what I produce tomorrow for this piece.\n\n3/6/23\n\nConor Jay Chepenik",
  "wordCount": 1013,
  "readingTime": 4.205974842767295,
  "claps": 0,
  "voters": 0
}