{
  "id": "cac9d5b50822",
  "title": "Day 277",
  "createdAt": "2022-12-25 00:59:42",
  "tags": [
    "social-media",
    "adhd",
    "substack",
    "energy",
    "mass-adoption"
  ],
  "url": "https://chepenikconor.medium.com/day-277-cac9d5b50822",
  "content": "# Day 277\n\nWrote the first Substack for Mass Adoption. I enjoyed typing this one out and look forward to doing more as I attend meetups.\n\n> [**Mass Adoption Is Happening**](https://massadoption.substack.com/p/mass-adoption-is-happening?utm_source=profile&utm_medium=reader2)\n\nIt was an easy article to bang out because I discussed exactly what I talked about at the meetup. Energy. The base layer of society. The thing politicians want to seemingly eliminate and also print money out of thin air to buy. Will see what plays out in the future, but I do think this substack will age well.\n\nMy girlfriend sent me this Ted talk about getting off social media and it is worth the 12 minute watch.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F3E7hkPZ-HTk%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D3E7hkPZ-HTk&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F3E7hkPZ-HTk%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI don't plan to stop using Twitter after this talk, but the visceral reaction to hearing, \"get off social media\" is all the moe reason why it's important to watch. If you want the sparknotes Doctor Cal explains why social media is like a slot machine that ruins our ability to have deep focus. Many people are struggling to sit down and focus on writing a long article, coding an algorithm, or learn a new instrument. Social media probably has something to do with why ADHD is so prevalent in society. Hopefully kids can be push through these challenges to achieve great things. I know as a young adult Twitter has been both incredibly useful and a massive time waster. I have yet to come anywhere close to mastering my social media use so I can only imagine what a 10 year old with a smart phone feels like. I wrote a piece a long while back on here titled \"Hi my name is Conor and I'm a dopamine addict\" and this video reminded me of that. We are resilient creatures; humanity will figure it out!\n\nGot tapas, churros, and Sangria at my favorite restaurant tonight, shout Dali. It was a lovely Christmas eve dinner with my partner and I'm feeling blessed. Happy Holidays anon. I hope it was a great day for you! If you're reading this after the holiday season then think about Christmas trees. Man do they smell amazing. I'd put the over/under for how long we live our tree up at February😂 .\n\n12/24/22\n\nConor Jay Chepenik",
  "wordCount": 389,
  "readingTime": 1.4679245283018867,
  "claps": 0,
  "voters": 0
}