{
  "id": "cae900331b1b",
  "title": "Day 282",
  "createdAt": "2022-12-29 15:54:20",
  "tags": [
    "bitcoin",
    "podcasts",
    "russia",
    "usa",
    "nation-state-pride"
  ],
  "url": "https://chepenikconor.medium.com/day-282-cae900331b1b",
  "content": "# Day 282\n\nListened to some fantastic podcasts this morning. The first one was a Joe Rogan Experience featuring my favorite actor from The Walking Dead.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F5PQuuviPU7xHqcqZOuCFxM%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F5PQuuviPU7xHqcqZOuCFxM&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fd5ac9cc928ad0bfbf25e3e9a&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nIt was fascinating to hear Jon talk about his time spent in Russia at one of their most prestigious acting schools. I had no idea this is what helped him become such a fantastic actor. It is also cool to learn about what Russia is like from an American perspective. There is not much room for typical western pleasantries because people in Russia get straight to the point. It makes me more appreciative to be in the United States. It is no joke the plight many Russian people have had to experience. I've always been fascinated with their culture and I remember I read a book called Zinky Boys in college detailing some of horrible experiences people had to suffer as a result of the Afghanistan War Russia fought in. Russians are tough as nails and I'm sure many of the citizens are amazing people who are dealing with a corrupt regime. I do think both countries, The U.S and Russia, have massive issues. There is no doubt about that. There is also a great deal of pride associated with one's nation-state and striving to become great at something so you can proudly represent your country. Despite the many atrocities committed by both the U.S Government and the Russian Government we the people hold a lot of pride for our country. Russian's call their land \"The Motherland\" while America has had this American exceptionalism thing going for a long time. The fact I can freely type my opinions, have a nuanced discussion criticizing these Governments, and not fear for my life should serve as a great reminder the U.S.A is an amazing place to be. There are countless problems and corruption happening in the highest levels of our Government but there is also hope to fight them. Bitcoin can help fix this and so can our constitution. Never stop defending your rights. God bless America, God bless the 2nd amendment (the amendment that protects the other 9 OG amendments) and God bless Bitcoin.\n\nThe other podcast I listened to today was Guy Swan's [Bitcoin Audible](https://open.spotify.com/episode/6Bmgr4twFCau37hMTUpV5t?si=-73dDfhSTmWSwX47X-gyIg) who read an excerpt from this article.\n\n> [**Structural Adjustment: How The IMF And World Bank Repress Poor Countries And Funnel Their Resources...**](https://bitcoinmagazine.com/culture/imf-world-bank-repress-poor-countries#:~:text=Currency%20devaluation,Higher%20interest%20rates)\n\nI ended up creating this poll and writing a massive Twitter thread which I'm going to tweak here before posting the thread under my poll.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1608465394733580293&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMy personal opinion is yes. There are two works that influenced my decision. \"Confessions Of An Economic Hitman\" by @jperkinsauthor where he shows how the IMF and World Bank loan money to developing countries so these countries can pay American companies to build the infrastructure.\n\nThis infrastructure rarely, if ever, meets the goals of what was promised. The end result is developing countries become straddled with debt they struggle to pay back with interest while developed countries gain control over these countries resources.\n\nI knew it was a sinister scheme forcing developing countries to take on debt they can't feasibly pay back but it's worse than that. Rather than let these countries declare bankruptcy they give them another loan so Western institutions don't have to take a balance sheet hit.\n\n@gladstein has written an excellent article about this outlining how these new loans come with many stipulations. The IMF and World Bank prefer working with dictators because they are much more likely to boot strap their citizens with debt if it means they can get quick cash.\n\nThe article can be found here. [https://bitcoinmagazine.com/culture/imf-world-bank-repress-poor-countries#:~:text=Currency%20devaluation,Higher%20interest%20rates](https://bitcoinmagazine.com/culture/imf-world-bank-repress-poor-countries#:~:text=Currency%20devaluation,Higher%20interest%20rates) It is a long read so I used @TheeGuyswan's Bitcoin Audible podcast to consume the article.\n\nAnyone reading this should take the time to do their own research on the subject. Based on what I've learned it is pretty clear there is no feasible way for these developing countries to ever pay back these loans. This is by design to keep developing countries beholden to their creditors.\n\nOne stat that stood out to me from Alex's work \"Between 1970 and 2007 - from the end of the gold standard to the Great Financial Crisis - the total debt service paid by poor countries to rich ones was $7.15 trillion.\"\n\nThis leads me to believe that the most powerful institutions in the world are using debt rather than guns to keep those less fortunate in chains. At least until democracy starts taking form in some of these places which typically results in a \"coincidental\" death.\n\nThe fiat system is beyond repair. The IMF and World Bank claim to be helping developing countries but they wreak havoc on the citizens of the countries they help. I've yet to see any examples of these loans actually help bring developing countries out of poverty.\n\nIf you have examples of the World Bank and IMF \"reducing poverty, increasing shared prosperity, and promoting sustainable development.\" I'd love to see them. Please post below so I can remain as neutral in my analysis as possible.\n\nBitcoin would make it difficult for organizations like the IMF and World Bank to loan indefinitely because it would prevent them from creating money out of thin air to lend. In the current system these organizations face no risk because if a country can't pay back their loan...\n\nthe IMF and World Bank will just loan to them again and include a bunch of stipulations that essentially screw the citizens in order to enrich the organizations who can lend indefinitely. Under a Bitcoin standard there would be no infinite money printer to lend.\n\nBitcoin doesn't fix all the atrocities in the world but it makes a lot harder to impose debt slavery on the most disadvantaged populations. Fiat is slavery; Bitcoin is freedom.\n\nNever stop calling out the B.S anon. Good is going to win because the truth doesn't need manipulated to manifest itself! The truth can defend itself no matter how much bad actors try to obfuscate it. Excited for what the future holds. I'm also proud to be an American who defends the constitution rather than tries to trample it for personal gain.\n\n12/29/22\n\nConor Jay Chepenik",
  "wordCount": 1053,
  "readingTime": 3.973584905660377,
  "claps": 0,
  "voters": 0
}