{
  "id": "cb1271a569c5",
  "title": "Day 66",
  "createdAt": "2022-05-27 21:27:22",
  "tags": [
    "parenting",
    "bitcoin",
    "advice",
    "friendship",
    "relationships"
  ],
  "url": "https://chepenikconor.medium.com/day-66-cb1271a569c5",
  "content": "# Day 66\n\nMy work has this thing called donut.ai that matches us up for a Zoom call with random people at the company and of course, I always ask the person I get matched up with what they think about Bitcoin. The responses are always interesting and usually it is software engineers who I'm talking with. I work for a SaaS company so it makes sense we are full of software engineers. Pretty much every time I ask no one has a high opinion of Bitcoin. Most of them just haven't done much research. It is good to have a conversation though and hear from those who see Bitcoin differently than how I do. Like Greg and Max discussed on the Swan Podcast I posted about yesterday: crypto attracts the best and worst people. The people who want humanity to thrive and the people who want to scram and grift their way to wealth. Thus these software engineers bring up legitimate points about some of the bullshit that goes on in crypto. I love doing what I can to talk about why Bitcoin is different but everyone has to go down their own rabbit hole. Proof of work in all facets of life baby.\n\n![](https://miro.medium.com/1*nifrWp9MEOkfe5HRhNHMcQ.jpeg)\n\nEnjoy this painting very much ^. Bunch of buddies are coming to town this weekend and I'm looking forward to hanging with them. Nice long weekend ahead😎 . It's amazing how easy it is to pick up right where I left off when seeing my buddies after long stretches of nada. That is definitely one of the signs of a quality friendship. When it doesn't matter how long it has been since you've last seen someone and you immediately pick up where you left off. Life is better when you have quality relationships.\n\nSome of the things I'd like to prioritize going forward. Spending less time on Twitter. Getting into a good habit of exercising again. Might even hit a light run after this since I'm still coming back from my appendicitis. Keeping a positive attitude at work. Reading more books about religion. Continuing to orange pill my coworkers. Learning to set up my day to work smarter not harder. Making time to learn about parenting best practices and supporting my girlfriend who is carrying my unborn child. Keeping a calm attitude. The software engineer I spoke with today might not have been a bitcoin bull, but he did have children and I asked him for advice since I'm going to be a new Dad. He said keeping a level head in high stress situations is probably one of the biggest keys to being a good parent. Great advice and it applys to almost everything in life. Two wrongs don't make a right. You do yourself no favors rising to someone else's level. Keep calm and carry on anon.\n\nGoing on the Nyc & Gryff show tomorrow morning so I should have some good stuff to write about. Hey now!\n\n5/27/22\n\nConor Jay Chepenik",
  "wordCount": 497,
  "readingTime": 2.0754716981132075,
  "claps": 0,
  "voters": 0
}