{
  "id": "cc1fe1f51636",
  "title": "Day 677",
  "createdAt": "2024-01-29 03:28:14",
  "tags": [
    "nietzsche",
    "dostoevsky"
  ],
  "url": "https://chepenikconor.medium.com/day-677-cc1fe1f51636",
  "content": "# Day 677\n\n![](https://miro.medium.com/0*YE83l_qYqxRGsw3k)\n\nNietzsche and Dostoevsky are names that pop up frequently in literary discussions, yet I've never fully immersed myself in their books. However, a recent YouTube video I watched didn't hold back in its critique, boldly labeling Nietzsche as a cuck in real life. This is despite Nietzsche writing as if he was an uber-chad. As for Dostoevsky, the video didn't spare him either, branding him a degenerate gambler, though arguably less cucked compared to Nietzsche. These blunt assessments have piqued my curiosity, and I'm now intrigued to dive into their works and form my own opinions about their controversial legacies. There was some praise for these individuals as well, but I had no idea what troubled lives each of these gentleman had.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FQx7T_NrL36Y%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DQx7T_NrL36Y&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FQx7T_NrL36Y%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOne of the best things about this video is how the orator insightfully delineates the tendencies of narcissists to inflict pain on others when their own desires are unmet, encapsulating the notion that \"hurt people hurt people.\" However, this phrase, while poignant, doesn't encompass the full complexity of human responses to pain. It's critical to acknowledge that the journey of those who are hurt is not unidimensional. Indeed, while some hurt people may cause harm, they also possess the potential to channel their experiences into helping others, often through creative expressions like art, music, or writing.\n\nThis duality suggests that pain, while it can lead to negative outcomes, can also be transformative. Those who have endured suffering can offer a wealth of knowledge, empathy, and insight, born from their own trials. Their art or creative works often serve as conduits for healing, both for themselves and for their audience, providing a unique perspective that someone untouched by similar experiences might not be able to offer. Thus, the narrative of hurt individuals is complex, characterized by both the capacity to wound and the profound ability to contribute positively to others' lives through their unique insights and creative expressions.\n\n1/28/24\n\nConor Jay Chepenik",
  "wordCount": 326,
  "readingTime": 1.430188679245283,
  "claps": 0,
  "voters": 0
}