{
  "id": "cc2e4af011b9",
  "title": "Day 723",
  "createdAt": "2024-03-15 03:05:04",
  "tags": [
    "the-fountainhead"
  ],
  "url": "https://chepenikconor.medium.com/day-723-cc2e4af011b9",
  "content": "# Day 723\n\nTonight I finished the Fountainhead. If you are unsure which is better collectivism or individualism I urge you to read that book. It's worth reading regardless, but especially if you think the collective should come before the individual. My opinion: hell no. Collectives consist of individuals, after all. It's the parasitic entities that impose their ideologies on others. Individuals who create live for their own sake. It's one thing to convince people of something by the merit of your idea. It is entirely different to coerce, shame, or force someone to accept your ideas.\n\n![](https://miro.medium.com/1*ipJy1g0MDA6jRYPUsljQAg.png)\n\n**\"Thousands of years ago the first man discovered how to make fire. He was probably burned at the stake he had taught his brothers to light, but he left them a gift they had not conceived of, and he lifted darkness off the earth.\"- Howard Roark**\n\nSociety moves on but we keep repeating the same mistakes over and over. It's literally the definition of insanity, but that makes sense. Think about how insane a society is! The towering skyscrapers, the vast and complex food systems, the abstract concept of money - countless intricate mechanisms interwoven, barely held together by a thread, yet somehow functioning in harmony, until that delicate balance is disrupted.\n\nIt is because of creators like Ayn Rand others can wake up and see the value in doing something because you believe it is right, not because someone else thinks it is right. If I had to give a TL;DR of the book it is the sentence before this one.\n\nThis idea applies to Bitcoin. I will continue to try and convince people about why it's the best money, but I will no longer try and tell them to buy it. Rather I'll tell people to study it, learn about it, figure out if they prefer fiat or Bitcoin. Fiat is literally for second handers. Bitcoin is for those who can think for themselves and see collective money controlled by a small group for the greater good is not it.\n\n**\"Rulers of men are not egoists. They create nothing. They exist entirely through the persons of others. Their goal is in their subjects, in the activity of enslaving. They are as dependent as the beggar, the social worker, and the bandit. The form of dependence does not matter\" - Howard Roark**\n\nBe a creator, not a second hander! :)\n\n3/14/24\n\nConor Jay Chepenik",
  "wordCount": 401,
  "readingTime": 1.7132075471698114,
  "claps": 0,
  "voters": 0
}