{
  "id": "cd5368a5d42d",
  "title": "Day 263",
  "createdAt": "2022-12-11 01:44:49",
  "tags": [
    "russia",
    "usa",
    "nation-states",
    "dips",
    "crypto-bros"
  ],
  "url": "https://chepenikconor.medium.com/day-263-cd5368a5d42d",
  "content": "# Day 263\n\nWent up to Salem Mass with my Girlfriend today. Interesting town with a lot of cool restaurants and probably the highest number of people with pink, green, or blue hair per capita in the U.S.A. Hahahaha seriously I saw so many with colored hair walking around that town. To each their own. There was a cool Tibetan store and we got some good smelling incense. Some might claim incense are for cat ladies, but I love the smell. No shame lighting those bad boys in order to get my apartment smelling like a lost buddhist temple.\n\nRecently I have been seeing a lot of speculation on Twitter about this being the end of the bear market soon. Including talk of the Fed getting ready to print to oblivion. Hahahahaha I still laugh at the tweet where someone posted this photo with the caption \"Crypto bros be like: You call that a dip?\" Hahahaha so good.\n\n![](https://miro.medium.com/0*jcMQ2bohMtOrmes_)\n\nI do believe Bitcoin is going to moon hard soon. Time will tell but I'm not sure if the bear market is over. Doesn't matter. I will continue to stack sats and stay humble. If I'm wrong I'm going down with the ship. If I'm right I will enjoy early retirement.\n\nIn other news it looks like I might get my Bitcoin Magazine Article published and if so I might write a 4th for the year if I can squeak it in. One of the prompts Bitcoin Magazine was looking for at the E.O.Y is to reflect on what 2022 meant to us as Bitcoiners. One word: verification. This year has shown more than any other year that verifying bitcoin on your own node and holding your own private keys is one of the most important things you can do. Third parties are security holes. Then again, maybe this year just had the most capital involved since Bitcoin and crypto as a whole crossed the 3 trillion dollar market cap threshold. Verifying bitcoin on your own node and holding the private keys has always been relevant but this year it just seemed more important than ever since some of these ponzi schemes and pump & dump coins got so much fiat currency value behind them. In the beginning you had no other option. Now it is at the point where there are so many companies who will gladly custody your bitcoin people and people are incentivized to outsource it like they do with their fiat currency to their bank. If you haven't been in this space long enough it is easy to get burned.\n\nAnother thing this year has down is humbled me while growing prideful at the same time. Going through these dips is not easy by any stretch of the imagination. Seeing the price draw down from 69k to 16k and having the cojones to keep smash buying sats despite extreme volatility takes a psychopath. I mean that word in the most endearing way possible. In the same way David Coggins is an absolute psycho for punishing himself the way he does day in and day out Bitcoiners are psychopaths about their favorite form of money. Both Coggins and Bitcoiners get to experience the darkness so we can come out the other side stronger. A lot of people hate on Coggins and he said something on the J.R.E that I will never get out of my head. \"You will never meet a hater more succesful than you\". Real shit David. Bitcoiners are buying these dips and when the next bull market comes there are going to be many people telling us we got lucky. It is what it is. Wasted energy to focus on those people.\n\nEnough about what 2022 meant for Bitcoin. I'd like to move on to this based video of Victor Bout the guy we traded for Brittany Griner. Not here to make a hot-take about trading an arms dealer for a WNBA superstar. I'm glad an American is back on U.S soil. I'm just disappointed we didn't get back the Marine Paul Whelan as well who I only heard about because of this trade going down. I'm also dumbfounded how based this Victor guy seems. The M.S.M told us he was a horrible arms dealing individual (from what I saw at least) and it turns out the guy seems to realize the game is the people vs the elites. Russia and the U.S.A should be working together to create a prosperous world for all the citizens in the world. Instead the elites who control both countries are in a dick measuring contest. I'm not a supporter of dealing weapons for the war machine but almost every word Victor said in this video hit home. I'd like to see more cooperation from nation-states instead of tyranny and terrorism. It's just common sense.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jackposobiec/status/1601706244418699264&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAnyway, who knows how it all plays out. I will continue to be bullish on decentralized, open-source, permissionless hard money. It changes the incentives and gives me confidence to start a family. The world is a better place because of Bitcoin. There will be hiccups as people wrestle with this new technology but in the long run it will allow us to better understand individuals and stop holding grudges based on imaginary nation-state lines.\n\n12/10/22\n\nConor Jay Chepenik",
  "wordCount": 886,
  "readingTime": 3.5433962264150947,
  "claps": 0,
  "voters": 0
}