{
  "id": "cd79b6384b6c",
  "title": "Day 218",
  "createdAt": "2022-10-27 02:03:42",
  "tags": [
    "bitcoin",
    "cbdcs",
    "urbit",
    "learning",
    "individuals"
  ],
  "url": "https://chepenikconor.medium.com/day-218-cd79b6384b6c",
  "content": "# Day 218\n\nToday I want to spend some time unpacking what I'm learning about Urbit. High-level, Urbit is a decentralized personal server platform seeking to do away with the client-server model (think your laptop is the client showing my writing via this Medium post which was fetched from a server Medium runs). What Urbit aims to do is replace this with a federated network of personal servers that connect in a peer-to-peer fashion and use NFTs digital identities. To do this they are using ERC-721 tokens which are way to make NFTs on ether. While I am a Bitcoin maxi I do understand at this point Bitcoin is not built to put NFTs on it yet (maybe taproot can fix this? I need to do more research). I am still excited by this overall idea and want to learn how to code on Urbit.\n\nThe platform has a high level functional programming language called \"Hoon\" and a low-level compiled language called \"Nock\". The idea behind the platform is quite beautiful when I listen to the [Understanding Urbit podcast](https://open.spotify.com/show/0Iu8wvvgYzgmizSytfnqVY) and how the software developers talk about it. I highly recommend for a high level overview of what this team is building.\n\nThe Urbit [routing](https://en.wikipedia.org/wiki/Routing) system consists approximately of 255 \"galaxies\", 65,000 \"stars\", 4 billion \"planets\" and 4.3 trillion \"moons\", which respectively function similarly to [DNSs](https://en.wikipedia.org/wiki/DNS), [ISPs](https://en.wikipedia.org/wiki/ISP), [personal computers](https://en.wikipedia.org/wiki/Personal_computers) and devices that connect to them. 4.3 trillion is a big number hahahaha. I love how they named stuff because using space as a metaphor for how Urbit will scale is both elegant and easily conceptualized, for me anyways. I can tell I have my work cut out for me because on the Wikipedia it states, \"The platform has been described as complicated for even the most seasoned of functional programmers\" but I'm excited to go down this rabbit hole.\n\nI started reading through [this](https://developers.urbit.org/guides/core/hoon-school/A-intro) to get an overview. Learning is fun if you pick what you want to learn about. I feel like the idea that we can optimize a classroom of small children to learn the same thing and get a quality education is flawed. There are tradeoffs to everything but it does seem wrong how our current education system is set up. I'm hopeful that technology can help people get more focused attention so they don't zone out in a one size fits all class with a teacher who is likely doing their best but struggling to meet all the different needs required of unique individuals.\n\nI attended the Boston BitDevs meetup and had an incredible time. While a lot of the topics covered are a bit over my head I'm learning bit by bit. Takes time to understand these things and develop a good base layer. One thing that impresses me is how welcoming and intelligent the community is. We did have two people at the meetup who are working on CBDCs for the Boston Fed. They seem to be two of the most brilliant engineers in the room and I'm curious what they honestly think of CBDCs. Maybe they do it for the money, maybe they are generally interested in helping the U.S.A stay on top, maybe they have motivations I could never understand because I have a deep rooted belief CBDCs are evil. I'd like to talk with them one day and dig into their thoughts. I did meet the CEO of [Foundation](https://foundationdevices.com/) tonight which was pretty cool. I love the Boston Bitcoin community and I'm grateful to be learning about this technology.\n\n10/26/22\n\nConor Jay Chepenik",
  "wordCount": 596,
  "readingTime": 2.249056603773585,
  "claps": 0,
  "voters": 0
}