{
  "id": "ce341033586a",
  "title": "Day 525",
  "createdAt": "2023-08-30 03:39:55",
  "tags": [
    "goals",
    "family",
    "fatherly-advice",
    "podcasting",
    "consistent"
  ],
  "url": "https://chepenikconor.medium.com/day-525-ce341033586a",
  "content": "# Day 525\n\n![Baba and Sloan booling in Providence Rhode Island (Rocking the same haircut too)](https://miro.medium.com/1*BXAD_pe1A64D1rC-_S_E7g.jpeg)\n\nI'm truly fortunate to have had the opportunity to share some cherished moments with my Dad during the past few days in the beautiful setting of Rhode Island. Amidst our conversations, one particular gem of wisdom that he shared resonated deeply with me - the concept of unlocking the potential in reverse engineering our aspirations. Inspired by this insight, I'm determined to channel my intentions through these posts, using them as a powerful tool for manifesting my desires into reality.\n\nWholeheartedly aligned with my Father's perspective, I recognize the immense significance of not only identifying one's ambitions but also vocalizing them, nurturing unwavering belief, vividly picturing success, and then meticulously deconstructing the path through reverse engineering. I've been kind of jacked up about these ideas and today I direct messaged two Bitcoiners about coming on my podcast. Both guys have large followings and it is kind of a long shot to get them on but so far it seems I might have a chance with one. Fingers crossed. Either way I'm going to ask two more people to come on my podcast tomorrow. Haven't decided who yet but I know I'd like to make a living and support my family from podcasting and the only way I will ever do that is by having more guests on my show. Reverse engineering already: LETS GO!\n\nHere is the topic list I made for the podcast. Thought this was a solid set of ideas.\n\n---\n\n- What industries Bitcoin will revolutionize and empower & which ones it will destroy completely.\n\n- The hardest challenges for Bitcoin to overcome on its way to mass adoption.\n\n- The game-theory and incentives that threaten Bitcoin the most. For me personally I'd argue people becoming complacent.\n\n- Would also like to focus on Bitcoin's incentive structure and how they are aligned to drive adoption among developers, miners, users, merchants, and investors.\n\n- Sharing tips for convincing family and friends about benefits of Bitcoin and getting them onboard as well as common objections and how to respond.\n\n- What you believe is more important: Persuading your outer circle or developing your own understanding and ability to use Bitcoin most effectively. Another way to phrase this question is what do you think helps Bitcoin more: Orange pilling as many people as possible or continuing to orange pill every aspect of your own life. (It is my belief one's skill set will typically determine one's opinion ie a developer might pick the latter and a podcaster might pick the former)\n\n- The role of younger generations - Will they really appreciate what makes Bitcoin great or will they be complacent about having permissionless, fixed supply, magic internet money.\n\n- Why fiat being a bad store of value leads to the obfuscation of savings and investment.\n\n- Bitcoin adjacent technologies you are most excited about? For me personally I am fascinated with Nostr and what it means for starting global, decentralized, 1099 businesses where anyone can hire anyone and zap them their pay directly when X task has been completed.\n\n- Why Bitcoin is our best chance at ending war amongst nation-states.\n\nNote to self \"stay consistent Conor\". You too anon. I have not got a clue what you are working on but feel free to let me know in the comments. There are no shortcuts in life. Figure out what you want. Plan how to get there. Put in the work.\n\n![Feel free to hit my line Nike. I'm nice with the AI art👀 ](https://miro.medium.com/0*8gjhbCwU-0XP60_g)\n\n8/29/23\n\nConor Jay Chepenik",
  "wordCount": 569,
  "readingTime": 2.530503144654088,
  "claps": 4,
  "voters": 3
}