{
  "id": "cee4fb56b391",
  "title": "Day 31",
  "createdAt": "2022-04-23 16:54:09",
  "tags": [
    "soccer",
    "sovereignty",
    "sovereign-individual",
    "bitcoin",
    "farming"
  ],
  "url": "https://chepenikconor.medium.com/day-31-cee4fb56b391",
  "content": "# Day 32\n\nReading [The Sovereign Individual](https://www.amazon.com/Sovereign-Individual-Mastering-Transition-Information/dp/0684832720) right now and it's pointing out how farming changed the way societies organize themself. One interesting point is during times of hunting and gathering few people worked any harder than they had to because doing so would lead to depopulating the area of viable food sources. There was no way to store excess meat so if you went around killing more animals than you could eat your small tribe was actually worse off. It was not until farming became a big thing that hierarchical power structures and slavery became a thing. Farming also led people to create calendars and focus more on time so they could better predict which seasons were the most beneficial to harvesting crops. These structures also led to the first form of Government/State; whatever you want to call the organization that gets the monopoly on violence. This is fascinating to me because while I agree that property is only yours in so far as you can defend it I also realize that those with the most power are the ones who get to become \"the State\". It's necessary to have a system in place that lets you defend your property but as we've seen throughout history the state can cause famine, genocide, and other typically frowned upon things.\n\nThe Sovereign Individual points out that as these farming societies blossomed the first people to become wealthy were the ones charging a tax for defending property. This led humanity to use math and record metrics so taxes could be assessed. This immediately made me think how ridiculous it would be if I started a garden in my community and when my tomato was ready to eat the government magically appeared and said \"Chep I demand 25% of the tomato in the form of income tax\". I would be pissed to share my tomato after putting in all the hard work of growing it but if the threat of violence was looming I'm going to end up giving the Government their cut. Obviously, this doesn't happen in modern-day society. No, they just take our money which is the same type of money they can decide to make without having to sacrifice something else. That's what we call [opportunity cost](https://www.investopedia.com/terms/o/opportunitycost.asp) in economics. If I want a tomato I will have to give up some money. Unless I'm great friends with a tomato farmer the only way I have to get a tomato is to give up my money, or another good, in order to receive a tomato.\n\nThe more I think about it the crazier it seems that I'm forced to give my Government a massive cut of my paycheck in order to not be deemed a criminal. I understand that we need basic infrastructure and systems that don't allow people to rape, murder, and pillage without consequence. I just believe there has to be a better system than the current one where the government wants to know about any transaction of mine over $600 dollars while they run up a 30 trillion + dollar debt. These people do not think through the second and third-order effects of their ridiculous policy. Listen to [the director of the IMF](https://twitter.com/plan_marcus/status/1517206580189671436?s=20&t=7xWzG0JACdhKspDOGS9s5A) refer to her organization and central banks as 8 years old chasing a soccer ball. Almost any bitcoin pleb on Twitter could've predicted the massive inflation that printing trillions of dollars could have caused. These are the same people interested in knowing what you did with that $601 dollars. Screw these people and screw their system. Opt-out anon. Let's not be modern-day slaves to those who charge us for working when they can clearly print that same money without opportunity cost. These are the same people telling you bitcoin uses too much energy while at the same time funding bullshit studies because they know damn well bitcoin poses a risk to the current status-quo. If we had a fair system central banks would not be able to make money out of thin air while working-class people spend their whole lives trying to acquire these same fiat tokens.\n\nEvery advancement of civilization comes with positives and negatives. Slavery is horrible but I'd argue farming had a net positive effect on civilization. I'm sure not everything Bitcoin brings will be positive. I do think it will be a massive net positive though. It wasn't farming that led to slavery. It was humans abusing this new system of farming in order to enrich themselves. Luckily, Bitcoin doesn't let people get special privileges no matter how much they buy. Proof-of-stake does and you should be very skeptical when you see the 8-year-olds chasing a soccer ball screech about switching to a Proof-of-stake system. Bitcoin will bring prosperity if we can get enough people to wake up and opt-out of the legacy soccer game.\n\nHappy Saturday anon go get some sunshine!\n\n![](https://miro.medium.com/1*4oIsq_8U351qzCuh7TjCYw.jpeg)\n\n4/23/22\n\nConor Jay Chepenik",
  "wordCount": 827,
  "readingTime": 3.3207547169811322,
  "claps": 0,
  "voters": 0
}