{
  "id": "cfe8374cd73",
  "title": "Day 516",
  "createdAt": "2023-08-21 02:06:41",
  "tags": [
    "freedom",
    "individualism",
    "america",
    "bitcoin",
    "80-20-principle"
  ],
  "url": "https://chepenikconor.medium.com/day-516-cfe8374cd73",
  "content": "# Day 516\n\n![Canva + Firefly design](https://miro.medium.com/1*kc3Ill6cQPTFTHmXQ6XIPA.png)\n\nThe saying \"There are levels to this ${insertWord}\" always made me chuckle. It rings true, as the world is full of paradoxes and inequities. Take AirBnBs as an example. If your rental property is average or standard, it can be challenging to profit much off of it after accounting for middlemen fees, taxes, and Airbnb's cut. The leftover profit may be quite small. Contrast that to someone who owns a true luxury property, catering only to the ultra-wealthy who can afford astronomical nightly rates. I'm not saying it's fair that some profit so much more easily, but there are certainly levels and tiers to that type of business.\n\nPower law distributions like the 80/20 rule are common throughout nature and society. The top 20% of Airbnb property owners likely account for 80% of the total profits. While the long tail of average rentals brings in some supplemental income for owners, the vast majority of profits concentrate at the top among those with the most expensive and exclusive homes. It reflects the deeper truth that much of life is unequal, with \"levels to this shit\" as the saying goes. The rich get richer, and the average struggle to accumulate wealth. Though imperfect, this tendency towards inequality seems woven into human affairs.\n\n![clipped from Google about Pareto principle :)](https://miro.medium.com/1*rVkE8VJbGOrQDBImjruTvA.png)\n\nIn a just society, citizens are not guaranteed equal outcomes, which are often beyond individual control. Markets distribute rewards based on demand and supply. Some Airbnb owners will profit more thanks to nicer properties, locations, and other factors shaping market value. It is not necessarily unfair that the owner of a luxurious beachfront villa earns more than someone renting a suburban condo.\n\nHowever, citizens should receive equal treatment under the law and within economic policy. The condo owner should not face extra taxes or restrictions that the villa owner avoids. This is where problems arise. Lobbying and influence-peddling can grant tax loopholes and incentives to privileged groups. The rich can perpetuate their wealth by shaping policy to benefit themselves, while average citizens lack that influence.\n\nHere in the United States, our core values include equal rights and responsibilities for all citizens, regardless of status, background, or demographics. Our democracy, the cleanest shirt in a pile of dirty shirts, aims to let all voices be heard. Each citizen deserves respect, dignity, and equitable treatment. Policy should not be bent solely for the fortunate few.\n\nI'm hopeful that society will get this ship corrected because of Satoshi. The creation of Bitcoin reflects the rugged American individualism that shaped our frontiers. Anyone with an internet connection can participate in the Bitcoin network and reap the rewards of their own initiative. There is no gatekeeper granting permission.\n\nBitcoin's open network allows participants to reap exactly what they sow, no more, no less. The technology's emphasis on individual capability and self-determination embodies America's ethos. While progress can be challenging, this individualistic spirit can empower society to overcome obstacles through innovation. Nakamoto's singular vision has unleashed possibilities for wealth creation and freedom far beyond the reach of restrictive traditional systems.\n\nLike America, Bitcoin is an experiment that challenges conventions of the old world. The principles of Bitcoin resonate with cherished American values of freedom and individualism.\n\n8/20/23\n\nConor Jay Chepenik",
  "wordCount": 539,
  "readingTime": 2.417295597484277,
  "claps": 0,
  "voters": 0
}