{
  "id": "d0e4149e99bf",
  "title": "An Interesting Bar Experience",
  "createdAt": "2021-04-12 16:37:24",
  "tags": [
    "the-masters",
    "monday-thoughts",
    "briny-irish-pub",
    "smartass-remarks",
    "perspective"
  ],
  "url": "https://chepenikconor.medium.com/an-interesting-bar-experience-d0e4149e99bf",
  "content": "# An Interesting Bar Experience\n\nLast night my friend Jacob and I got a drink and watched the end of The Masters at a bar called the Briny. It's your typical Florida dive bar and it was awesome getting to chat with the locals. As we were leaving a random woman asked us for a lighter to light her cigarette. We didn't have one so she asked \"How do you ever expect to get laid without a lighter?\" My friend Jacob, being the smartass he is, responded \"Wait you're telling me if I had a lighter I could get laid\". The lady laughed and said you are the wise guy of the group. Then the strangest thing happened. This woman looked at Jacob and me and said \"You are two beautiful young boys. Enjoy it you have no idea what this life is like.\" Jacob and I were still all giddy, but the \"vibe\" shifted when she said this.\n\nIt's amazing the conversations humans can have with their eyes. Jacob and I could see immense pain coming from this woman. She went on to say \"She was broken and we have no clue about anything\" but you could tell she was being so genuine when she complimented and insulted us. It was such a pure moment. We ended up leaving and unfortunately didn't have a lighter to help the woman spark her cigarette, but I will heed her advice. Life is short and before I know it I'll be an old man looking back. I don't want to be \"broken\" or experience the same pain that woman had experienced. She was right; Jacob and me are young and have a ton to learn. It's important we stay open-minded and are open to new possibilities and cherish the time we have on this planet. It was heartbreaking to see another human going through the pain of regret, but I'm glad we experienced it because I'm not going to let regret ruin my life. I'm manifesting it now: good things will come.",
  "wordCount": 340,
  "readingTime": 1.2830188679245282,
  "claps": 0,
  "voters": 0
}