{
  "id": "d44408eb4966",
  "title": "Day 305",
  "createdAt": "2023-01-21 21:20:18",
  "tags": [
    "big-tasks",
    "broken-up",
    "leverage",
    "gold",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-305-d44408eb4966",
  "content": "# Day 305\n\nI'm going to start today with an Odell quote I just read.\n\n_In the wake of FTX, it seems obvious that the price of bitcoin has been suppressed by fractional reserve exchanges selling bitcoin they do not actually own. As long as people continue to withdraw bitcoin to their own wallets any entities playing these games will get rekt eventually. The absolute scarcity of bitcoin combined with the fractional reserve games played by major banks, exchanges, and 'stablecoins,' in a macro environment primed for major currency inflation, **means every person on this planet is unintentionally short bitcoin**. [At some point this will become a reality, nobody knows when, but we must remain humble enough to assume it will happen when we all least expect it.](https://tftc.io/r/367c8336?m=efcaf026-c8f9-4859-92eb-f5d4d58bb971)_\n\nPowerful stuff. Play fiat games win fiat prizes. Lot of these companies will end up getting rekted. I'm hopeful that Gemini can figure their stuff out because I love getting bitcoin rewards on my credit card, but lending money to Genesis for their earn program and then having Genesis lose all their customers money because they had to declare bankruptcy is exactly what I mean when I say play fiat games win fiat prizes. Just look at this.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/alphaketchum/status/1616326351870431233&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt's almost as bad as the FTX corporate structure hahahaha. Of course there is a nice silver lining here. Lots of leverage is going to get drained out of the system. That is a big net positive in my book. Important not to get over your skis if you are thinking about purchasing some of the best money man has ever known. Also learn self-custody. Bitcoin held on exchanges is like paper gold. It's an IOU not actual gold or bitcoin!!!\n\n![](https://miro.medium.com/0*dhAkD2vw_1TCbkiZ.jpg)\n\nToday is a big football day. Jags vs Chiefs and Eagles vs Giants. I'm pretty excited to watch both these games. My partner's sister is in town to help watch our newborn so I got the greenlight to go hang with the boys for the Eagles game tonight. I'm pretty excited. Having a child is absolutely amazing but it's also a grind. Looking forward to hanging with friends for the first time since the birth.\n\nI need to make some progress on the binmucker.com website and massadoption.net. Slow and steady wins the race. I love this graphic.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/colinyurcisin/status/1615707270444204037&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThat's all I got for today because the Jags are starting soon and I need to work on a Dad blog for binmucker.com. Week 2 needs to be posted today. Grind don't stop. GOOD\n\n1/21/23\n\nConor Jay Chepenik",
  "wordCount": 422,
  "readingTime": 1.7924528301886793,
  "claps": 0,
  "voters": 0
}