{
  "id": "d4c4a73fd4c6",
  "title": "Day 119",
  "createdAt": "2022-07-19 21:05:31",
  "tags": [
    "bitcoin",
    "podcasts",
    "renaissance",
    "children",
    "parenting"
  ],
  "url": "https://chepenikconor.medium.com/day-119-d4c4a73fd4c6",
  "content": "# Day 119\n\nAnother day, another Bitcoin podcast, another perspective that blows my mind wide open with ideas. It is so amazing how deep and insightful many Bitcoiners are and I'm grateful that I get to listen for free. Reminds me of the Drake/ DJ Khaled song about making love for free when it is so good that they should've charged for it. The difference is I come away better after listening to a Bitcoin podcast. Those girls getting with Drake probably come away longing for more. Hahahaha.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F65YWSJFldBj1yJRD2IRnts%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F65YWSJFldBj1yJRD2IRnts&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fb002a59bec16a2c9e9c368a3&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nJokes aside this was a great podcast and BangBitcoin has me thinking a lot about how crucial our early childhood years are. I never thought about how humans will not survive without someone caring for them those first couple years. It is one of those no shit moments that when you actually think about is pretty profound. Some animals require very little care after birth, but that is not the case with humans. Even at 5 little people still need help from their parents. The age someone becomes a full adult is different depending on many things but for the most part without elders guiding and caring for children, kids would be screwed. Thus, I agree with BangBitcoin that these years are crucial and they probably play a much bigger role in our development than many realize. It was cool listening to this conversation because I've always joked and believed that the key to adulthood is just understanding that our parents are just humans trying to figure it out. Naturally, kids admire their parents and think they can do no wrong (*if you have parents that love you*) At least that is how I viewed my parents growing up. I still love my parents tremendously and have a great deal of respect for the sacrifices they made to raise me and my sisters. That said, it was definitely a big moment for my development when I realized they aren't perfect and while they might've messed up certain parts they both did the best they could to raise us. Maybe I was very privileged to have parents who put their children first. It's a fine line though because parents who might mean well can end up babying their children. That is arguably as bad as children who were abandoned by their parents. One doesn't understand the importance of pain and one feels way to much pain. It seems to become an adult is very dependent on you becoming your own person and to do this you need to have been loved, but not too much to the point where you \"can't do no wrong\" because your parents always fix your problems. An ideal adult in my mind is one who respects the value of their elder's advice, but also makes decisions for themself.\n\nAnother important idea this podcast reminded me of is that writing helps clarify our thinking. The amount of times I've had ideas in my head that not only make sense, but seem brilliant, only to turn out to be absolutely incoherent when I speak is larger than I'd like to admit. I'm sure some of my writing also comes off as incoherent, but every now and then that spark of beauty will fly. Plus writing is good for my own development. It was really gratifying seeing Bitcoin Magazine publish a piece of my work and reminded me of two things: you can set out to achieve near anything you set your mind to do and that's a lot easier to do *anything* if you are truly passionate about it. I'm also excited to read back over some of these pasts many years from now and think my child(ren) will appreciate what their father was thinking as a 25 year old.\n\nThe future is bright not that I've found both a money to store my value in that will not be debased and a group of people who are excited for the renaissance that Bitcoin can bring to the world. Love, life, liberty, and happiness are all on the horizon for those who take the 🍊  💊  :)\n\n7/19/22\n\nConor Jay Chepenik",
  "wordCount": 690,
  "readingTime": 2.6037735849056602,
  "claps": 0,
  "voters": 0
}