{
  "id": "d4cc17fed0bd",
  "title": "Day 319",
  "createdAt": "2023-02-05 03:52:06",
  "tags": [
    "babylon-bee",
    "balloon",
    "satire",
    "reality",
    "1984"
  ],
  "url": "https://chepenikconor.medium.com/day-319-d4cc17fed0bd",
  "content": "# Day 319\n\nThis morning I woke up and read 2 more chapters of 1984. It's scary how realistic that book has become. I mean we are still a far way off from a ministry of truth erasing what they said in the past and editing it to fit what actually happened. However, we are at the point where sarcasm is becoming reality pretty fast.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/TheBabylonBee/status/1621514411671441408%3Fs%3D20%26t%3DbuaGYnJj69Ab8Z0XutA4Bg&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/JeffSimmons6/status/1621967780814757888%3Fs%3D20%26t%3DbuaGYnJj69Ab8Z0XutA4Bg&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nImportant to be balanced so here is another tweet I saw that claims there was a reason we waited to shoot it down.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/EdKrassen/status/1622003917759340545%3Fs%3D20%26t%3DbuaGYnJj69Ab8Z0XutA4Bg&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI'm not sure why jamming its signal is advantageous. My friend also mentioned to me that there is likely nothing that balloon could capture that a satellite could not. I'm not sure what to think but it cracks me up that we are at the point where the Babylon Bee article takes one day to come true.\n\nMy buddy Travis was cracking up when I told him I was reading 1984. He said it reminded him of when I found out about The Beatles during my sophomore year of college. The joke being of course that I find good art, music, & literature way too late. Better late than never.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/Resist_05/status/1619487320901832704%3Fs%3D20%26t%3DaFy4RQgnlI8j8nGSn_glGA&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhile we are still quite far away from true 1984 censorship those in Davos seem to want a Big Brother. I'm not sure they have the technology, yet anyways, to achieve something like this. However, it is terrifying to think about a world where your thoughts aren't private. Evading people's privacy always seems to fall under the umbrella of safety, fighting crime, or climate change. The last one I'm saying tongue in cheek but jokes aside it is a privacy violation in my book to take aways peoples gas stoves because its bad for the climate. Of course I want to be a good steward of the environment. I'm just not willing to believe some insane science about gas stoves and this idea we need to get rid of them. I've been cooking on my moms electric stove this week while I'm back home and it stinks. I miss my gas stove. Love being home, just wish they didn't have an electric stove😂\n\nMaking good progress on my coding class. Need to get back to writing more though. Hard to balance the two but practice makes perfect. Finally got around to giving my buddy some feedback on an essay he wrote about the importance of debt markets. Felt good. Hope he finds value in my critiques. Now I just need to finish writing that damn article about Bitcoin & Football lol. One of these days I'll get er done!\n\n2/4/23\n\nConor Jay Chepenik",
  "wordCount": 440,
  "readingTime": 1.6603773584905661,
  "claps": 0,
  "voters": 0
}