{
  "id": "d67d833b9fc8",
  "title": "Day 106",
  "createdAt": "2022-07-06 23:37:52",
  "tags": [
    "bitcoin",
    "bitcoin-maximalism",
    "comedy",
    "preparation",
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-106-d67d833b9fc8",
  "content": "# Day 106\n\nDoing a comedy set last night was such an incredible feeling. The stand-up set went really well and I'm glad that I took the class and did a 5 minute set in front of an actual audience. Not going to lie, my heart was racing quite fast when I got up on the stage but things got better as I got into into the set. Reminded me of football games where I would be so nervous to go on the field, but once you actually start playing it comes naturally. Obviously, preparation also plays a role in both stand-up and sports but if you put in the hard work before the event it usually goes well. Part of me wants to take level 2 stand-up, but I also found a Bitcoin meet-up in Boston for Tuesday so I'm leaning towards doing that because I'd also like to meet more Bitcoiners in real life. I'm thinking about going to more open mics and potentially even doing one if I enjoy them. So much to do and like I joked in my set \"Life is about having a plethora of experiences\". I truly believe that and will continue to challenge myself in various ways because it seems to make life a lot better. My girlfriend recorded the set last night and while the audio quality is not the best you can still clearly hear what I'm saying. Maybe I'll go ahead and upload it to Youtube.\n\nOutside of that, I'm excited to keep the podcast going. I will be having J.P Knight from Kelp financial on next week. He was one of my suite mates sophomore year of college and is now working at a crypto hedge fund. While I'm a Bitcoin maxi at heart I'm curious to hear his thoughts and what he has to say about various projects in the space. Couldn't come at a better time considering what is happening with Nic Carter. This article from Pete Rizzo was an excellent take.\n\n[https://www.forbes.com/sites/peterizzo/2022/07/04/bitcoin-maximalism-is-dead-long-live-bitcoin-maximalism/?sh=2d45886d182b](https://www.forbes.com/sites/peterizzo/2022/07/04/bitcoin-maximalism-is-dead-long-live-bitcoin-maximalism/?sh=2d45886d182b)\n\nI like Nic and think he has overall done a lot to contribute to the Bitcoin community. I also agree with Pete that he is wrong about Bitcoin Maximalism. I would be a lot wealthier if someone had been able to educate me on why it was not worth playing the bitcoin casino. Then again, pain is a great teacher and we all get Bitcoin at the price we deserve. Not to mention the great thing about this space is people will always disagree but the network doesn't give a crap. You either follow its rules and get to transact on the network or you break them and get forked off. Doesn't matter how many people agree or disagree with Nic. People can fight on Twitter all day and while I do hope Nic continues supporting Bitcoin, in the long run, I don't think it matters to the security and success of the network. In the short term though he has been a great asset so I hope he continues to help orange pill the public and expose why holding USD is not a great move for storing your wealth over the long term.\n\nWho knows how it plays out but I'm confident a new wave of Bitcoiners, like myself, can pick up the slack if we lost one of the OGs due to bitterness with the bitcoin maxi crowd. Life is hard and arguing with internet randos don't make it easier lmao.\n\n7/6/22\n\nConor Jay Chepenik",
  "wordCount": 594,
  "readingTime": 2.241509433962264,
  "claps": 0,
  "voters": 0
}