{
  "id": "d738c28a18f7",
  "title": "Day 140",
  "createdAt": "2022-08-09 20:48:59",
  "tags": [
    "computers",
    "running",
    "bitcoin",
    "self-reflection"
  ],
  "url": "https://chepenikconor.medium.com/day-140-d738c28a18f7",
  "content": "# Day 140\n\n![Photo by Pixabay: [https://www.pexels.com/photo/close-up-photography-of-computer-motherboard-163125/](https://www.pexels.com/photo/close-up-photography-of-computer-motherboard-163125/)](https://miro.medium.com/0*ckq3sIyWx_52lWAE)\n\nDid a speed run today on Nike Run Club. It was nice to mix it up. I like speed runs because I can run really fast in certain parts and walk during the relaxing parts. I'll usually just hit somewhere between a 2–4 mile jog going roughly the same pace the whole time so I don't really turn on the jets when I'm not doing a speed run. It feels really good to go fast though. Saw a car that had an awesome bumper sticker on my run. It read \"Peace starts with a smile\". Facts. It's so easy to get caught up in bullshit that we forget to just smile. After the raid on Trump's house last night my whole twitter feed was filled with outrage and rightfully so. That is some banana republic shit using the FBI to spy on an ex-president and the biggest political opponent of the sitting president. I saw people talking about how the \"security state\" is flicking the dog on its nose and hoping it retaliates so they can put the dog down. A dark metaphor indeed. I'm glad I saw that bumper sticker because it's a good reminder to just smile and keep on with my day. Keep on learning how to code, keep on stacking sats, keep on going to Bitcoin meetups, keep on learning how to defend myself.\n\nGod Bless America we will get through this. I'm a small pawn in the big scope of things, but decentralized forms of media like this, podcasts, and social media are being leveraged to break the massive \"propaganda machine\" Andrew Tate was talking about in that Pomp podcast I posted about the other day. Scary times, but guess what. Strong men are made in hard times.\n\nGoing to another Bitcoin meetup tonight which I'm excited about. Always nice getting to chat with my new Bitcoin friends. Outside that not much to report. Been reading more of The Sovereign Individual and will hopefully have that book finished before the end of August. I need to start decentralizing my life. Get more income streams outside my main job of selling software. Sad that the Government thinks spending 120 billion or whatever it is on more IRS agents is a good idea. Makes me think they wan't people dependent on their main job as the only source of income. Whatever. Going to keep doing my part to build a life I can be proud of. Being reliant on one job for everything is the key to a miserable life. The Sovereign Individual reminds me that if you acquire the right skills the opportunities out there are endless. Especially if those skills involve computer science.\n\nWhile it seems like the world is going crazy it doesn't mean I have to. Focusing on what I can control is the key to fixing it. Losers blame others for their problems. Winners focus on themselves which ironically enough ends up helping others in the long run. Take Bitcoin. It was Satoshi's innovation and genius that now gives me and billions of others a way to opt out of the rotting fiat system. Will take some time for billions to see it, but my focusing on myself I can help many come on board to a more fair, honest, and truthful system.\n\n8/9/22\n\nConor Jay Chepenik",
  "wordCount": 558,
  "readingTime": 2.3056603773584907,
  "claps": 0,
  "voters": 0
}