{
  "id": "d757bfe36f15",
  "title": "Day 292",
  "createdAt": "2023-01-09 02:52:35",
  "tags": [
    "medicine",
    "hospital",
    "healthcare-beasts",
    "tyranny",
    "wef"
  ],
  "url": "https://chepenikconor.medium.com/day-292-d757bfe36f15",
  "content": "# Day 292\n\nMan what a joy it is looking into the eyes of my lil nug. There is nothing I would not do to protect her. My heart feels so full of pride, happiness, joy, and love when I look at Sloan. My partner and I have our work cut out for us but that's okay. Luckily, we both have families that have been so supportive. Not to mention Sloan has been an absolute champion. She sleeps most of the time and when she isn't sleeping she feeds. I've heard this is because Sloan is a brand new baby and this won't be the case for long. Whatever, I will adapt as necessary. It still blows my mind that my partner and I created this (mostly my partner lol). She did the hard work anyways. It took about 15 hours of labor from the first contraction to Sloan actually entering the world outside of my partner's uterus. Considering a marathon takes about 4 hours I now see why people use the ultra marathon reference to try and compare what pregnancy is like. I have been slacking on my goals of reading, coding, and running this past two days because of the birth but I still made time to make sure I write something on here, even if it was short like yesterday's post. In our defense we had to go to the hospital after the birth to get Mom sewn up and thankfully all went well but we did not get back home till 8 AM this morning. Needless to say I slept from 8–3 because it was not very comfy sleeping on the hospital floor waiting for my partner.\n\nAll things considered it was a great first birth. Could not ask for a better new born. While at the hospital Sloan had her first poop and I had to change her diaper. For those who don't know a newborn's first poop is like tar. So my first ever diaper change was incredibly difficult. If diaper changing was a video game with levels this would be the all-madden version. Luckily, the nurse at the hospital helped and showed me proper diaper wiping etiquette. For example wipe from front to back so you don't get anything in her private parts. You know humans amaze me. In the beginning of the night I got a bit emotional. I didn't swear or curse or insult the nurse, but I was not listening to her about wearing my mask in the hospital because I wanted to kiss and hold my newborn. She asked me again to put it on and I said seriously? Her justification was that there are six nurses out with RSV, as well as the new covid-19 (or I guess 23 at this point) variant, and other stuff going around so it's important I mask up which made me roll my eyes. I begrudgingly put on my mask and refused to say anything back for about 5 minutes because I was upset. It seems a bit ridiculous we try to protect ourselves from a microscopic virus with a mask. It would be like trying to keep flies out with a chain-link fence. Despite my initial attitude the nurse was an absolute doll and took amazing care of us. She got me covers and blankets which made sleeping on the floor a lot better. She also gave my partner and I countless tips about what it's like having a new born plus effective tips & tricks for taking the best care of her. Despite my initial attitude this woman was a rockstar. It made me realize humans are such dynamic creatures. I feel bad for this woman who is forced to wear an uncomfortable mask for an 8 hour shift because the institution she works for demands it. Especially after \"the science\" has been flip flopping all over the place on mask issues since this pandemic started. Maybe there is some effectiveness to wearing a surgical mask but cloth masks just keep germs in the front of your face. Not exactly sold on surgical masks either I'm just trying to be fair in my personal judgements. Being at the hospital is not a pleasant environment. Fluorescent lights, crappy food, a sense of general stress in the air, combined with the smell of cleaning supplies for making sure everything has been disinfected. I wish these institutions focused on keeping people healthy via exercise, proper diet, and prevention but that is nowhere near as profitable. I'm not saying everything about this twitter thread below is credible, it does look like a 4chan screenshot, but I do think there is some truth to be found in it. Recommend reading the whole thing and withholding your judgements until you finish reading every part.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/cgcomp/status/1609338544010723329&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAnyways, all this to say there are amazing people in the system. It warms my heart that this nurse was so kind to us. Her advice was incredibly helpful and she made a stressful situation much better for my partner and me. It's not easy going to the hospital right after a successful homebirth which we hoped to use to avoid the hospital. It saddens me that the institution she works for has been co-opted in certain ways so they are more worried about masks than giving people solid exercise and diet advice. Anyways, while I don't have much faith in the medical-industrial system, I am also reminded there are true professionals who are deeply good people working inside these systems. I'm confident good will win out every time I experience something like this.\n\nI did a read of Common Sense by Thomas Paine which I will be sharing on my podcast later. I feel there is a lack of common sense in our system today. I also see the tide is changing. Bitcoin is enabling the individual to become very expensive to tyranny. It is changing the incentive structure for governments to trade and provide value for their citizens rather than treat them like cows. At least in certain places like El Salvador. Bitcoin is not perfect but it heals the world from all the tyrants we see right now. (check out the World Economic Forum, really do a deep dive if you do not believe me) Over a long enough time horizon I'm confident more countries will go the route of optimizing their land to be a place that provides value to their citizens rather than steals it. Many people in the system likely don't spend as much time as me reading about why Bitcoin is crucial for the development of humanity or look into why tyrants are becoming so emboldened in today's world. I'm grateful that I found this rabbit hole and I've taken the proverbial red pill. A good way to test if someone has taken the red or blue pill is to ask for their opinion of Bill Gates. If they like him you can confirm they have not taken the red pill lmao. To be fair people are also dealing with a lot of things in their own life like trying to figure out why the price of eggs has done a 3x since 2020 yet their wages are the same. With enough time though common sense will prevail and people will see there is a better money that can fix many of these problems.\n\nFound this thread and while I don't know if this is the solution to all our problems it seems like a solid start. Keep the hope anon.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jackmurphylive/status/1612174276127342597&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWe are going to win!\n\n1/8/23\n\nConor Jay Chepenik",
  "wordCount": 1269,
  "readingTime": 4.788679245283019,
  "claps": 0,
  "voters": 0
}