{
  "id": "d794444ddde4",
  "title": "Day 39",
  "createdAt": "2022-05-01 02:26:24",
  "tags": [
    "life",
    "liberty",
    "the-pursuit-of-happiness",
    "media",
    "computing"
  ],
  "url": "https://chepenikconor.medium.com/day-39-d794444ddde4",
  "content": "# Day 39\n\nGot to play some golf today which is always fun. Hitting a golf ball clean is such a refreshing feeling. Also, being in nature. Went to Green Meadows in New Hampshire and loved every second. Spending too much time looking at a screen makes being outside all the sweeter. Crazy to think how many people now have a job that requires staring at a laptop for 8 hours. While I am very glad technology exists I've been thinking a lot about what Grimes said in [Lex Fridman's Podcast](https://youtu.be/KOwm7GUjcg8). Something along the lines of \"We are no longer homo-sapiens but homo-technos. I like this description because it's true in a lot of ways. Technology allows us to do things that would seem like magic to homo-sapiens of the past. I imagine this trend will carry on and some of the stuff I'll be able to do in 10–20–30 years would seem like magic if experienced today. Had the realization computers are just calculators talking with each other and computing. Bitcoin is a magical revolution because it's math that allows humans to send, receive, and store value without having to trust a third party. Anyone can use a computer (calculator) to plug into the network that doesn't debase itself. A network with only rules, no rulers. God it is a beautiful thing to think about. Pure math. Quick meme dump.\n\n![](https://miro.medium.com/1*1sdCxhLXJxF7sdm2R_6pRQ.jpeg)\n\nIt's not that complicated. We know what is healthy and what is not. Our brains love to lie and justify stuff. Deep down we know better though.\n\n![](https://miro.medium.com/1*GdMI7B2bsru4KFSP3YmDHg.jpeg)\n\nOur brains aren't the only thing that lie anon. The media hive mind also likes to lie and justify stuff. All we can do is strive to be better the next day. Life is complicated but only because we make it so. Sometimes the right thing is right in front of us and we can't even acknowledge it because we are so caught up in our own bullshit. It's a beautiful thing really. Life, liberty, and the pursuit of happiness are things that can only be achieved when you think for yourself instead of letting others think for you.\n\n4/30/22\n\nConor Jay Chepenik",
  "wordCount": 363,
  "readingTime": 1.7531446540880502,
  "claps": 0,
  "voters": 0
}