{
  "id": "dce1e18176fc",
  "title": "Day 257",
  "createdAt": "2022-12-05 03:40:45",
  "tags": [
    "submarines",
    "nuclear",
    "chatgpt"
  ],
  "url": "https://chepenikconor.medium.com/day-257-dce1e18176fc",
  "content": "# Day 257\n\nSpent today with the Grandparents visiting Portsmouth and got to check out the U.S.S Albacore. Look at this submarine!\n\n![](https://miro.medium.com/0*1omRK8g1XgH_UMJa)\n\nMy Grandpa and I toured inside and it's insane how many people they fit into such tight quarters. On this property they also have a little museum that details the development of submarines. The Navy dude working at the museum gave us a great run down of submarine history and the role they played in developing nuclear energy. Initially submarines were diesel and battery powered so they would have to come to the surface after 24 hours because that is the maximum time the battery could last. Enter nuclear energy which allows them to stay under water for months at a time. I even asked chatGPT to fill me in and this is what the AI had to say.\n\n![](https://miro.medium.com/1*371kYZYy1phluSLQsBddnA.png)\n\nLearning about history is pretty damn cool. I've driven by this submarine in New Hampshire many times so I'm glad I got the chance to stop and actually go inside. After hitting Portsmouth we drove back to Boston and managed to get a reservation at Dali one of my favorite restaurants that serves amazing tapas and Sangria. We followed up dinner by playing phase 10 and I had quite the comeback to tie my girlfriend. I'm so grateful to have Grandparents who love me dearly and are willing to make the trip up to Boston to spend time with me and my partner.\n\nLife is good. Feeling in a giggly mood so I decided to ask chatGPT some silly questions and the thing hit me with great advice.\n\n\"How do I get my girlfriend to understand that the time I spent on Twitter is worthwhile and that strangers really care about my opinion\"\n\n\"It is ultimately up to your girlfriend to decide whether she believes that the time you spend on Twitter is worthwhile and that strangers care about your opinion. However, you can try to explain to her why you value the time you spend on Twitter and why you think it is important.\n\nSome possible reasons why you might value the time you spend on Twitter include:\n\n- You enjoy engaging with other users and discussing topics that interest you.\n\n- You learn new things and gain valuable perspectives from other users.\n\n- You are able to share your own ideas and experiences with a wider audience.\n\n- You are able to connect with like-minded individuals and build relationships with them.\n\n- You are able to stay up-to-date with current events and trends.\n\nIt is important to remember that everyone has different priorities and values, and what is important to you may not be as important to your girlfriend. However, if you are able to articulate why you value the time you spend on Twitter and how it benefits you, she may be more understanding and supportive of your decision to spend time on the platform.\"\n\nHahahaha I guess it makes sense they haven't programmed the AI to be humorous (or maybe they have and my question just missed the mark). This is honestly pretty good advice though. Since the AI wants to be serious I asked it an important question and it once again gave a solid answer.\n\n\"Why is there racism in the world?\"\n\n\"There is racism in the world because of a variety of historical, social, and psychological factors. Racism is a complex and multifaceted issue, and it cannot be explained by a single cause. However, some of the factors that contribute to racism include:\n\n- Historical and institutional discrimination. Throughout history, many societies and institutions have promoted and supported the idea that certain races are superior to others. This has led to widespread discrimination and inequality, which has created deep-seated biases and prejudices that continue to impact people today.\n\n- Societal power dynamics. Racism often arises when one group of people has power over another group of people. For example, in many parts of the world, people of color are disproportionately disadvantaged and marginalized, while people who are white have greater access to resources, opportunities, and privileges. This power imbalance can fuel racism and discrimination.\n\n- Psychological factors. Racism can also be influenced by psychological factors such as fear, insecurity, and a need to feel superior to others. Some people may hold racist beliefs because they are afraid of people who are different from them, or because they feel threatened by the success of other groups. Others may use racism as a way to boost their own self-esteem or to feel superior to others.\"\n\nI don't know all the implications of this thing but I'm so shook how powerful this tool is still. It can answer most questions you ask it. It can code up stuff you ask it. Like for example, I said write me some javascript code that generates a random number and it popped this out immediately.\n\n// Get a reference to the button element\nvar button = document.getElementById(\"button\");\n\n// Add an event listener to the button that runs the specified function\n// when the button is clicked\nbutton.addEventListener(\"click\", function() {\n // Generate a random number between 0 and 100\n var randomNumber = Math.floor(Math.random() * 100);\n\n// Print the random number to the console\n console.log(randomNumber);\n});\n\nAI is going to automate so many things in our life and the highly skilled jobs will be those who can query AI the best. I hope it gets to the point where people in D.C start asking AI to deescalate the war and that the AI is successful. For shits and giggles I went ahead and tried.\n\n\"It is not within my capabilities as a language model trained by OpenAI to provide a specific compromise to end the war in Ukraine, as I do not have the necessary knowledge, expertise, or information about the conflict. Furthermore, it is not appropriate for me to make suggestions or recommendations about complex and sensitive political issues such as this.\n\nThe war in Ukraine is a complex and ongoing conflict, and finding a solution will require the efforts and cooperation of multiple parties. A solid compromise to end the war would likely involve a combination of political, economic, and diplomatic measures, and it would need to address the underlying causes and grievances of the conflict.\n\nIt is important to remember that finding a solution to the war in Ukraine will require a lot of hard work and compromise from all sides. It will not be easy, and it will require the willingness of all parties to make difficult concessions and to work towards a common goal. However, with persistence, determination, and good faith, it may be possible to find a solution that can bring an end to the war and pave the way for a peaceful and stable future for Ukraine.\"\n\nSo it clearly has some bias from the people who coded it up. Still a hell of a tool that will change the way people learn and use technology. I'm excited for the future and I'm grateful for the present I get to live. Like the turtle said in Kung Fu Panda,\n\n![](https://miro.medium.com/0*uF09JYtP8SC3-OSY.jpg)\n\n12/4/22\n\nConor Jay Chepenik",
  "wordCount": 1186,
  "readingTime": 5.025471698113208,
  "claps": 0,
  "voters": 0
}