{
  "id": "dd5baa6980b9",
  "title": "Day 584",
  "createdAt": "2023-10-28 02:32:46",
  "tags": [
    "bitcoin",
    "the",
    "solution",
    "to",
    "inflation"
  ],
  "url": "https://chepenikconor.medium.com/day-584-dd5baa6980b9",
  "content": "# Day 584\n\nThere is about 96.3 trillion dollars of debt and 8 trillion dollars circulating systemwide. This indicates that the total debt surpasses the money supply by over tenfold.\n\n![[https://youtu.be/Z6qzEYxBYcQ?si=kjIw0LMxcP3zAsci](https://youtu.be/Z6qzEYxBYcQ?si=kjIw0LMxcP3zAsci)](https://miro.medium.com/1*FPMsa8SHcZPMW_bTosBSbQ.png)\n\nA Ponzi scheme is an illicit investment strategy where funds from fresh investors are utilized to deliver fabricated \"returns\" to prior participants, creating a façade of profitability and stability. However, its survival hinges on the constant influx of new funds.\n\nSimilarly, in our existing financial system, new debt is consistently generated to settle previous debts, along with interest. The two systems are not identical, but there are striking resemblances between how a Ponzi scheme operates and the way our financial system functions.\n\nLike a Ponzi, the system relies on ever-increasing creation of new debt to keep functioning. Reducing or \"tapering\" new debt creation could expose the imbalance and cause the system to become unstable, like how a Ponzi collapses when new investments dry up.\n\nThe presentation below is one of the best explanations I've ever seen about why bitcoin is the solution, not a hedge, to inflation. Shout out [@parkeralewis](https://twitter.com/parkeralewis) for doing a phenomenal job distributing this knowledge to more people.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FZ6qzEYxBYcQ%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DZ6qzEYxBYcQ&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZ6qzEYxBYcQ%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nAs [Max Keiser](https://twitter.com/maxkeiser) likes to say \"You can't taper a ponzi\". Do not read this and think Chep is telling me to buy bitcoin. No my anonymous friend, I am telling you to go learn about Bitcoin.\n\nYou can thank me later. 😘\n\n10/27/23\n\nConor Jay Chepenik",
  "wordCount": 238,
  "readingTime": 1.0981132075471698,
  "claps": 41,
  "voters": 3
}