{
  "id": "de2a5bb636c2",
  "title": "Day 19",
  "createdAt": "2022-04-11 00:49:33",
  "tags": [
    "running",
    "dreams",
    "pepe",
    "basic-human-rights",
    "innovatoooooor"
  ],
  "url": "https://chepenikconor.medium.com/day-19-de2a5bb636c2",
  "content": "# Day 19\n\nHad a wet dream last night. Didn't think I would be getting those at 24 but here we are. Not going to lie, the orgasm in my dream felt hyper-realistic and outside of waking up in sticky sheets, it was pretty great. You might be wondering why the hell I'm writing about this anon and it's because I want to remind everyone that no matter how much fame, success, money, or glory one receives we are still just a human being who has to face the realities and limits of our body. I also had a dream last night (before ze sexy time dream) where I pulled out a gun and joked about shooting someone. It backfired immediately because the person I aimed at had a revolver. All I remember after that is hiding behind a tree and seeing a bullet go by with super sonic waves forming around it. I guess the takeaway is never under any circumstance pull out your gun unless you plan on using it to defend your life. A good and important lesson. Guns can be an incredible tool but they can also be a devastating one if not used properly. Two vastly different dreams and only one with a clear lesson. Went for a 3 mile run last night before bed so maybe that is what helped me get some nice REM sleep. I woke up feeling refreshed and drained 😂 .\n\nLife is good though. Back in Boston after my flight from Norfolk and played a round of golf with my buddy Kuba today. Afterwards Kuba and I met up with our buddy Mins and we got food. Cracking jokes and letting loose with close friends is what life is about. There are situations that require professionalism but life is far too short to take seriously. Living in the moment and finding humor in everyday life rules.\n\nYesterday, as I was going through the Norfolk airport security the T.S.A threw away my toothpaste citing the fact it was too big. This irked me because they let it go through the first time in Boston. I understand that 5 dollar toothpaste will not break my bank or be a huge hindrance in my life. It just seems like such a waste for no good reason. Think of all the times the T.S.A has made life miserable for people. Before 9/11 people used to be able to walk all the way up to the flight gate and now we got a standing army of roughly 47k people. According to [Wikipedia](https://en.wikipedia.org/wiki/Transportation_Security_Administration), \"As of the fiscal year 2020, the TSA operated on a budget of approximately $7.68 billion and employed over 47,000 Transportation Security Officers, Behaviour Detection Officers, Transportation Security Specialists, Federal Air Marshals, and other security personnel.\" I understand that we need some form of airport security, but I feel like we would be so much better off just having Air Marshals flying to make sure no one gets rowdy and only check for guns, knives, and explosives. 7.68 billion is a lot of taxpayer money for a service that almost everyone gets annoyed with. No disrespect to the T.S.A workers who are doing their job but a ton of disrespect to the bureaucrats who disguise power grabs as \"safety measures\". I'm the farthest thing from a security expert so maybe this idea is missing something but having metal detectors at every gate and only using x-rays to scan checked bags could do a lot to limit how many agents are needed for the job. Of course, everyone wants to feel safe when traveling and this is important. It just seems like there are more efficient ways to make sure people are not bringing weapons on the plane without having to scan every bag and make sure no one is taking any liquids over 3 ounces. I'm probably missing something in my assessment of airport security. I just think it would be great to see the big brains of the world innovate to make airports more secure while making the experience for all travelers involved better. There has to be ways to improve the common mans airport experience without stripping away freedoms. Innovators lets get it! Our time is now to make the world a better place.\n\nOne of my best friends had her father pass away recently. It is always heartbreaking to hear a loved one passed away. Reassuring to know the guy is on to better things and it makes me grateful I got to know him. He let me live in one of his homes for 6 months. Living in that front house helped me tremendously during the beginning of the \"pandemic\" and I will forever be grateful for the kindness and hospitality. It's weird to think life will never be the same after covid in the same way that the airports changed after 9/11. God bless the victims of that awful day. Good intentions might have been the reason for bulking up the T.S.A so much but there has to be a better way. Likewise, there has to be a better way to help those survive a virus than mandating masks and 💉 . People have the right to choose what they do, not what others should do. Safety is important but fear can cripple people. Every single day is likely to be filled with perplexing and emotion-provoking interactions. We can not hide from this by coddling people and letting them lash out under the guise of moral superiority. This just leads the world to be a worse place for everyone. Stand up and speak your mind anon. Life is some funny shit but it can get ugly if we don't speak up for basic human rights.\n\nI've been making a big effort to read more. Learning is both motivating and humbling because the more I read the more astounded I am with how much humanity still has to learn. Questions > Answers > More Questions > More Answers > Even More Questions. I don't know what the hell my dreams mean, but I bet you they contain lessons that will be valuable later in my life. Hug a tree, call a family member, go for a run and channel your inner animal. After I finished my 3 mile run last night I started snarling and making faces at the cars driving by because I felt my ego going crazy. Ended up doing one last sprint to tire myself out. Apologies to the people who saw me being a weirdo on the sidewalk but damn does it feel good to channel my inner beast. The corporate, woke, \"ESG\" society I find myself in can be frustrating at times, but getting back to the basics of being an animal is great. Don't underestimate the body and brain's ability to find happiness in the things our biology evolved to let us do ie: running.\n\n![](https://miro.medium.com/1*LesEat0_JSSIUqdodrWcZw.jpeg)\n\n4/10/22\n\nConor Jay Chepenik\n\nP.S Finished [Born To Run](https://www.amazon.com/Born-Run-Hidden-Superathletes-Greatest/dp/0307279189) and it's what motivated me to run at midnight on a Saturday. Do yourself a favor and read it if. Running could be a cure for so many of our modern-day problems.",
  "wordCount": 1195,
  "readingTime": 4.709433962264151,
  "claps": 0,
  "voters": 0
}