{
  "id": "e07bf8ff840f",
  "title": "Day 254",
  "createdAt": "2022-12-01 20:00:53",
  "tags": [
    "cs",
    "bitcoin-raps",
    "coercion",
    "hope",
    "peace"
  ],
  "url": "https://chepenikconor.medium.com/day-254-e07bf8ff840f",
  "content": "# Day 254\n\nThis video from Tip is incredible\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tip_nz/status/1598374379490246656&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMakes you wonder what a world built on debt means for the incentives of this game. Charlie Munger had a great quote about greed.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/nathanbaugh27/status/1598091596402429953&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIn many ways our world is 600% better. The question I'd ask Charlie if I could is how much of the wealth in the system is made up of debt. Like IOU's in the form of bonds between various companies and the derivatives on top of that. I have to imagine that it is a big number. The world is constantly changing and breeding new incentives structures. I believe our current system allows human greed to thrive because it takes away the physical cost of certain actions and socializes that cost around in an obscure way. A way that allows people to justify theft and get away with it. The free market lets everyone benefit in the collective productivity of a society. You can't fix people but you can fix incentives. Maybe when our system is built on open source software and math instead of nation-state debt we can have less coercion and more innovation. Look at this letter.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/repthomasmassie/status/1598397483318906880&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nSo insane that they fired people over a \\/ax that was falsely promoted as something that would prevent transmission 100%. When money isn't based on promises this wouldn't fly. There are many in media right now who constantly justify theft. This clip explains what happened with FTX and the fact no one has been arrested for what's happening is absolutely insane.\n\n> [**Bruce Fenton on LinkedIn: #Ftx #ftxcrash #sbf**](https://www.linkedin.com/posts/brucefenton_ftx-ftxcrash-sbf-activity-7004148009768747009-Ynbd?utm_source=share&utm_medium=member_desktop)\n\nClear cut case of fraud. Our system is so corrupt and based almost entirely on debt that stuff like this just flies. The [IMF claimed](https://www.imf.org/en/Blogs/Articles/2021/12/15/blog-global-debt-reaches-a-record-226-trillion) at the end of 2021 that global debt had hit a record 226 trillion. I mean come on. That's so insane! According to my google search the world Gross Domestic Product (GDP) was 96.1 trillion USD in 2021. After asking my hand dandy computer what 226/96.1 is it was revealed to me we have a 223% debt-to-GDP rate in the world. In a way debt is the ability to control something. Those that are in debt are beholden to their creditors. These two sides don't always see eye-to-eye especially when one owes the other side money. As the likelihood of one not paying able to pay accelerates it seems that issues are likely to arise. Like any sane human I pray we don't see another world war. Bad global money incentives war while fair money incentives piece. It is that simple!\n\nThank god for Bitcoin. No more cantillionaires. No more holding assets in companies that would be technically insolvent without a lender of last resort. Small ya later #CS.\n\n![](https://miro.medium.com/1*sR_4Hh-2Rgj3_0TsvGlsEQ.png)\n\nI don't know if they will actually go out of business but this does seem to be how bank runs start. It doesn't make much sense to hold your assets at a place that is doing the same thing as FTX and is likely technically insolvent. Fractional reserve banking is bad. So grateful I can be own my bank thanks to Mr. Nakamoto! Run a node anon.\n\n12/1/22\n\nConor Jay Chepenik",
  "wordCount": 549,
  "readingTime": 2.2716981132075476,
  "claps": 0,
  "voters": 0
}