{
  "id": "e0aaf6e80135",
  "title": "Day 500",
  "createdAt": "2023-08-04 22:47:43",
  "tags": [
    "bitcoin",
    "social-me",
    "gatekeeping",
    "curation",
    "lessons"
  ],
  "url": "https://chepenikconor.medium.com/day-500-e0aaf6e80135",
  "content": "# Day 500\n\nI don't know what it is about round numbers but they are cool. Amazing to think I've been putting my thoughts on the digital substrate that is Medium for 500 days in a row.\n\n![AdobeFirefly generation](https://miro.medium.com/1*y_5YWTa0Q7gmk7m-Vjb-jQ.png)\n\nToday I watched a podcast with this guy named [Gurwinder](https://twitter.com/G_S_Bhogal). He is one of my favorite follows on Twitter.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FOoF-t8yQCMY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DOoF-t8yQCMY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FOoF-t8yQCMY%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThis conversation made me think about how important curation is. Social media algorithms have an enormous influence on the information we consume. Platforms like Facebook, Twitter and Instagram allow us to curate our feeds by choosing who to follow. However, the content shown to each user is also dictated by complex recommendation systems behind the scenes. I would wager over 99.9% people don't understand how these opaque algorithms work, even though they shape the media diets of billions of users. This highlights the need for greater algorithmic transparency and user empowerment when it comes to social media curation. We should be more aware of how our online environments are filtered for us, and have more control over what information we receive. Unfortunately that will likely not happen on legacy platforms since there is no obvious incentive in doing so.\n\nThese platforms employ proprietary algorithms to curate our feeds, which cost each company a lot of money to develop. At the time of this writing Twitter is the only one I know who has made efforts towards opening up its algorithm. Still, we should aim to be selective about who we follow, despite not fully grasping the backend. It's a balance - following those we agree with builds community, but stepping outside our bubbles exposes us to new perspectives. We can learn the most from those we disagree with. Though algorithms are opaque, we do have agency in who we connect with. Curating our feeds thoughtfully, not haphazardly, can improve our experience. The platforms may shape the buffet, but we can still choose carefully what's on our plates.\n\nOpen source social media protocols like Nostr offer an exciting alternative to closed, proprietary platforms. Nostr's open ecosystem enables transparency, decentralization, and user control lacking in the major networks. Partly due to the public/private key design so a user controls their data and also partly because of the fact most clients on Nostr are open source. Though there are always tradeoffs, thoughtful curation on these platforms can foster enriching experiences. As Gurwinder notes, our feeds can become \"Heaven or Hell\" depending on how we cultivate our digital spaces. Nostr's ethos empowers users to mindfully shape feeds filled with signal - art, ideas, humor and conversations that uplift, not overwhelm. When freed from both opaque algorithms and all our data being on a central set of servers, we can better self-determine our social media diets. While curation takes effort, the rewards are feeds that inform and inspire. Thoughtful cultivation creates the heaven, leaving behind the hellish alternative.\n\nGatekeeping often carries negative connotations, but judicious curation is key to shaping social platforms that enrich rather than overwhelm. Thoughtful gatekeeping allows us to transform chaotic spaces into havens for learning, creativity and community. This morning I read about gatekeeping in the Bitcoin protocol - an example of setting standards to enable innovation on top of a solid permissionless foundation. It's weird to think a permissionless platform needs gatekeepers, but it surely does. Similarly, being selective (gatekeeping) about who and what we follow establishes a strong basis for social media experiences that add value.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FUsw2ZiRqsCY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DUsw2ZiRqsCY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FUsw2ZiRqsCY%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThe choice is ours . We can let our feeds overwhelm us, or we can take control. With intention and care, we can override the worst tendencies of social media and unlock its powers for good. Mindful curation grants us agency amidst opaque algorithms. And when we tend our digital gardens well, they blossom into beautiful oases of meaning.\n\n8/4/23\n\nConor Jay Chepenik",
  "wordCount": 636,
  "readingTime": 2.6,
  "claps": 0,
  "voters": 0
}