{
  "id": "e24b8e4671ed",
  "title": "Set Up My Own Bitcoin Node Today",
  "createdAt": "2021-10-11 00:38:33",
  "tags": [
    "bitcoin",
    "node",
    "technology",
    "raspberry-pi",
    "appreciate"
  ],
  "url": "https://chepenikconor.medium.com/set-up-my-own-bitcoin-node-today-e24b8e4671ed",
  "content": "# Set Up My Own Bitcoin Node Today\n\nThe best realization I've had as an Adult is that 99.9999% of people don't know a god damn thing and as animals who can think critically we often overestimate our abilities. Thus, I've tried to keep an open mind about every topic imaginable and remain ready to change my opinions when new facts present themselves. It's so easy to get pissed off by a clickbait headline but in most cases the news will have no effect on me. I'm really trying to expect less and appreciate more. Learning this is such a valuable skill and one I strive to practice every day. I have so much work to do and a bunch to learn but the first step is acknowledging :D\n\nIn honor of that I'd like to take a second and commend myself for practicing what I preach. I finally set up a Bitcoin Node which has me pretty excited. I constantly try to convince my friends and family about the power of Bitcoin and its ability to change the world for the better. However, one of the coolest aspects of Bitcoin, the fact it's decentralized, is limited if most users just end up on an exchange like Coinbase, Gemini, Binance, etc. To really unlock the true power and potential of Bitcoin it's best to run your own node. The beautiful thing is just because you have your Bitcoin on exchanges doesn't mean you can't run a node anymore. Exchanges are great in the sense they allowed me to buy Bitcoin before I could really do my research and get everything I needed to run a node. My guess is the majority of people in the world who decide to use crypto will end up on crypto exchanges. This is not necessarily a bad thing, but the more people who get convinced to run their own node the stronger the network becomes, the more privacy Bitcoin participants receive, and you learn a ton about Bitcoin and its underlying technology when you take the time to set up a personal node.\n\nThus, if you are just into Bitcoin for the price action maybe an exchange is your best route so you can treat your coins like securities and easily sell for fiat when the price appreciates as it constantly has over the years. If you're in crypto for the sovereignty and freedom you are most likely running a node. If you're in it for both do what I did: start with exchanges and slowly work your way up to a node when you feel comfortable. Everyone's journey with Bitcoin/crypto will be different but I've found that most people who start down the rabbit hole get so damn excited and it's a big reason why I'm such a believer it will go on to impact the world for the better.\n\nIn conclusion, I'm thankful as f*** to live in the time period I do, in a country like the U.S (that has it's flaws, but also has a ton of sovereign individuals working constantly to make sure we keep the freedoms that we hold so valuable as a country), and a support group that always has my back. Who knows what the future holds. I'm just appreciative I was able to set up my own Bitcoin node and now I get to learn about all the cool things I can do with it. Luckily, my girlfriend just got into knitting today so we will both have our hands full learning new skills :).\n\nIf you're curious about setting up your own node I used getumbrel.com and built my own with a raspberry pi. That being said, there are so many different ways to do it and I'd recommend doing some interweb searches before you purchase anything.\n\n10/10/21\n\nConor Chepenik",
  "wordCount": 635,
  "readingTime": 2.3962264150943398,
  "claps": 5,
  "voters": 1
}