{
  "id": "e2607645e2d7",
  "title": "Day 821",
  "createdAt": "2024-06-21 03:23:47",
  "tags": [
    "semler-scientific",
    "bitcoin",
    "treasury-management",
    "public-companies",
    "healthcare"
  ],
  "url": "https://chepenikconor.medium.com/day-821-e2607645e2d7",
  "content": "# Day 821\n\n**Semler Scientific's Bold Move to Secure Shareholder Value**\n\nAs corporate treasury strategies evolve, Semler Scientific has taken a pioneering step by embracing Bitcoin as a treasury reserve asset. This bold decision reflects the forward-thinking leadership of its Chairman, [Eric Semler](https://x.com/SemlerEric), and the company's commitment to optimizing shareholder value.\n\nDuring a recent interview with Bitcoinnews, Eric shared insights into the motivations behind this strategic move. \"We have a large cash balance, and almost half of our market value was in cash,\" Semler explained. \"As a board and management team, we spent a lot of time looking at options for the use of cash.\" The decision to invest in Bitcoin was not made lightly; it was the result of extensive deliberation and a deep understanding of the potential benefits and risks.\n\nSemler, who has been a seasoned investor and the founder of TCS Capital, brought his extensive experience to the table. His familiarity with the evolution of Bitcoin and its role in the financial ecosystem played a crucial part in the decision-making process. \"I followed the evolution of Bitcoin closely. I've invested in it. It was something that was top of mind,\" he noted.\n\n**Navigating the Risks and Rewards**\n\nOne of the key challenges in adopting Bitcoin for corporate treasury is managing its inherent volatility. Bitcoin tends to flow to productive entities rather than consumers because producers have the cash flow to manage its volatility, while consumers often cannot hold it due to their lack of incoming funds. As a successful business with significant cash on hand, Semler Scientific is well-positioned to leverage Bitcoin's potential. Eric noted Semler Scientific's team discussed various strategies in depth, but that specific board discussions must remain confidential.\n\n\"The actions kind of speak for themselves, right? Our board decided to do this. We announced that it's our primary reserve strategy and that we have been buying Bitcoin...as they say in baseball, you got to talk with your bat and that's kind of what we're doing.,\" Semler stated. This move has already started to pay off, with the company's stock seeing an upward trend since the [announcement of this strategy in late May](https://ir.semlerscientific.com/news-releases/news-release-details/semler-scientificr-announces-bitcoin-treasury-strategy), indicating market approval.\n\n![[https://www.google.com/search?q=Semler+scientific+stock&oq=Semler+scientific+stock&gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIGCAEQLhhA0gEIMzAyM2owajSoAgCwAgA&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=Semler+scientific+stock&oq=Semler+scientific+stock&gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIGCAEQLhhA0gEIMzAyM2owajSoAgCwAgA&sourceid=chrome&ie=UTF-8)](https://miro.medium.com/1*KVzcwq5ENmbfuJvrLyh2VA.png)\n\n**Leading by Example**\n\nSemler Scientific's decision sets a precedent in the healthcare industry, where such innovative financial strategies are rare. When asked if other companies might follow suit, Semler expressed his surprise that more companies haven't already adopted Bitcoin as part of their treasury. \"It surprises me that a lot of companies, big and small, haven't been doing this,\" he said. He believes that as Bitcoin becomes more institutionalized and if global economic instability persists, more companies will recognize its value as a reserve asset.\n\n**The Broader Impact**\n\nThis move by Semler Scientific is not just about financial optimization; it represents a broader trend towards embracing digital assets and technological resilience. \"The digital nature of Bitcoin, its technological strength, its architectural resilience - I think it is a terrific asset class,\" Semler asserted.\n\nBy integrating Bitcoin into their corporate treasury, Semler Scientific is not only securing its financial future but also paving the way for other companies to explore similar strategies. This bold move underscores the importance of innovation in corporate governance and capital allocation, setting a new standard for the industry.\n\nEric also discussed a significant challenge within corporate boards which might explain why more companies haven't adopted Bitcoin as a treasury reserve asset. He observed that many boards are composed of members who are more focused on maintaining the status quo rather than taking bold, innovative steps. \"Maybe why this hasn't happened more is that there are a lot of boards where they're just filled with people who are retired, collecting a coupon for showing up,\" Semler remarked. This conservative approach often results in a reluctance to embrace new financial strategies that might appear risky.\n\nHowever, both Semler and Bitcoinnews are in agreement that Bitcoin stands out as the only cryptocurrency with a genuine shot at becoming sound money for the world. This is why Semler Scientific adopted a Bitcoin strategy, not a diversified cryptocurrency strategy. One clearly aligns more with the goal of maximizing shareholder value, and it's not the dogecoin/eth/solana strategy. This belief in Bitcoin's unique potential as a sound monetary asset was a key factor in Semler Scientific's decision to make it a part of their treasury strategy.\n\n**Conclusion**\n\nSemler Scientific's embrace of Bitcoin as a treasury reserve asset is a testament to the company's strategic vision and commitment to shareholder value. Under Eric Semler's leadership, the company is navigating new financial landscapes, demonstrating that with careful consideration and a forward-thinking approach, innovative strategies can lead to significant rewards.\n\nWhile it's easy for board members to show up and collect a check, taking the time to embrace new ideas, take risks, and leverage new technologies can yield tremendous benefits if done correctly. Semler Scientific's decision to adopt Bitcoin reflects a willingness to step outside the conventional boundaries of most publicly traded healthcare companies. This move not only secures their financial future but also sets a precedent for other companies to follow.\n\nAs the market continues to respond positively to Semler Scientific's bold move, it is clear that their strategy could inspire a new wave of adoption among other companies. This domino effect, starting with pioneers like MicroStrategy, Semler Scientific, and MetaPlanet, could ultimately lead to the largest companies in the world embracing Bitcoin as a treasury reserve asset. This heralds a new era in corporate treasury management, where digital assets play a crucial role in optimizing shareholder value and driving financial innovation.\n\n![](https://miro.medium.com/1*Pi0rYniWaJZQlRzP3_50ww.png)\n\n6/20/24\n\nConor Jay Chepenik",
  "wordCount": 935,
  "readingTime": 3.911635220125786,
  "claps": 2,
  "voters": 1
}