{
  "id": "e4f0f0e200c3",
  "title": "Day 165",
  "createdAt": "2022-09-03 21:07:08",
  "tags": [
    "boston",
    "library",
    "time",
    "computers",
    "food"
  ],
  "url": "https://chepenikconor.medium.com/day-165-e4f0f0e200c3",
  "content": "# Day 165\n\nGot to enjoy a nice dinner in the North End of Boston with my girlfriend, Mum and Stepfather last night. Usually, I'm not the biggest fan of Italian food, but that food last night was delicious. Honestly, it's not that I dislike Italian food I just find it has so many carbs. I'd usually prefer meat. That said, I ate so much good Italian food last night that I still feel a little slow this morning because my body is trying to process all the food hahahaha. Hard to stop eating delicious pasta once you started. Had a fascinating conversation at the dinner table as well. Growing up I thought my Stepdad could be a little condescending, but I now realize the dude is just brilliant. He understands so many different things that sometimes when he explains stuff it goes right over everyone else's head because they don't have the background to understand what he is talking about. We got on the conversation of computers and data because my Stepdad use to be a coder. It is amazing how far modern day computers have come with silicone. Back when my Stepdad was programming they had to use magnetic tape to run programs. He only used C to code and he had people manually running around to put the tape in a certain spot so the computer could run the code. Nowadays everything on the back end is mostly a server rack hosted by AWS, GCP, or Azure. Plus a few on-prem and smaller hosting companies. Another thing we talked about is the charm of older pieces of technology. For example, my Stepdad used to have an amazing old record player and massive speakers. He was getting crap for it taking up so much space so he sold it. Not even a year letter my youngest sister was asking for a record player hahaha. I don't have a record player, but every time I have gotten the chance to listen to one it is awesome. I do think the audio quality is a little better and it's a visceral feeling taking a record out of its case and hearing the scratch when you put the needle down on it.\n\nLife changes and those who keep up with the changes typically benefit the most. That said, nostalgia is a powerful thing and I can see why people pay so much money for older items that are of quality. I sold my ps3 in college plus a bunch of controllers and games for like 60 bucks. I regret that decision now because had I kept it up to date and nice I could've sold it for a lot more in the future. I also could've continued to use it to play various games without having to hook my system up to the internet and deal with all the B.S that comes with a TCP/IP connected device. It still blows my mind how rapidly the way we store, call, and use data is changing. Seems like it won't be long before we put the TCP/IP connected devices into our skins rather than just carry the devices in our pockets. Not saying that's what I want, but it does seem like that is where we are heading.\n\nMy Mum has a nice Tesla and I love all the features in that car. However, driving a Tesla is not a visceral feeling in the same way driving a manual sports car is. Like if I'm going on a super long road trip I'll admit the idea of autopilot and Netflix playing sounds great. If I'm just going for a joyride though I'd prefer the muscle car with a stick shift. Everything has tradeoffs but I'm curious what the world will look like in ten years and what I'll be reminiscing about. Probably stick shift cars still since at that point they will likely be near impossible to get hahahah. Also maybe a simpler time when corporations weren't trying to shill be a TCP/IP connected piece of hardware that goes inside my body.\n\nWent on a duck tour and explored downtown Boston today with the family. It was actually a great experience. First time taking a duck tour since I moved to Boston in 2016. Do recommend. Also got to check out the Boston Public Library which was really cool. Some photos below.\n\n![](https://miro.medium.com/1*BsxLlWzytRYk1Y93qtGUww.jpeg)\n\n![](https://miro.medium.com/1*iVG35HlfpmU6TUwiPo_Hog.png)\n\nSomething really amazing about the low time preference architecture of Boston. I used to be a big modern art guy and while there is still some I do admire it seems that a lot of modern art is high time preference fluff. The real low time preference works before fiat money corrupted most stuff is really something to behold. Felt special being in the Boston Public Library. I've been down on America recently because of all the B.S filling my feed, but today was a good reminder that we are an incredible country and the fact this library is a public space for people to learn and study is amazing. I need to make some trips here to study just look at this.\n\n![](https://miro.medium.com/1*lGJP1Fvn_QzdQTuBHUeuKw.jpeg)\n\nWho wouldn't want to study in a space like this. Overall, a really good weekend. About to hit a nice run now and then grab dinner with my family tonight. Life is good.\n\n9/3/22\n\nConor Jay Chepenik",
  "wordCount": 889,
  "readingTime": 3.9047169811320757,
  "claps": 0,
  "voters": 0
}