{
  "id": "e5105c1785c5",
  "title": "Day 331",
  "createdAt": "2023-02-17 03:58:37",
  "tags": [
    "parenting",
    "mass-adoption"
  ],
  "url": "https://chepenikconor.medium.com/day-331-e5105c1785c5",
  "content": "# Day 331\n\nFantastic parenting article by Cernovich. Highly recommend reading for those with little ones.\n\n> [**Parenting: It Always Starts with You**](https://mikecernovich.substack.com/p/parenting-it-always-starts-with-you?utm_source=substack&utm_medium=email)\n\nLot of lessons I can take away from this article. Sometimes at night my kid will start crying and I'll feel this ringing in my ear. It reminds me of the scene in a movie when people are at war or a bomb goes off and a loud ringing plays. Usually the characters in the film just zone out. Luckily for me, zoning out for a moment won't mean losing my life. One of lines from this article that I think is important to remember: \"You have to watch yourself. Kids have huge surge of energy before bedtime. They will go from running around like feral lemurs to snoozing.\" I can attest to this. I've seen Sloan so worked up and then bam! She is out like a brick. If I'm worked up because I just want to sleep and Sloan isn't sleeping my \"energy\" of being annoyed won't help. If anything it is likely going to keep up more. The key is being calm so when she burns through that energy burst she is ready to pass out rather than worrying about why I'm annoyed.\n\nOn another note feels good to be back in Boston. I went to my Mass Adoption Bitcoin meetup tonight which was a treat. Shout out my partner for watching the little nugget while I chatted it up with the boys. For the substack article I'm going to write my plan is to discuss what our festival can have. Currently we are talking 3 v 3 basketball, a tire to throw a football through, competitions (potentially including these sports to win sats), and food trucks that will be selling food for sats. Another thing I'd like is the potential for a small stage for some fireside chats. It is going to be interesting to see how this all plays out but I'm pumped to watch this festival come to life. I'd also like to discuss the whole alien/balloon/ufo rabbit hole I went down at the meetup tonight. I was recommend a podcast called merged.\n\n> [**Merged Podcast**](https://www.youtube.com/@merged_podcast)\n\nAfter watching the intro clip I must say I'm intrigued. The rabbit hole runs deep on UFOs and aliens. Zach, the guy who really seemed to know what he was talking about joked that I should be prepared if I start going down this rabbit hole because it's like the Bitcoin one: never ending. Another thing discussed at the meetup was the importance of principles. Specifically to the whole ordinals thing on Bitcoin. I liked the framework either recommend some code or shut up. Hahahahaha a simple framework. Makes sense though because Bitcoin is about building. Either propose something better or stop complaining about what's happening on a permissionless network. Need to think about how I can incorporate all this in an article. Final thing discussed was Bing's new chatGPT type thing. I have not read to much but I was put on to this Twitter account which is having some interesting conversations with it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/gfodor/status/1626019636096675842%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nCreepy stuff but kind of cool. These systems are going to get exponentially better and melt faces. In the good way hopefully hahahahha. Like oh my gosh everything is so much cheaper and people are more prosperous type melting faces instead of terminator style.\n\nFinal thought for today: write a Bitcoin article about the lessons I've learned from 1984. First finish 1984 though. I'm almost done and I like how in the book Big Brother gets their victims to feel remorse for their crimes. It ties in with what I want to write about which is the Fed and other central banks trying to lul people into using fedcoins. Not sure if that is even how you correctly spell lul but we're riding with it for this post! One of the ways they will do this is to get people to think cash is dirty. Preach the convience of this new system. They might even only offer UBI through it. I don't know but I think it's important to get people ready to commit thought crimes. To show humanity we can opt out peacefully before it's too late. Lot of writing to do and I'm here for it. See you tomorrow anon.\n\n2/16/23\n\nConor Jay Chepenik",
  "wordCount": 760,
  "readingTime": 2.8679245283018866,
  "claps": 0,
  "voters": 0
}