{
  "id": "e64b91d5d959",
  "title": "Day 55",
  "createdAt": "2022-05-17 01:57:29",
  "tags": [
    "joe-rogan",
    "authentic-self",
    "censorship",
    "hotep-jesus",
    "starting"
  ],
  "url": "https://chepenikconor.medium.com/day-55-e64b91d5d959",
  "content": "# Day 55\n\n![](https://miro.medium.com/0*yxIzJbSM_H6E_SNd)\n\nToday I tweeted, \"New constitution: \"Leave Me The Fuck Alone\" fantastic conversation by [@HotepJesus](https://twitter.com/HotepJesus) & @[JoeRogan](https://twitter.com/joerogan)\" with a link to the podcast which can be found [here](https://open.spotify.com/episode/2l8MdAvOqCuncuE0jMMZgq?si=jpxfPt6ITAeA-B3ySJ-haA&context=spotify%3Ashow%3A4rOoJ6Egrf8K2IrywzwOMk&nd=1) and it got retweeted by Hotep. I meant it too. Excellent podcast that was both hilarious and insightful. Hotep joked that Alex Jones, Micheal Malice, and Joe Rogan were his new Mount Rushmore and while that is funny as fuck it is also true for myself if I think about. Maybe I would add Lex Fridman up there too 🤣. I got way more respect for those three than the donkeys in politics. Old ass senators on their death beds t[rying to send us to war ](https://twitter.com/greg_price11/status/1525161726643257344?s=20&t=4EMCUx8THMVT0Pzjyb7NYg)without even having congress vote on it. What an absolute joke. Seriously. In a world full of so much fake, toxic, corporate bullshit people who speak their mind and don't put on an act are special people. Politicians think they run shit when in reality they were elected to work on our behalf. There are still a few out there who are trying to put the people first, but most are absolute 🤡 s like Pelosi, Biden, Steny Hoyer, and the rest of these people who think they are above hard-working citizens. The crazier the world gets the more people have to self-censor. When you start worrying about not saying the wrong thing you go down a slippery slope. Plus, people start to see through your bullshit real quick. Be authentic anon. Find your voice and let it spread. I appreciated Joe Rogan saying mentioning this same idea on his Podcast. Joe even joked that he sucked when he first started making the J.R.E but over time he got good. It's simple advice but often ignored advice. So many have said it and it is so true: just start. Figure out what you like to do and do it every single day. My whole goal with these posts is to get better at writing. Some days writing is the last thing I want to do and some days I can not wait to start putting my fingers on the keyboard. That's just being human, but I know that come day 365 I will be a much better writer than I was on day 1. At least I hope so🤣.\n\nIt's also incredible how connected social media has made us. I just found out about Hotep Jesus when I saw him on Robert Breedlove's Podcast a while back. Was pleasantly surprised to see him on J.R.E so I watched the episode because I thought he crushed it on Breedlove. Hotep is smart but I don't think that's what made me like him. It's the fact he is authentic as fuck. Just like Joe, Micheal, Alex, and Lex. (Haven't watched much Alex Jones outside of clips but now I want to start watching more. For a conspiracy theorist he sure did get a lot right👀 ✊🏽 🤔) I've self-censored these past two years. Not proud to admit it but I want to make a point to be better. Enough with the self-censoring bullshit man. Life is so short. If I lose my job or get attacked by the woke mob so be it. I'm done self-censoring. I will speak my mind and admit if I'm wrong. I might change my opinion later when I learn new facts but I am not going to self-censor anymore. Censoring is bad for the mind, body, and soul. Putting it in words here so I am committed to speaking freely. I don't want to go out and start provoking people for no reason, but I'm done holding my tongue(or fingers if we talking social media😂 ). Thank you Hotep and Joe for making my day better and reminding me no one likes the scripted corporate doublespeak that litters the mainstream airwaves. Let's get after it people! Also, look at the reach of this tweet. I didn't make the tweet to grow my audience. I made it because I genuinely thought they crushed it. That said, it is a good lesson. A great way to grow your social media following is to tweet compliments at people you like. Especially if you mean what you are saying, the rest will take care of itself.\n\n![](https://miro.medium.com/1*thjT9K1IbGYqXHDesEZVDg.jpeg)\n\nLot of people seem to be waking up and smelling the roses. Many are tired of the woke hive mind and it is great to see mainstream media losing its grip. People will continue to flock to those who are authentic while the people who are trying to coerce others will die out. Like I've said so many times on this medium good is going to win. Guess what ima keep it saying. I'll never stop saying it. The good guys are going to raise families, pass on their legacies, eat healthy, exercise, and lead meaningful lives. The woke hive-minded people will remain miserable and try to weaponize others' goodness for their own gain. As more people wake up and realize the woke only have power if you play their game the quicker they will become irrelevant and likely die off since they will be too miserable to accomplish anything great. Especially something as great as raising a family. Be proud of yourself anon. Most importantly, be yourself anon. Don't be afraid to let out your weirdness. Don't be afraid to speak your mind. Most importantly don't be afraid to start. Cheers.\n\n5/16/22\n\nConor Jay Chepenik",
  "wordCount": 911,
  "readingTime": 3.821069182389937,
  "claps": 0,
  "voters": 0
}