{
  "id": "e8311761840b",
  "title": "Day 782",
  "createdAt": "2024-05-12 19:24:58",
  "tags": [
    "the",
    "bitcoin",
    "white",
    "paper",
    "simplified"
  ],
  "url": "https://chepenikconor.medium.com/day-782-e8311761840b",
  "content": "# Day 782\n\n**Breaking Down The Bitcoin White Paper**\n\nThe [Bitcoin White Paper](https://bitcoin.org/bitcoin.pdf) is a beautiful document, but quite a technical one. For those without a background in finance, computer science, or networking, it can be a difficult read. This essay seeks to demystify the white paper, presenting its concepts in an accessible and straightforward manner for readers without a technical background.\n\n![Satoshi bringing digital scaricity to the World](https://miro.medium.com/0*eCRmLJkRlqiW9O4X)\n\n**Part 1 - Introduction**:\n\nImagine you want to send money to your friend online. Normally, you would need to go through a bank or payment service like PayPal to make sure the transaction is secure and your money doesn't get spent twice (double-spending).\n\nThese banks or services act as a third party or middleman. They keep track of everyone's money and make sure transactions are valid before approving them.\n\nHowever, having to rely on a middleman has some downsides:\n\n1. Transactions can be reversed or stopped if the middleman decides there is a dispute or fraud. This makes it hard to make truly irreversible payments.\n\n2. The middleman charges fees, which increases costs, especially for small payments like a few cents.\n\n3. Because reversals are possible, merchants have to ask for more information from customers to verify identities and prevent fraud.\n\n4. There is no way to make payments directly between two people online without involving a middleman.\n\nThe goal is to create a new electronic cash system that doesn't need a third party. Transactions would be secure thanks to cryptography (fancy math codes) rather than having to trust a middleman.\n\nThis would allow any two people to send money directly to each other over the internet without a bank, fees, or the risk of chargebacks. Sellers would be protected from fraud, and buyers could use escrow services if needed.\n\nThe key is solving the double-spending problem in a decentralized way, without a central authority. That's what the rest of the paper describes - a peer-to-peer network and system for achieving this.\n\n**Part 2 - Transactions:**\n\nIn this system, money is represented by digital coins. But these coins aren't physical objects. Instead, each coin is like a digital record or log of ownership.\n\nImagine there's a piece of paper that says \"This coin belongs to Person A\". When Person A wants to give that coin to Person B, they do the following:\n\n1. Person A gets the piece of paper representing the coin's ownership.\n\n2. Person A writes on the paper: \"I, Person A, am transferring this coin to Person B\" and then digitally signs it with a secret code (like a super secure signature).\n\n3. The paper now has Person A's signature showing they approved the transfer to Person B.\n\n4. Person A gives the updated paper with their signed transfer statement to Person B.\n\nNow Person B has proof of ownership of that coin, because they hold the paper with Person A's signature transferring it to them.\n\nWhen Person B wants to spend that coin with someone else like Person C, they just add their own signed transfer statement to the same paper, saying \"I, Person B, transfer this coin to Person C.\"\n\nSo the paper trail or chain of ownership keeps growing with each transfer, with every new owner adding their digitally signed transfer statement.\n\nThis allows anyone to verify the full chain of ownership by looking at all the signatures on the paper trail for that coin.\n\nHowever, there's still one big issue... What if Person B tries to cheat by also giving a copy of that same coin's paper trail to someone else, like Person D? This is called \"double-spending\" and it's currently prevented by banks/third-parties keeping ledgers.\n\nBut in this new system, there needs to be a way to prevent double-spending without a third-party. That solution is described in the next sections!\n\n**Part 3 - Timestamp Server:**\n\nTo prevent the double-spending problem without a third-party, we need a way to prove which transaction for a coin happened first in time.\n\nImagine there's a very reliable and trusted source that constantly publishes a record of current events and their exact times, like a newspaper.\n\nWhen Person A wants to transfer a coin to Person B, they make an announcement to this timestamp source, saying \"At 3:25pm on June 1st, I transferred my coin to Person B.\"\n\nThe timestamp source then publishes this announcement in their next event record, proving the transfer was made at that specific time.\n\nNow if Person A tries to double-spend by transferring that same coin to Person C later at 4:15pm, the timestamp record shows the earlier 3:25pm transfer to Person B happened first.\n\nSo by checking the widely-published and trusted timestamp record, everyone can see which transfer is the valid one that should be accepted.\n\nOf course, we can't rely on a single timestamp source like a newspaper, as that reintroduces a third-party we need to trust.\n\nThe solution is to use a decentralized network of computers, all maintaining their own timestamp records together, so no single entity is in charge.\n\nEach computer records a batch of recent transactions in a \"block\", stamps it with the current time, and links it to the previous block of transactions in a long \"chain\" of timestamps.\n\nSo the full chain of transaction blocks, secured by advanced cryptography, acts as the trusted public record of which transactions happened first, second, third, and so on.\n\nThis distributed timestamp server system run by the network itself prevents double-spends without needing a third-party referee!\n\n![[https://bitcoin.org/bitcoin.pdf](https://bitcoin.org/bitcoin.pdf)](https://miro.medium.com/1*cMVxa_9H5ahvQ9MsZ0IEXg.png)\n\n**Part 4 - Proof Of Work:**\n\nIn the previous section, we described how the network acts as a decentralized timestamp server by computers adding new blocks of transactions to a chain.\n\nHowever, there needs to be a way to decide which computer gets to add the next block and update the official transaction record.\n\nIf anybody could just add blocks anytime they wanted, there would be conflicting records and no way to agree on which chain is the correct one.\n\nThe solution is to make adding new blocks very difficult and have the computers essentially race or compete to be the first to create the next valid block.\n\nHere's how it works:\n\n1. To add a block, a computer must find a special extremely difficult mathematical solution or \"puzzle.\"\n\n2. This puzzle is so hard that even powerful computers can only get lucky and solve it through a very large number of random guesses.\n\n3. The first computer to finally guess the solution gets to add their block of new transactions to the chain.\n\n4. Once a computer succeeds, the puzzle resets and all computers start racing to solve the new puzzle for adding the next block.\n\nThis process of expending massive computing work to find the solutions and add blocks is called \"Proof-of-Work.\"\n\nThe key idea is that while any computer can try to create blocks, only one can succeed each time. And there's no way to cheat, because solving these puzzles really does require that much computational effort.\n\nSo the longest chain of blocks is the trusted one, because that's the chain with the most cumulative Proof-of-Work behind it from all the computers on the network.\n\nAs long as honest computers control more total power than any malicious group, they will create the longest valid chain that the entire network accepts.\n\n**Part 5 - Network:**\n\nThe network that powers this electronic cash system doesn't have a central authority or server running it. Instead, it relies on the combined efforts of many computers (nodes) working together in a peer-to-peer fashion.\n\nHere's a step-by-step overview of how the decentralized network operates:\n\n1. When someone wants to transfer a coin, they broadcast the transaction details to the entire network so that every node gets the information.\n\n2. Each node collects several new transactions into a \"block\" like pages in a ledger book.\n\n3. The nodes then race to solve the difficult proof-of-work puzzle for their block, essentially competing to become the next record-keeper.\n\n4. Whichever node solves the puzzle first gets to broadcast their completed block to everyone on the network.\n\n5. The other nodes check that all transactions in this new block are valid (no double-spends) before accepting it.\n\n6. Once accepted, the new block gets cryptographically linked and added to the ever-growing chain of approved transaction blocks.\n\n7. All nodes then start working on the next block of transactions to add to that same chain.\n\nThe amazing part is that the network can keep running in this decentralized manner without any central oversight or point of failure. It's self-sustaining.\n\nNodes can join and leave the network whenever they want. As long as there is a majority of nodes behaving honestly, the system works.\n\nNew transactions and blocks get constantly added to the shared transaction chain through competition and consensus among the nodes.\n\nSince Satoshi Nakamoto created Bitcoin, the landscape of mining has evolved significantly. Initially, any participant could mine with general-purpose hardware like CPUs or GPUs. However, the mining process is now predominantly performed by specialized hardware known as ASICs (Application-Specific Integrated Circuits), which are far more efficient at solving Bitcoin's cryptographic puzzles. Additionally, while many nodes continue to participate in transaction verification, a considerable number of these nodes now primarily focus on verifying and maintaining the blockchain without directly engaging in the mining process.\n\n**Part 6 - Incentive:**\n\nFor this decentralized network to work, we need incentives to encourage people to run the nodes that power it. Running a node takes effort, electricity and computing power.\n\nSo here's how the system incentivizes participation:\n\nWhenever a node manages to solve the proof-of-work puzzle and gets to add a new block to the chain, that block has a special first transaction in it.\n\nThis first transaction doesn't transfer any existing coins, instead it creates brand new coins and assigns them to the node that created that block.\n\nIt's like a reward or payment to the node for the work it did to construct a valid new block.\n\nThis process of generating new coins to reward nodes for their proof-of-work is how all coins initially get created and introduced into the system.\n\nIt's similar to how gold miners expend effort and resources to extract new gold and bring it into circulation.\n\nOver time, as more and more blocks get added, more and more new coins get created and distributed to the nodes doing the proof-of-work.\n\nAdditionally, regular transactions can also include small fees payable to the node that includes those transactions in their block. This provides another incentive.\n\nBy incentivizing with newly created coins and transaction fees, the system motivates a network of nodes to power it through their combined efforts without anyone being in charge.\n\nThe hope is nodes will have more incentive to play fairly than try to disrupt the system, as that would devalue the coins they earn.\n\n**Part 7 - Reclaiming Disk Space:**\n\nAs more and more transactions get added to the chain of blocks over time, the total data size will keep growing. This chain has to be stored by all nodes on the network.\n\nIf nodes had to keep absolutely every transaction record forever, even really old ones, eventually they would run out of disk space on their computers to store the massive chain.\n\nTo prevent this problem, the system allows nodes to discard or \"prune\" some of the really old/spent transaction data while still keeping the integrity of the overall chain intact.\n\n![[https://bitcoin.org/bitcoin.pdf](https://bitcoin.org/bitcoin.pdf)](https://miro.medium.com/1*Ihmj9EMLxrk937GDGDNZFA.png)\n\nHere's how it works:\n\n1. Instead of just listing all transactions one after another, they are grouped and organized in a special way using something called a \"Merkle Tree\".\n\n2. This tree structure allows for portions of the old transactional data to be mathematically summarized or compressed into a tiny unique \"fingerprint\" code called a hash.\n\n3. Only this small hash code needs to be stored and kept, not the full data for those old transactions.\n\n4. Newer blocks in the chain only record the hash representing the historical data, not the actual data itself.\n\n5. So nodes can discard the underlying old transactional data that's already been summarized and replaced by these tiny hash codes in the newer blocks.\n\nThis pruning process is like cutting off branches of a tree (the old data) but still keeping intact the trunk and roots (the chain's history encoded in hashes).\n\nBy only storing these compact hash codes instead of full transaction data, the size of the chain that nodes need to store is vastly reduced over time without compromising integrity.\n\nThis reduction in storage requirements enables even older computers to participate as nodes in this optimized blockchain system. Consequently, this fosters greater decentralization, as it allows a broader range of devices to contribute to and maintain the network, enhancing its robustness and resilience.\n\n**Part 8 - Simplified Payment Verification:**\n\nNormally, to fully verify if a transaction is valid and really part of the approved chain, you need to be running a full node on the network. A full node means you have to download and store the entire blockchain data.\n\nHowever, there is a \"lightweight\" method that allows you to still verify payments without having to store the full chain. This makes it easier for devices like mobile phones or simple wallets to still confirm transactions.\n\nHere's how the simplified verification works:\n\n1. Instead of storing the entire chain, you only need a copy of the block headers - which are like the summaries or titles of each block, not the full transaction data inside.\n\n2. You can get this copy of block headers by asking a few different nodes on the network and cross-checking that you have the longest valid chain from the majority.\n\n3. When you receive a transaction, you're also provided with a special code called a Merkle Branch that links the transaction to a specific block in the chain.\n\n4. Using this Merkle Branch, you can cryptographically confirm that the transaction is indeed embedded into that block, without needing the full data.\n\n5. Since you have the block headers with hashes linked all the way down, you can verify that the block belonged to the longest chain accepted by nodes.\n\nSo in essence, you rely on verifying that the transaction is found in a block that was approved by the honest majority of nodes as part of the valid chain, rather than checking every transaction yourself.\n\nThis lightweight method allows secure verification of payments by even simple wallets, as long as the network itself remains secure and properly decentralized among honest nodes.\n\n![[https://bitcoin.org/bitcoin.pdf](https://bitcoin.org/bitcoin.pdf)](https://miro.medium.com/1*2DK9gF_E7d9GndjQ3uWEtA.png)\n\n**Part 9 - Combining and Splitting Value:**\n\nIn the system described so far, we've treated coins as whole individual units that get transferred from owner to owner.\n\nHowever, in reality, we often need to combine or split values when making payments and receiving change.\n\nFor example, if you want to pay $7 but only have $5 and $3 coins, you'd need a way to combine their values. Or if you pay $10 for something that costs $7, you'd want $3 back in change.\n\n![[https://bitcoin.org/bitcoin.pdf](https://bitcoin.org/bitcoin.pdf)](https://miro.medium.com/1*w4CCWdGHbL47dO-su6y5Xg.png)\n\nThis section explains how the system handles those kinds of combined transactions:\n\n1. Instead of having just one input and one output, transactions can have multiple inputs and multiple outputs.\n\n2. For a payment, the inputs are unspent coin amounts you already own that add up to the desired value to transfer.\n\n3. The outputs are split into two parts - the payment amount itself going to the recipient, and any remaining change going back to you as a new coin output.\n\n4. This allows values to be flexibly combined from multiple input coins to make a payment output, and also create change outputs from leftovers.\n\n5. It's sort of like exchanging two $5 bill to buy a $7 item, where you seamlessly get $3 one dollar bills back as change.\n\nThis flexible input/output model gets around the limitation of having to transfer whole coin values at a time.\n\nIt enables micro-payments down to tiny amounts by letting you combine as many inputs as needed. And it ensures there is no lost value by outputting change.\n\nThe splitting and combining is all handled seamlessly within transactions in the blockchain.\n\n**Part 10 - Privacy:**\n\nWhen you make a transaction through a traditional bank, your personal information like name and account numbers are kept private and only accessible to the bank and parties involved.\n\nHowever, in Bitcoin's decentralized system where all transactions are publicly announced across the network, some level of privacy is still needed. We don't want everyone to see which real-world identities are associated with each transaction.\n\nHere's how Bitcoin achieves a reasonable degree of privacy:\n\n1. Instead of using names or accounts, transactions only refer to digital \"addresses\" which are long random-looking strings of numbers and letters.\n\n2. These addresses act like anonymous identities or aliases. You can have as many addresses as you want, and they are not linked to your real-world identity by default.\n\n3. When you make a transaction on the network, your addresses sending and receiving the bitcoin are publicly visible, but not your real name or identity behind those addresses.\n\nIt's similar to how a public stock market shows trading data like the time, amount and price of trades, but doesn't reveal the real identities of the buyers and sellers behind each trade.\n\n1. To further improve privacy, you can generate and use a brand new address for every transaction you make. This helps prevent different transactions from being linked back to the same originating address/identity.\n\n2. The downside is that if someone is able to link one of your addresses to your real identity through other means, all transactions involving that address could then also be linked to you.\n\nSo while not 100% secure, Bitcoin provides a reasonable level of privacy by dissociating real-world identities from the public blockchain, similar to the pseudonymity of online usernames or nicknames.\n\nThe goal is to find a balance between privacy and verifiability that is suitable for an open cryptocurrency system.\n\n![[https://bitcoin.org/bitcoin.pdf](https://bitcoin.org/bitcoin.pdf)](https://miro.medium.com/1*OA7SmmhGbPdWbS5iM5iHhw.png)\n\n**Part 11 - Calculations:**\n\nThis section does some math to analyze how secure Bitcoin's system really is against potential attackers trying to disrupt or manipulate the transaction history.\n\nImagine an attacker (like a hacker or malicious group) is trying to modify the public ledger of transactions for their own benefit, like redirecting payments that were sent to someone else.\n\nThey will attempt to build their own separate blockchain that rewrites the parts they want to change. This is known as a \"fork\" from the main accepted chain.\n\nThe key question is: What are the odds that the attacker's fork could actually outpace and overtake the legitimate chain maintained by honest nodes on the network?\n\nThe calculations show that the probability of an attack succeeding drops exponentially as more blocks get added to the legitimate chain over time.\n\nEssentially, as long as honest nodes control more computational power for mining than the attacker, they will keep extending their chain faster than the attacker's fork.\n\nThe more the attacker falls behind, the more impossibly difficult it becomes to catch up due to the intense Proof-of-Work requirements.\n\nUnless the attacker can somehow get control of the majority of the network's computing power, their odds of successfully rewriting the established blockchain become infinitely small.\n\nSo while an attack is theoretically possible, Bitcoin's system makes it practically infeasible for any single attacker to override the authoritative transaction record, as long as the network retains decentralization.\n\n**Part 12 - Conclusion:**\n\nThe conclusion and key innovation of Bitcoin is the creation of a decentralized, secure system for digital cash that doesn't require trust in any central authority.\n\nBy combining key concepts like a public blockchain, Proof-of-Work mining, and economic incentives, Bitcoin allows anyone in the world to cheaply and fairly participate in a globally neutral currency system.\n\nNo longer do we need to rely on governments, banks or payment processors to verify, approve or control our digital money transfers and ownership records.\n\nInstead, through decentralized consensus mechanisms and cryptographic verifiability, Bitcoin puts the power into the hands of its global peer-to-peer network participants.\n\nFor the first time, we have a way for online payments to be transferred in a truly peer-to-peer fashion, without intermediaries, interventions or unnecessary costs.\n\nBitcoin unlocks the possibility of a globalized, open, neutral digital cash system that is natively internet-based and belongs to the public commons, just like no single entity can claim ownership over the air we breathe.\n\nThis is what makes Bitcoin extraordinarily important - it takes us away from centralized controlling authorities and into a new era of decentralized global finance and currency for and by the people.\n\n**Never Stop Learning**\n\nBitcoin is a complex journey that reshapes our understanding of money and value. This essay aimed to simplify the Bitcoin White Paper, making Satoshi Nakamoto's groundbreaking ideas more accessible. Just as air is indispensable and universally used, Bitcoin could become essential for digital transactions, offering a new way to think about and use money.\n\nHumanity is still at the forefront of Bitcoin's adoption. By learning about it now, you're positioning yourself in a movement that's set to revolutionize finance. Your efforts today could be remembered by future generations as foundational in creating a fairer and more prosperous world.\n\nKeep diving deep into Bitcoin. Every bit of knowledge not only enlightens but also paves the way for innovative opportunities. Decentralized, bottom-up systems like Bitcoin flourish when knowledge and adoption spread far and wide. So never stop learning, your journey through Bitcoin might just be the start of something monumental.\n\n5/12/24\n\nConor Jay Chepenik",
  "wordCount": 3594,
  "readingTime": 14.512264150943395,
  "claps": 0,
  "voters": 0
}