{
  "id": "e911fe10c95e",
  "title": "Day 253",
  "createdAt": "2022-11-30 23:49:07",
  "tags": [
    "sbf",
    "bitcoin",
    "eth",
    "casa",
    "multi-sig"
  ],
  "url": "https://chepenikconor.medium.com/day-253-e911fe10c95e",
  "content": "# Day 253\n\nWatched Andrew Sorkin interview SBF today and it was a waste of an hour. I appreciate Sorkin asking hard hitting questions but as far as I could tell SBF is full of shit. The amount of UMs and repeating the question to himself before answering was ridiculous. I'm proud of the Bitcoin Magazine piece I wrote outlining why SBF was a villain in disguise. Joe nailed it with this tweet.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/joeconsorti/status/1598079808571060231&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nToo much brain power has been wasted on this dude. I hope he goes to jail and is charged for his fraud.\n\nAnyways, today was a good day. Got some nice diner food with my girlfriend and enjoyed learning about some Computer Science. I'm making solid progress on Saylor's CS 101 course. Today I learned the computer can only run one OS at a time. I'd like to start playing around with linux at some point but I'm going to hold off until I know more. Not trying to wipe the window's OS off my personal server and lose everything. I heard when Snowden leaked the NSA files he used an OS from a thumb drive that he plugged into a laptop. That is some hacker type stuff right there.\n\nSaw Devotion last night which was alright. Here is the trailer.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FnIvBBd8pU1s%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DnIvBBd8pU1s&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FnIvBBd8pU1s%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThey cast the same dude from Top Gun who played the super cocky guy. It made me sad thinking about how many lives were lost because of war. I can't imagine dying for my country. Growing up I had a great deal of pride in the United States. I still do for our constitution but I only have disdain for the leaders of this country. There is a select group of people in congress like Rand Paul, Thomas Massie, and a couple others who appear to be fighting for liberty but the rest just seem to care about one thing: their own power. It's unfortunate our leaders don't respect the constitution. It's so wild to think of the incredible people lost fighting to protect our freedoms and how much those freedoms have been withered away because of the \"uniparty\" in D.C. This is why we Bitcoin. If there was a silver lining this movie helped me orange-pill my girlfriend even more by explaining how the Bank Of England funded the first world war.\n\n![](https://miro.medium.com/0*1sqzRRCVBspRFXAj)\n\nAnother thing I saw today is that Casa has decided to offer multi-sig custody for Eth. As you can imagine if you spend any time on Bitcoin Twitter they are getting absolutely torched by the Maxis. Here is just one example of countless.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/hodlingcarla/status/1598054126164008961&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI am a free market maximalist and I understand that there is probably a big demand for Eth on their platform, but as a proud Bitcoiner I will not be recommending any newbies to use Casa in the future. I think their C.T.O Lopp is brilliant and has done a lot for Bitcoin. I also think that this was a bad move in the long term. My guess is they lose more money from Bitcoin Maximalists leaving their platform then money gained by helping new users with Eth multi-custody solutions. I'm glad that Casa is not my own company because having the cyber hornets attack you online is never fun. I wish them luck but I'm curious how this plays out in the coming years. Looking forward to seeing if my hypothesis holds up.\n\nFinally, thought this clip from Dylan was pretty good. He explains why gold will not be the future of money.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/dylanleclair_/status/1598098699590127616&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n11/30/22\n\nConor Jay Chepenik",
  "wordCount": 590,
  "readingTime": 2.4264150943396228,
  "claps": 7,
  "voters": 1
}