{
  "id": "eac344d46dd7",
  "title": "Day 322",
  "createdAt": "2023-02-08 05:09:58",
  "tags": [
    "chatgpt",
    "state-of-the-union",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-322-eac344d46dd7",
  "content": "# Day 322\n\nToday was a busy day so I didn't get to update my football piece. I'll get around to that and also updating the Treasury piece I wrote soon enough because I promised bitcoinnews.com I would have another article uploaded by Sunday. Glad to see my first one get published.\n\n> [**Ayn Rand's Objectivism Meets Bitcoin: Perfect Match?**](https://bitcoinnews.com/objectivism-meets-bitcoin/)\n\nInstead of writing/updating those articles today I coded, ran 3 miles, and spent a lot of time with my Partner's father. I'm glad Sloan got to meet her Grandpa on Paige's side. Plus, it's been nice being in South Florida. The weather is fantastic and the beach breeze is top notch. While we laid out at the pool I got to read more of 1984 and I must say the sex scenes in that book are much more enjoyable than I had anticipated. It's one thing to watch a sex scene in a movie and be turned on, but for a book to have a similar effect is much harder to achieve. In both Atlas Shrugged and 1984 I was pleasantly surprised. I wouldn't say the book \"turned me on\" in the traditional sense, but it filled me with joy. Kind of like the idea if you read 1000 books you can live 1000 lives. In this case I was happy to see Winston make love to Julia who he was ready to kill in the beginning of the book. The whole time your reading part 1 you can feel Winston's pain because he lusts for this woman but it makes it seem like he will never be able to actually fulfill his desires so his intentions towards her are cruel. When he finds out she loves him and they successfully sneak past big brother to make love and it's a beautiful thing.\n\nRead more books anon. It's great getting to live the life of others by reading. Even if it's fiction a good book can transport you to another time and make you feel like you are actually there.\n\nIf you don't feel like picking up a book right now then click away from this Medium and read this Twitter thread.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/Aristos_Revenge/status/1622840424527265792%3Fs%3D20%26t%3Dzf5duEvAdQs8GL0UAGlfLw&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGreat stuff.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/Aristos_Revenge/status/1623040838937837568%3Fs%3D20%26t%3Dzf5duEvAdQs8GL0UAGlfLw&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAnyways last thing I'll write for tonight is I didn't watch the State of the Union today, but I did see this clip as a response to it. Hahahahaha a President who surrendered to a woke mob who couldn't tell you what a woman is. What a wild time to be alive. Also props to this woman for being elected Governer at 40. Literally half Joe Biden's age.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/bennyjohnson/status/1623168499064373250%3Fs%3D20%26t%3Dzf5duEvAdQs8GL0UAGlfLw&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nUntil tomorrow!\n\n2/8/23\n\nConor Jay Chepenik",
  "wordCount": 456,
  "readingTime": 1.7207547169811321,
  "claps": 13,
  "voters": 0
}