{
  "id": "ebb2605da6ed",
  "title": "Day 643",
  "createdAt": "2023-12-26 03:49:49",
  "tags": [
    "indoctrination",
    "education",
    "unlearning"
  ],
  "url": "https://chepenikconor.medium.com/day-643-ebb2605da6ed",
  "content": "# Day 643\n\nOne of the best ironies of life is that it is a lot harder to unlearn something than it is to learn something new. We are programmed to believe what we were originally taught. This is why schooling is so powerful. It indoctrinates children to think a certain way for the rest of their life. I've written about how indoctrination isn't necessarily bad. Rather, the virtue or vice of indoctrination hinges on the nature of the beliefs and values imparted to the young.\n\nFor example, instilling values such as respect, community contribution, and evaluating others based on their actions rather than ethnicity, are universally acknowledged as positive. These principles foster harmony and understanding. Conversely, advocating for an collectivism, prompting unwarranted self-doubt about one's identity, or encouraging judgments based on race over merit, can seed confusion, resentment, and a myriad of societal issues.\n\nSadly, I fear that marxist communists are trying to teach people the latter. Thus, there are many [NPCs](https://www.urbandictionary.com/define.php?term=NPC) in the world who I honestly think mean well but are misled by their ingrained doctrines. They become unable to reconsider or shed these learned perspectives, despite the negative outcomes they engender.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F3oRW4cIdMP1AlGq2WeisNe%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F3oRW4cIdMP1AlGq2WeisNe&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f0769be4b16ae503e0abf293b&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nThis podcast is worth the listen if you have small children. It reminded me of a quote I heard the other day.\n\n\"We receive three educations, one from our parents, one from our school masters, and one from the world. The third contradicts all that the first two teach us.\"\n\n― Charles Louis de Secondat Baron de Montesquieu\n\nThis quote is so funny to me. I know my kid will be indoctrinated with something so I want to indoctrinate her with knowledge that she won't just rebuke when she is exposed to the real world as an adult. I am positive I will get many things wrong but the goal isn't to indoctrinate my children with my own beliefs but rather to provide them with the tools and knowledge they need to develop their own understanding of the world.\n\n![Charles Louis de Secondat Baron de Montesquieu](https://miro.medium.com/0*1TyocIV0slrHoTOq)\n\n12/25/23\n\nConor Jay Chepenik",
  "wordCount": 338,
  "readingTime": 1.4754716981132074,
  "claps": 3,
  "voters": 1
}