{
  "id": "ed6d7d293251",
  "title": "Day 318",
  "createdAt": "2023-02-04 04:16:13",
  "tags": [
    "music",
    "steak",
    "small-business",
    "bitcoin",
    "writing"
  ],
  "url": "https://chepenikconor.medium.com/day-318-ed6d7d293251",
  "content": "# Day 318\n\nWent to an empanada restaurant for dinner and got steak with chimichurri sauce. Wow ... so good. I love me some delicious homemade chimichurri on a good flank steak. The owner of the restaurant clearly cared about making sure the customer was happy and every bite was delicious. I got rice, beans, and yukka with my dinner. Afterwards I enjoyed a cuban coffee and some Tres Leches cake. My daughter Sloan, my partner Paige, my sister Grace, her boyfriend John, and my Grandpa Marvin were all there. I can't get over how good it feels to be surrounded by family. I always took it for granted growing up because college and \"adulting\" seemed so far away. Now coming home feels like both a vacation and special treat. Growing up is good and all but damn. I feel such a strong sense of nostalgia being home.\n\nI also love eating at restaurants where the owners clearly care about great customer service. Outside of Chick-Fil-A you very rarely get an experience like the one I had tonight. The incentives are nowhere near as strong for an employee of a chain to give top-notch service compared with employees in a family owned restaurant. I hope to see more small businesses with people who care popping up. It's a beautiful thing.\n\n![](https://miro.medium.com/0*E3j3Q5xIQcd1BGWF)\n\nI went to target with my Mom today and she got me a massive monitor. I must say this thing makes coding so much easier. The bootcamp I'm taking recomendded a monitor and I'm glad I took the advice even though it was not required. Being able to visualize and have multiple tabs open on the same screen is huge. Plus I enjoy scrolling through AI art on a dope monitor. It's amazing some of the stuff that people can create with computer code and lots of data.\n\n![[https://creator.nightcafe.studio/creation/JpeflsnE7Hl00lyRKqO8](https://creator.nightcafe.studio/creation/JpeflsnE7Hl00lyRKqO8)](https://miro.medium.com/0*9IGK6nDE8QJIcKF1)\n\nSaw on the news today China flew a giant balloon over the United States. It was in Montana so I'm not sure why exactly we didn't shoot it down. My Grandpa was saying that he heard they didn't want it to hit someone, but that seems ridiculous. I've been to Montana and even the populated parts are pretty spread out. It looked like it was over eastern Montana and outside of military bases it seems to be mostly open land. Maybe this whole thing is some sort of psy-op? I have genuinely no clue but if it was a spy balloon flying in our space we probably should have shot it down and sent a clear message to other nations they need to respect our sovereignty. I'm not a part of the U.S military so I guess it's above my clearance level. What cracked me up was when my family had the news playing earlier and some general was answering the presses questions and every single time someone asked a question home boy had to say \"Now that is classified, I can't go into detail, or not something we are willing to disclose and if that changes in the future we will let you know\" after almost every question. It was getting to the point where I was thinking why are you even doing this press conference. Likely another Psy-op in a long list of psychological operations? At this point it is one of my best guesses lol. Whatever the case that is enough brain power wasted on a balloon.\n\nStarted reading the classic 1984. George Orwell wrote an amazing book. Only 1 chapter in but I look forward to reading more. Also made a tiny bit of progress on that Bitcoin Magazine article I'm writing about football and Bitcoin. I feel like I have 1000s of things I need to get done but the best way to do a bunch of stuff is to block it off in small chunks. One foot after the other!\n\nIf you are trying to do deep work and get distracted by random noises I've found music like this to be super helpful for getting in the mood.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FpfU0QORkRpY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DpfU0QORkRpY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FpfU0QORkRpY%2Fhqdefault.jpg&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nUntil tomorrow anon!\n\n2/3/23\n\nConor Jay Chepenik\n\nP.S what a dope date. JUMP MAN JUMP MAN JUMP MAN CHEP IS UP TO SOMETHING AYYEEE",
  "wordCount": 700,
  "readingTime": 3.0248427672955973,
  "claps": 0,
  "voters": 0
}