{
  "id": "ee5587855731",
  "title": "Day 49",
  "createdAt": "2022-05-11 01:29:38",
  "tags": [
    "hypocrisy",
    "bitcoin",
    "citadel",
    "politicans",
    "hope"
  ],
  "url": "https://chepenikconor.medium.com/day-49-ee5587855731",
  "content": "# Day 49\n\nLast night I was on a walk with my girlfriend and as we passed through Harvard Square a homeless woman spit on my girlfriend. Immediately I pushed Paige out of the way and yelled \"What the fuck is wrong with you\". When I saw the woman's eye I realized her lights were on but no one was home. This woman just laughed as I yelled at her. Initially, I was seeing red and ready to inflict violence on this poor homeless lady if she had come any closer. After calming down and taking a shower I felt pity. What the hell does someone have to go through to feel such disdain for two strangers that you would attempt to spit on them. As the world becomes more uncertain people give less of a fuck. Plain and simple. Humans are receptive creatures and when we see others doing something we typically follow them. If the rules of the game get changed people will get pissed and start breaking the rules themself.\n\nHypocrisy is a terrible thing that causes people to rapidly lose credibility. I firmly believe that so many of the problems we see today are a result of everyday individuals seeing world leaders get away with egregious acts of hypocrisy and thinking to themselves \"screw this, why do I care if the leaders don't care\". Hard to actually correlate these second and third-order effects but that is my gut feeling. It is not just politicians though. Citadel got away with murder during their whole GME/AMC debacle and ultimately found a way to cover their shorts. It's ironic that organizations like the S.E.C claim to protect the everyday investor yet Citadel is somehow not insolvent. Citadel rallied their buddies to prevent retail from buying meme stocks to save themselves. This correlation was more clear-cut than people doing stupid shit because they see politicians being hypocritical. The sad truth is most people (outside of those directly involved who lost money) have forgotten. Appreciated [Bruce Fenton](None) calling them out in his tweets today.\n\n![](https://miro.medium.com/1*9ENkZ109ZQYpnWLkmXBBgg.jpeg)\n\nAlso, today Coinbase put this in their 10-Q. I'm glad that I've taken self-custody of my bitcoin and if you are reading this and have your bitcoin on an exchange I would recommend you do the same anon. Not financial advice: sound advice🤣🤝\n\n![](https://miro.medium.com/1*ecMvQDHGzEmV6ZZo-McULw.jpeg)\n\nWe are living through wild times. I know technically speaking we are always living through history, but this feels like the part people will actually write about haha. Thought this tweet spelled out some of the issues the United States is facing today.\n\n![](https://miro.medium.com/1*QOezxHUOGf7VnvNWJbYsCg.jpeg)\n\nLots of negative in this post though and we won't fix our problems by being pessimistic. Thus, I hope you enjoy this meme dump. Stay positive anon. The good guys are going to win because we will continue to call out these absurd decisions and restore a world of abundance where we have rules and not rulers. I genuinely belive people won't be tossing up their hands and saying \"fuck it\" on a bitcoin standard because politicians will have a much harder time acting in the interest of themselves, rather than the people they were elected to serve, if they can't print money out of thin air in order to achieve their goals.\n\n![](https://miro.medium.com/1*cLLfHupezocID-OKoF5HDw.jpeg)\n\n![](https://miro.medium.com/1*gt9wF_QYdVTfloZx6S6ICA.jpeg)\n\n![](https://miro.medium.com/1*ryjYDZZdnYjiuTw6W-FtWQ.jpeg)\n\n![](https://miro.medium.com/1*YH4b58x8TOgOg1BkgHKpJQ.jpeg)\n\n![](https://miro.medium.com/1*eJ7XZJg4z0HUWFZN4qo4lg.jpeg)\n\nStay positive anon. Hope is a powerful thing.\n\n5/10/22\n\nConor Jay Chepenik",
  "wordCount": 557,
  "readingTime": 3.2352201257861637,
  "claps": 0,
  "voters": 0
}