{
  "id": "efaeece339d5",
  "title": "Day 129",
  "createdAt": "2022-07-29 19:48:49",
  "tags": [
    "city",
    "hypocrisy",
    "bitcoin",
    "meetup",
    "attitude"
  ],
  "url": "https://chepenikconor.medium.com/day-129-efaeece339d5",
  "content": "# Day 129\n\nMan I can not say enough good things about attending my local Bitcoin meetup. The people at these meetups are so (insert all the positive adjectives). The two times I've been to a Bitcoin meetup in the bay state the conversations have been both intriguing and insightful. It's so easy to talk with everyone about the problems in our current system and why Bitcoin fixes this. Finding a hobby you love and then meeting up with people who share that hobby is a great way to improve your life. People of all ages were at this meetup and everyone was able to contribute to the conversation. It's amazing how everyone who goes down the Bitcoin rabbit hole becomes interested in a wide range of topics. It is such a positive energy flowing around as everyone asks questions about how people got started on their rabbit hole journey. People were joking last night that before Bitcoin they had never questioned how does energy work, why we have central banks, or how our debt based robs us when Government's print money under the guise of Quantitative Easing. In the process of thinking about what money actually is people realize the answer to understanding Bitcoin starts with relearning a lot of what was taught in school. Bitcoin involves quite a broad range of topics. I know that as Bitcoiners keep leveling up and those in power keep trying to c[hange the definition of words](https://twitter.com/Cernovich/status/1552793864821284864?s=20&t=gL_uyovz49How3zHVj9q3w) \"the people\" will side with those who are seeking truth.\n\nOne point made last night was how in El Salvador they are teaching the children to do math that relates to computer science so they can help program Bitcoin. I thought this was so cool because the math I learned in high schools had examples that I would never use in the real world. Focusing on math that applies to something you can tangibly do is incredible. I would imagine many kids were excited to study because they saw it could help them with a real world problem. Need more education like that and it's so cool how Bitcoin helps many get excited to learn like this. Bitcoin incentives people to have fun learning. The traditional system of fiat/government school sucks compared with Bitcoin. People don't want to raise their hands, they want to shitpost, go to meetups, drink beer and have beefsteaks. They also use their freetime to learn as much as they can and stack sats. Changing the world one meme at a time.\n\n![[https://twitter.com/Rothmus/status/1553055607569190915?s=20&t=gL_uyovz49How3zHVj9q3w](https://twitter.com/Rothmus/status/1553055607569190915?s=20&t=gL_uyovz49How3zHVj9q3w)](https://miro.medium.com/0*IEkXQobkQ5vl1AmH)\n\nHypocrisy sucks and the more the \"elites\" show their hand the more people will wake up. Meeting these people in real life, continuing to learn, getting excited and happy about the future is the way. Lot of scary stuff to see on socials if you want. It's important to remember these algorithms on social media are the nutritional equivalent of candy for our mental health. Fun in the short term, painful in the long term. Lot of amazing people out in the real world to go and build better systems with. Going forward I will be more focused on the positive things I can do to get me excited to help in the world. That way I don't worry as the people doing the least complain the loudest. Focusing on more positive inputs so I can help instead of getting annoyed with others actions and shortcomings is the way.\n\n7/29/22\n\nConor Jay Chepenik",
  "wordCount": 572,
  "readingTime": 2.358490566037736,
  "claps": 0,
  "voters": 0
}