{
  "id": "f002ea83cde3",
  "title": "Day 670",
  "createdAt": "2024-01-22 02:22:38",
  "tags": [
    "tyranny",
    "bitcoin",
    "united-states-of-america",
    "2nd-amendment",
    "god-bless-the-usa"
  ],
  "url": "https://chepenikconor.medium.com/day-670-f002ea83cde3",
  "content": "# Day 670\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/NaviGoBoom/status/1749103739028344922%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI came across this post and it really resonated with me. It highlighted a crucial strategy: to effectively persuade, one must not only present their own perspective compellingly but also consciously reject the opposing frame. AR-15s are for sure weapons of war and that does not change the fact that the 2nd amendment grants me the right to have one. It is the law according to the constitution.\n\n![](https://miro.medium.com/0*7afGt7YPgYdct09i)\n\nThis framing makes me think about taxes and Bitcoin. Critics often argue that Bitcoin's primary utility is in enabling tax evasion. While Bitcoiners counter this by highlighting its diverse applications, there's a more profound point to be made: Bitcoin's inherent design does challenge the traditional mechanisms of taxation. This characteristic isn't a flaw but a feature. Inflation and taxation are both theft. Inflation is just hidden taxation. The state is constantly stealing money from savers to fund bloody wars. The state is not the moral arbiter of good and bad. It's nothing but a machine that conscripts, imprisons, and robs citizens blind. If you're deluded enough to see this corrupt entity as humanity's savior, then congratulations, you're a textbook case of state indoctrination. Waking up from that brainwash? It's a hell of a battle. I've been there, and it's a rugged path to unlearn the lies. So, good luck with that.\n\nThank God for Bitcoin's resistance to taxation—it will make war incredibly costly and far less profitable as the network grows. In the meantime I'm also grateful to be in America because if the state tries to pull an executive order 6102 on BTC, well seizing that bitcoin is going to be incredibly costly. Remember, the state's crusade against guns is not about citizen safety; it's about taxing us into submission without a whimper of resistance. Make yourself a costly problem to tyranny. Refuse to let these bloodthirsty tyrants masquerade their intentions with moral righteousness or feigned concern for your wellbeing. Governments are nothing more than collectives of flawed humans - prone to envy, embarrassment, and an insatiable thirst for power. We're all imperfect beings, capable of greatness but equally susceptible to corruption. This is precisely why outsourcing our protection is a fool's errand.\n\nBless the Second Amendment, Bitcoin, and the true spirit of the United States of America - upheld not by the kleptocrats in D.C., but by the genuine patriots. Reject and repudiate the deceitful narrative of those who believe they have the divine right to extort us and strip away our defenses. Stand firm in your costly opposition to tyranny, and never, ever apologize for it.\n\n1/21/24\n\nConor Jay Chepenik",
  "wordCount": 434,
  "readingTime": 1.8377358490566038,
  "claps": 0,
  "voters": 0
}