{
  "id": "f022eb06275d",
  "title": "Day 196",
  "createdAt": "2022-10-05 00:03:48",
  "tags": [
    "cooperation",
    "bitcoin",
    "children",
    "abundance",
    "finance"
  ],
  "url": "https://chepenikconor.medium.com/day-196-f022eb06275d",
  "content": "# Day 196\n\nThe idea of learning from your children is something I want to try and keep in mind while I raise my kid(s). Children are the key to a functioning society. They are the future generations that will one day rule the world (as long as we get around to setting age limits for politicians lol but jokes aside hopefully software replaces democratic rule that becomes authoritarian when unchecked). Adults are not that much different from kids who spend most of their time playing games they make up from their imagination. When Adults play game there tends to be a lot more on the line in terms of cost because the adult games we play involve real life consequences. However, they are still games being played and someone in the past built or came up with the thing that helps us play these games. Now-a-days a lot more of games are going digital and Gigi talked about this in the piece I shared yesterday. This podcast with Pomp and Breedlove also talks about these games we all play.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FsUozMbEJ8yM%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DsUozMbEJ8yM&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FsUozMbEJ8yM%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nGames involve money because money is time and time is money. Now I'm reminded of a great Tiktok from Tip-nz that can be found [here](https://www.linkedin.com/posts/swissbanking_bitcoin-nakamotoinstitute-activity-6983166365675192320-IUkF?utm_source=share&utm_medium=member_desktop).\n\nIt's so funny to think the games being played out the highest level of society with masses amounts of wealth on the line include people posting this stuff on Twitter to win points in this \"game\". It's a good reminder to not take everything so seriously.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/occupydemocrats/status/1577404712625745920&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI'm also grateful to be privy to Pomp and Robert talking. I'm grateful to the internet for good ideas and all the random stuff I need to get better at filtering out of my feeds. I'm grateful to all the games that have been developed over the course of time to allow me to spend most of my time on literally trying to talk to strangers in order to see if my \"technology\" can help them. (I sell software at this point in my life for those anons who might have just stumbled upon this \"random stuff\" via Medium's algorithm) The made up institutions and chain of commands in all our lives are super helpful. Thank God for the beef ranchers who raise cattle so I can bulk order a bunch of grass fed beef via a plastic card that has numbers on it. NUMBERS I TELL YOU. Math is amazing.\n\nAll this to set up a long winded way of saying Bitcoin is the fairest game to ever be created (As far as I can tell). It will allow humans to flourish and a \"somewhat soft landing\" from the fiat system that steals everyones time. We can't print time but Governments can print money and use it as an attention allocating technology. At this point more money is \"printed\" via the click of buttons to change an SQL database held at the Fed instead of actually printing the cold hard cash. That is so wild to me that central bankers (or the IT guy assumedly🤣🤣) presses buttons on a keyboard to change the U.S dollar amount. There is still a ton of faith in the dollar and as I've mentioned before I often get caught up complaining about all the doom I see on my timeline. However writing everyday reminds me to breath, relax, and realize that the vast majority (likely 80 percent) aren't even thinking about the problems with our current fiat system.\n\n![](https://miro.medium.com/0*i67rjwR8G0wKIjbd.jpg)\n\nI might even be giving the person in the middle more credit because only [52% of households hold investable assets in the stock market according to the Pew Research Center.](https://www.pewresearch.org/fact-tank/2020/03/25/more-than-half-of-u-s-households-have-some-investment-in-the-stock-market/) Also would like to note here that I am by no means a financial expert myself. As a matter of fact I'm definitely not and nothing I say should be taken as financial advice. What I will encourage you to do though is go down the Bitcoin rabbit hole and do the proof of work for yourself. It has been an amazing experience for me. There are so many terms in finance I do not know or understand. I'm doing my part to get better and Bitcoin has helped me enjoy math (which is pretty much what finance is as far as I can tell, math + trust anyways). I've come to the conclusion that a lot of Keynesian finance is based on derivatives, manipulation, and a lack of first principle fundamentals which results in the majority of wall street playing a big poker game separated from reality. The leads to a lot of smart and talented people playing with computer algorithms to maximize returns for investors rather than working on more important stuff: like making my life and my fellow humans life easier. 🤣🤣🤣🤣.\n\nI write this tongue in cheek but honestly think about how awesome that would be for society. If everyone was just committed to the greater good and could share the wealth and abundance that is created from our amazing fellow humans. Not talking about socialism and communism here either by the way. I'm talking about how we leverage innovative technology to increase productivity and make our lives easier. Think about how are showers, computers, fridges, toilets, A/C and so many other things make life so much easier. There are a lot of problems to be addressed but there is much more abundance out there today than say 100–200 years ago. Most of my problems at this point are all things in my head. I worry about pretty ridiculous things since my basic needs of food, water, and shelter are met. It is because those needs are met that I can stress about when I haven't written my daily Medium post or made enough time to study computer science rather than where my next meal is coming from.\n\nLife is crazy man. I love writing. Of all the random things I do with my life writing is one of the more solid habits. That and running. Also making time for my girlfriend. Which could be included in the bigger habit of spending time with people I love.\n\nOne thing that is interesting about computer programing is we can use math and hierarchies to create games from our imagination. It's pretty much endless the amount of things we humans can program a computer to do. I like the idea of humans being organic computers; are bodies also have hierarchies for dealing with so many different processes to keep us alive. Our Brain is handling the majority of these processes and I remember hearing somewhere that the Brain accounts for around 20–25% of energy used in the body even when we are at rest. Over countless years our species developed incredible software to run. It is important to trust these processes. Trust our gut if you will. Look at what some random algorithm a human at Twitter created help me find online today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/mr_vril_maxxed/status/1577413306746540033&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nA nice reminder to trust my gut. My gut is telling me most people are good deep down and want to cooperate. Bitcoin will help people cooperate over a long enough time horizon and create an incredible world for my children and their future children and so on. A world where kids can play games all the way through their adult life. Games that will require much less trust because someone created Bitcoin and let that trust be distributed all over the \"human nodes\" running Bitcoin on their computers and in their minds. That said, trust don't verify for the important things. I just have faith in Bitcoin and not coercion as the thing that gets humanity to a place where we have abundance. A world that promotes cooperation in a way that everyone wins instead of cooperating in a game where the people at the top are cheating and stealing everyone's time.\n\n10/4/22\n\nConor Jay Chepenik",
  "wordCount": 1310,
  "readingTime": 5.143396226415095,
  "claps": 0,
  "voters": 0
}