{
  "id": "f06c6b7edf0c",
  "title": "Day 307",
  "createdAt": "2023-01-24 03:57:02",
  "tags": [
    "tiktok",
    "social-media",
    "dopamine",
    "hardwork",
    "easy"
  ],
  "url": "https://chepenikconor.medium.com/day-307-f06c6b7edf0c",
  "content": "# Day 307\n\nWell Bitcoin Magazine gave me some kind words in regards to the article, but decided against publishing it because the work focused more on the US Treasury than it did Bitcoin. Very fair critique. I submitted it to Satoshi's Journal so maybe they'll pick it up, but if they are also hesitant because it's focused more on the Treasury than Bitcoin I will submit it via Mass Adoption's Substack. I did try and touch on Bitcoin in the article but to be fair it was at the very end. It does make me feel better though that the editor thought it was well-written and researched. Life goes on and there will be more articles to write. I was hoping though to have this one picked up because I felt like Zerohedge would've eaten eat up. I know they love trash talking poor fiscal policy as much as the next guy😂😂😂\n\nOn another note I need to be a better listener to my partner. She is going through a lot at the moment which is fair considering she just had a baby. I'm hoping to take a long roadtrip to see family because I want my child to meet its Great Grandparents. One of my Grandparents is struggling and it would be gut renching if they weren't able to meet Sloan. At the same time I should not push my girlfriend to do something she really doesn't want to do. Boston to Jacksonville is not a short road trip. It helps that we can stop along the way and visit family along the coast, but it's still a lot of driving no matter how many times we stop. There is no perfect outcome here; I need to be more like the Tao teaches and realize whatever happens, happens.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1616454713532104704&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFantastic quote. Meant to just post the bottom one but because it was a thread it draws in the top one as well. That's okay the top quote is also insightful. I need to meditate more. Not sure there is a better way to really know yourself than meditating. There is an argument to be made that you can get to know yourself through intense training. David Goggins being one of the best examples of this.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/davidgoggins/status/1606836001464549377&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI'd make the argument that is a form of meditation. You can look inwards and really know who you are when you are exhausted beyond belief. A different type of meditation than the most common one of sitting still. I think there is value in both. As a matter of fact I'm going to set a timer for 5 minutes, sit in my chair, and meditate. I will report back my findings below after doing this.\n\nI feel more calm. Hahahahhahahahhahahahha \"amazing insight thanks Chep\" - the reader. Jokes aside, those 5 minutes flew by much quicker than expected. It's hard to not let your mind wander, but when I really tried to reflect the thing that kept coming to mind was you are so lucky, you are so fortunate, you can't accomplish all your goals tomorrow, pace yourself, enjoy the ride.\n\nI did a read for my podcast on this amazing substack.\n\n> [**TikTok is a Chinese Superweapon**](https://gurwinder.substack.com/p/tiktok-may-be-a-chinese-bio-weapon)\n\nThe biggest takeaway is that instant gratification is a goal killer. Apps like TikTok feed off this instant gratification by giving us all quick dopamine hits. It's not easy to sit down and read a 1000 page book. However, if you do it there will likely be some dopamine released when you get to the good parts. It takes some work to get to those good parts though! It takes no work to pop open TikTok and mindlessly scroll. Twitter, Instagram, and Facebook are also guilty of this but the article lays out how TikTok is the worst because of the quick short videos and an algorithm that doesn't require any user feedback to start using machine learning to recommend you stuff. The article is worth the estimated 19 minutes it takes to read.\n\nIf meditation serves as a reminder for being patient and learning to accept the long road ahead then social media apps serve the opposite purpose. I need to be much better in my life about using technology as a tool to enhance my life, not as a self-enforcing-prison where I can't stop scrolling because I'm constantly chasing that low quality dopamine hit.\n\nYou know the other day I was thinking about how the more I run the better I feel on my runs. It's like the runner's high gets better the more I do it. Social media is kind of the opposite. The initial dopamine hit was fantastic, but the more you use it the more that initial dopamine hit diminishes. Food for thought :)\n\n1/23/23\n\nConor Jay Chepenik",
  "wordCount": 818,
  "readingTime": 3.086792452830189,
  "claps": 0,
  "voters": 0
}