{
  "id": "f0d630ca3941",
  "title": "Things I Find Virtuous",
  "createdAt": "2021-10-20 13:11:26",
  "tags": [
    "united-states-of-america",
    "freedom",
    "bitcoin",
    "virtuous",
    "democracy"
  ],
  "url": "https://chepenikconor.medium.com/things-i-find-virtuous-f0d630ca3941",
  "content": "# Things I Find Virtuous\n\nGiving feels better than receiving in most cases. Some of the most rewarding moments in my life have come from giving to others. Giving can be cumbersome at times, like for example, writing this Medium post is taking me forever to finish. Hitting Publish makes me feel vulnerable, but that fades away when I step back and think about how massive the universe is and that we are all mere specks in the grand scheme of things. Once I've reminded myself of the human races insignificance I persevere because giving makes me feel good. Writing provides clarity for the mind and lets one look back and gain insights into their present moment by learning from the mistakes of their past. Plus, the idea our children, great-children, and so forth (if we're ever so lucky) could learn about their ancestors through our online content is incredible. Hilarious to think my grandkids will be able to scroll through my social media channels and see what a drat I've been and continue to be. Hopefully, they have good senses of humor and appreciate that the culture they grow up in will be vastly different from the one I did. This brings me back to the title of this essay.\n\nThe most virtuous people on this planet are the ones who keep an open-mind. The ones who aren't afraid to admit they were wrong and proudly change their opinion because new facts or perspectives convinced them otherwise. Open networks are pretty awesome because they allow anyone in the world with an internet connection to tune in and gain information. The spread of information right now is growing exponentially. The more we learn the more questions arise, but by giving this information out freely and openly to the masses we can increase our capacity to answer these ever expanding questions. Like everyone going through life having human experiences I've felt down before and one thing that helps me feel better is reminding myself that I have so many incredible freedoms and privileges living in the United States of America in the year 2021. Tons of people have fought for these freedoms and given their lives to uphold the values that the U.S.A is built upon. That being said, these values are eaten way when information is restricted, manipulated, and used as propaganda. I'm so grateful I can spell this out in caps without the fear of my government putting me in jail for doing so. THE UNITED STATES NEEDS TO STOP TAKING AWAY INDIVIDUAL LIBERTIES IN THE NAME OF PEOPLE'S HEALTH. THE GOVERNMENT NEEDS TO STOP SPENDING RECKLESSLY AND PRINTING FIAT MONEY LIKE IT'S THEIR JOB. FINALLY, THE UNITED STATES NEEDS TO EMBRACE BITCOIN AND HELP THE WORLD ADOPT AN OPEN AND SOVEREIGN PAYMENT SYSTEM WHERE INDIVIDUALS ARE THEIR OWN BANKS WHO DON'T HAVE TO WORRY ABOUT A MIDDLEMAN GETTING HIS CUT BECAUSE SAID INDIVIDUAL IS DEEMED TO STUPID TO OPERATE AS HIS OWN BANK. The latter of these three statements might seem a little outlandish to some who are still committed to fiat, but I think in the coming years that will change for most.\n\nVirtous people, businesses, governments, and other entities promote self-sovereignty and basic human rights. It's hard to define evil, but if I had to I would say it's the opposite of these entities that promote freedom, sovereignty, and the democratization of information. Human folly leads to powerful individuals becoming corrupt. What's fascinating about Bitcoin is there is no central entity promoting Bitcoin for their own benefit. Unless Satoshi reveals himself one day Bitcoin will be the least corruptble source of value on this planet. The stronger the network grows the truer this becomes and I appreciate the folks who hold a lot of Bitcoin that promote it because as the network effect grows the chances of ever stopping Bitcoin dimminish. In a way, it's just like a lot of popular internet services. I recently trashed Youtube for trying to censor Pomp's Best Business Show, but Pomp has also pointed out that anyone with an internet connection can tune into the show and watch. If they were streaming on a cable network this wouldn't be the case as you would need cable to watch. I love this type of open network technology and it makes me sad that Youtube even considered trying to censor Pomp at one point. Luckily, they brought the show back which is an overall positive and a great example of the world being gray instead of black and white. It was evil of Youtube to censor Pomp, but ultimately they admitted to their mistake and corrected it which is the crucial part. The reason I believe in making information and knowledge free and accessible is because it allows democracy to work better. If everyone on this planet understood how serious climate change is it would be much easier to pass legislation to curb all the pollution happening. Instead information is manipulated and tweaked so the masses don't get upset about something that will destroy our species in the name of profits.\n\nIn conclusion, anyone who is willing to change their mind and strive to understand rather than be understood is virtuous in my book. Knowledge brings so many freedoms and innovations along with it. I'm hopeful to live in a world one day where the majority of people have opted into technologies, like Bitcoin, that increase the sovereignties of the individual rather than the state. Virutous people put themselves out there knowing damn well they will face criticism and disdain, but ultimately don't care because they value giving more than they value receiving. Ironically enough the more you give the more you tend to receive anyways.\n\nP.S First Bitcoin based ETF in USA started trading this week and the ticker is #BTFD which I will be doing during the next bear market ;)\n\nConor Chepenik\n\n10/20/21",
  "wordCount": 986,
  "readingTime": 3.720754716981132,
  "claps": 0,
  "voters": 0
}