{
  "id": "f1f8030cae35",
  "title": "Day 234",
  "createdAt": "2022-11-11 22:43:31",
  "tags": [
    "tedtalks",
    "don-tapscott",
    "google",
    "bitcoin",
    "ftx"
  ],
  "url": "https://chepenikconor.medium.com/day-234-f1f8030cae35",
  "content": "# Day 234\n\nDon Tapscott killed it with this Ted Talk. An age where institutions no longer have clothes. One of networked intelligence where the common man can learn from the greatest minds of our generation. An age were metaphorical sunlight is being poured onto almost everything. It's amazing. It's hopeful. It's going to lead to another renaissance over a long enough time horizon. I'm with Don that sunlight is the best disinfectant.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FjfqwHT3u1-8%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DjfqwHT3u1-8&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FjfqwHT3u1-8%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOf course there will be those who oppose what the internet is doing to the world. I loved the example of the music industry suing kids rather than innovating. This Ted Talk was ~ten years old from the time of this writing and obviously the music industry has somewhat gotten with the times. However, Apple Music and Spotify are much more known and used than any particular record label. TCP/IP is an amazing protocol and I'm grateful for what it is doing to humanity's collective conscious.\n\nI went on a bit of a Ted Talk bender today. Of all the benders you can go in this is probably one of the better ones. Hahahahahaha jokes aside I'm truly amazed at how much knowledge is out there if you are willing to look. I think it gets lost on us that we are all in our own little internet bubble. I watched another Ted Talk that talked about how every Google search is different depending on the person. According to the talk which was also a couple years back there are 57 things Google checks before showing you results. I'd bet a lot of 🌽  that this number is much higher now.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FB8ofWFx525s%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DB8ofWFx525s&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FB8ofWFx525s%2Fhqdefault.jpg&key=d04bfffea46d4aeda930ec88cc64b87c&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI get that Google is trying to do it's best to show us relevant information. I also fear that this function could be co-opted to push agendas. I don't know what the fix to these problems is but I do know it has never been more important to check your biases; to do everything in your power to keep an open mind and reassess when new facts are presented.\n\nIt was pretty wild to see a bank (or better yet crypto) run on FTX. I would like to note that as far as I can tell those who decided to make bets with customer funds should be in jail. I'd also like to note that watching this shit play out in real time is some of the craziest shit I have ever witnessed. It's bad how much time I've spent on Twitter looking for updates. I don't even have any funds on FTX or other exchanges like Crypto.com/Blockfi etc who had close ties. I just can't look away from the dumpster fire.\n\nIt's encouraging to see that bad actors get caught. It is also heartbreaking to see people lose fortunes because they trusted a major exchange that was endorsed by Tom Brady, Giselle, and had their logo on the Miami Heat stadium. It's going to be an ugly fall from grace for crypto but from those ashes Bitcoin will emerge. Bitcoin doesn't care that fiat to crypto exchanges are insolvent. It just keeps adding block after block roughly every 10 minutes. I pray those who were affected get some of their money back and learn the importance of self-custody.\n\nAnyways, I'm grateful that I got in during 2017. Took me a long time to understand why self custody of your coins are so important. It also took me an even longer time to understand Bitcoin != crypto. For those who don't code != means not equal. Probably could've picked up that through context but I digress.\n\nWent for a run today and felt like crap. So after the first half mile I walked. Then I ran another mile and barely made that so I walked a mile and followed it up by doing another mile to get in 4 miles on my Nike Run Club application (because if you don't record it on an app did you even run?). Of course you did lol but I like using technology to track my runs. I like posting in my \"proof of work\" groupchat talking shit. I am committed to running at least 30 miles every month for the rest of 2022 so I'm happy I have an app to track all this.\n\nAll this to say technology is so freaking incredible and also overwhelming. I have like 1000 things I want to do and sometimes it feels like so much I say screw it and mindlessly scroll Twitter instead. I'm sure if you are human and have a smart phone you can relate (even if your social media of choice is something else besides the damn bird app lol). I've said it before and I know I'll say it again in my future writings. The journey of 1000 miles start with a single step. Just begin anon. Keep going!!!\n\nSpeaking of here are some things I'd like to focus on in no particular order.\n\n- Write my Bitcoin magazine article and tie in this whole FTX debacle because it seems to be on everyone's mind.\n\n- Work on my simple app Habitchain that I have not touched in a minute.\n\n- Stretch more and learn to do something breathing exercises. *gonna need to do some youtubing. If you have any recs hmu in the comments anon.*\n\n- Accept I am human and will make mistakes.\n\n- Be more intentional about Twitter use. Assess my followers and use it as a muse to be productive rather than a procrastination tool to mindlessly scroll.\n\n- Be a better boyfriend which will ultimately help me be a better father.\n\n- Forgive, don't hold grudges, and remain optimistic even when everyone is running around with their hair on fire because a fat vegan who was having orgies in the Bahamas and was promoted by mainstream outlets as the next \"Warren Buffet\" got caught trading client's funds. It is reassuring to see him exposed as an absolute fraud and get reminded that good and truth always win :)\n\n11/11/22\n\nConor Jay Chepenik",
  "wordCount": 1004,
  "readingTime": 3.788679245283019,
  "claps": 7,
  "voters": 1
}