{
  "id": "f229e07b6806",
  "title": "Day 265",
  "createdAt": "2022-12-12 23:11:09",
  "tags": [
    "democracy",
    "jokes",
    "bitcoin",
    "writing",
    "hope-for-the-future"
  ],
  "url": "https://chepenikconor.medium.com/day-265-f229e07b6806",
  "content": "# Day 265\n\n> [**Bitcoin Stops The Bleeding: A Sound Money System Is The Only Cure For What Ails Our Economy**](https://bitcoinmagazine.com/culture/bitcoin-stops-the-fiat-bleeding)\n\nGot my third article for Bitcoin Magazine published today and it feels pretty good. Might even try and get a fourth one published this year outlining what 2022 has meant for Bitcoin; we will see.\n\nGoing to a golf lesson today which I'm pretty excited for. My Dad bought it for me awhile ago and while I love playing golf I'm pretty trash so this will be good to get some guidance. I've yet to break 100 but maybe today they'll give me some tips and when it's golf season again I'll be shooting straight enough to get under 💯 . Can confirm that the lesson went well and it's amazing the technology Golftec has to help beginners, but I also don't like golf enough to pay their prices. It's expensive enough going to courses. Maybe if my buddies were sick at golf I'd consider paying for the lessons but since everyone I play with is around my level I'd prefer to just spend my money actually playing instead of getting lessons.\n\nMy Aunt sent me this impractical jokers video and it's hysterical. I don't know how these guys do what they do.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FNy4ysSjxeVo%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DNy4ysSjxeVo&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FNy4ysSjxeVo%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI'm curious if after all the shenanigans they tell all the people involved this is for a TV show. I would think so but still an impressive feat to keep a straight face through all of this. I cracked up when Joe goes \"I'm the manager get these people a cheesecake\" after breaking their table. I see why Impractical Jokes has been on TV since 2011.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F6DTCAno9eAw8jnIyBz0Ltm%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F6DTCAno9eAw8jnIyBz0Ltm&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fac0bc5d2a414f204108ff9f5&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nListened to this Podcast today and WOW! Peter gave great advice throughout the entire thing and my biggest takeaway is your mindset is everything. If you think you can do something then you likely can. If you think you can't will it's guaranteed you can't. Success isn't guaranteed just because you think you can do something but it's like that Wayne Gretzky quote \"You miss 100% of the shots you don't take\". Another part I appreciated was when he mentioned that great writing for him comes from waking up and writing for an hour. If he can get one page done a day and then edit the page he wrote the day before he is making great progress. Seems like an incredible way to write a book. I've been slacking with some of these medium posts recently by waiting till the end of the day to write them. Obviously, everyday is different and sometimes I have stuff to do in the morning. I resonate with Peter's method though because for the most part I am much more creative and willing to bust out some paragraphs in the morning vs at night when I'm ready to go to sleep.\n\nFinally, I think Peter's method of democracy is amazing. Not sure how we go about getting this implemented in the states because Government moves slowly but the idea makes perfect sense. With technology you can give people the ability to vote incredibly easily. It's crucial you set it up so it can't be rigged but calculating votes could be done in real time theoretically. Peter's idea was that you vote for what you understand and pass on your vote for subjects you don't understand to those you trust to make an informed decision. So for example Peter doesn't know everything about Bitcoin so he would outsource his vote on Bitcoin topics to Robert Breedlove, but Peter is an expert on space while Robert might not be so Robert could give Peter his vote for anything space related. I do imagine there might some room for quid-pro-quo and corruption but that goes for just about anything: just look at the current system lol. People could keep all their votes if they really desired but this system makes perfect sense to me and I'd be willing to outsource my votes on topics I was not passionate or educated about to people I trusted more. I'd also hope my friends would be like yea Chep take my Bitcoin votes. At least the friends who didn't go down the rabbit hole.\n\nNo system is perfect and getting something like that setup I'm sure would face challenges. Over a long enough time horizon I think this system is viable and could do a lot of good in the world. Our current representative democracy is starting to crack in various ways because technology is moving so fast and the two party system doesn't work for the 80% of people in the middle. Time will tell what happens, but I am grateful that the U.S constitution protects a lot of the American citizen's freedoms. I'm also more hopeful for the future after listening to Peter dive into all the things we should be excited about!\n\n12/12/22\n\nConor Jay Chepenik",
  "wordCount": 842,
  "readingTime": 3.177358490566038,
  "claps": 7,
  "voters": 1
}