{
  "id": "f22bea55d3e1",
  "title": "Day 630",
  "createdAt": "2023-12-13 04:33:43",
  "tags": [
    "there",
    "is",
    "no",
    "second",
    "best"
  ],
  "url": "https://chepenikconor.medium.com/day-630-f22bea55d3e1",
  "content": "# Day 630\n\nYou may not be interested in war, but war is interested in you. This lesson in memetics was truly enlightening.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FqC_bzMwgVBI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DqC_bzMwgVBI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FqC_bzMwgVBI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nFor example, Bitcoin is a weapon of peace. A digital sword forged in the fires of decentralization. It's like a financial Jedi wielding a lightsaber of liberty, cutting through the red tape of traditional finance. This TRUTHFUL ledger is the best tool humanity has for overcoming the tyranny brought about by Bankers who print money out of thin air and charge us interest on it. It's like a digital Robin Hood, taking power from the rich and giving it to the people. Bitcoin is the peaceful protest of the financial world, a silent but powerful force for change. It is the financial equivalent of Gandhi's Salt March, a nonviolent movement towards economic freedom. Bitcoin is a peaceful revolution, a financial coup d'état without a single shot fired. If you want to use Bitcoin all you have to do is abide by its rules. BuT iTs VoLaTiLe CoNOr....\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/TheRealTahinis/status/1734745743498289538%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMemetics, this is what I mean. How can you unsee this? Fiat is what's volatile my brother in Christ! Truly an eye opening image. Change your unit of account and you will see that Bitcoin is one of the least volatile things on the planet. 1 bitcoin = 1 bitcoin and there will never be more than 21 million of them. So easy to discount Bitcoin when you are privileged to live in a country without insane inflation. However, if you are in a country that isn't so lucky Bitcoin is a life raft amongst constantly debasing fiat currencies.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1734792685167276370%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nTruth is hard to find in this world because we all have our own truths. Which sounds so lame to say. I'm LiViNg My tRUth. Yea okay queen/king no one cares! If you want Truth (with a good 'ol capital T) opt for honest ledgers. Enough said!\n\n![](https://miro.medium.com/0*Whb2BAcEc1CTYDz0)\n\n12/12/23\n\nConor Jay Chepenik",
  "wordCount": 319,
  "readingTime": 1.4037735849056603,
  "claps": 0,
  "voters": 0
}