{
  "id": "f3c03e33616a",
  "title": "Day 397",
  "createdAt": "2023-04-23 19:43:56",
  "tags": [
    "writing",
    "dopamine"
  ],
  "url": "https://chepenikconor.medium.com/day-397-f3c03e33616a",
  "content": "# Day 397\n\nThis article is both insightful and enjoyable. Arthur has such a great way of writing in a very dumbed down pop-culture mainstream fashion that is also super insightful. It's like a teenager cracking jokes who knows exactly what is he talking about. Read this for example\n\n> Many people do not understand how the flows of capital and trade work, and thus are driven to the wrong conclusions. So bear with me, as I'm going to start by going deep on the fundamental economics that support my assertions. And if your TikTok-addled brain can't focus for 30 minutes, I suggest you save yourself the trouble and just open up a new tab, Google \"ChatGPT-4,\" and ask our future AI overlords for a summary of this essay.\n\n> [**Exit Liquidity**](https://cryptohayes.medium.com/exit-liquidity-3052309e6bfa)\n\nInsightful, funny, and unfortunately true. Hell part of his essay could be AI generated but he still has an incredible's author voice. I'd like to have a similiar writing style. One where I can crack jokes you'd expect from the id while making points that appeal to anyone looking for sound advice.\n\nI need to focus and have better discipline. My dopamine feels off. Need to limit my time on social media so I don't get tiktok brain. Which I'd say is a broad term for any type of overt social media usage nowadays. We have some of the most powerful algorithims competing to feed our brain dopamine. What did we expect to happen? Increased IQ from looking at bikini pics all day?\n\nI don't know. I'm human: I will figure it out. I like that line a lot. Shows you are willing to accept your flaws and also be able to overcome them with determination. At least that is how I percieve it anyways. Going to go for a run now because my brain feels fried and it's a crappy day so I NEED EXERCISE.\n\nSee you tomorrow anon.\n\n4/23/23\n\nConor Jay Chepenik",
  "wordCount": 347,
  "readingTime": 1.3094339622641509,
  "claps": 2,
  "voters": 1
}