{
  "id": "f4405975ee9a",
  "title": "Day 28",
  "createdAt": "2022-04-19 17:13:26",
  "tags": [
    "bitcoin",
    "profit",
    "melancholy",
    "little-things",
    "starbucks"
  ],
  "url": "https://chepenikconor.medium.com/day-28-f4405975ee9a",
  "content": "# Day 28\n\nMelancholy day for your boy. Woke up to a rainy day outside and just felt dreadful about having to go to work. Decided to take a walk to my local Starbucks and felt much better. Something about being outside is so great. Started my walk by listening to the recent Lex Fridman Podcast with Andrew Huberman (3rd appearance for those wondering which one) and Lex brought up the song \"Where is my mind\" by The Pixies. Immediately I remembered how much I liked this song so I threw it on and got goosebumps. By the time I got back from my walk, I was in a much better mood. No one wakes up every day on the right side of the bed. (Unless they are an absolute freak of nature and if this is you please give me your tips for always waking up on the right side of the bed in the comments section) It's important to make time for yourself to do the little things that you know will put you in a better mood. Once I got into the daily workflow it didn't seem that bad. Lowkey, I enjoy learning about cloud servers and why businesses are using them to scale their websites and apps rather than host their own on-prem servers. Just something about the idea of work becomes exhausting when you get into the day-to-day. Saw a great quote online and I can't remember who wrote it but the quote was \"The happiest day for an employee is between the job offer and the first day\". I mean that is hilarious because it's true! The excitement between getting a job and actually starting a job is spot on. Some jobs are better than others and finding a job that allows you to do what you love is key. Sometimes you got to do work you dislike but showing up is a lot easier if you are working toward some type of goal. For myself, I want to stack as many satoshis as possible while expanding my knowledge of both hardware and software. Computers aren't going anywhere and familiarizing yourself with them is likely to help you better predict and plan for the future compared with your average Luddite.\n\n![](https://miro.medium.com/1*F_dwPlrSahmdsUQyUa-ugQ.jpeg)\n\nMemes also help improve my mood. Not great waking up and scrolling Twitter but the place is a gold mine of quality memes. I laughed so hard when I first saw this. Anyways, that is all for today. A short piece but a good reminder if you wake up feeling meh go do something for yourself. Love you anon ❤\n\nOh, also reading _The Real Anthony Fauci: Bill Gates, Big Pharma, and the Global War on Democracy and Public Health_ by Robert F. Kennedy Jr., and I must say it's terrifying to see the harm corporations are willing to cause for money. Profit shouldn't be a dirty word unless you are putting profit over the well-being of the public. I'm not a doctor (or a biologist lol) and I'm only at the beginning of the book so I don't have much analysis. I just wish people would wake up and look at what happened the past two years as objectively as possible without trying to label someone \"right\" or \"left\" based on their views of C-19. Public health doesn't work when it becomes politicized and the last two years are a glaring example of that. Anyways, peace and love for real this time. :D\n\n4/19/22\n\nConor Jay Chepenik",
  "wordCount": 588,
  "readingTime": 2.418867924528302,
  "claps": 0,
  "voters": 0
}