{
  "id": "f8fef9f2a9d",
  "title": "Day 23",
  "createdAt": "2022-04-14 21:27:27",
  "tags": [
    "elon-musk",
    "twitter-takeover",
    "day-23",
    "positive-attitude",
    "learning-from-mistakes"
  ],
  "url": "https://chepenikconor.medium.com/day-23-f8fef9f2a9d",
  "content": "# Day 23\n\nJumpman, Jumpman, Jumpman, Chep is up to something. Writing every day feels good. Today I'm happy to be a young adult living through this timeline. Elon Musk [announced](https://twitter.com/elonmusk/status/1514564966564651008?s=20&t=EA--kudsCWMa-BEmFgEr-w) he wants to buy Twitter and take it private. What an incredible move. As far as I can tell Elon wants Twitter to be a platform that promotes free speech instead of \"the narrative\". Hopefully, I'm correct and Elon is able to pull this off. Only time will tell.\n\nSometimes I think I would be better off not following any news and just focusing on myself. At the same time, it's pretty comedic watching \"woke\" people freak out online about a \"billionaire\" owning Twitter when almost every major news network, platform, media source, etc is already owned by billionaires. We are living in a time where hypocrisy is running rampant. I'm grateful for pages like [DefiantL's](https://twitter.com/DefiantLs) which roasts people solely based on things they post. It is important to give people the benefit of the doubt and acknowledge the fact we can change our minds. That said, some tweets are just so bad they need to be dunked on.\n\nI'm sure I will look back at old posts on here (and other platforms lol) and find them cringe or maybe even flat out wrong. I'm glad because the only way for me to learn and be better the next day is to make mistakes and learn from them. Life is an incredible thing if you want it to be. Life can also be a living hell if you sit around feeling bad for yourself. Find a hobby anon, I signed up for a stand-up comedy class that starts in May which I'm pumped for. One thing the comedy class website emphasized is finding humor in everyday life. This is a crucial point and I recall Kevin Hart talking about how his comedy really improved when he started telling jokes about his personal life. I will be on the lookout for comedic moments in my life going forward. Got a feeling I'm going to be blessed up because humans are unique, wacky, and incredibly fascinating. Peace & Love anon.\n\n![](https://miro.medium.com/1*XDd1H1JPJBuRuzwKYA_bgA.jpeg)\n\n4/14/22\n\nConor Jay Chepenik",
  "wordCount": 363,
  "readingTime": 1.5698113207547169,
  "claps": 0,
  "voters": 0
}