{
  "id": "f98809f92433",
  "title": "Day 556",
  "createdAt": "2023-09-30 02:49:15",
  "tags": [
    "low-rung-thinking",
    "high-rung-thinking",
    "tim-urban",
    "all-in-podcast",
    "questions"
  ],
  "url": "https://chepenikconor.medium.com/day-556-f98809f92433",
  "content": "# Day 556\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FivDwzBYsED4%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DivDwzBYsED4&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FivDwzBYsED4%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nUnderstanding the intricacies of people's political beliefs can be a daunting task. However, there is a method that can shed light on these complexities and help us distinguish between high rung thinking and low rung thinking. High rung thinking, in this context, signifies a more nuanced and open-minded approach to politics, while low rung thinking represents a rigid and closed-minded perspective.\n\nOne insightful approach to identifying these two modes of thinking is through the art of asking questions. As one astute commenter on YouTube pointed out, questions can be a powerful tool to unveil the depth of someone's political beliefs. Here's a simple example that illustrates this concept:\n\nImagine asking a Democrat, \"Would you ever vote for a Republican?\" On the flip side, you pose the same question to a Republican, \"Would you ever vote for a Democrat?\" The beauty of this approach lies in the simplicity of the question. It's a yes-or-no query, but the richness of the responses can reveal a lot about a person's political mindset.\n\nIf an individual responds with an unequivocal \"no,\" stating they would never vote for the opposing party, it's a clear indicator of low rung thinking. This rigid stance suggests that they may be strongly wedded to their party's policies and beliefs, with little room for open-minded exploration of other viewpoints.\n\nConversely, if someone responds with a more nuanced answer, perhaps explaining under what conditions they might consider voting for the other party, it hints at a higher rung of thinking. This person is willing to entertain different ideas and may have a broader perspective on political issues.\n\nNow, it's crucial to acknowledge that political beliefs are seldom black and white. They exist on a spectrum, and individuals may have a variety of reasons for their political preferences. However, what makes this method insightful is its ability to reveal the presence of low rung thinking, which often shuts down constructive dialogue.\n\nIt's important to note that this approach doesn't seek to oversimplify political beliefs but rather acts as a starting point for understanding someone's mindset. Tim Urban, a master of simplifying complex concepts through graphs and charts, has a knack for making the intricate seem approachable.\n\nThe power of high rung thinking lies in its openness to questions, its willingness to explore different perspectives, and its ability to engage in constructive discourse. Political views can be improved with nuance. Using questions as a tool to help us identify and foster more open-minded discussions will contribute to a more informed and interconnected society.\n\nIn my personal life, my goal is to foster an environment in which individuals can confidently transcend low-rung thinking. Engaging in robust discussions is valuable, and those who insist that a particular issue is definitively resolved often exhibit narrow-minded thinking.\n\nOn another note here is a cool app for putting stuff behind a bitcoin pay wall. Bullish on Bitcoin and high-rung thinking!\n\n> [**PlebPay ⚡ - _Create a Bitcoin Lightning paywall and get paid directly to your Strike account._**](https://www.plebpay.com/)\n\n![](https://miro.medium.com/1*UhYQdf-gwjA3uZsAG8vOpw.png)\n\n9/29/23\n\nConor Jay Chepenik",
  "wordCount": 525,
  "readingTime": 2.181132075471698,
  "claps": 0,
  "voters": 0
}