{
  "id": "fb43ac2e7301",
  "title": "Reminder To Get Outside Your Comfort Zone",
  "createdAt": "2021-04-07 19:46:12",
  "tags": [
    "thoughts",
    "life",
    "miami",
    "taking-chances",
    "silverlinings"
  ],
  "url": "https://chepenikconor.medium.com/reminder-to-get-outside-your-comfort-zone-fb43ac2e7301",
  "content": "# Reminder To Get Outside Your Comfort Zone\n\nThe pandemic has wreaked havoc on \"normal life\", but I'm a big believer in silver linings. For me, that has been the ability to travel. Currently, I am visiting my oldest sister, Grace, in Miami. Despite what my girlfriend will tell you I am an introverted individual deep down. I do love talking to other people, but when I'm in a room full of people I don't know I get anxious. I bring all this up because last night Grace invited us out. I usually wait for the weekends to go out, but since I don't see my little sister as often as I would like we agreed to go out. When we first got to the party it was uncomfortable because I didn't know anyone, but after forcing myself to talk to some people things started to change and by the time I got back home I was happy as a clam. Right before we went out part of me wanted to grab a cold beer and sit on the couch and watch TV instead. However, I forced myself to go and it ended up being a great experience.\n\nIt's easy to stay in your comfort zone, but you'll regret it in the long run. It doesn't always happen like this, but there have been multiple times in my short sales career where I almost didn't call a prospect because he held a senior position or wasn't the perfect fit. In those cases when I picked up the phone anyways I turned two of those calls into scheduled meetings.\n\nSame with running. I never thought I could run for an hour straight without stopping when I first started, but I decided to give a Nike Rub Club hour-long guided run and I covered 6.54 miles of non-stop running in that time. Often times the hardest part of accomplishing something isn't doing it, but having the courage to take the chance. It sounds cliche, but there is a reason it has become a cliche. :D\n\n4/7/21\n\nConor Jay Chepenik",
  "wordCount": 348,
  "readingTime": 1.3132075471698113,
  "claps": 0,
  "voters": 0
}