{
  "id": "fc5f8e839b26",
  "title": "Day 340",
  "createdAt": "2023-02-25 21:37:19",
  "tags": [
    "frameworks",
    "tolkien",
    "writing"
  ],
  "url": "https://chepenikconor.medium.com/day-340-fc5f8e839b26",
  "content": "# Day 340\n\nMy dear anons,\n\nAs a lover of languages and a creator of online Bitcoin articles, I have come to appreciate the importance of frameworks. In my own writing, I created a framework to get better which involved writing every single day for 365 days. I'm still not done with this framework. As you can see by the title of this piece I have 25 more days to go. Of course this is a very simple framework, but those who stick to it will improve their writing. I call it the proof of work framework.\n\nThat said, I'm sure there are a lot of better and more complex frameworks out there to help writers. One example comes from J. R. R. Tolkien, the creator of _Lord Of The Rings,_ who died in 1973. From what I can find online he had an amazing framework for writing which he developed over many years of experience as a writer and scholar. He believed that writing should be treated as an art form, with careful attention paid to every aspect of the process, from the initial inspiration to the final draft.\n\n![](https://miro.medium.com/1*g9Mkin3FyDPFtOp_1LaLeA.jpeg)\n\nOne of the most important elements of Tolkien's framework for writing quality was his focus on world-building. He believed that a great story must have a rich and detailed setting, with a fully-realized history, culture, and mythology. He spent years creating the world of Middle-earth, drawing on his extensive knowledge of languages, folklore, and mythology to create a universe that felt fully alive.\n\nAnother key element of Tolkien's framework was his emphasis on language. He believed that words were the most important tool of a writer, and that a mastery of language was essential for creating great literature. He was particularly interested in the ways that language could be used to evoke emotions and create a sense of atmosphere, and he spent many years developing the languages of Middle-earth. So if you thought writing for 365 days was hard imagine trying to come up with your own language for your next book!😂\n\nTolkien also believed that a great story must have a strong moral core. He was deeply interested in ethical and philosophical questions, and he used his stories to explore issues like the nature of good and evil, the importance of loyalty and friendship, and the dangers of power and corruption.\n\nFinally, Tolkien believed that a great story must be deeply rooted in the author's own experiences and beliefs. He saw writing as a way of exploring the world and his own place in it, and he believed that a writer must be willing to draw on their own life and experiences to create something truly meaningful and powerful. This is why I focus on Bitcoin because it has made such a positive impact on my own life.\n\nOverall, Tolkien's framework for writing quality was deeply rooted in his own passions and interests, and reflected his belief that writing was a deeply personal and creative process. He saw writing as a way of exploring the world and the human experience. I think we can all agree he was successful in creating a rich and immersive world that captured the imaginations of countless readers.\n\nBut frameworks aren't just useful in the realm of fiction. In fact, they can be incredibly valuable in our daily lives, helping us to achieve our goals and improve our productivity. The possibilities are endless but here are five examples of frameworks that you might find useful in your own life:\n\n1. Wether you work in finance, operations, accounting, or something else creating an excel sheet to organize your work is an effective framework for managing tasks and deadlines. Begin by identifying and listing all the tasks that need to be completed, then prioritize them based on their importance and deadline. Use color coding or conditional formatting to visually highlight urgent and overdue tasks. Regularly update the progress and completion status of each task to ensure that you stay on track and meet your goals. Finally, don't be afraid to adjust and refine your system as needed to improve its effectiveness over time.\n\n2. Everyone wants to be healthy, but with so much conflicting information out there, it can be difficult to know where to start. A framework for eating healthy can make all the difference. Set clear guidelines for the types and quantities of food you consume. Focus on sourcing your food locally. Incorporate more whole foods into your diet like meat, fruits, and vegetables. When shopping don't forget to check the ingredients before you buy something and do your best to avoid vegetable oils which are horrible for you.\n\n3. In today's social media age, everyone wants more followers to boost their online presence and potentially increase their income. But how do you make your posts go viral and attract more followers? A framework for posting on social media can help. Here are two tips for going viral: post consistently with high-quality content and engage with your audience by responding to comments and messages. Use AI by being as specific as possible with your prompts. For example, I've used AI to help me write Bitcoin articles and the more specific I can be with my prompt the better quality content I can get from the AI to help supplement my work. By implementing a clear strategy, you can build a strong social media presence and achieve your goals.\n\n4. Learning how to learn is a crucial skill in today's fast-paced world, where new technologies and innovations are constantly emerging. By developing a framework for learning new skills, you can not only become an expert in your chosen field but also cultivate a lifelong love of learning. With the right approach, anyone can acquire new skills and knowledge, no matter their age or background. So, why wait? Everyone has different ways of learning and it might make sense to start creating your framework so you can figure out what works for you and unlock your full potential!\n\n5. A framework for managing your finances can help you develop positive habits and achieve your long-term financial goals. By creating a clear budget, tracking your expenses, and investing wisely, you can live within your means while also building wealth for the future. Everything is connected - if you create an Excel sheet you use to organize your work there is no reason you should not create one to track your expenses and savings. Once you have a grasp on how much is coming in and out every month consider putting money aside to dollar cost average into bitcoin, gold, or other hard assets which historically over long time horizons have appreciated a lot.\n\n![*Do keep in mind this chart shows data that gets cut off at 2021* Source [https://www.nasdaq.com/articles/bitcoin-vastly-outperformed-gold-and-sp-500-over-the-past-decade](https://www.nasdaq.com/articles/bitcoin-vastly-outperformed-gold-and-sp-500-over-the-past-decade)](https://miro.medium.com/0*4Ux3NYcxONleaj23.png)\n\nNow, some of you may be worried about the rise of artificial intelligence and its potential impact on our jobs. But I would argue that AI should not be seen as a threat, but rather as a tool that can help us create even more valuable frameworks. With AI, we can automate tedious tasks, analyze data more quickly and accurately, and develop new insights and ideas that would have been impossible to achieve on our own. This combined with the power of the internet, you can reach a global audience and build a business around your frameworks.\n\nIf you are reading this article that is amazing, but I encourage you to actually implement more frameworks in your own life. I've given you some examples. Plus, there are plenty you can create on your own. Don't just consume information, take the initiative to create something new after you learn something! Who knows what amazing things you might achieve with the power of frameworks? If you got a valuable framework that has been working well in your own life let me know in the comments. I'm always eager to improve my own way of doing things :)\n\n2/25/23\n\nConor Jay Chepenik",
  "wordCount": 1316,
  "readingTime": 5.34937106918239,
  "claps": 0,
  "voters": 0
}