{
  "id": "fc954ead9525",
  "title": "Day 347",
  "createdAt": "2023-03-05 02:32:52",
  "tags": [
    "bitcoin",
    "fiat",
    "nostr"
  ],
  "url": "https://chepenikconor.medium.com/day-347-fc954ead9525",
  "content": "# Day 347\n\nOne time when I was doing some fungi at the pub my buddy who works in trad-fi said to me \"Yea it's pretty crazy getting on wall street and realizing there are just players who can't lose\". I literally had to get up and take a walk outside the bar. It made me sick to think about this. All the hours that have been stolen because we have kleptocrats willing to pillage from the common man. To my buddy's credit when I sent him this he thought it was fascinating and asked me about lightning.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/JoeConsorti/status/1632070915637886977%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt makes sense we should have a risk free rate yield based on providing value rather than a risk free yield due to the threat of violence. Fiat money steals from savers and benefits the kleptocrats. Bitcoin gives back to the savers (in purchasing power terms) and benefits those who provide value. There is no such thing as a true risk free yield. The U.S Treasury bond is not the [safest investment vehicle on the planet](https://bitcoinnews.com/us-dolla-ponzi-scheme/). Bitcoin, on the other hand, will continue to be more reliable than a system based on theft.\n\nToday I bought some storage space on nostr.build to upload a photo. Felt good to spend my satoshis on something I needed.\n\n[https://nostr.build/p/nb948.jpeg](https://nostr.build/p/nb948.jpeg)\n\nSad to see the image doesn't integrate in the medium page but you can click the link to see it. Anyways, I'm going to try and write a post for the Binmucker substack since I've been spending time trying to get binmucker.com looking better. Been using Nostr more and I'm blown away. Since I'm going by binmucker on the purple ostrich app I figured it made sense to improve my personal website that is linked to my Nostr account. Need to make it look a bit more proffesional but we are making solid steps to start!\n\n3/4/23\n\nConor Jay Chepenik",
  "wordCount": 314,
  "readingTime": 1.1849056603773584,
  "claps": 0,
  "voters": 0
}