{
  "id": "fcc4ba178580",
  "title": "Day 591",
  "createdAt": "2023-11-03 21:27:22",
  "tags": [
    "federal-reserve",
    "central-banks",
    "democracy",
    "war",
    "1984"
  ],
  "url": "https://chepenikconor.medium.com/day-591-fcc4ba178580",
  "content": "# Day 591\n\nToday I was doing some research on the Fed and learned it was established on December 23, 1913, when President Woodrow Wilson signed the Federal Reserve Act into law. Convenient timing when most members of Congress were away from DC for the Christmas holiday.\n\n![](https://miro.medium.com/0*5qAq7H6IK3qKYEWd)\n\nThe Act was the culmination of a series of clandestine meetings and negotiations that took place at Jekyll Island, Georgia, in 1910. There, a group of the nation's most powerful bankers and politicians convened to draft the blueprint for a central banking system.\n\n![](https://miro.medium.com/0*2eX8UaeGif0NPPGt)\n\nThe secrecy of these meetings was so paramount that participants used code names and avoided the use of last names to prevent the detection of their identities and intentions. Wonder why they would want to keep their plan of monopolizing credit a secret?🤔\n\n![](https://miro.medium.com/0*lWcjJsyo-qLnJF6u)\n\nI'm no history expert but I do enjoy learning about the past. I did not know much about Woodrow Wilson so I did a google search and found this link on the White House's website.\n\n> [**Woodrow Wilson | The White House**](https://www.whitehouse.gov/about-the-white-house/presidents/woodrow-wilson/)\n\nAccording to the Whitehouse \"Woodrow Wilson, a leader of the Progressive Movement, was the 28th President of the United States (1913–1921). After a policy of neutrality at the outbreak of World War I, Wilson led America into war in order to \"make the world safe for democracy.\"\n\n![](https://miro.medium.com/0*RaVOs_C19DDcp4FX)\n\nThis line right here sounds like something out of 1984 \"Wilson led America into war in order to 'make the world safe for democracy.'\" The line from 1984 that comes to my mind is \"War is peace.\"\n\n![](https://miro.medium.com/0*lcMNOJDtSp5pXqtq)\n\nWhile I mourn for the civilians impacted by war, America's justification for sending hundreds of billions to other countries is justified because \"We are defending democracy\". Based on my research this is the same narrative Woodrow Wilson used to enter World War I.\n\n![](https://miro.medium.com/0*qyb4uGQH0YYRXOFs)\n\nIronically, this narrative is failing (I would guess in large part because social media is making \"the narrative\" impossible to control) so they are pivoting to \"focus on the jobs that can be created by money spent on the war\" Sadly, this is not a joke.\n\n> [**The White House is losing the messaging war on Ukraine. Now it's changing the message.**](https://www.politico.com/news/2023/10/25/biden-ukraine-aid-messaging-00123466)\n\nIt is my personal belief that if we had not monopolized credit and needed to actually tax the money from citizens there is no way we would be sending out the billions we have to fund war. This Ron Paul quote always resonated with me.\n\n![](https://miro.medium.com/0*g_7W6SwAR4DQULJi)\n\nSo to recap\n\n- Woodrow Wilson, a Progressive, helped create the institution which robs citizens via the hidden tax of inflation\n\n- War must be done to \"defend democracy & create jobs\"\n\n- Creating the Fed was done by a bunch of bankers in secret\n\n![](https://miro.medium.com/0*nvaYRVXDUjjyMsV5)\n\nI'll admit, I first came to Bitcoin attracted by the number go up technology. But as I learned more, I realized Bitcoin offers humanity a chance to break free from the violence and manipulation made possible by centralized monetary control.\n\n![](https://miro.medium.com/0*h4pBgaVGmLWgJIA-)\n\nOnly time will tell if I am right but I really believe that Bitcoin can help build a better future where central bankers can't devalue currencies to fund wars through reckless printing. A future where financial power is distributed, not hoarded. Bitcoin is a peaceful revolution.\n\n![](https://miro.medium.com/0*5ZQ733CcrwVf2jqB)\n\nMy writing for today was originally posted as a Twitter thread and was inspired after I was tasked with writing an article for bitcoinnews.com about this insanity.\n\n> [**Federal Reserve Threatens to Sue Bitcoin Magazine**](https://bitcoinmagazine.com/legal/federal-reserve-threatens-to-sue-bitcoin-magazine)\n\nI always enjoy helping educate others why the Fed is not our friend nor are they an honest organization. So if you enjoyed reading this and have an X/Twitter account consider liking and retweeting to help educate others🫂🫂\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1720512960752218298%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n11/3/23\n\nConor Jay Chepenik",
  "wordCount": 670,
  "readingTime": 3.7783018867924527,
  "claps": 0,
  "voters": 0
}