{
  "id": "fd46832dccf4",
  "title": "Day 269",
  "createdAt": "2022-12-16 23:53:40",
  "tags": [
    "replit",
    "bitcoin",
    "science",
    "atoms",
    "god"
  ],
  "url": "https://chepenikconor.medium.com/day-269-fd46832dccf4",
  "content": "# Day 269\n\nLess than 100 days until I've written every day for a year. LETS FREAKING GOOOOOOO. Damn I'm proud of myself for this progress. I don't celebrate and pat myself on the back enough during the winter. Specifically during the winter because life is a little harder up here in Boston. It's cold and there is not as much daylight so I don't get as much vitamin D as I do during the summer. Thus, I'm taking some time to reflect on why I'm grateful for tapping my fingers on this computer keyboard day in and day out for 269 days straight. There are some posts that were pretty poorly written and then some I turned into Bitcoin Magazine articles that got a lot of praise. No one bats 100% so it feels good to acknowledge I showed up anyway. This tweet from Tyler is spot on!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tyromper/status/1603765433290543110&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nSome crazy new information came out today about the Twitter files. Confirmed that the FBI is colluding with big tech to censor people.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/mtaibbi/status/1603857534737072128&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThis is messed up and directly against the U.S constitution but also not surprising at all. Speaking of sunlight, I hope by shining a light on this collusion legal action will come and actually outlaw the F.B.I from spying on American citizens without a warrant. Sunlight is the best disinfectant. It does dishearten me to learn about this kind of stuff, but I have hope that there will be enough people upset by this that real change will take hold. The censorship and supression of speech these past two years have been ridiculous. We can't let these people win and as a citizen the best way to deal with this stuff is to laugh it off and make jokes.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1603887430956126208&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI have to imagine the FBI was looking at my account which both scares me and makes me feel like a patriot for doing my best to call out lies. Like any human I'm sure I've got it wrong many times and will continue to get it wrong. What's important is recognizing my mistakes when they become apparent and keeping an open-mind when new facts are presented. Hard to tell what's true and false nowadays but it's also easier than ever to learn new skills so overall I think humanity will figure it out in the long run. Today I read chapter 1 of this book.\n\n> [**A Universe from Nothing: Why There Is Something Rather than Nothing**](https://www.amazon.com/dp/1451624468?psc=1&ref=ppx_yo2ov_dt_b_product_details)\n\nIt reminded me that knowledge builds on top of previous knowledge. The scientists who figured out that the Universe is expanding at rapid speeds were only able to discover this because of a theory that came before and disproved those theories along the way. Bitcoin in the same vein came out of a long line of failed projects but used various things from all those projects. One of the most notable being Adam Back's proof of work concept. Maybe in 1000 years humanity will have so much abundance we won't necessarily need money, or at least not in the way we need money today, but for my lifetime I think Bitcoin can do incredible things for humanity.\n\nIt's truly ammoral that one group can create money out of thin air that all other actors in the economy have to work for. Bitcoin fixed this by building on top of humanity's collective knowledge before its discovery/creation by Mr.Nakamoto. I wonder if new theories will come along and make the current one that the Universe is expanding irrelevant. Maybe not in my lifetime, but either way it is an important reminder to remember how finite our knowledge is. The author of _A Universe From Nothing_ mentioned that he doesn't subscribe to the idea creation came from a God or Creator. I personally disagree and still enjoyed the first chapter very much. I'm in agreement with the author that science is incredibly important for humanity, but where I disagree is that will be able to use it to explain how we got the Universe from \"nothing\". Maybe reading more chapters will expand my perspective, but it gives me comfort putting my faith into God. It helps remind me that good is going to win out in the long run and to remain humble in the face of technological progress unlike anything humanity has ever seen. Some of the ideas presented in that book are fascinating and difficult to understand. However, the author does an amazing job explaining concepts in laymen's term and one that stuck out is how the empty space in cells between electrons and protons & neutrons might be more like a molasses filled space. Thus, matter can't actually move through this space as if nothing is there. The book does a much better job explaining than I just did but that imagery worked well for me. It's pretty crazy to think science has helped discovered particles that are even smaller than electrons, protons, and neutrons. This paragraph might be all over the place, but the point I want to drive home is science constantly allows us to updates our models and the way we think about the planet which is incredibly useful. It's important to remain humble along the way because for all we know a new model could come out that shatters everything we thought we knew.\n\nHaving faith in God makes me more comfortable with the idea we don't know and will not know the answers to the \"Universe\" in our finite time on this planet. That doesn't mean science can't help humanity. Science is the key to making the lives of everyone around the world better and more abundant. It just means that I accept there is likely a limit to what our monkey brains can even begin to comprehend. Our soul will likely have to leave our bodies to find these so called answers. Maybe I'm wrong about faith. Maybe I'm wrong about math not being enough to discover why there is a _Universe From Nothing_. What I do know is reading the Bible and finishing Lawrences book will help me figure out these things.\n\nFinally, I will leave you with this article anon. I'm so bullish on technology and Bitcoin making American's (and the rest of the world) lives better.\n\n> [**Issue #1293: Replit + Lighting could open the floodgates to app building**](https://tftc.io/martys-bent/issue-1293-replit-lighting-could-open-the-floodgates-to-app-building/)\n\nReplit is a powerful tool and this is another example of technology doing incredible things. It's also a great place to learn how to code. Do recommend trying it out.\n\n12/16/22\n\nConor Jay Chepenik",
  "wordCount": 1133,
  "readingTime": 4.275471698113208,
  "claps": 13,
  "voters": 2
}