{
  "id": "ff81cad11814",
  "title": "Day 620",
  "createdAt": "2023-12-03 04:16:08",
  "tags": [
    "sublime",
    "robert-greene",
    "thomas-sowell",
    "podcasts",
    "tom-bilyeu"
  ],
  "url": "https://chepenikconor.medium.com/day-620-ff81cad11814",
  "content": "# Day 620\n\n![Black are also sublime](https://miro.medium.com/0*5z2oAuqFgNqAtQrR)\n\n## \"When you want to help people, you tell them the truth. When you want to help yourself, you tell them what they want to hear.\"\n\n― **Thomas Sowell**\n\nSuch an insightful quote. I also watched a really insightful podcast today which got me thinking about the sublime.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FNyj431txkN0%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DNyj431txkN0&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FNyj431txkN0%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThe concept of the sublime is a philosophical and aesthetic notion rooted in the idea of experiencing something that is both awe-inspiring and somewhat terrifying due to its vastness, grandeur, or beauty. This concept is often associated with nature, art, and literature. It revolves around the feeling of being overwhelmed or humbled by something that is beyond one's understanding or control.\n\nHistorically, the sublime has been a key topic in the fields of aesthetics and philosophy. Edmund Burke, in the 18th century, distinguished the sublime from the beautiful. He argued that the beautiful is what is well-formed and aesthetically pleasing, while the sublime is what has the power to compel and destroy us. The feeling of the sublime arises from the recognition of our own smallness in the face of something much greater.\n\nIn the Romantic period, the sublime became closely associated with nature. Poets and painters sought to capture the overwhelming emotional experience of confronting the power and beauty of the natural world. Think of standing before a towering mountain or a vast ocean and feeling a mix of awe, terror, and pleasure.\n\nIn modern times, the concept of the sublime has expanded beyond nature. It can apply to any experience that pushes the limits of what is comprehensible, whether it's a work of art, a scientific discovery, or a technological innovation. The idea is that the sublime makes us confront our own limitations and the vastness of what lies beyond them.\n\nThe sublime is a profound experience, one that overwhelms us to the point where it stretches beyond our full understanding, triggering deep emotional responses. When listening to Robert speak, what struck me most was his ability to eloquently describe how this extraordinary concept is woven into the fabric of our ordinary lives. The lens through which we view the world matters immensely. If we choose to seek the sublime in the small, everyday moments, we'll discover it just as surely as we'll find negativity if that's what we look for. By shifting our perspective, we open ourselves up to a richer, more fulfilling experience of life. It's about adjusting our viewpoint, finding those pockets of wonder in the mundane, and allowing ourselves to be moved by them.\n\n12/2/23\n\nConor Jay Chepenik",
  "wordCount": 425,
  "readingTime": 1.8037735849056604,
  "claps": 5,
  "voters": 1
}