{
  "id": "ffde494a4b69",
  "title": "Day 441",
  "createdAt": "2023-06-06 21:37:01",
  "tags": [
    "health",
    "fasting",
    "bitcoinnews",
    "writing",
    "psycopath"
  ],
  "url": "https://chepenikconor.medium.com/day-441-ffde494a4b69",
  "content": "# Day 441\n\nToday will be me working on that same piece from yesterday.\n\n**Stop Tweeting Decrees & Start Adding Value**\n\nOne of my pet peeves is seeing people tweeting about how others should use their bitcoin so we can have mass adoption. It is important to note this is all anecdotal evidence from what the Twitter algorithm is pushing in front of my eyes, but I find these tweets to be ridiculous. As Bitcoiners we believe in permissionless money; I have no right to tell someone how to use their UTXOs. All I can do is utilize my own UTXOs how I see fit and accept others' UTXOs if they believe the goods and services I'm offering are valuable enough to part with their own bitcoin.\n\nTo fully appreciate the value proposition of Bitcoin, it is crucial to highlight the fundamental distinction between Bitcoin and fiat currency. Bitcoin emerges as a money system adopted by the free market, in stark contrast to fiat currency, whose value is dictated largely by government decree. The term fiat itself is Latin for \"by decree.\" The prevalence of fiat currency today can be primarily attributed to the coercive power wielded by nation-states, enforced by their armies, and upheld through legal tender laws. This system relies on people's trust in a mere piece of paper to retain their value. It is indeed remarkable that these paper notes - or even their digital counterparts stored in banks and intermediaries like Visa and Mastercard - serve as the medium of exchange for a wide range of goods and services, including travel, sustenance, real estate, automobiles, and much more.\n\nGiven the widespread acceptance and usage of paper money and plastic cards for transactions by the global population, it is not far-fetched to consider the potential for bitcoin to gain broad acceptance as a form of currency. In fact, Bitcoin offers a more equitable system. Of course, with the absence of a government-decreed currency supported by military backing many people won't make the shift to the new better form of money until they have been completely rugged of all their purchasing power. The vast majority of humans will opt for the path of least resistance. It's only the [psychopaths](https://nypost.com/2022/04/12/bitcoin-fans-are-psychopaths-who-dont-care-about-anyone-study-shows/) who are willing to go the extra mile to become sovereign.\n\n![](https://miro.medium.com/1*T91evW2ZUNIX7WoBMk2cnQ.png)\n\nPain is the best teacher, and those who have witnessed the devastating effects of hyperinflation require no further persuasion to recognize the immense value of alternatives like Bitcoin. However, the majority of the world remains unaware of our fractional reserve system unless they have firsthand experience within the banking industry or are deep down the Bitcoin rabbithole. This unfortunate knowledge gap predominantly exists due to the omission of fractional reserve banking from educational curricula. Such an omission should come as no surprise, as fractional reserve banking inherently involves elements of deception and manipulation. America's founding fathers understood this and Thomas Jefferson astutely remarked:\n\n_If the American people ever allow private banks to control the issue of their currency, first by inflation, then by deflation, the banks and corporations that will grow up around them will deprive the people of all property until their children wake up homeless on the continent their Fathers conquered.... I believe that banking institutions are more dangerous to our liberties than standing armies.... The issuing power should be taken from the banks and restored to the people, to whom it properly belongs._\n\nThese prophetic words, uttered nearly two and a half centuries ago, bear a disconcerting resemblance to our present reality, where we witness bank bailouts while working-class individuals face the threat of foreclosure. It is not my intention to advocate for individuals to retain their homes without meeting their financial obligations. However, it is bewildering to fathom why banks are rescued under the pretext of being \"too big to fail,\" while ordinary individuals are left to bear the burden of hardship. Frankly, this state of affairs is deeply abhorrent and morally repugnant. The stark contrast between the treatment of financial institutions and the plight of everyday citizens calls into question the fairness and equity of the existing system.\n\nFortunately, we find ourselves at a juncture where a peaceful revolution beckons, open for anyone willing to participate. It is crucial that we remain vigilant and avoid succumbing to the same pitfalls that have plagued fiat currency. In our current financial system, a select few dictate how nation-states spend trillions, who receives bailouts, who faces censorship, and who benefits from the [Cantillon effect](https://river.com/learn/terms/c/cantillon-effect). While Bitcoin may not be flawless, it undeniably presents a substantial improvement, a leap forward that surpasses our current monetary system by an order of magnitude.\n\nA legitimate concern often raised is the limited availability of goods and services for purchase using bitcoin. However, rather than merely lamenting this situation, individuals have the power to effect change by actively offering their own goods and services in exchange for bitcoin. I have personally taken this proactive step by leveraging my web development skills to accept bitcoin as payment. [For instance, if someone wishes to have a personal website created, they can compensate me with the equivalent of 100 USD in bitcoin for my services.](https://magicwebstore.xyz/index.html?pubkey=02b1a6c208420d3eb5a625aa8c79689e1dd4ea94f82286d06e1df7a05e2c3a482f&relays=%5B%22wss://nostrue.com%22,%22wss://relayable.org%22,%22wss://nostr.oxtr.dev%22%5D) It is through such individual initiatives that the Bitcoin network gains strength and exerts a more significant influence. As more people choose to accept bitcoin as a viable form of payment for their goods and services, the network grows in size and significance. By actively participating in this manner, we contribute to the ongoing development and expansion of the Bitcoin ecosystem. These network effects grow in an exponential fashion. The phrase \"gradually, then suddenly\" aptly captures this transformative process, highlighting how small individual initiatives can accumulate over time, eventually resulting in a substantial shift towards widespread adoption of Bitcoin as a viable form of currency.\n\nWhile some may raise a common argument against holding bitcoin as a valid use case, I respectfully dissent from such a viewpoint. When we compare bitcoin to fiat currency, a crucial distinction emerges. Fiat currency, subject to the whims of central banks, penalizes the act of saving through relentless money printing, gradually eroding the currency's purchasing power. In stark contrast, despite its extreme volatility, bitcoin has demonstrated remarkable appreciation over extended periods. Embracing bitcoin as a long-term savings vehicle has consistently yielded favorable outcomes within four-year time horizons. It is essential not to punish savers for their prudence; on the contrary, saving is a virtuous habit that allows individuals to accumulate capital for various purposes, including acquiring homes, cars, and starting a business. If individuals continuously lose purchasing power at a rate surpassing their capacity to save for these aspirations, their dreams may forever remain unfulfilled. The debasement of fiat currency not only obstructs individuals from achieving their savings goals but also coerces them into seeking higher-risk investments. This is a troublesome scenario as investments inherently entail uncertainty, while savings should provide stability for the future. The relentless money printing by central banks has effectively compromised the dollar's long-term store of value attributes in favor of short-term stability. Throughout history, the allure of printing money has proven irresistible to those with the power to do so.\n\nUltimately, money should fulfill three fundamental functions: serving as a store of value, a medium of exchange, and a unit of account. Historically, these functions are established in that specific sequence. However, with fiat currency, although it continues to be extensively used as a medium of exchange and unit of account, its capacity to function as a dependable store of value has significantly deteriorated. Governments have seized control of fiat currency, rendering it impotent as a store of wealth, and instead exploiting it as a tool of control.\n\nAs the Bitcoin network continues to gain momentum and establish itself as a monetary system, it is increasingly probable that more individuals will adopt it as a medium of exchange, which if true will ultimately lead to bitcoin supplanting the dollar as most people's preferred unit of account. The timeline for this transition remains uncertain. What is certain is that Bitcoin must not succumb to the same pitfalls of control that plague fiat currency. Safeguarding the principles of decentralization, individual sovereignty, and limited supply will be crucial to maintaining Bitcoin's integrity as a liberating force in the realm of meatspace.\n\nMy concern does not lie in the potential of bitcoin as a store of value, but rather in the dangers of individuals attempting to dictate how others should utilize their bitcoin. No individual possesses superior knowledge or insight into the daily incentives faced by others. Depending on one's circumstances, it may be more practical to save bitcoin and conduct transactions using fiat currency, especially if using bitcoin as a medium of exchange subjects one to capital gains taxes. Conversely, in regions where native currencies are highly volatile, individuals may naturally gravitate towards using bitcoin as their de facto medium of exchange, preferring its stability and utility over their own fiat currency. While bitcoin may exhibit volatility when measured against fiat, it continues to achieve new all-time highs against weak currencies, such as the Argentine peso.\n\n![](https://miro.medium.com/1*sNGw46todX-qvLryJ_PYaA.png)\n\nEnhancing individual autonomy and recognizing people's capacity to make decisions based on their unique circumstances, incentives, and preferences is vital for the growth of the Bitcoin network. Rather than scrutinizing others' bitcoin usage, let us redirect our focus and allow incentives to naturally drive increased interest and understanding over time. If you are that eager to onboard your friends and family, lead by example instead of imposing your views. When people witness Bitcoiners embracing healthy habits, engaging in physical activity, building families, and pursuing other low time preference activities they are more likely to join in. Remember, we are not mere observers of history but active participants in shaping it. Therefore, let's refrain from imposing fiat decrees and instead let our actions play an integral role in strengthening the network. By doing so, we can provide humanity with a currency that is backed by mathematics and energy, rather than debt and violence.\n\n![](https://miro.medium.com/1*r1254Zl9e170TW-6LlsmHQ.png)\n\n**FIN**\n\nI can always continue to improve my writing. Feel like I made some decent progress from what I released yesterday but still have more ways I could make this better.\n\nOn another note I'd like to try fasting for a week after reading this thread. Amazing stuff.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=d04bfffea46d4aeda930ec88cc64b87c&schema=twitter&url=https%3A//twitter.com/RussellOkung/status/1665871215477530625%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3D4fce0568f2ce49e8b54624ef71a8a5bd\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe video is super powerful. I don't think fasting will be easy, but it seems like it could be very useful. I need to drink a lot of water and make sure I don't go overboard with the running. I asked chatGPT about the positive effects of fasting and after reminding me \"WE NEED MORE STUDIES AND I AM NOT A DOCTOR PLEASE CONSULT A HEALTHCARE PROFFESIONAL\" it pointed out these six benefits.\n\n1. Weight management: Fasting can help promote weight loss and weight management by reducing calorie intake and increasing fat burning. When you fast, your body utilizes stored fat as an energy source, which can lead to a decrease in overall body fat and weight.\n\n2. Improved insulin sensitivity: Fasting has been shown to enhance insulin sensitivity, which is beneficial for individuals with insulin resistance or type 2 diabetes. Improved insulin sensitivity can help regulate blood sugar levels and reduce the risk of developing chronic conditions related to insulin resistance.\n\n3. Enhanced autophagy: Autophagy is a cellular process in which damaged or dysfunctional cells are broken down and recycled. Fasting has been found to stimulate autophagy, which may have anti-aging effects and potentially reduce the risk of certain age-related diseases.\n\n4. Reduced inflammation: Chronic inflammation is associated with numerous health problems, including cardiovascular disease, diabetes, and certain cancers. Fasting has been shown to reduce inflammation markers in the body, which could have long-term benefits for overall health.\n\n5. Brain health and mental clarity: Some studies suggest that fasting may have positive effects on brain health. It has been associated with increased production of brain-derived neurotrophic factor (BDNF), which is involved in the growth and protection of nerve cells. Fasting may also improve mental clarity and focus for some individuals.\n\n6. Longevity: Caloric restriction and intermittent fasting have been linked to increased lifespan in animal studies. While it's not yet clear if the same effects occur in humans, some research suggests that fasting might have a positive impact on longevity by improving various health markers.\n\n#BULLISH!\n\n6/6/23\n\nConor Jay Chepenik",
  "wordCount": 2064,
  "readingTime": 8.33867924528302,
  "claps": 1,
  "voters": 1
}