{
  "id": "01d210165377",
  "title": "Day 1216",
  "createdAt": "2025-07-21 01:06:46",
  "tags": [
    "btcpay-server",
    "bitcoin-news"
  ],
  "url": "https://chepenikconor.medium.com/day-1216-01d210165377",
  "content": "# Day 1216\n\nToday I had an amazing dinner at my Grandparents with all my sisters. So nice having all the family under one roof. Now I will write a draft for a Bitcoinnews interview series article.\n\n...\n\n**From Banking Blacklists to BTCPay Server: The Nicolas Dorier Story**\n\nSometimes the best Bitcoin stories start with the worst banking experiences. For Nicolas Dorier, creator of BTCPay Server, his journey into Bitcoin began not with grand visions of digital money, but with the frustrating reality of being blacklisted by French banks over a measly $1,000 unpaid bill.\n\n\"I tried to create a new business that was just consulting. So like no risk at all and banks would not let me open a bank account,\" Dorier recalls of his 2011 experience. Even when France's central bank forced one bank to accept him as a customer, the service was deliberately minimal: \"So you don't have internet banking, you have a credit card that doesn't work anywhere. Basically everything you need to do you need to go in person at the branch. So it's pain in the a**.\"\n\nThis banking nightmare left Dorier primed for Bitcoin's message when he discovered it after the Mt. Gox collapse. What puzzled him initially wasn't Bitcoin itself, but the community's reaction to the exchange's failure.\n\n\"I was wondering why people who lost their savings in bitcoin were still a believer in bitcoin and still buying bitcoin. I thought what level of scam it must be to reach this proportion,\" he remembers. \"So that's why I started reading about it.\"\n\n**The Accidental Bitcoin Library Builder**\n\nDorier's technical curiosity led him deep into Bitcoin's source code. What started as a personal learning exercise became NBitcoin, now the largest Bitcoin library in .NET. \"I started actually just to learn bitcoin. It was not meant to be a project to share with anybody. It was just me trying to copy some code from the Java world or C++ world and trying to make sense of it.\"\n\nThis library work established Dorier as a Bitcoin consultant from 2014 to 2017, during which he regularly recommended BitPay to clients. That recommendation would later become a source of deep frustration during Bitcoin's blocksize war.\n\n**The BitPay Breaking Point**\n\nThe 2017 Bitcoin scaling debate revealed what Dorier saw as BitPay's bad faith approach to the controversy. \"The thing that really pissed me off is when BitPay did a blog post where they were not even explaining the situation to their merchants,\" he explains. \"They said like oh you will automatically update you have nothing to worry about and you will still accept Bitcoin and they were not explaining anything...there was a battle that maybe it will not be Bitcoin it will be something else.\"\n\nFor Dorier, this was personal betrayal. \"You know I got customers to use their service and now they were basically using what I gave them against Bitcoin.\"\n\nBut the technical issue ran deeper than any single company's politics. Dorier realized that despite Bitcoin's decentralized protocol, the infrastructure layer remained dangerously centralized. \"If there was not enough infrastructure, open source infrastructure, people will naturally rely on centralized and closed system to use Bitcoin because there was no other choice.\"\n\n**BTCPay Server's Explosive Launch**\n\nDorier's angry tweet about creating a BitPay alternative struck a nerve in the Bitcoin community. The timing couldn't have been better for launching a competing product.\n\n![[https://x.com/NicolasDorier/status/898378514256207872](https://x.com/NicolasDorier/status/898378514256207872)](https://miro.medium.com/1*UvPCXPfcc_F3Hj6rGGJVBw.png)\n\n\"Because there were so much hate to be paid for what they did it kind of gave a very easy first 10/15 users,\" he notes with characteristic bluntness. \"Like when you start a new business the most difficult part is to get the first users and then after it's maybe 10 other users and then after it's scale and it's not taking that much to get a bit more.\"\n\nThe community's frustration with BitPay became BTCPay Server's initial user base. \"There was so many people pissed off at BitPay that when they saw an alternative that was kind of working, they switched right away.\"\n\n**Beyond Lightning: The Future of Bitcoin Payments**\n\nWhile many focus on Lightning Network adoption challenges, including BTCPay Server, Dorier is also excited about emerging solutions that could make Bitcoin payments even more accessible. He's particularly bullish on Cashu, an ecash system that allows offline payments.\n\n\"I see it as a very promising method of payment because it allows a payer to pay without having internet access,\" he explains. \"Like in conference for example where Wi-Fi sucks, you don't really have internet connection because too many people connect to the tower.\" With Cashu making true electronic cash possible and apps like [BitChat](https://x.com/jack/status/1941989435962212728) enabling offline messaging through bluetooth, the possibilities for peer-to-peer commerce without internet dependency are expanding rapidly.\n\nHe's also excited about Bolts, an atomic swap service that could solve Lightning's liquidity problems for merchants. \"The merchant could receive directly on lightning without a lightning node. He receives on lightning and it goes directly into his liquid wallets...it means that the merchant can finally accept lightning, without giving up his self custody, and without channel management.\"\n\n**Government Bitcoin and Corporate Treasuries**\n\nWhen it comes to institutional Bitcoin adoption, Dorier draws clear distinctions between government and corporate involvement. He's skeptical of government Bitcoin reserves: \"They should just not tax people and just let them keep the money, you know...people have the ability to invest by themselves rather than relying on the government for doing it for their own good.\"\n\nCorporate adoption is different. \"Companies are attracted by the same things as us. They don't want to keep their money in an account where it's melting like an ice cube, like Saylor said.\"\n\nDorier holds some hope for Argentina's Javier Milei, despite past memecoin controversies. \"His long goal is basically to say okay public money exists you can use it but it doesn't have any free goodies over any other form of money, like it just happened to be in the market of money and you can decide.\"\n\n**AI's Double-Edged Impact on Development**\n\nAs a maintainer of a large open-source project, Dorier has witnessed AI's impact on developer behavior firsthand. \"AI give lots of power to developers that are still junior and the thing that it ends up doing is that the junior then wants to do too many things...then they do a PR request and there is 2,000 lines of code.\"\n\nThe problem isn't the code quality necessarily, but the lack of understanding. \"There is lots of bugs and you ask the person why did you do this and they cannot come up with an answer because they don't really understand.\"\n\nHowever, AI has also improved code review processes. BTCPay Server now uses Code Rabbit for automated pull request reviews. \"Even in my own code sometimes I do PR so I see the AI reviewing it and it finds some bugs a lot of the time.\"\n\n**The Satoshi Question**\n\nWhen asked what he'd ask Satoshi Nakamoto, Dorier's response is refreshingly direct: \"Give me 1 million Bitcoin.\" But on a more serious note, he believes Satoshi's continued absence serves Bitcoin well. \"If he was going public and reappearing again, it will do more harm than good... I would tell him to keep quiet maybe.\"\n\n**Looking Forward**\n\nFor Dorier, Bitcoin's value proposition remains simple: people who have experienced banking or payment provider bans immediately understand Bitcoin's importance. \"You don't have to tell them 10 times the value of Bitcoin. They already know about it.\"\n\nHis advice for Bitcoin adoption is equally straightforward: \"I hope people interested in BTCPay Server give a try to it. Just install it, see how it goes and yeah, that's about it. If they like it, talk about it to other people.\"\n\nSupporting open-source Bitcoin infrastructure goes beyond just using the software. Developers like Dorier rely on contributions of time, code, corporate sponsorships, and simple word-of-mouth recommendations to keep these critical tools free and accessible.\n\nFrom a frustrated French entrepreneur blacklisted by banks to the creator of one of Bitcoin's most important payment infrastructures, Nicolas Dorier's story illustrates how personal pain often drives the best Bitcoin innovations. Today, BTCPay Server powers countless merchants worldwide and delivers on Bitcoin's original promise: truly peer-to-peer electronic cash that no intermediary can control or censor.\n\nIn true Bitcoin fashion, it all started with someone who was simply fed up with the existing system and decided to build something better.\n\n7/20/25\n\nConor Jay Chepenik",
  "wordCount": 1407,
  "readingTime": 5.5094339622641515,
  "claps": 0,
  "voters": 0
}