{
  "id": "0211319b0b5d",
  "title": "Day 825",
  "createdAt": "2024-06-25 03:11:34",
  "tags": [
    "assange",
    "federal-reserve",
    "bitcoin-meetups"
  ],
  "url": "https://chepenikconor.medium.com/day-825-0211319b0b5d",
  "content": "# Day 825\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=d04bfffea46d4aeda930ec88cc64b87c&schema=twitter&url=https%3A//x.com/BGatesIsaPyscho/status/1804979958143705102&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe above video is pretty funny. Had I watched it in 2019 I would have thought it was ridiculous. Seeing what happened during 2020 and beyond though it seems legit. I don't think the people in power have the best interest of humanity at heart. If anything, I think they want to destroy it as long as they can maintain their power.\n\nIn recent news, it's fascinating to see that Julian Assange is officially set to be released. While I'm genuinely pleased about this development, I can't help but wonder about the factors that led to this decision. Biden's polling is probably not looking great.\n\n![[https://x.com/BitcoinMagazine/status/1805379948409954692](https://x.com/BitcoinMagazine/status/1805379948409954692)](https://miro.medium.com/1*5krRqQ_xr4aOxBfrM6-4Hw.png)\n\nThe Federal Reserve also seems to have gotten hacked today. I don't want to see people lose their personal banking information, but I hate the Fed so this did make me laugh.\n\n![[https://x.com/DougAMacgregor/status/1805390694804070541](https://x.com/DougAMacgregor/status/1805390694804070541)](https://miro.medium.com/1*c1QvX2eIlKKl947a8Px6Fg.png)\n\n2024 has been a wild year so far and it is not even halfway over yet. Excited to see what the back 9 of this year holds. Things are going to be LIT.\n\nOn a personal note, I'm thrilled to share that I'm hosting my first Bitcoin meetup in Jax tomorrow. Bringing Bitcoiners together is always an exhilarating experience, and I'm looking forward to presenting at the event. These gatherings are fantastic opportunities to connect with like-minded individuals and foster community within the Bitcoin ecosystem. Might need it if the Fed keeps getting hacked haha.\n\n6/24/24\n\nConor Jay Chepenik",
  "wordCount": 239,
  "readingTime": 1.2852201257861635,
  "claps": 2,
  "voters": 1
}