{
  "id": "02d1941220d3",
  "title": "Day 1017",
  "createdAt": "2025-01-03 02:25:16",
  "tags": [
    "wojak",
    "pepe",
    "grateful",
    "charge-your-batteries",
    "thank-you-god"
  ],
  "url": "https://chepenikconor.medium.com/day-1017-02d1941220d3",
  "content": "# Day 1017\n\nI've been scouring deep corners of the internet, hunting for the finest Wojaks and Pepes , and let me tell you, I've unearthed some absolute gems. Consider these gems my gift to you, anon. You're welcome. 🐸\n\n![](https://miro.medium.com/1*-CXqy4AGF8gWwnHaxFF9Xw.png)\n\n![](https://miro.medium.com/0*hrVHh0yY4qvrN_1-)\n\n![](https://miro.medium.com/1*k4eKSWLqxWyHVG17OQaPlw.png)\n\n![](https://miro.medium.com/0*8FlyytVZlscA5WzV)\n\n![](https://miro.medium.com/0*KOmxOsedJ8rhilhq)\n\nAmazing Pepes & Wojaks aside I do need to figure out how to overcome my internet addiction. Do you guys understand how much freaking dopamine this interconnected web we call the internet can provide? Hint: it's more than a human could ever consume in their life. It's a blessing and a curse.\n\nI love the web, I really do, but it's also something I use way too often. I feel like recently I've had a hard time sitting down and writing stuff I'm proud of. I've just not wanted to write to be candid. Partly due to the holidays, partly due to enjoying X/Nostr/WojakMemeWebsites, and partly because I've just not felt a big muse. I saw [a great post today on LinkedIn from Dante Cook](https://www.linkedin.com/posts/dantecook_burnout-isnt-a-badge-of-honor-its-a-activity-7280572409634533376-IzrG?utm_source=share&utm_medium=member_desktop) I'll share here.\n\n\"Burnout isn't a badge of honor.\n\nIt's a warning sign... you've unplugged.\n\nMy 4-year-old taught me a lesson about burnout - using an iPad.\n\nShe said, \"I started charging the iPad.\"\n\nConfused, I looked over. The charger was with me on the couch.\n\nBut when I checked, the iPad was plugged into an adapter... disconnected from a power source.\n\nIt hit me: this is how so many of us operate.\n\nWe're expending energy non-stop, but we're disconnected from what recharges us.\n\nWhether it's faith, family, friends, or something deeper, staying disconnected guarantees burnout.\n\nJohn 15:5 says:\n\n\"I am the vine; you are the branches. If you remain in me and I in you, you will bear much fruit; apart from me, you can do nothing.\"\n\nThe grind alone won't get you to your goals in 2025.\n\nThe most successful people don't just grind - they stay plugged into their source of energy.\n\nSo let me ask you:\nWhat's your power source? Are you connected to it?\"\n\nHere is to reconnecting to that charger more in 2025. The internet drains me more than it charges me up. Which is fine because what point is a charge if you don't use it. Just a good reminder, ironically enough that I found on the internet, to be more in tune with myself and to make sure I am charging my battery with the right things.\n\nWe got this!\n\nFinally, I'll note we had an early birthday party today for my Daughter tonight and it was a really special. Grateful to have friends and family to celebrate Sloan's birthday. She had an amazing time and it was really cool to see her so happy. Thank you God for everything. From the bottom of my heart I mean that.\n\n1/2/25\n\nConor Jay Chepenik",
  "wordCount": 468,
  "readingTime": 2.59937106918239,
  "claps": 0,
  "voters": 0
}