{
  "id": "035f62929a75",
  "title": "Day 604",
  "createdAt": "2023-11-17 05:04:04",
  "tags": [
    "tech",
    "focus",
    "ai",
    "titans",
    "meetups"
  ],
  "url": "https://chepenikconor.medium.com/day-604-035f62929a75",
  "content": "# Day 604\n\nAttended an awesome AI meetup tonight in Jacksonville. Did not know the tech scene was so vibrant here but was pleasantly surprised to find Jax has a great tech scene.\n\n![](https://miro.medium.com/1*lW9vSxlQma0O6tYkZxsSVw.png)\n\nThis is the meetup group if anyone reading this is located near North-East Florida and wants to attend. Highly recommend checking out the next one.\n\n> [**Jax Tech | Meetup**](https://www.meetup.com/jax-tech-meetup/)\n\nAt the event tonight, a notable C.T.O made an intriguing argument: AI will generate a plethora of legal jobs. This stems from the contention that many Language Models (LLMs) have been trained on data without ownership rights. While it's true that these models often utilize publicly scraped internet data, the legal implications are vast and complex.\n\nOn one hand, the presenter's points seemed quite valid. Yet, the legal grey areas surrounding data use and AI are immense. How does data transformation within AI language models, which are not entirely understood, affect legal standings? Furthermore, the rapid pace of AI innovation might outpace legal frameworks. For instance, legal proceedings are notoriously slow. By the time a 2023 case reaches the courts, AI technology might have evolved beyond the case's relevance.\n\nThis raises numerous questions, the answers to which only time can unveil. Despite these uncertainties, the meeting left me optimistic about AI's future impact. Beyond the potential legal entanglements, AI promises vast business opportunities. While some ideas will inevitably be overtaken by market forces, others could flourish into trillion-dollar enterprises. If a 'Unicorn' denotes a billion-dollar company, what should we call its trillion-dollar counterpart?\n\nIntrigued by this question, I've created a poll to explore potential names for such companies. If you're reading this before November 24th, your timely input is welcomed!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1725370686967828909%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nYour focus is a powerful tool, anon. In a world often clouded by worries and the constant buzz of social media, it's easy to lose sight of what truly matters. Imagine your focus as a spotlight in the dark, illuminating only what's essential. Right now, you have the choice to direct this light.\n\nRemember, what's beyond your control, like the endless stream of global news or the chatter on social media, often only adds to your stress. It's like trying to calm a sea by commanding the waves to stop - futile and exhausting. Instead, turn your spotlight inward and to the present.\n\nPause for a moment. Feel your breath as it flows in and out. Let this simple act anchor you in the now. Ask yourself, 'What can I influence at this very moment?' It's in these small, mindful choices that peace and happiness often lie. Your energy is precious; choose wisely where to invest it.\n\n![](https://miro.medium.com/0*qtfM1sQJB58ItzJb)\n\n11/16/23\n\nConor Jay Chepenik",
  "wordCount": 465,
  "readingTime": 2.138050314465409,
  "claps": 0,
  "voters": 0
}