{
  "id": "0558351e8717",
  "title": "Day 1028",
  "createdAt": "2025-01-14 04:04:26",
  "tags": [
    "on",
    "my",
    "manifesting",
    "arch"
  ],
  "url": "https://chepenikconor.medium.com/day-1028-0558351e8717",
  "content": "# Day 1028\n\nI came across a video today that highlighted the link between physical exercise and the release of happiness chemicals in our bodies. These naturally produced chemicals are a much better way to experience mood-boosting effects compared to commonly prescribed antidepressants, such as SSRIs. The video did an excellent job of summarizing the key points, and it actually motivated me to exercise twice today. In essence, our muscles act as manufacturers of antidepressant chemicals, but to get these chemicals flowing, one must get the blood flowing. Engaging in regular physical activity is the key to unlocking the production and release of these chemicals, which can have a profound impact on our mental well-being. I can confirm from experience that I am much happier when I exercise regularly.\n\n![[https://x.com/GreaseTheWheelz/status/1878296993736597640](https://x.com/GreaseTheWheelz/status/1878296993736597640)](https://miro.medium.com/1*v33TeAqUocDLu77sMwdPwg.png)\n\nIt's easy to overlook something so basic in our noise-filled world. I mean, the ads I see for hims.com drive me insane. GLP-1s and other pharmaceuticals won't fix your issues; they are just Band-Aids on bullet wounds. I don't know what side effects we'll discover in the future, but I do know there are no one-stop-shop solutions for the real problems we face.\n\nWant to be fit? You'll have to put in the many hours eating right and exercising. Want to build wealth? Well, it's a marathon, not a sprint, and the market will take back any ill-gotten gains you get lucky with. Want a relationship that's on fire? Newsflash: Viagra and GLP-1s won't magically produce one for you. You will need to endure many tough conversations, sacrifice, and a willingness to put your partner first.\n\nSo, yeah, I'll get off my high horse, mainly because I don't have a six-pack, I'm not insanely wealthy, and I have to keep working on my relationship to make it flourish for the rest of my time on this planet. But I want to remind myself, and you, dear reader, that these quick fixes are not viable solutions. Sure, SSRIs might numb you, but if you want long-term happiness, find a good exercise routine. Whether it's running, walking, basketball or something else that gets you going. Pick your passion and trust me, you'll be much happier in the long run. On second thought don't trust me: go verify for yourself.\n\nThat's one of my favorite phrases in Bitcoin: Don't Trust; Verify.\n\nSome other cool things. Today I got to enjoy a delicious shepherd's pot pie with my Mum, Step Dad, Wife, and Daughter. I figured out a way to open my safe because my Step Dad is quite the hacker, and I swept an old OpenDime onto a more secure wallet because I was worried the hardware might crap it. Real hacker type shit.\n\nYou know it feels so cool to just do shit. I know that sounds silly because I typed it, read it, and chuckled. BUT man is it true. There is no set instruction manual for life. To be fair most men wouldn't read that shit anyways, but I love that you can remind yourself how powerful tinkering, envisioning, and manifesting is. Seriously put your thoughts out there and bend reality to your will. Conquer shit. Go on silly side quests. Become a force of nature. And for the love of God don't trust the sleazeballs in big Pharma who advertise panaceas with ridiculous side effects. I mean, come on, \"side effects may include nausea, diarrhea, vomiting, loss of limbs, hair loss, poor eyesight, and a bunch of other crap\"? It's arguably worse than the problem they're trying to solve. It blows my mind that those ads sometimes work, but I guess it's a lesson in the power of marketing, or propaganda, if you will.\n\nFuture looks bright, for those who take the time to manifest a bright future!\n\n1/13/25\n\nConor Jay Chepenik",
  "wordCount": 642,
  "readingTime": 2.6226415094339623,
  "claps": 0,
  "voters": 0
}