{
  "id": "066183e915f4",
  "title": "Day 688",
  "createdAt": "2024-02-09 02:28:55",
  "tags": [
    "putin",
    "tucker",
    "russia",
    "usa",
    "enemies"
  ],
  "url": "https://chepenikconor.medium.com/day-689-066183e915f4",
  "content": "# Day 688\n\n![](https://miro.medium.com/0*SV5CehKHSf3akKYU)\n\nI've been delving into Robert Greene's \"The 48 Laws of Power,\" and one intriguing concept it presents is the notion that enemies can often be more reliable than friends. At first glance, this idea might seem counterintuitive, but upon reflection, it holds a certain logic.\n\nFriends, motivated by the desire to maintain harmony or driven by underlying envy, might withhold harsh truths or offer misleading encouragement. They may harbor feelings of jealousy when we succeed and, even unconsciously, prioritize their advancement over our improvement. While this doesn't apply universally, it does reflect a prevalent aspect of human nature. The implication is not that all friendships are insincere, but rather that the dynamics of friendship can sometimes obscure the truthful reality we need to hear.\n\nThus, when I saw this interview drop I became excited to watch it. Why? Because I believe Putin will not obscure the realities of Western wrongdoings in the manner that our so-called \"friends\" (Western world leaders) might.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/TuckerCarlson/status/1755734526678925682%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGranted, I acknowledge the likelihood of encountering Russian propaganda within this interview. Yet, considering that mainstream media in the West often disseminates its own version of skewed narratives, engaging with perspectives from what my country deems an adversary offers a refreshing divergence.\n\nMoreover, there's an intriguing notion that extending understanding and grace towards our adversaries can sometimes yield a more appreciative response than what we might expect from our allies, suggesting a complex interplay of respect and acknowledgment in international relations.\n\nThe world is not so black and white. Take off the glasses and realize that nuance is your friend anon 🫡\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/WarClandestine/status/1755763948207423669%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n2/8/24\n\nConor Jay Chepenik",
  "wordCount": 270,
  "readingTime": 1.2188679245283018,
  "claps": 0,
  "voters": 0
}