{
  "id": "0759e6df23ab",
  "title": "Day 743",
  "createdAt": "2024-04-04 02:15:20",
  "tags": [
    "sim-swap",
    "cryptography",
    "online-safety",
    "bitcoin",
    "hackers"
  ],
  "url": "https://chepenikconor.medium.com/day-743-0759e6df23ab",
  "content": "# Day 743\n\n![](https://miro.medium.com/0*OhScP9VmXE-axp6m)\n\n**Protect Yourself from the Perils of A SIM Swap Scam**\n\nA SIM swap scam is a sophisticated form of identity theft where fraudsters manage to get your mobile carrier to switch your phone number to a SIM card they control. This type of attack can leave you vulnerable, particularly if you use SMS-based two-factor authentication (2FA).\n\n**The Impact on Bitcoin Security**\n\nFor Bitcoiners, the stakes are even higher when it comes to SIM swap scams, particularly if you use centralized exchanges. These platforms often employ SMS-based 2FA, which can be compromised, leading to unauthorized access to your accounts and potential loss of funds.\n\nHowever, if your Bitcoin is stored in a self-custodial wallet, where you control the private keys, a SIM swap should not directly compromise the security of your Bitcoin. The autonomy provided by self-custody significantly mitigates the risk associated with such telecom-based attacks.\n\n**It Can Happen To Tech Savvy People**\n\nHere is the content with grammar mistakes fixed:\n\nProtect Yourself from the Perils of a SIM Swap Scam A SIM swap scam is a sophisticated form of identity theft where fraudsters manage to get your mobile carrier to switch your phone number to a SIM card they control. This type of attack can leave you vulnerable, particularly if you use SMS-based two-factor authentication (2FA).\n\nThe Impact on Bitcoin Security For Bitcoiners, the stakes are even higher when it comes to SIM swap scams, particularly if you use centralized exchanges. These platforms often employ SMS-based 2FA, which can be compromised, leading to unauthorized access to your accounts and potential loss of funds. However, if your Bitcoin is stored in a self-custodial wallet, where you control the private keys, a SIM swap should not directly compromise the security of your Bitcoin. The autonomy provided by self-custody significantly mitigates the risk associated with such telecom-based attacks.\n\nIt Can Happen to Tech-Savvy People Jeff Booth is incredibly popular in the Bitcoin space for good reason. He is a successful author, an amazing tech entrepreneur, and an incredibly compelling speaker. However, he got SIM swapped, which is not to say this was his fault. Clearly, the man knows, understands, and uses technology. The point is that centralized systems are points of failure. In a recent podcast, Jeff mentioned he hasn't decided to return to Twitter, where his account was hacked as a result of the SIM swapping.\n\nLuckily, with Nostr, he does not have to worry about this. In the same way Bitcoin held in self-custody is safe if properly secured, so is one's Nostr key if the private key is kept safe. Private/public key cryptography will become increasingly important in the following years, with AI making deepfakes more prevalent and easier to make. Knowing how to use public/private key cryptography will be crucial.\n\n![[https://primal.net/e/note1xd9uelw9d8tyqmdjljxq3s9uyyp0rx77h9fs0e548mq97uhz8fts2hw997](https://primal.net/e/note1xd9uelw9d8tyqmdjljxq3s9uyyp0rx77h9fs0e548mq97uhz8fts2hw997)](https://miro.medium.com/1*6vUWU1rvkBWP00NqlyF8NA.png)\n\n**Steps to Avoid SIM Swap Scams**\n\n1. Switch to an Authenticator App for 2FA: Relying on apps like Google Authenticator or Authy instead of SMS for two-factor authentication significantly reduces your vulnerability to SIM swap scams.\n\n2. Implement Additional Security Measures: Utilize security features provided by financial platforms, such as withdrawal address whitelisting or multi-factor authentication, to safeguard your assets. This is not always an option, especially if you are trading peer-to-peer, but when possible it's an advisable thing to do.\n\n3. Stay Vigilant Against Phishing: Be cautious of unsolicited communications and always verify the authenticity of any request for personal information or urgent actions related to your accounts. In many cases, urgency can be a sign you're dealing with a scammer.\n\n4. Inform Your Mobile Carrier: Make your carrier aware of the potential risks and inquire about additional security measures to protect your account from unauthorized changes.\n\n5. Prioritize Non-Custodial Wallets: To maximize security, opt for storing your Bitcoin in hardware or reputable software wallets, where you have complete control over your private keys. Don't ever share the private keys with anyone or keep them online. Cryptography is a double-edged sword, so wield it properly and with care.\n\n**Perfect Is the Enemy of Good**\n\nWhile implementing all the recommended security measures is ideal, don't let the pursuit of perfection paralyze you into inaction. Even taking a few crucial steps, such as enabling an authenticator app and gradually transitioning to non-custodial wallets, can significantly bolster your defenses against SIM swap scams.\n\nPerfection in security is an ever-moving target, and bad actors are constantly evolving their tactics. Rather than striving for an unattainable absolute, prioritize implementing practical and effective measures that substantially reduce your risk exposure. Adopting a proactive and layered approach to security, even if imperfect, is far better than leaving yourself entirely vulnerable. The journey toward ironclad security is an ongoing process, and every step you take improves your resilience against threats like SIM swap scams.\n\n**Conclusion**\n\nSIM swap scams are a significant threat in the digital age, particularly for individuals holding valuable digital assets like Bitcoin. By following these steps and opting for non-custodial solutions, you can protect yourself from these sophisticated attacks and ensure your Bitcoin remains secure, even in the face of such vulnerabilities.\n\n4/3/24\n\nConor Jay Chepenik",
  "wordCount": 863,
  "readingTime": 3.639937106918239,
  "claps": 0,
  "voters": 0
}