{
  "id": "080ee23d15a3",
  "title": "Day 588",
  "createdAt": "2023-11-01 02:52:31",
  "tags": [
    "unsupervised-learning",
    "supervised-learning",
    "ai",
    "human-learning",
    "bitcoin-white-paper-day"
  ],
  "url": "https://chepenikconor.medium.com/day-588-080ee23d15a3",
  "content": "# Day 588\n\nI'm diving deep into AI and machine learning today and plan to jot down the key insights as I learn. Kicking off with the distinction between unsupervised and supervised learning:\n\nSupervised learning and unsupervised learning represent two major branches of machine learning. In supervised learning, models are trained on labeled data, where the correct answers are provided upfront. For example, to build an algorithm that distinguishes benign from malignant tumors, we supply labeled training data indicating which tumors are cancerous. This allows the model to learn the features and patterns that differentiate between the two classes.\n\nIn contrast, unsupervised learning utilizes unlabeled data. Rather than being given explicit answers, the model must find structures and relationships within the data on its own. If training an algorithm to identify tumor types, we would provide unlabeled examples and allow the system to cluster them based on shared attributes, without predefined malignancy labels.\n\nThe difference can be summed up succinctly:\n\n- Supervised learning trains models on data with known, labeled answers. The model is taught directly about the desired output.\n\n- Unsupervised learning finds patterns in unlabeled, unclassified data. The model must infer the relevant relationships and structure among inputs.\n\nA common supervised task is classifying handwritten digits by supplying images and corresponding labels. Unsupervised learning would entail providing the unlabeled digits and allowing the algorithm to discern similarities and cluster the numbers.\n\nIn summary, supervised learning and unsupervised learning take different approaches to training machine learning models. The choice between the two approaches depends on the problem, data availability, and end goals.\n\n- Supervised learning leverages labeled data, where inputs X are mapped to known outputs Y. By providing categorized examples, the model learns to infer the relationship between inputs and outputs. This allows creating models tailored for prediction, classification, and other tasks where the desired outputs are known.\n\n- Unsupervised learning operates on unlabeled data, where only the input data X is provided without corresponding outputs. Instead of teaching the model to generate predetermined results, unsupervised learning aims to uncover latent patterns and structures within the data. The model must discern relationships and clusters among inputs on its own.\n\nAs I was rocking my child to sleep tonight it occurred to me that these same ideas could be applied to how a human learns. I'm generalizing here but it surprised me when I became an adult and realized that many of the most succesful people in the world are the ones who struggled in school. While at the same time those who excelled in their academics often became dissatisfied with life. My speculation is this may be because a standardized education rewards finding the \"right answers\", whereas life has no predefined solutions.\n\nLike machine learning, human learning uses both labeled and unlabeled data. School imparts knowledge through supervised lessons, shaping our associations through feedback, like training predictive models.\n\nHowever, unsupervised learning through self-directed experience seems more impactful in developing internal qualities essential for fulfillment - wisdom, empathy, resilience. Growth arises from exploring our own minds, emotions, and abstract reasoning.\n\nThose conditioned to seek externally validated \"correct answers\" may never look within. They focus on narrow academic metrics rather than nurturing broader human potential. Fear of failure limits their ability to find personal meaning.\n\nIn contrast, those who struggled in academics are freer to chart their own course through trial and error. By realizing life has no predefined answers, they cultivate courage, creativity and self-awareness. This unsupervised approach of exploring unseen possibilities leads to greater fulfillment.\n\nTrue happiness appears to stem from developing internal qualities, not simply accumulating accolades. While school teaches certain skills, the deepest lessons are learned by looking within, questioning assumptions and integrating experiences in our unique way. Fulfillment comes from this inner journey of self-discovery.\n\n![I tried to prompt it multiple times to not hallucinate with the spelling but no luck. You get the idea of what I'm trying to point out here.](https://miro.medium.com/0*qEo2wnnWmUPO1jTb)\n\nP.S Happy 15th anniversary of the Bitcoin white paper. Where ever you are Satoshi I appreciate you🫂\n\n10/31/23\n\nConor Jay Chepenik",
  "wordCount": 649,
  "readingTime": 2.649056603773585,
  "claps": 0,
  "voters": 0
}