{
  "id": "0b1fb478e4e0",
  "title": "Day 867",
  "createdAt": "2024-08-06 01:58:40",
  "tags": [
    "consistency",
    "tahinis",
    "learn-to-code"
  ],
  "url": "https://chepenikconor.medium.com/day-867-0b1fb478e4e0",
  "content": "# Day 867\n\nToday was a solid day. I interviewed the founder of [Tahini's](https://x.com/TheRealTahinis) and enjoyed a nice chest workout with my dad in the AM.\n\nI also launched [SaylorScope](https://www.saylorscope.com/) and made a demo video of the product, which can be found on both X and Youtube:\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/ConorChepenik/status/1820495727543693726&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fpk6U0ZMVdFI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dpk6U0ZMVdFI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fpk6U0ZMVdFI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI've still got a lot of work to do making content, but one profound quote that hit me when talking with the cofounder of Tahini's is that the guy was consistent. He mentioned that his early videos sucked and that he just kept going. Now Tahini's has almost 3 million subscribers on YouTube. Some of their videos are pretty funny too.\n\nAmazing what consistency can do for someone. I've found that being consistent with my writing has helped my own writing career a lot. I'm also proud to have done Replit's learn to code for 4 days straight. 96 more days to go, and it's only 4 days in, and I'm already launching new websites. LFG. I need to remake my binmucker.com website already!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/ConorChepenik/status/1820550640419930293&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt's easy to get caught up in the negative aspects of social media, but it's also a powerful tool that can be harnessed for good. By using it intentionally and allowing it to hold me accountable, I can tap into the positive side of peer pressure and stay motivated to achieve my goals.\n\nAs I look ahead to the next 96 days of learning to code on [Replit](http://replit.com) and continuing to build my online presence, I'm reminded that life is a marathon, not a sprint. Consistent effort may not be glamorous, but it's what builds lasting greatness. So figure out what you want and stay consistent. Don't worry anon that's just as much for me as it is for the reader ;)\n\n![Sometimes I will just straight up copy and paste my essay to see the image it makes and this one gave me an LOL](https://miro.medium.com/1*908n_oIYGJvK6QtyMLyH5w.png)\n\n8/5/24\n\nConor Jay Chepenik",
  "wordCount": 296,
  "readingTime": 1.3169811320754716,
  "claps": 1,
  "voters": 1
}