{
  "id": "0b5e907a975e",
  "title": "Day 1074",
  "createdAt": "2025-03-01 02:34:06",
  "tags": [
    "food",
    "for",
    "thought"
  ],
  "url": "https://chepenikconor.medium.com/day-1074-0b5e907a975e",
  "content": "# Day 1074\n\nIt's a shame that so many people today look down on billionaires just because of their wealth. I was thinking about this recently, and it hit me: the real problem is not billionaires, it is rent seekers. We've got it all wrong. Someone who's created tens of thousands of jobs and generated immense wealth through hard work and innovation is a far more productive member of society than some bureaucrat leaching off everyone else. The focus shouldn't be on how much money someone has, but on _how they made it_. Did they improve the world, or did they make it worse? That's the test we should be using. I want to see more job creators, and fewer job destroyers.\n\nToo often, society paints billionaires as villains, as if having a massive bank account automatically makes you greedy or immoral. But that's a lazy shortcut. Not all wealth is the same. A billionaire who's built something valuable like Elon Musk with Tesla and SpaceX, or Jeff Bezos with Amazon hasn't just piled up money. They've created industries, employed countless people, and delivered products that change lives. Tesla's electric cars are a hell of a product andAmazon's logistics make goods accessible to millions. These aren't idle fat cats; they're driving progress.\n\nBut not all billionaires are the same. Some, like George Soros, rightly face criticism for using their wealth in ways that harm society rather than help it. That said, the real issue isn't the wealth itself it's how it's earned. Creating value and enriching yourself is much different than rent seeking your way into massive wealth. These are the ones we should target with our criticism. Unlike entrepreneurs who innovate, rent seekers get rich by gaming the system. They lobby for subsidies, snag shady government contracts, or exploit tax loopholes extracting wealth without creating any. Imagine a corporate lobbyist rigging regulations to crush small competitors, or a bureaucrat green-lighting deals that siphon public funds into private hands. That's the true drain on society not the risk-taker who bets it all to build a business.\n\nThis distinction is everything. A billionaire who's generated jobs and innovation isn't the enemy; they're a net positive. Take the tech boom: companies like Apple or Google employ tens of thousands directly and support millions more indirectly through their ecosystems. Hell I'm using a Mac to type this and Brave browser which is built on Chromium, an open-source project developed by Google that also serves as the foundation for Google Chrome. While I have my own beef with some of the rent seeking tactics of these massive corporations, that is the part we should criticiize. Not the part about generating wealth that comes from solving problems. We should be reward for connecting people, simplifying tasks, advancing knowledge, etc. On the flip side, a rent seeker's wealth comes from gaming the rules, leaving nothing better behind. It's not about the dollar amount in someone's account; it's about what they did to get there. Did they lift society up, or drag it down?\n\nOf course, not everyone agrees. Some say billionaires have too much power, that they dodge taxes or hoard wealth while others struggle. Which again are fair points I am all for criticizing. There is no doubt power can corrupt, and no one's perfect. But let's not throw the baby out with the bathwater. A billionaire's influence isn't inherently bad if it's used to create value. And while tax systems need fixing, punishing wealth creators won't solve that. It will just discourage the risk-taking that fuels growth. The real fix is targeting rent seeking: close the loopholes, stop the handouts, and reward those who actually contribute.\n\nImagine if we judged people this way. Not by their net worth, but by their impact. A society that celebrates job creators and shames rent seekers would look different. It'd be more meritocratic, where success comes from what you build, not who you know or what strings you pull. Innovation would thrive, bureaucracy would shrink, and resources would flow to those who use them productively. We'd cheer the entrepreneur opening a factory and boo the insider rigging the game. That's a world worth aiming for; one where wealth reflects worth, not just cunning.\n\nIn my opinion those who improve the world deserve respect, not scorn. Those who leach off it deserve the opposite. Call it karma, call it justice, or just call it common sense: actions have consequences. How you make your wealth defines your legacy, and no amount of money can hide that truth.\n\n![Asian Elon In the House LOL.](https://miro.medium.com/1*BtSuJQvFmNNhPme84HxLbQ.png)\n\n2/28/25\n\nConor Jay Chepenik",
  "wordCount": 764,
  "readingTime": 3.0830188679245283,
  "claps": 0,
  "voters": 0
}