{
  "id": "0c36676f3622",
  "title": "Day 1022",
  "createdAt": "2025-01-08 03:17:37",
  "tags": [
    "cleanspark",
    "bitcoin-mining",
    "harry-sudock"
  ],
  "url": "https://chepenikconor.medium.com/day-1022-0c36676f3622",
  "content": "# Day 1022\n\n**CleanSpark's Harry Sudock on Bitcoin Mining**\n\nBitcoin mining stands as perhaps the purest expression of capitalism in today's business world. It's an arena of intense competition where success demands massive capital investment, operational excellence, and something utterly unique: a peculiar enthusiasm for having your revenue cut in half every four years (210,000 blocks). While most CEOs would need smelling salts at the mere thought of a 50% revenue reduction, Bitcoin miners celebrate this quadrennial event like it's New Year's Eve.\n\nIn this unforgiving landscape, CleanSpark has emerged as a leader by embracing these challenges. Their formula seems deceptively simple: focus relentlessly on producing Bitcoin below market cost, then scale that process across an ever-growing network of mining facilities. Speaking with [Harry Sudock](http://Harry Sudock), Vice President of Strategy at CleanSpark who joined the company following their acquisition of GRIID, reveals how one of America's largest Bitcoin mining operations maintains its competitive edge while serving both shareholders and local communities.\n\n![](https://miro.medium.com/0*-L8oR_tRz4KzirIx)\n\nSudock's journey into Bitcoin mining began in the traditional financial sector, where he worked with hedge funds and banks, getting an intimate look at the inner workings of global financial systems. \"Finance was an industry that was sort of ready for the next round of innovation,\" Sudock explains. \"The business had been software upgraded, but Finance the asset had not been.\"\n\nThis realization, combined with his growing interest in Bitcoin, led him to a crucial insight: in the Bitcoin space of 2016–2018, you could either build exchanges or mine Bitcoin. The \"bricks and sticks\" aspect of mining, the physical infrastructure and tangible nature of the business, appealed to his desire to build something with fundamental business principles at its core. \"I wanted to return to a business that had the laws of physics, business fundamentals apply to it again rather than raise a bunch of money and convince everybody that it should be worth more,\" Sudock reflects.\n\nThe CleanSpark Approach has four pillars of excellence. Those four key concepts are Bitcoin, energy, operational excellence, and capital stewardship. Unlike some competitors who have diversified into AI or high-performance computing, CleanSpark maintains a laser focus on what Sudock describes as their core competency: \"producing Bitcoin below market cost and doing so at enormous scale.\"\n\nThis approach has led to impressive growth, with the company expanding from one data center in Georgia to 28 data centers across five states in just three and a half years. Their recent $650 million convertible note offering is not being used to buy Bitcoin directly, unlike some other players in the space, but rather to fuel continued growth in mining operations. As Sudock puts it, \"We would rather mine Bitcoin at $35–40,000 in electricity spent than buy it at $95,000 in cash spent.\"\n\nOne of the cool insights Sudock noted was Bitcoin mining is a people business in disguise. Despite generating revenue algorithmically with no traditional customers, the success of a Bitcoin mining operation hinges on the individuals who make it happen. As Sudock explains, \"It is the mayor of Maynardville, Tennessee believing that this business should come to his town. It is the general contractor getting excited to work with new technology,\".\n\nThis human element extends to their community impact strategy. CleanSpark often builds in areas where manufacturing jobs have left and technology companies have not arrived to fill the void. \"These are communities with incredibly high intelligence, integrity, work ethic, workforces, and they are just hungry for the opportunity for a company that can work in partnership with them to show up and do what they say they are going to do,\" Sudock emphasizes.\n\nOne of the coolest aspects of CleanSpark's operation is their approach to power management. During recent extreme weather events like Hurricane Helen, their facilities demonstrated their value as community partners by temporarily reducing operations to return power to essential services like hospitals and volunteer fire departments.\n\n\"Those are hours that hospitals needed to have the lights on and the HVAC running,\" Sudock notes. \"We get to play a critical role in those communities making sure they have a redundant opportunity for power to be given back.\"\n\nWhen asked about concerns regarding mining pool centralization, Sudock offers a nuanced perspective. He emphasizes that while pools may process a large percentage of hash rate, the actual control remains with individual miners who can easily switch pools if necessary. \"Our ability to move hash rate from pool A to pool B is borderline frictionless with a beyond negligible revenue impact,\" he explains.\n\nTo illustrate the relationship between miners and the broader Bitcoin network, Sudock offers an elegant analogy: \"Solving a Bitcoin block is like putting together a jigsaw puzzle. It is really hard to do and takes forever, but anybody walking by can tell you if the jigsaw puzzle is finished or not. Miners put the puzzle together, nodes check the puzzle.\" For those who have a hard time explaining the difference between the two to newcomers in the space, this analogy is quite helpful.\n\nLooking forward as Bitcoin approaches its next halving and the industry continues to mature, CleanSpark's approach offers a compelling model for sustainable growth in the mining sector. Their focus on fundamental business principles, community partnership, and operational excellence, combined with their strategic approach to capital deployment, positions them well for the future.\n\n\"We bleed two colors,\" Sudock concludes. \"We bleed blue for the company and orange for Bitcoin. Because ultimately, if Bitcoin does not work, we do not have jobs. And we feel great about that perspective because there is nothing more exciting happening than Bitcoin right now.\"\n\n![](https://miro.medium.com/1*E__5YUTrCRZaaanPNoRsFw.png)\n\nYou can learn more about Cleanspark on their [website](https://www.cleanspark.com/) or [X(Twitter)](https://x.com/cleanspark_inc).\n\n1/7/25\n\nConor Jay Chepenik",
  "wordCount": 945,
  "readingTime": 3.94937106918239,
  "claps": 0,
  "voters": 0
}