{
  "id": "0d7f2640c1d2",
  "title": "Day 1008",
  "createdAt": "2024-12-25 02:46:28",
  "tags": [
    "merry",
    "christmas",
    "and-a",
    "happy-new-year",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/day-1008-0d7f2640c1d2",
  "content": "# Day 1008\n\n![[https://x.com/ConorChepenik/status/1871748341366956131](https://x.com/ConorChepenik/status/1871748341366956131)](https://miro.medium.com/0*pQe9HQWnd24bldSf)\n\nTomorrow is Christmas. Another year down man how fast time flies. It was around this time last year I had started at Fidelity only to find out I landed the Swan job. So glad I ended up working in Bitcoin instead of traditional finance.\n\nFeels good to be employed. I don't want to be a wage slave for the rest of my life, but I'm so grateful to have a job I actually enjoy.\n\nBefore I know it I'm going to wake up and find that it's about to be 2035. Time flies as an adult when you have lived more years. Here are some things I want do accomplish in 2025.\n\nBe a good flag football coach. I am excited for the opportunity to teach young men about football. Continue learning about Bitcoin. Have another child God willing. Keep improving binmucker.com and be a force for good in the world. Write a book filled with memes. Also commit to getting in shape by forcing the peer pressure of X to make me healthier. Yea I think I'm going to do the shirtless posting thing even though it is a bit gay.\n\nNot a bad list. I believe I can do this. No better yet I know I can do this. I'm a stud. God gifted me with the ability to write and a good sense of humor. He also gave me one kid so I'll keep praying he gives me another.\n\nMerry Christmas anon. So much to be grateful for this time of year. I hope you have an excellent holiday and if you are not reading this during the Christmas season I hope you are having an excellent day. It's always a great day to go and get what you want out of life. BANG BANG!!!!\n\n![Also friendly reminder the IRS is unamerican and ridiculous. We need a flat tax in this country [https://x.com/ConorChepenik/status/1871742729535041951](https://x.com/ConorChepenik/status/1871742729535041951)](https://miro.medium.com/1*Fw3COwYG0nOvYpTG5CLXpw.png)\n\n12/24/24\n\nConor Jay Chepenik",
  "wordCount": 304,
  "readingTime": 1.530503144654088,
  "claps": 1,
  "voters": 1
}