{
  "id": "0fca71f73f3f",
  "title": "Day 1011",
  "createdAt": "2024-12-27 19:32:13",
  "tags": [
    "art",
    "collectoooooooor"
  ],
  "url": "https://chepenikconor.medium.com/day-1011-0fca71f73f3f",
  "content": "# Day 1011\n\nI'm not a big art collectooooooor, but man sometimes when I see a piece I love, I _have_ to buy it. I heard the [CEO of Sotheby's give some advice on a podcast](https://youtu.be/1Hil9D4PYwc): when it comes to buying art, just buy pieces you _love_.\n\nNow, this might sound like a \"no shit\" kind of statement, but I think it's actually profound. If you buy art you love and its value goes up, fantastic! But if it tanks, who cares? You still have something you _love_.\n\nWhen I saw this painting from my sister, I bought it on the spot because I knew instantly I _needed_ it.\n\n![Shout out my Sister Grace who painted this](https://miro.medium.com/1*38_Oq5cwaTE8tUNW1-S2wg.png)\n\nWell, there's another painting I saw and instantly knew I needed. So, I bought it today, and honestly, I'm glad I did.\n\n![[https://store.bitcoinmagazine.com/collections/art/products/bitcoin-war-bonds-2022-limited-edition-print-256](https://store.bitcoinmagazine.com/collections/art/products/bitcoin-war-bonds-2022-limited-edition-print-256)](https://miro.medium.com/1*DIDhQJcs8y1LgKT2QKN7Vg.png)\n\nThis painting is packed with amazing hidden messages. It's a clever play on Executive Order 6102, the one where the government banned gold ownership for U.S citizens. It pokes fun at how the state often resorts to stealing from its citizens to prolong wars and that irony just grabbed my attention as one of the things I hope Bitcoin can do is help end wars. If you can't print money out of thin air to finance war then war becomes a hell of a lot more expensive. Fait goes hand and hand with prolonged conflicts.\n\nOverall, it's a fantastic piece. Ten out of ten (or should I say twenty one out of twenty one) Even though it's just a print, I think it was worth every one of the 256 cuck bucks I spent on it. It makes me laugh, too, because there are only 256 prints, which I'm _sure_ is a nod to SHA-256, one of the cryptographic algorithms that secures Bitcoin.\n\n12/27/24\n\nConor Jay Chepenik",
  "wordCount": 298,
  "readingTime": 1.5078616352201257,
  "claps": 1,
  "voters": 1
}