{
  "id": "1232c1e05057",
  "title": "Day 274",
  "createdAt": "2022-12-21 23:37:37",
  "tags": [
    "tank-sinatra",
    "nostr",
    "bitcoin",
    "sim-cards",
    "servers"
  ],
  "url": "https://chepenikconor.medium.com/day-274-1232c1e05057",
  "content": "# Day 274\n\nLearned today they are getting rid of physical sim cards for e-sim cards. On the one hand this is great so someone can't swap your sim card if you leave your phone out. Not so great though if you want to buy a cheap sim card and swap it out for privacy. I could be wrong because I know every phone emits a signal to radio towers which includes meta data, but I think it makes it a lot harder to identify someone if they change their sim card. In the United States I'm not sure where to buy pre-loaded cheap sim cards but I remember this being a big thing when I was in Colombia. You could get them in grocery stores and buy a set number of minutes. Other than that I'm not sure the negative parts of not having control of your sim card. I'd assume having to trust Apple and your phone provider to not cancel you, but that was already a risk. That might've been mitigated if you bought another sim card to replace yours with? I'm not sure if that would've worked though. Which reminds me it's important to run my own server, but there is also only so much time in the day. That said, we make time for what's important. I will work on learning how to do so in order to not be fully reliant on a company for my data.\n\nWent and got some drinking chocolate today with my girlfriend at [https://www.burdickchocolate.com/](https://www.burdickchocolate.com/) Amazing. I like hot chocolate, but this is like hot chocolate on steroids. Definitely on the pricy side but I've never had such an enjoyable beverage. Can't recommend enough if you get a chance to visit Cambridge and enjoy hot chocolaty beverages.\n\nIn other news I see congress in looking to pass a 1.7 trillion dollar spending bill which is nuts considering the debt this country has. Which according to [https://www.usdebtclock.org/](https://www.usdebtclock.org/) is just under 31.5 trillion at the time of this writing. No fiscal austerity being practiced by those at the highest levels of American Government is upsetting. It's embarrassing how many of our politicians have no regard for their constituents. I've seen a few Senators speaking out which gives me hope, but I'm praying this thing doesn't get rubber stamped through. The last thing the United States needs right now is more debt. I'm not holding my breath, but maybe will see a Christmas miracle. I called both my Senators here in Massachusetts. I hope they listen and vote no. However, I'm not holding my breath that Senator Warren or Markey come through for me.\n\nI also spent some time coding in python today. I'm doing [Replit's](http://replit.com) 100 days of code and I recommend it to anyone looking to learn computer science. Fun easy way to learn using only a computer and web browser. I love seeing a platform like that even the playing field so anyone with a desire to understand comp-sci can learn.\n\nCrushed two important podcasts today that I'd like to share. The first was TFTC with JB55 about Nostr.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FSxkYxuIY1HU%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DSxkYxuIY1HU&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FSxkYxuIY1HU%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nNostr clearly has a long way to go before it can \"beat out\" platforms like Twitter and Instagram. However, it shows a lot of promise and seems to be much more immune to censorship than our current social media tools. I'm super grateful to social media for a lot of things, but it's also an incredible mind suck. Just consumes you if you are not careful. Nice for little dopamine hits, but hard to just take a quick scroll. Most times I just end up depleting way too much dopamine while I mindlessly stare at a piece of glass with transistors inside it. My biggest takeaway from this podcast is that I need to spend more time playing around on Nostr. I'm going to keep writing on Medium until 365 days have passed and I appreciate Medium for storing all my posts in their cloud. The problem is this means I'm way too reliant on them as a company. If they wanted to censor me for whatever reason I would have no recourse. Not saying they have plans to censor me, but I think running my own blog is definitely a worthwhile endeavor and based off this conversation something that could be done on Nostr. This protocol reminded a bit of Urbit. So many exciting things being built and only so much time in the day to explore them. Got to ignore the analysis paralysis and pick one. Side note, I saw Urbit was on Umbrel now which is cool. I'm impressed with how easy Umbrel has made it to spin up your own server and man is the new UX sleek on Umbrel.\n\nFinally, this Pomp Podcast with Tank Sinatra was great. Tank is hilarious and I appreciated his message of don't stop. If you want to get great at something do it everyday relentlessly. Homie was posting and creating like 10–15 memes a day at one point. Just insane. Not easy to share your own memes. Now the guy has been paid millions of dollars over the course of his career to simply shitpost: incredible. I see why his account is \"The Michael Jordan Of Memes\".\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FXNfww7HZ6p8%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DXNfww7HZ6p8&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FXNfww7HZ6p8%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIt's awesome learning about people who were down on their luck and just said: \"FUCK IT NO MORE!\" If you want something go and take it. What I appreciated though is Tank wasn't rah rah or trying to give some self help speech. He was just talking about his own life and that made the advice that much more powerful. Overall, great conversation and I do recommend listening. Funny and insightful :)\n\nTomorrow is the Mass Adoption Christmas meetup which I'm excited for. I will likely use tomorrow's post to brainstorm what I want to write on our Substack. I told the sqaud I'd do a Substack after every meetup so I'm looking forward to creating the first one. Comp-sci is the field I want to test out next, but writing is something I want to do for the rest of my life. Lot of value in trying to clarify your thoughts in words. You quickly realize what seemed so brilliant in your mind is incredibly incoherent when you go to articulate via writing or typing😂\n\n12/21/22\n\nConor Jay Chepenik",
  "wordCount": 1060,
  "readingTime": 4,
  "claps": 12,
  "voters": 1
}