{
  "id": "125c1ea0e639",
  "title": "Day 232",
  "createdAt": "2022-11-10 01:43:45",
  "tags": [
    "politics",
    "bitcoin",
    "fraud",
    "central-banks",
    "illusion-of-choice"
  ],
  "url": "https://chepenikconor.medium.com/day-232-125c1ea0e639",
  "content": "# Day 232\n\nThe urge to act like a central bank is strong in the crypto sphere. The problem is these now failed exchanges don't have a government or military to back up their freshly printed money. Obviously, it is not enjoyable to watch my net worth in USD terms drop the way it has since I hold a large portion of my wealth in bitcoin but at the same time I am a staunch believer that pain is the best teacher. 1 bitcoin = 1 bitcoin if you have the private keys. While it is hard to treat bitcoin as a unit of account when it's this early and the USD price is volatile I still wholeheartedly believe we will see a day when people are treating Bitcoin as a medium of exchange, store of value, and unit of account. What happened with FTX should serve as an important lesson for many who lost funds that A. Not your keys not your coins and B. Bitcoin != Crypto. Human nature is a funny thing. Wild to see someone like SBF absolutely fumble the bag. Sad to see all these depositors lose out on so much money. Thought this coverage by the Bitcoin layer was well done.\n\n> [**Binance Launches a Speculative Attack Against FTX, and Wins**](https://thebitcoinlayer.substack.com/p/binance-launches-a-speculative-attack)\n\nThought this one line was particularly notable.\n\n> Whereas Japan can defend the yen with an infinite balance sheet, FTX has to defend FTT with a limited amount of dollar-denominated reserves.\n\nI'm sure Celsius, Voyager, and FTX would all love the privilege to do what Central Banks do. However, that is not the case and when you fuck around you find out. I can only imagine how these fraudsters are feeling today. Probably horrible. I don't feel that bad for them though, my sympathy lies with the consumers who had funds on these exchanges. I hope they can get some of their funds back and use this expensive lesson as a teacher to take self custody and stop dabbling with ponzi coins.\n\nIn other news the election was not the red wave people expected. I do think there is something to be said about the illusion of choice. While Bitcoin is chopping around 16k at the time of this writing I am still so hopeful it can deliver actual freedom to the people rather than the pretend freedom politicians promise. I do think it is kind of crazy Fetterman pulled out Pennsylvania when he talked like this. I get the dude had a stroke but damn. Why can't we fill the senate with the best and brightest?!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/outspoken_sam/status/1585073366775390209&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nHowever, Dr. Oz was a TV show guy who wanted red flag laws. So I guess it didn't matter who PA picked because it would be an L. I wish [Kathy](https://twitter.com/Kathy4Truth) was picked as the nominee but she spoke out too much against the WEF cucks so of course the establishment didn't want her taking the GOP seat. Anyways, not financial advice but the next few years will likely be filled with high inflation, crappy stock performance, and a bunch of uncertainty so learning, DCAing and taking self custody of bitcoin is probably a good move.\n\nSmile anon. Life is too short to be caught up worrying about B.S. Find what you love in life and let that fill up your time.\n\n11/9/22\n\nConor Jay Chepenik",
  "wordCount": 578,
  "readingTime": 2.181132075471698,
  "claps": 0,
  "voters": 0
}