{
  "id": "12f1fcb3693d",
  "title": "Day 511",
  "createdAt": "2023-08-15 22:02:04",
  "tags": [
    "money",
    "podcasts",
    "fiat",
    "abstraction",
    "philosophical"
  ],
  "url": "https://chepenikconor.medium.com/day-511-12f1fcb3693d",
  "content": "# Day 511\n\nIt is 2023 and most of my content diet is just listening to other humans talk with each other. Podcasts are the best.\n\n![](https://miro.medium.com/0*F0KkNoJbFmWdxy_c)\n\nHighly recommend listening to this podcast if you want to learn more about the philosophical and technological implications of money. I know I learned a lot from this conversaiton.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FZ_PEIR9A4TY%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DZ_PEIR9A4TY&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZ_PEIR9A4TY%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nMoney is an astounding social construct when you stop to think about it. A few reflections on money as an abstraction:\n\n- It's essentially a token that represents value, but has no inherent worth itself. Just some paper, metal, or digital data. Yet we imbue it with tremendous power in our society. There is an argument that commodity monies like gold having some baseline utility value, but most of their value is still as a socially agreed upon monetary instrument.\n\n- Money facilitates exchange and serves as a store of value, allowing commerce and economic activity that would be impossible through direct bartering. It's much more efficient to exchange money for goods and services than to barter one good for another.\n\n- Money which stems from government backing needs coercion. There's nothing about a paper note that makes it inherently valuable. It's valuable only because we collectively agree to see it as such.\n\n- The same physical object (a banknote) can represent vastly different amounts of abstract value, based on its denomination. Yet the physical money itself doesn't change besides the number on the peace of paper.\n\n- Fiat money relies heavily on trust and faith in institutions. We must trust that banks will safeguard our money, governments won't devalue currency, and society will continue to accept its value.\n\n- It shapes psychology and behavior in profound ways. Our relationship with money - whether we have a lot or a little, whether we spend or save - influences our moods, relationships, work, and life choices.\n\nMoney is a strange invention that defies logic in some ways, but has incredible utility in facilitating economic activity between humans. The fact that such an abstraction can gain such immense power in society is a testament to the creativity and collective faith of humans! The shift towards money rooted in software and mathematics is commendable, as human-issued currency tends to succumb to hyperinflation over long enough time frames.\n\n8/15/23\n\nConor Jay Chepenik",
  "wordCount": 377,
  "readingTime": 1.6226415094339621,
  "claps": 3,
  "voters": 1
}