{
  "id": "14377775ea2c",
  "title": "Day 177",
  "createdAt": "2022-09-16 00:16:58",
  "tags": [
    "podcasts",
    "habits",
    "sweets",
    "coffee",
    "internet"
  ],
  "url": "https://chepenikconor.medium.com/day-177-14377775ea2c",
  "content": "# Day 177\n\nMan 177 days of typing some stuff out for the internet. Let's freaking go! Humans are creatures of habit and I feel like this is one of the better habits I have. Some negative habits I have that I could cut back on include coffee and sweets consumption. I love me some good tasting food and drink. Some other good habits I've instilled is running frequently, hitting the sauna, and almost always getting in at least 10k steps a day.\n\nI've found that all those things are habits I actually enjoy. I mean the running can suck at moments but after a run I always feels good. I didn't include it but also listening to podcasts is a solid hobby of mine. Hearing from those that are wiser than me has been awesome in terms of my personal growth. So many brilliant people out there to learn from if you are willing to put in the time to listen. So grateful for podcasts.\n\nDriving up to Maine after work today which I can not wait for. Ready for a little R&R up in the woods. On my drive I've been listening to this podcast which has been awesome.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F2XCJAb43d6b4cNLdKS9jSw%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F2XCJAb43d6b4cNLdKS9jSw&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f544f5699bfa6351b6b38d496&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"207\" width=\"368\"></iframe>\n\nFascinating to hear these men discuss psychedelics. I agree with both of them that it is not the answer to all of society's ills but it is one of the answers. Going to take a lot of reform but magic mushrooms and other stuff can help. Another point they talk about is how there is a big relationship between successful people and those who had loving parents. How kids inherent trauma from their parents or better yet parents pass on their trauma to their children. Fascinating stuff. I hope I can do a good job not passing on my B.S to Sloan and hopefully the other children I have. I like to think I can learn from my parents mistakes (which overall weren't many I had a pretty good childhood) but if anything I probably just have a different set of traumas that are similar but slightly different because of a few genes and the environment and time I grew up in. Man life is some fascinating shit. Tired of writing in the car though to make sure I get this piece published so that is all. See you tomorrow anon :D\n\n9/15/22\n\nConor Jay Chepenik",
  "wordCount": 396,
  "readingTime": 1.4943396226415093,
  "claps": 0,
  "voters": 0
}