{
  "id": "1493f2def92c",
  "title": "Day 194",
  "createdAt": "2022-10-02 22:39:08",
  "tags": [
    "black-comedy",
    "bitcoin",
    "finance",
    "financial-crisis",
    "swan"
  ],
  "url": "https://chepenikconor.medium.com/day-194-1493f2def92c",
  "content": "# Day 194\n\nLiving life in a fiat world, not thinking twice, just buying shit I don't need because that's what it's like to trust and not verify. Blowing dollars, stacking sats, somethings gotta give, there goes everyones pensions, OH CRAP!!!!!\n\nHahahhaha I hope you read that with a tune anon. No clue what the coming months are going to hold but I don't think it's going to be pretty. Hope I'm wrong but the math seems off. Like really off. Not to mention those who weaponize the financial system to hurt others don't typically do it to stop the bad guys.\n\n![](https://miro.medium.com/0*i5E7jBe_UxKlh61I)\n\nAfter accepting most of this crap is out of my control I enjoyed my Sunday and overall it has been a decent Sunday. Was feeling a little unproductive so I crushed a run and that felt great. Listened to this Podcast from Swan as well which was well done.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2ForvcTwZwQ84%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DorvcTwZwQ84&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2ForvcTwZwQ84%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI'm still cracking up at the metaphor Preston gave during this rip comparing the economy experiencing QT now after years of easy money being like a 95 year old Grandma getting told \"hey bench 315 you need to stay active\". Pretty apt comparison honestly. Almost no companies or nation-states are going to be solvent if the Fed does not do something and change course. The Math is just so beyond messed up. I don't see how we get a \"soft landing\".\n\nGot a follow from Greg Foss on the bird app today which was nice. I appreciate what Foss adds to the Bitcoin community. Obviously, everyone has their own perspectives and ways of looking at the world. Not everyone on Bitcoin Twitter thinks that BTC is some CDS on sovereign default but I like to think of it that way. I also like to think of it as Freedom money, and stored energy, and a whole bunch of other metaphors that confirm my bias that Bitcoin will fix the world. Of course it is just computer code, but it is computer code that will fix so many problems as far as I can tell.\n\nAnyways, made some stew so I'm going to go eat that now. Going to be a wild couple of months as far as I can tell. My daughter is about to be born during the next great financial crisis (hopefully I'm wrong about this but a lot of people smarter than me seem to be saying otherwise) so I'm grateful Satoshi gave me some of the best credit default swap technology out there in Bitcoin hahahahha.\n\nOh before I go I also have a great idea for a stand up set. Yesterday, my girlfriend's friend asked about what happened with the Bank of England so I went on like a 3 hour tangent about Bitcoin...naturally of course. After some ranting she asked me about Bitcoin's environmental use and I went on this rip about how that is the stupidest shit when you think about it from first principles. I went on to talk about how energy is the base layer of society and while people in less developed countries are losing their babies because they don't have reliable energy we here in the states (and other developed countries for that matter) are essentially virtue signaling, saying \"No you can't have reliable energy you will need to use unreliable technologies like solar and wind\" and then posting about how we are doing our part by driving an electric car not even realizing in most cases that electricity is coming from a coal generated plant. So if anything those people who are virtue signaling about their Teslas would actually be doing more for the environment by just driving a petrol vehicle. It was some dark humor but it was also pretty funny in the moment. We are literally telling people who are dying as a result of not having reliable energy \"Yea sorry get fucked oh and by the way you are going to need to use less electricity and the little you can use will have to come from sources that have never been approved by the free market and are only in place because of massive government subsidies. SORRY!\" I'm not an energy expert but I'm so grateful to Alex Epstein and his book _Fossil Futures_ because it has helped me realize how flawed much of my thinking on energy has been. Energy helps humanity thrive and cheap abundant energy is the key to maximum human prosperity. I have nothing against trying to fix the environment. I am against those who want to quell fossil fuel use without coming up with some solid alternatives that actually provide reliable energy (wind and solar are not reliable at this time to give all 8 billion people worldwide reliable energy).\n\nWe almost started crying last night because we were laughing so hard. Such a great case of black comedy. When I took Black Comedy in college (it was a class offered at Tufts) I assumed it was a race thing. Turned out to be Comedy that relates to a dark sense of humor. Turned out to be one of my all time favorite classes. While Black Comedy is funny it also makes you deeply sad. Maybe that will be my next Bitcoin Magazine article \"Black Comedy: Why Bitcoin Is Vital To Fixing The Madness That Is Western Virtue Signaling\".\n\nJust floating the idea. I need to hash out these ideas some more in my writing but man when I was telling those jokes yesterday we were all laughing so hard and it felt so great. Having an audience laughing like that is truly special. It was amazing because I was able to get my point across, shill Bitcoin, and help people laugh. Sometimes shit is so messed up all you can do is laugh.\n\nOk now I'm going to eat some stew for real. Enough writing on this fine Sunday.\n\n10/2/22\n\nConor Jay Chepenik",
  "wordCount": 986,
  "readingTime": 3.9207547169811323,
  "claps": 0,
  "voters": 0
}