{
  "id": "1516ede36812",
  "title": "Day 47",
  "createdAt": "2022-05-08 18:56:59",
  "tags": [
    "web-browser",
    "microsoft",
    "bitcoin",
    "brave-browser",
    "educating"
  ],
  "url": "https://chepenikconor.medium.com/day-47-1516ede36812",
  "content": "# Day 47\n\nI'm taking a coding class to learn front-end development and it led me to a fascinating website. I have not spent much time thinking about web browsers, but the more I learn the clearer it becomes how vital one's browser is when scrolling the internet. I'm a huge fan of the Brave browser because it blocks trackers and ads if you want. It also pays you in Basic Attention Token. As a Bitcoin maximalist, I view most cryptocurrencies (outside of bitcoin) as crypto-equities, but I believe in Brave's mission of paying people for their attention and I can always use the B.A.T (basic attention token) to buy more bitcoin so I'm happy. I digress, here is the link to the fascinating story I just read about Microsoft and their mission to make people use their internet explorer web browser.\n\n[http://toastytech.com/evil/ieisevilstory.html](http://toastytech.com/evil/ieisevilstory.html)\n\nTo give a little background for those not wanting to click the link and read the whole story I will use this quote from the essay, \"Microsoft forced people to install their browser and other tasteless things. Then the browser war got really fierce. Microsoft released Internet Explorer 4 - a very buggy, bloated browser that encouraged the use of the highly insecure ActiveX. By itself, the release of yet another web browser would have been no big deal, but how Microsoft pushed it on to consumers was unacceptable. First, Installing IE 4 was a very invasive process. Other browsers, or indeed any normal application, would never touch system files or alter the way an operating system worked. IE 4, when installed on Windows 95 or NT 4, would replace or update many system files with its own special versions, which sometimes broke functionality of other applications, and made it almost impossible to re-install these OSes once IE 4 was installed.\"\n\nThis essay also mentioned people were doing fine not using web browsers in the early days of the internet. Could you imagine if everyone today knew how to run and write code on Linux? It is really interesting to me that people were doing fine not using a web browsers when personal computers were becoming big in the 90s. I had no clue there was a big war over web browsers and I'm grateful that more competition came into the space via Google Chrome, Firefox, Safari, Tor, Brave, and all the other web browsers that I didn't mention. By bundling a web browser into a window's computer and making it near impossible to download a different web browser I see why the creator of the site styled his web page to look like this.\n\n![](https://miro.medium.com/1*dqZGwE8d-KBEr53J5WDVRw.jpeg)\n\nLearning how technology works is important because it allows you to see the sneaky bullshit companies try to pull with bundling. Think about insurance for a second. All these companies want you to bundle everything so they can get more business and they convince the consumer by offering discounts for bundling. The problem is many times people don't need all the extra insurance. There are definitely situations where insurance can be great, but it's also a pain in the ass and almost never used by those who act responsibly. Obviously, it is good to have car insurance since anything can happen but for the uber safe drivers who always practice safe driving they might never end up needing their insurance. (*Napkin math* I spend roughly 1,000 a year on car insurance so that is 60 grand over a lifetime of driving that hopefully goes down if I don't crash or get tickets) Not sure how to fix the insurance industry. I just bring this up because I'm sure billions, if not trillions, of dollars, have been spent on products and services people didn't need or use because a \"bundle offer\" seemed like a good deal but was really just a way for a company/ organization to eek out some extra profit.\n\nBy putting a browser straight on the operating system of a window's computer Microsoft essentially guaranteed the end-user would pick the path of least resistance and use the Microsoft web browser (which at the time was Internet Explorer). Only the super technical would have the knowledge (and will) to change this. I remember as a kid using internet explorer and never thinking twice about the web browser. Like most people, I just expect my technology to work and if it's not my personal computer I will use whatever browser is there. Thus, this gave me Microsoft a monopoly on the web browser at the time. Free markets are great when they can operate. Monopolies kill free markets and I'm so glad Microsoft had a shitty product that ultimately didn't win out.\n\nI don't get paid anything to promote Brave browser. That said, I'm happy to do so because I've made over 75 bucks using Brave and I've blocked nearly 250,000 trackers and ads at the time of this writing. What an incredible feature. Again, most people don't realize how intrusive technology has become. Whenever I think about what happens with my data an orgy with a bunch of old dudes and beautiful women comes to mind. In this metaphor, the beautiful women are people like myself who massive organizations want to sell something. The highest bidder gets my data and targeted ads start getting shown to me. I'm not special though. Billions of people are being targeted while proclaiming to their friends \"I think my phone is listening to me\". Well if you have social media apps and you gave them access to your microphone you can rest assured they are listening. Like I said yesterday, the internet is a vast and incredible space. It is also a very scary one. I'm loving my coding class because it has forced me to think through a lot of this stuff. An orgy with high-end escorts and wealthy old men is a grotesque example to compare the buying and selling of data. The reason I choose it is because the women who sleep with these older men are likely taking the path of least resistance. Rather than use their intellect to make a better life for themselves they choose an easy path where they could make a lot of money selling their body. This is not to shame sex workers. I get that everyone has their own situation and reasons for ending up where they are. It's just unfortunate that many in those industries end up addicted to drugs and depressed. While the cash might seem worth it in the short term it seems that many regret their decisions later in life. The same goes for our data. The ease and practicality of using the browser installed, giving social media apps access to our cameras and microphones so we can post, and not worrying about your data is common. Shitfire, I am guilty of doing these things myself. That said, the more I take the time to educate myself, the more disgusted I get with big companies \"gang banging\" my data and selling it off to the highest bidder so they can show me targeted ads. The current ad revenue model is so broken and I'm glad things like Brave browser exist.\n\nThere is so much more for me to learn and a lot I still don't completely understand. I will continue learning and figuring out how to best protect myself online so I'm not constantly targeted with ads. Human nature typically leads people down the path of least resistance. It seems that most people who are able to overcome this urge end up much better in the long run. Lower your time preference anon and great things will happen. Until tomorrow :)\n\n5/8/22\n\nConor Jay Chepenik",
  "wordCount": 1288,
  "readingTime": 5.060377358490566,
  "claps": 0,
  "voters": 0
}