{
  "id": "1516126f5ef4",
  "title": "Day 498",
  "createdAt": "2023-08-03 03:23:52",
  "tags": [
    "java",
    "python",
    "youtube",
    "learn-to-code",
    "content-creation"
  ],
  "url": "https://chepenikconor.medium.com/day-498-1516126f5ef4",
  "content": "# Day 498\n\nI need to write about some concepts I'm trying to understand in computer science so hope you find my teachings valuable anon. Lets start with Object Oriented Programming.\n\nUsing OOP, we could create individual Bird objects, each with their own attributes like age, name, and species. We can encapsulate the data and behaviors of a bird into a Bird class:\n\n```java\npublic class Bird {\n\n  private int age;\n  private String name;\n  private String species;\n\n  public Bird(int age, String name, String species) {\n    this.age = age;\n    this.name = name; \n    this.species = species;\n  }\n\n  public void makeSound() {\n    if (species.equals(\"duck\")) {\n      System.out.println(\"Quack quack!\");\n    } else if (species.equals(\"hawk\")) {\n      System.out.println(\"Screech!\");\n    }\n  }\n\n  // getters and setters\n}\n```\n\nNow we can create individual Bird objects, like `Duck duck = new Duck(2, \"Donald\", \"duck\");` and `Hawk hawk = new Hawk(4, \"Tony\", \"hawk\");`.\n\nEach bird encapsulates its own data like age and species. We can call `duck.makeSound()` and `hawk.makeSound()` to have each bird generate its own sound based on its species. This demonstrates using OOP and encapsulation to manage bird data and behavior.\n\nOn top of trying to learn the Java langauge I also spent time today learning about Python and stayed up late creating a Youtube video on how to create a website with Python and Streamlit. I love it. It's fun to make videos about software engineering. It also makes me feel better about getting a film major in undergrad.\n\nWhen I was at Tufts I'd always say you dim sum you lose sum when ordering General Tso's chicken from my favorite restaurant, Dim Sum cafe. It's an incredible time to be alive and it's never been a better time to learn to code.\n\n![](https://miro.medium.com/0*V5996nblmPieRpNG.jpeg)\n\nRan this twitter poll today. Still early but I think it shows that people I follow and who follow me support similar ideas. At least in regards to politics.\n\n![[https://twitter.com/ConorChepenik/status/1686796831945093141?s=20](https://twitter.com/ConorChepenik/status/1686796831945093141?s=20)](https://miro.medium.com/1*iZSe8Wg9AnmHhOk7Q1vx_Q.png)\n\nBeing anti-establishment appears to be the most based position in politics since the taxpayers have continually been screwed by the two party system. That said, it isn't great social media trends towards echo chambers.\n\nI'm concerned by the hyper-partisanship in politics today that seems to put party loyalty above addressing real issues. For example, the national debt has skyrocketed under both Republican and Democratic leadership over the past decades. Hard-working taxpayers are the ones left paying the bill while wealthy special interests dominate policy conversations.\n\n![](https://miro.medium.com/1*b8cQQzPK24MLGtwStw-wXA.png)\n\nAt the same time, I wish our political discourse on social media encouraged more nuanced thinking. Too often complex issues get boiled down to simplistic memes designed to \"own\" the other side. Not to say I don't love good memes. Just pointing out that memes can also leverage respectful debate and important nuance.\n\nI appreciate all long-form podcasts that feature real discussions. While not perfect, these kinds of conversations help listeners better understand the trade-offs and gray areas inherent in difficult issues across the board. If you have a desire to learn it's never been a better time to be alive.\n\n8/2/23\n\nConor Jay Chepenik",
  "wordCount": 505,
  "readingTime": 2.4556603773584906,
  "claps": 0,
  "voters": 0
}