{
  "id": "15417b4e9d19",
  "title": "Day 3",
  "createdAt": "2022-03-25 19:28:13",
  "tags": [
    "loving-yourself",
    "mental-health",
    "society",
    "health",
    "hope"
  ],
  "url": "https://chepenikconor.medium.com/day-3-15417b4e9d19",
  "content": "# Day 3\n\nMan, I love my life so much. I'm grateful to have my health and the ability to exercise frequently. Most people who complain about everything are depressed because they don't get outside, move around, or seek positive relationships. Instead, they obsess over what people are saying on their social media feeds. Mental illness is a tricky topic because it's more prevalent than ever despite the majority of humans living easier lives than ever. I am by no means saying that mental illness is not a legitimate problem. In the United States in 2020 the CDC recorded [45,941 suicides according to their website.](https://www.cdc.gov/nchs/pressroom/sosmap/suicide-mortality/suicide.htm) Thus, it is clear mental health is a big issue. My point is most people aren't giving themselves a fighting chance to beat mental health. It is no surprise people who don't exercise, doom scroll social media and live unhealthy lifestyles are miserable. There is nuance to this conversation and some people aren't able to do some of these things. If you can be grateful. Acknowledging how lucky you are and making a cognizant effort to put your own health first is a good thing.\n\n![](https://miro.medium.com/0*xtLWFrVBzu0hKjmn)\n\nFor better or worse I've been a relationship guy my entire life. I believe this is because A. \"my game\" is weak and B. I genuinely love myself. Growing up I was always conscious of my weight and would cry when other kids called me Chumpnik. In sixth grade my father let me play Pop Warner football and I was playing with kids 2–3 years older than me because of my weight. The first week of practice was absolutely brutal for two reasons. The first being the older kids absolutely dominated me and the second was the strenuous exercise that took place at practice. I lost ten pounds in the first week just from going to practice. My father helped me drop the next ten and within two weeks I had completely changed my body and got to play with kids my own age since I dropped from the 155 lb weight class to the 135 lb weight class. I felt so much better about myself after losing the weight and no longer took offense when people called me fat.\n\nI'm by no means ripped with a six-pack now, but despite having a lil pudge I don't take offense when others call me fat. I've matured enough to know that when people call you names it's more a reflection of their own insecurities than my own. I ended up dating a variety of girls throughout my adolescence and despite making plenty of mistakes I think the reason I always had girlfriends is that I loved myself enough to know whether or not I wanted to date someone. It's much easier to love someone else if you love yourself first.\n\nI don't advocate for fat-shaming, but I do think our society has grown incredibly soft. Many people would be much happier if they took the time to get their health right. In my own experience when someone doesn't love themselves it usually has to do with their body. You can't fix ugly but you can fix fat. Being fat is hard and so is working out. It just comes down to choosing what pain you want to endure. (To the people who might argue makeup fixes this I'd say make up fixes ugly the same way printing money fixes the Federal Government's budget deficit)\n\nFor those who have health problems that make it harder to lose weight than others I recommend you start doing research about your own body. See if there are tools you can use to cut back on foods that negatively affect your metabolism. Cut out seed oils, eat more locally raised meat, and try different things. Nutrition is not a one size fits all solution.\n\nIn summary, prioritize your own mental and physical health, be grateful for what you do have, and enjoy the comedy found in everyday life. Helping others is great but to do so effectively you must first have a good grasp on your own life. Lots of pain and suffering in this world, but focusing on it won't fix your own problems anon.\n\n3/25/22\n\nConor Jay Chepenik",
  "wordCount": 705,
  "readingTime": 2.8603773584905663,
  "claps": 0,
  "voters": 0
}