{
  "id": "1621f1b4732f",
  "title": "Day 227",
  "createdAt": "2022-11-05 00:19:41",
  "tags": [
    "math",
    "coding"
  ],
  "url": "https://chepenikconor.medium.com/day-227-1621f1b4732f",
  "content": "# Day 227\n\nToday I learned about transitions in CSS which are dope. I thought the hover property was cool, but transitions can take the hover property to the next level. Rather than just immediately changing the pixels when you hover over the item you can slow it down and have a smooth transition. It looks almost psychedelic as it changes when you make it a transition to a different color. Try it out in this code pen anon!\n\n[https://codepen.io/thebinmuckerpod/pen/gOzyqKa](https://codepen.io/thebinmuckerpod/pen/gOzyqKa)\n\nI've found it kind of annoying to try and type code in Medium so I think it makes more sense to leverage something like codepen.io It's pretty cool that you can just build stuff straight from your web browser. It has never been easier and more difficult at the same time to learn coding. Easier in the sense you no longer need to master a terminal to code but more difficult in the sense new languages, tools, and frameworks seem to be constantly popping up. Or better yet constantly updating and adding new features so there is a learning curve testing out all the new features. I am constantly reminding myself the journey of 1000 miles begins with one step and it has quickly become clear if I am going to succeed in this field the biggest thing I can do is be open to constantly learning.\n\nLearning is fun though. Especially when it is done informally. It is also worthwhile to write about what you learn. See something useful, steal it, link to where you found it, and put your own spin on it. Like this photo I found on Twitter.\n\n![[https://twitter.com/jeffkortenbosch/status/1513755811008454661?s=20&t=_4idwWjp4r6rdI6cPHul9w](https://twitter.com/jeffkortenbosch/status/1513755811008454661?s=20&t=_4idwWjp4r6rdI6cPHul9w)](https://miro.medium.com/0*9AgabKivknNZlsEz.jpeg)\n\nCurate your social media with people providing signal. There are people who can make powerful memes that convey important messages, there are people who post great links, there are people who do a bit of everything in between, and then there are people who every time you come across their posts you feel dumber. Curate for the first three and unfollow the latter.\n\nIf you enjoyed playing with transitions in codepen here is a website I came across that is pretty helpful for creating transition functions [https://easings.net/](https://easings.net/)\n\nIt's amazing how many things have been created and open sourced. I'm reminded of when I was going through middle school starting to do math that was a little harder than my elementary school so we got to use calculators. I remember thinking well if I have a calculator this should be a piece of cake, but then you quickly realize the calculator still has to compute a lot of stuff and you have to be able to enter the correct things for it to compute. Thus, it's important you learn about the basics like addition, subtraction, multiplication, and division so you understand what you are putting into the calculator. Once yI got into algebra and beyond I started relying on the calculator a lot more to handle the basic math. It's a double edge sword though because it's easy to become so reliant on the calculator that you forget how to do long division. I think there are a lot of similarities to coding. It's important to learn the fundamentals so you know what the code is doing, but at the same time it's tempting to just copy and paste some pre-built functions rather than spend an hour coding up your perfect transition function.\n\nGoing back to the basics is important. I don't want to lose sight of how to do the basic stuff as I get deeper into my journey. That definitely happened to me in math during my education. I became so reliant on a calculator I forgot how to do long division.\n\nSmile anon. Life is too short to be bitter. Even if you forgot how to do long division. Might go watch a youtube video to remind myself lol.\n\n11/4/22\n\nConor Jay Chepenik",
  "wordCount": 647,
  "readingTime": 2.6415094339622645,
  "claps": 0,
  "voters": 0
}