{
  "id": "1653cd34915f",
  "title": "Day 159",
  "createdAt": "2022-08-28 20:21:05",
  "tags": [
    "clown-world",
    "eating-bugs"
  ],
  "url": "https://chepenikconor.medium.com/day-159-1653cd34915f",
  "content": "# Day 159\n\nI've always been a big believer in being open minded. It is important to realize that all people are constantly trying to figure out this weird life thing we are doing while alive. Some have done a much better job than others, but overall no one has truly figured it out. That is where faith in a higher power comes in. Faith that \"good, love, truth\" will be waiting for our soul in the afterlife. I bring this up because I've been seeing a lot of stuff online about replacing meat with bugs and it is hard to keep an open mind for stuff like that. This has got to be the stupidest idea I've seen in a long time... I mean come on. While it's important to consider various perspectives this is not one I have any patience for. How on earth can someone think that bugs are a viable replacement for cows which humans have been eating since well we've existed as a damn species!\n\nI have heard of some cultures eating bugs. Maybe in a pinch there is some validity to eating bugs. Like if you have no other forms of food I could understand it. However, to mass produce crickets and make cricket powder that just seems ridiculous to me. We should be regenerative farming and raising cows properly. Letting the cows roam grass and fertilize the soil with their poo. Not mass producing crickets to make crappy junk food both cheaper and crappier. Money is a powerful tool. If the money is broken it seems we get stupid ideas like using crickets & larva as a way to make food cheaper. It is my opinion these ideas need to be mocked and ridiculed. I truly believe having an open mind and being open to dialogue is key to a functioning democracy. I just do not think that there are many good faith discussions to be had about what is better for humans, cows vs bugs.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1563919693106544640&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI tweeted this before reading the article because it seemed so ridiculous. However, after starting to write I realized instead of preaching about being open minded I will practice what I preach. So I just read the article and I'd like to show some quotes from this propaganda puff piece about why big food should add insects to their products.\n\n> Insects are \"truly eco-friendly and more efficient in comparison to typical livestock,\" said Cho.And they're a good source of protein. Despite their ecological and nutritional benefits, mealworms still face a challenge that prevents them from readily finding their way into meals: the ick factor. Customers are just grossed out by mealworms, said Cho.\n\n> \"Insect farming requires just a fraction of the land, water, and feed in comparison to the traditional livestock farming,\" said Cho. \"Edible insects are superfoods.\"\n\n🤡 🌎  does not make it easy to keep an open mind man. I would argue that cows being lined up in a slaughter house is not eco friendly and the meat gets tainted when they are stressed right before they are slaughtered. However, cows living a proper life and grazing on a field is incredibly eco-friendly. It can be great for the environment if we raise cows right. I also don't buy that edible insects are superfoods. I've seen reports about how bugs contain viruses and other stuff which is toxic for humans. It makes sense that the same bugs that often spread disease would not be great food proudcts. the only way bugs are superfoods is in the sense they will kill your immune system real fast.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/burackbobby_/status/1563764991718838272&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMore examples of 🤡 🌎  . There is no shortage these past 2 years. Glad people are waking up and asking tough questions though. It is time we start having open discourse instead of fear mongering and acting like science is settled when the reality is science can never be settled. Science is about testing and updating our models based on those tests.\n\nBeing open minded is not the same as accepting every narrative without doing your own research. I'm glad I took the time to read that article and see the perspective they are trying to argue from. I don't think bugs are a more eco-friendly and healthier solution than red meat. Having an open mind allows me to see their perspective and call out the bullshit. Being close-minded would mean I don't consider any perspective that doesn't agree with my narrative.\n\nTimes are ah changing. I'd like to get some land and learn how to code. Mimo has been so hopeful with the coding aspect. Podcasts and youtube will be pivotal to learning how to do solid regenerative farming. I want to be more self-sovereign in my life and not accept eating bug filled cheese puffs for a snack. We have so much entertainment at the tips of our fingers it's hard to see the signal through all the noise. Like I discussed yesterday information is some powerful shit. If you don't know where to look it's hard to verify stuff for yourself. That's not to say I don't get it wrong all the time. I'm just doing my part to seek truth and think critically.\n\nGood habits, not being so quick to judge, and keeping an open mind while not being so quick to blindly trust narratives seems to be helping me seek truth. Life is a journey anon. We got to do our part to put the pieces together while realizing there will be new science that comes out and we should update our models when new facts present themself.\n\n8/28/22\n\nConor Jay Chepenik",
  "wordCount": 942,
  "readingTime": 3.5547169811320756,
  "claps": 0,
  "voters": 0
}