{
  "id": "16d78daaf314",
  "title": "Day 501",
  "createdAt": "2023-08-05 16:24:17",
  "tags": [
    "sql"
  ],
  "url": "https://chepenikconor.medium.com/day-501-16d78daaf314",
  "content": "# Day 501\n\nFound this old 💎  I made back in college. Did not want to lose it when I upgrade my computer some day so I uploaded it to Youtube for safekeeping.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fs_yntfCSZP4%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Ds_yntfCSZP4&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fs_yntfCSZP4%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThere are for sure some cringy moments but there are are also some hilarious ones. Filmmaking is not as easy as it looks, but being on set with your boys is always a good time. I particularly enjoyed the blooper reel section. Feels likes yesterday I made this even though I'm pretty sure it was well over ~4 years ago.\n\nAnyways, enough about my film & media undergrad days. Now I'm trying to improve my computer science skills. So for the rest of today I will be writing and answering questions about SQL. Which might seem random, but for me writing out stuff I need to learn is extremely helpful in terms of me learning it so bear with me anons.\n\n1. What are the different ways to show a result set of two tables records?\n\n- JOINs (INNER, LEFT, RIGHT, FULL OUTER) and UNION\n\n2. What aggregate functions could I use to return the number of rows in my table?\n\n- COUNT()\n\n3. What is the difference between ORDER BY and GROUP BY?\n\n- ORDER BY sorts the result set. GROUP BY groups rows with matching values.\n\n4. What is the WHERE clause?\n\n- Filters records that meet a specified condition.\n\n5. What is the HAVING clause?\n\n- Filters grouped records that meet a specified condition.\n\n6. What could I use in my query if I wanted to get the average amounts of salaries from my Salary Table?\n\n- AVG() aggregate function\n\n7. What would this query look like in my column was called salaries?\n\n- SELECT AVG(salaries) FROM SalaryTable;\n\n8. What are the sublanguages of SQL and list some of their associated commands.\n\n- DDL (CREATE, ALTER, DROP), DML (SELECT, INSERT, UPDATE, DELETE), DCL (GRANT, REVOKE)\n\n9. What is a result set?\n\n- The output of a SQL query.\n\n10. What does RDBMS stand for?\n\n- Relational Database Management System\n\n11. What does it mean to be a relational database?\n\n- Data is stored in related tables with foreign key relationships.\n\n12. What is a Schema?\n\n- The structure of a database including tables, columns, datatypes, constraints.\n\n13. Describe the Primary Key?\n\n- Uniquely identifies each record in a table.\n\n14. What are some SQL datatypes?\n\n- Integer, Decimal, Varchar, Date, etc.\n\n15. What is a database?\n\n- Organized collection of structured data stored electronically.\n\n16. How would I insert data into a table?\n\n- INSERT INTO table (columns) VALUES (values);\n\n17. Let's say you made a table and miscalculated how many characters you needed in a column. How would you modify the buildingID to accept 3 characters rather than 2 characters?\n\n- ALTER TABLE building MODIFY buildingID CHAR(3);\n\n18. How would I create a numeric datatype that accepts decimal values in SQL?\n\n- DECIMAL(precision, scale)\n\n19. What is the difference between CHAR and VARCHAR?\n\n- CHAR has fixed length, VARCHAR has variable length.\n\n20. What is the difference between DELETE and TRUNCATE?\n\n- DELETE removes some rows, TRUNCATE removes all rows.\n\n21. How would you Select all from a table in SQL.\n\n- SELECT * FROM table_name;\n\nBonus question: What is a foreign key and how does it relate two tables?\n\nA foreign key is a column or set of columns in a table that references the primary key of another table. It creates a link between the tables and enforces referential integrity, ensuring that the foreign key matches a value in the referenced table's primary key. For example, an Order table might have a foreign key linking to a Customer table so each order is associated with a specific customer. The foreign key relates the two tables together.\n\n___\n\nSo there is some knowledge about SQL and some random video about a screenwriting class. Day 501 is quite a random entry but that's okay. I would like to practice being better about focusing on only things I care about. What fuels the greats is intrinsic motivation. While it's human nature to fixate on external validation, true mastery requires charting your own course. The sooner we stop seeking the world's approval, the faster we will achieve our highest potential.\n\n8/5/23\n\nConor Jay Chepenik",
  "wordCount": 697,
  "readingTime": 2.630188679245283,
  "claps": 0,
  "voters": 0
}