{
  "id": "180b10b5eaed",
  "title": "Day 492",
  "createdAt": "2023-07-28 03:42:10",
  "tags": [
    "virtue",
    "convenience",
    "chinese-bbq",
    "frens",
    "freedomtech"
  ],
  "url": "https://chepenikconor.medium.com/day-492-180b10b5eaed",
  "content": "# Day 492\n\nI believe that the best way to truly understand something is by teaching it. So I made a coding video about creating a website.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F5ZqLiJzpbnI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D5ZqLiJzpbnI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F5ZqLiJzpbnI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIt's never been a better time to learn a new skill. Yes AI can hallucinate but it can also be a tremendous tutor. If used as a tool to help humanity innovate we can create cheap, abundant, and plentiful energy for the entire world.\n\nFor my next coding video I plan to build a next.js app from scratch. Good to start with the basics first.\n\nTonight a buddy from my bitdevs meetup took me out to Chinese BBQ. Despite being a seasoned connoisseur of Chinese cuisine, I had yet to indulge in the delights of Chinese BBQ. I feel truly blessed to have finally savored this culinary marvel after 26 years.\n\nThe flavors that danced on my taste buds were a perfect blend of sweetness and spiciness, unlike anything I had ever encountered before. Which is ironic because I've had a lot of sweet and sour sauces in my life. The masterful use of unique spices elevated the taste to new heights, especially when paired with the delightful crunch of cabage and scallions. Every bite was a symphony of tastes, leaving me utterly captivated by the delectable delights. They even had a tofu dish fried in fish oil which tasted like good fish.\n\nTo add to the magical ambiance, my friend, who is fluent in Mandarin, engaged in conversations with the native speakers at the restaurant. Hearing their seamless exchange in Mandarin was an oddly satisfying experience and brought an authentic touch to the entire evening.\n\nIn retrospect, the evening was a tapestry of new experiences, flavors, and cultural encounters. Even got a Thai ice tea on my walk back to mi casa.\n\nWhen I got home I popped open primal, the Nostr client, instead of Twitter. Good decision.\n\n![](https://miro.medium.com/1*KUAZW_eeXV0hm13Dty8r0g.png)\n\n![](https://miro.medium.com/1*78adHNkNmTSB6QqbD4pyAw.png)\n\nNostr is the best. Freedom tech rules so hard and will win. That said we must keep in mind convenience is so important. It's easy to just opt into apps and not have to deal with human interactions. Which isn't great but we can all make an effort anyways to not let our phones be an excuse to avoid meatspace contact with other humans.\n\nAt the Chinese BBQ joint we ordered all the food via one app which was amazing because if you needed a beer it was just a quick boop bop. Of course we were kind to our waiters and also had interesting conversations amongst peers at dinner.\n\nLife is a long journey. Karma is real and you will get back from the world what you put in. So optimize your goals as conveniently as possible so you can achieve great things. Yes I like that. Good riff.\n\nP.S - never stop challenging some core assumption. For me that assumption is if fiat money is necessary...I deeply believe we can have better technology for money than currency backed by debt (IOUs) & violence\n\nP.S.S - by challenging assumptions, we are less likely to make decisions based solely on tradition or convention. Instead, we make decisions based on a deeper understanding of the situation and the potential consequences. Which is good because exponentials can cut both negatively and positively.\n\n7/27/23\n\nConor Jay Chepenik",
  "wordCount": 549,
  "readingTime": 2.4550314465408807,
  "claps": 0,
  "voters": 0
}