{
  "id": "18660386a4e",
  "title": "Day 207",
  "createdAt": "2022-10-16 02:15:07",
  "tags": [
    "south-carolina",
    "yin-and-yang",
    "traveling",
    "drinking",
    "family"
  ],
  "url": "https://chepenikconor.medium.com/day-207-18660386a4e",
  "content": "# Day 207\n\nGot to enjoy South Carolina today with my Dad, sister and freshman year roommate. My Dad is trying to sell me pretty hard on the area so I move down here with my girlfriend and daughter. I have enjoyed my time here and we had a really nice time checking out Greenville, a mountain top between North & South Carolina, and going out for dinner & drinks in downtown Anderson. Here are two photos from the day.\n\n![](https://miro.medium.com/1*9-mzC3JauahnV1KK0BMT0w.jpeg)\n\n![](https://miro.medium.com/1*OUOlTTwQGQ2cl-45lqCjbA.jpeg)\n\nSouth Carolina is a great area and I'm grateful I got to visit and see my Dad's new spot. Still not convinced enough to leave Massachusetts but a lot can happen between now and April 2023 when my lease in Cambridge expires.\n\nIn Greenville today there was a festival going on called \"Falling For Greenville\". We brought our dog Sammye and so many people came up today to pet her. It was both sad and funny how many people commented about what a well behaved dog Sammye is because in the past she has been notorious for barking like crazy and not listening. Recently our Rottweiler Kobe passed away and since then Sammye has been incredibly well behaved. It's nice seeing Sammye behave and it's also nice getting so much attention. So many people wanted to come up and pet Sammye. That said, it was bittersweet watching Sammye on her best behavior since Kobe is no longer here. Not sure why that has caused her to mellow out so much but it is significant how much more calm Sammye is without Kobe. Maybe without an alpha male dog in the house Sammye doesn't feel the need to act up.\n\nI'd love for my girlfriend to come visit South Carolina soon. I'm not sure she would be convinced to come move down here but I do think she would like the area. It's so cool seeing how even in the United States the different states have areas that are completely different from each other. This country is a special place and the more states I get to visit and experience the more my pride in this United States grows. I have many qualms with our federal government but I fall more and more in love with the people of this nation. The world is full of incredible people and if you don't travel and get outside your own echo chamber you may miss out on all the incredible things out there anon.\n\nI'd also like to note that my Dad does not drink often but when he does it's A LOT. HAHAHAHA the man does not casually drink beer, wine, or a mixie. When my Dad is drinking he goes hard. Kind of the opposite of my Mom who likes a glass of wine at night but rarely drinks to get drunk. Funny how opposites attract. Yin and yang I guess.\n\n![](https://miro.medium.com/0*lpSz6nI03tZYZKiK)\n\n10/15/22\n\nConor Jay Chepenik",
  "wordCount": 483,
  "readingTime": 2.3726415094339623,
  "claps": 0,
  "voters": 0
}