{
  "id": "19ea438ca53d",
  "title": "Day 444",
  "createdAt": "2023-06-10 02:33:27",
  "tags": [
    "ai",
    "children",
    "good",
    "evil",
    "future"
  ],
  "url": "https://chepenikconor.medium.com/day-444-19ea438ca53d",
  "content": "# Day 444\n\nToday I was looking at my daughter after she fell asleep and all I could think was that's the best thing I've ever done. Create another human. Well help create another human. My partner did the heavy lifting of course. Your heart changes when you have a kid. My Dad would always talk about how I just wouldn't understand until I had one and he was right. What I think he missed though is I'm sure it's different for every person. Didn't hit me immediately when I had the kid, but everyday that goes by and my lil lady gets bigger I change. For the better I hope; it feels like it.\n\nI've been enjoying reading Russel Okung's posts about fasting. I fasted yesterday and it felt good. I'd like to try and do a week of fasting. Props to Okung for fasting for 40 days.\n\n> [**Okung Fast**](https://blog.okungfast.com/)\n\nI think there is a nice clarity that comes with fasting. This morning I broke my fast with coffee and honestly felt a bit dizzy. Followed the coffee up with left over panang curry and my nose was all stuffy afterwards. Kind of a wild food to break a fast with. Whatever, it was delicious.\n\nLife can suck sometimes. I've felt a bit sad these past couple days. Don't know why. It just kind of feels like the world is going a bit mad. The reality is I'm spending too much time on my phone. Also didn't run these past 2 days which is something I usually do to force myself to be in a better mood. Playing basketball tomorrow so everything is going to be okay. Writing this as a reminder to exercise if we ever feel depressed 🤝 Also while I know social media is not real life I must admit it was crazy seeing photos of New York having orange skylines. Especially because I was in New York two days before this happened.\n\n![](https://miro.medium.com/1*DH__n1qk3pqHqTJJ84Qitw.jpeg)\n\nScary image. I hear in that game though you play as the good coming to kill the devil. Feels like there is a battle of good and evil going on. Good will win because good is that feeling you get in your heart when you look at your child. Your baby girl or boy and understand you would do anything for that little person.\n\nFor a significant period of time, I held the belief that every action humans undertake is driven solely by self-interest. This perspective even encompassed virtuous acts, such as willingly endangering one's own life to rescue their children, which I believed were motivated primarily by the desire to ensure the continuation of one's own legacy. However, my perception underwent a profound transformation when I became a parent myself and experienced firsthand the depths of love and care that accompany the arrival of a child. It was in that moment that I realized the truth: when you genuinely care for someone or something, such as your own child, your actions transcend self-interest. The inherent love and attachment you feel for that precious life surpass any other concern. In fact, these selfless acts of safeguarding and nurturing are driven by a profound desire to see goodness prevail. It is through these acts that we create the best opportunities for positive outcomes to emerge, and ultimately, for good to triumph.\n\nI'll leave you with this. You can focus on the good or you can focus on the bad. History is rhyming like crazy and with hyperinflation on the horizon the life boat is here. Get on now or regret it later. Your children will thank you.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FXhnd8rL-3YA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DXhnd8rL-3YA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FXhnd8rL-3YA%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>",
  "wordCount": 625,
  "readingTime": 2.558490566037736,
  "claps": 0,
  "voters": 0
}