{
  "id": "1ab29897b262",
  "title": "Day 186",
  "createdAt": "2022-09-24 18:50:56",
  "tags": [
    "bitcoin",
    "mission"
  ],
  "url": "https://chepenikconor.medium.com/day-186-1ab29897b262",
  "content": "# Day 186\n\n![Photo by Crypto Crow: [https://www.pexels.com/photo/person-holding-silver-bitcoin-coin-1447418/](https://www.pexels.com/photo/person-holding-silver-bitcoin-coin-1447418/)](https://miro.medium.com/0*sEWFfuejCizsuqAr)\n\nSome dude who delivers drugs to my Mom (she is a pharmacist) so technically this dude is a legal drug dealer called me because my Mum told him I'm into crypto. Nice guy and I love talking about Bitcoin with anyone so he called me and I answered. Interesting conversation and he kept asking me about various shitcoins. I politely told him that I think the only thing that matters is fixing the money so Bitcoin is what interests me. I was respectful of course and didn't tell him I think the broader crypto market is a massive dumpster fire. I advised him to read The Bitcoin Standard and learn why alt-coins are not so decentralized and the biggest priority facing the world is fixing the money first and foremost.\n\nFeels good. Everyone has their own journey and I played with shitcoins at first. Takes time to learn but I'm proud I put in that time and now I can confidently share my opinion with others and feel good about the reasoning. Bitcoin is special and it makes me feel like I have a positive mission in this world. TYB!\n\nMy girlfriend's brother and his girlfriend are up this weekend. I love showing people Boston because it is a historic city full of rich history. Easy to forget that since I live here but Boston really is a special place.\n\nAnyways, that is all for today. Need to spend less time on Twitter but my god it is hard to look away with so many things in the world going wild. I'm very lucky though to be in the spot I am in and I'm happy that with every passing day it becomes more clear my mission in life is spreading the good word of Bitcoin & raising a family. Well the latter part coming soon here anyways. Not to mention both these go hand and hand because part of raising a family is doing what you can to make the world a place you are proud to bring children into and as I see it Bitcoin makes the world that place. It gives humanity the hope for a brighter future where there is abundance and the masses can't be robbed by kleptocrats. BANG BANG!\n\n9/24/22\n\nConor Jay Chepenik",
  "wordCount": 382,
  "readingTime": 1.641509433962264,
  "claps": 0,
  "voters": 0
}