{
  "id": "1b81befa028e",
  "title": "Day 251",
  "createdAt": "2022-11-29 02:11:39",
  "tags": [
    "bitcoin",
    "ultrasound",
    "daughter",
    "fiat",
    "new-system"
  ],
  "url": "https://chepenikconor.medium.com/day-251-1b81befa028e",
  "content": "# Day 251\n\nMy Girlfriend and I got an ultrasound today. Not the best quality photo but it still blows my mind this little girl is my daughter. I can not wait to meet you Sloan. :)\n\n![](https://miro.medium.com/1*qi6B3fecc89sbTJdL8EA0g.jpeg)\n\nAfter the ultrasound I came back and wrote more of my article for Bitcoin Magazine. Then I hit a 5 mile run and came back for more corrections. I'm sure I could spend another week tweaking this to make it better but alas I felt like it was time. I can always start another one later but I'm pretty proud of what I accomplished with these past couple posts dedicated to building out my article. I've submitted it to the new editors at Bitcoin magazine, fingers crossed they accept it. I know they are focused more on the print issues rather than online ones at the moment.\n\nEither way here is the finished draft for now (pending changes the BM team might recommend)\n\n**Bitcoiners Are Trying To Stop The Bleeding**\n\nWhen a Doctor operates on a wounded patient the first thing they have to do is make sure they can stop the bleeding. There is no point operating on someone if you can't get the bleeding under control because they will die. The same goes for your wealth. Fiat currencies are bleeding out in value which is incentivizing less people to save. If you want to stop the bleeding in your financial life you are going to need to find a way to store your wealth in something else. There are plenty of options but only one that is programmed to stop all bleeding in 2140.\n\nThe people's money is not the only thing being bled out. Our education, time, and I'd even argue our mental sanity are being \"bled\" by bad actors. Blood isn't oozing out egregiously but rather being siphoned off from tiny cuts so the majority of people don't even realize it is happening. This is a hard pill to swallow. Most Western societies teach people not to question authority, raise your hand if you want to ask questions, and trust the experts. Breaking out of this mentality is difficult. Watch this[ clip](https://twitter.com/canindependent/status/1595460390045028352?s=20&t=qIFHdHF4A-8z4nmfle5Mqw) of the White House Press Secretary to get an idea of how those at the top will treat people who dare question the narrative.\n\nWithout a controlled narrative those at the top would not be able to coerce the masses to accept a \"Great Reset\". If you have no idea what the Great Reset is you can read about it [here](https://alilybit.substack.com/p/what-the-fuck-is-going-on). The scope of this article is not to dig into what Davos is attempting to impose on the rest of the world, but rather why Bitcoin fixes many of the problems we see in society today. It is a near impossible task to try and calculate the variables that bring about the emergent complex behavior of society. It should not be a surprise that the past two years have been full of chaos in the form of riots, protests, and supply chain issues. This is a byproduct of Governments stealing trillions of dollars from their citizens via quantitative easing and blaming their theft on covid-19. The Federal Reserve is following up its quantitative easing with tightening monetary policy at record paces trying to get inflation under control. This demand destruction is wreaking havoc all over the economy and weeding out unprofitable businesses. The silver lining is that pain is the best teacher. A great example of this is Trezor (a hardware wallet provider) reporting a 300% increase in sales revenue after the FTX debacle. My heart goes out to those who lost money because they decided to trust FTX. If you have not spent countless hours learning about Bitcoin and why holding your private keys is so important it is understandable why one would trust FTX. They seemed to have the stamp of approval from every mainstream news outlet, politician and celebrity in the space. Their fraud was so egregious that many people are waking up and starting to see through the charade. Even the puff pieces are being exposed and tarnishing the credibility of once notable media outlets.\n\n![](https://miro.medium.com/0*NyNBpbGzCQsn0zqE)\n\nThe remedy to most people's problems is a better education. With the internet the barrier to get an education has never been easier, but with this comes tons of distractions in the form of social media, video games, and all the other stuff you can find on the internet. What made me spend more time learning instead of mindlessly scrolling my feed is Bitcoin. As I went down the proverbial Bitcoin rabbit hole it became clear how much people are not taught during their traditional schooling. It is important to note that when you find an answer to one thing you have been studying you typically end up with twice as many questions. That number grows exponentially as you continue learning. There is only so much time in the day and teachers must prioritize their curriculums accordingly. I just have a hard time understanding why taxes, how to vote, and basic financial literacy aren't at the top of most public school curriculums. I'll let the reader come to their own conclusions why those things are not taught in most schools. What's important is finding a teacher that speaks your language and a subject that brings out your natural curiosity. Learning becomes one of the most euphoric feelings in the world when those two needs are met.\n\nThe standard way of learning has horrible mental models for teaching people. Memorizing things for a test is not a great way to learn any subject. Asking permission to apply your newfound knowledge on a project is the wrong mental framework. Those who changed the world for the better didn't ask for permission to make the world a better place. They just did it. People want a hero to fix all their problems but the truth is no one is coming to save you. The hero's journey starts with identifying your heroes and the dysfunctional relationship that might be present. For many S.B.F was a hero who turned out to be a villain. I'm not saying don't find great mentors; it's super valuable being able to listen to those who have become experts in their field in order to learn. The problems start when people worship someone like a God who can't make mistakes. S.B.F is on the record talking about how his biggest regret after this whole debacle is not being able to try and trade his way out of a multi billion dollar hole. Seems like stealing from customers should be his number one remorse but then again if I was a multi-billionaire by the time I hit 30 I'm sure it would be hard not to develop a God complex.\n\n![](https://miro.medium.com/0*ek_Jg-Or_XIuuQmr)\n\nI hope those who lost funds in FTX will learn from the pain and come out as stronger and more resilient individuals. Most people come to understand the difference between paper bitcoin and bitcoin you actually hold the keys for via an expensive lesson. Once the majority of people slay their heroes, self custody their coins, and stop blindly trusting others is when the world will really see fireworks in regards to Bitcoin's price action. Every person is different and has various forms of risk tolerance. This is the time where those who learned a valuable lesson double down on their education and help the next round of newcomers learn so they don't end up making the same mistakes. The more educational content Bitcoiners can put out the more we can help to minimize the initial pain for those looking to get off zero. Rome was not built in a day. Sometimes the only way to get a lesson through someone's head is for them to suffer the initial pain that results when you start learning about a new subject.\n\nWhat is interesting about watching FTX fail so rapidly is the same thing would happen with our traditional financial system if we didn't have Central-Banks acting as lenders of last resort. It was gross and wrong of S.B.F to take customer funds and trade them, but when a registered bank does it 99.9% of the world either turns a blind eye or just does not know this is how fractional reserve banking works. In his book _Human Action_ Mises writes,\n\n> \"The rich, the owners of the already operating plants, have no particular class interest in the maintenance of free competition. They are opposed to confiscation and expropriation of their fortunes, but their vested interests are rather in favor of measures preventing newcomers from challenging their position. Those fighting for free enterprise and free competition do not defend the interests of those rich today. They want a free hand left to unknown men who will be the entrepreneurs of tomorrow and whose ingenuity will make the life of coming generations more agreeable. They want the way left open to further economic improvements. They are the spokesmen of progress.\" (p. 83)\n\nTechnology should be rapidly reducing prices for the majority of things in the world. Unfortunately, regulatory moats and monopolies prevent this. Think about Apple and Google who have massive monopolies on their app stores. If you release a phone application you will have to go through Apple and Google unless you want the app to only be used by the small minority of people who don't use the Google Play/Apple App Store. FTX tried to create their own monopoly by lobbying Congress and creating a regulatory moat around their business that would've made it impossible for competitors to compete. They spent tons of money lobbying regulators and donating to the Democrats. The world is fortunate their system blew up before FTX was able to get their way with D.C because if the leaders at FTX were willing to use customer funds as they saw fit one can only imagine what they would have done to the crypto industry as a whole. As a Bitcoin maximalist I'm not worried about the other coins but I feel very strongly that Mises was right. The invisible hand will regulate and figure out what makes our life more agreeable. Bitcoin has over 10,000 competitors and that number is growing everyday. I don't think any of them can compete with Bitcoin in the long run but that isn't for me alone to decide. It is the market's job. We need more people advocating for a free hand that lets entrepreneurs innovate. Ultimately, the great entrepreneurs won't ask for permission. They will just build like Satoshi did. The reason I advocate for free markets and less regulatory moats for the incumbents is because free markets will increase the speed of hyper-bitcoinization so we can get to a world where one doesn't have to hold the majority of their wealth as a liability on a bank's balance sheet.\n\nWhat's beautiful about the Bitcoin space is that there is such a wealth of amazing individuals and incredible content if you look in the right spots. I'm constantly blown away by how lucky humanity is to have access to conversations amongst the smartest people in the world that wouldn't otherwise be accessible without the internet. Imagine explaining the modern day wonders we have like the ability to send messages instantaneously anywhere in the world, to use the little piece of glass in our pockets to hail a ride, order food, and listen to some of the greatest minds on the planet whenever we want. Technology is magical. Of course there are going to be many hiccups along the way as humanity tries to come to grips with these new tools. I've had this Hal Finney quote as my Twitter header for quite some time because I believe it is highly relevant to what we are seeing in today's society.\n\n![](https://miro.medium.com/0*cFFc1hHPiBCPJHtn)\n\nFor all the wonders technology can do for humanity it can also drive a whole new level of control. Markets need to be free and open for optimal price discovery. Too much central planning and markets will break down. Price discovery in a free market is like a hash function. It takes inputs of data and spits out an output that only goes one way. With a normal hash the algorithm works so that it is unfeasible to reverse calculate the data. You can verify a hash by making sure the same output is achieved based on the input but you can't take the output and figure out the input. In this same vein a free market will set the price of a good but you can't figure out how all the labor, work, travel, and other variables that went in to deliver said goods were calculated. The function only goes one way. Since price discovery only goes one way it is hard to see how manipulated free markets can become when central planners start meddling in them. People get upset with the price increases that result but the blame is typically pushed on to the producers rather than the central planners who are causing such issues. Sound familiar? Like say the U.S government who is calling out \"greedy fossil fuel companies\" for raising the price of gas while at the same time advocating for the end of fossil fuel use. These problems only get worse when price controls are imposed and price discovery completely breaks down resulting in shortages. Until the creation of money is no longer heavily intermingled with politics these issues will continue to play out.\n\n![](https://miro.medium.com/0*JUep1VkGtWBB-GSZ)\n\nThe chart above shows what exponential growth looks like. Exponential growth is hard to fathom but that is what's coming with the Bitcoin network. A heavily used analogy for Bitcoin adoption is the .com bubble of the early 2000s. 22 years later and most internet companies went bankrupt but the ones that survived like Facebook, Apple, Amazon, Google and others built on the TCP/IP protocol and changed humanity in ways that seemed unimaginable not long ago. These companies have made the life of the average human being better and they have also given Governments the ability to increase their authoritarianism. As CBDCs and digital identities are rolled out it has never been more important to point out how Bitcoin fixes this. Bitcoin allows the individual to go down a hero's journey where they can keep the value of their labor in their head. CBDCs and digital IDs offer Nation-states a tool to enact monetary policy at the individual level, be at the center of every transaction, and turn off people's money if they post something online that goes against the Government's approved narrative.\n\nOne Bitcoiner I enjoy following is[ Bruce Fenton](https://twitter.com/brucefenton) who has been getting a lot of slack on Twitter recently for saying that self-custodying bitcoin is difficult. He is absolutely right. It is very difficult to self-custody your bitcoin in an ideal manner. Especially if you have large amounts of money stored in Bitcoin. That's the beauty of this network though. Your wealth rests on complete ownership of how you create your setup. Everyone has different tradeoffs to consider and the majority will not take the time to remember 12 words to store their entire net worth in their head. Considering these tradeoffs is part of every Bitcoiner's hero journey. It might not be a bad idea to store a little bit of bitcoin in your memory for a rainy day. There is no limit to the amount of wallets you can have so it makes sense to split up your bitcoin into various UTXO setups. Everyone's situation is unique and the fact that Bitcoiners have that option is what matters.\n\nBitcoin empowers and offers a better system. One where people take full responsibility to play the game where they know there is no central authority who can manipulate the rules. If you try to cheat Bitcoin it will come back to bite you.[ Preston Pysh](https://twitter.com/PrestonPysh) said it best \"Bitcoin is like the infinity stone.\" It takes a great deal of faith to hold on to an asset that has had multiple 70–90% drawdowns before recovering to new all time highs. Not many can hang on to their bitcoin but those who do over long periods of time are greatly rewarded. The network effects of this thing are insane. There is a[ Bitcoin website](https://bitcoin.rocks) paying people 21,000 satoshis to post a sticker (that is shipped to you) somewhere in your city. Think about that. If you are willing to use your time to spread the good word of Bitcoin you can earn sats because a \"human node\" cares enough to pay people to do this. The tech is exciting, but I don't think many understand how passionate Bitcoiners are and their unwillingness to budge on the rules ingrained in the code that makes up Bitcoin.\n\nDespite often being grouped with utter crap Bitcoin is the zero to one invention that changes everything. Bitcoin as a technology, a new form of money, and an idea are bringing hope to humans around the world who have been disadvantaged because of the place they were born. Bitcoin is like the self help book that you didn't know you needed. Most self-help books are super cheesy and offer no tangible advice other than \"you can do it if you believe in yourself\". Which is true but how does one begin to believe in themself? Action. As far as I can tell the only way to make progress is to take action, fail, and learn from those mistakes. Bitcoin helps with this tremendously. I've consumed more podcasts, books, articles, and even written some of my own because of this magic internet money. I've driven my family mad because I won't stop talking about it. Luckily, my Grandparents like listening to me and they typically follow up my rants with \"Conor I'm so proud of how much your vocabulary has grown and how knowledgeable you are on this stuff but I didn't understand half of what you just said.\" Which turns out to be an amazing feedback loop because it makes me go back and try to synthesize my ideas into more coherent ones. When my Grandparents understand my rants is when I know I have developed a solid understanding of the thing I'm trying to articulate.\n\nThe future is bright. There will be growing pains along the way and more turmoil in the short term for those obsessed with measuring things in fiat. The way to fix that is to orient yourself around the new system. To spend more time with all the incredible minds in the Bitcoin space. To seek knowledge from those who are starting to realize that humanity is entering another renaissance. The barrier to entry has never been lower. All you need is an internet connection and a desire to learn. After spending thousands of hours listening to various Bitcoin podcasts I feel like I'm best friends with so many in this space who I've never actually spoken with. Luckily, they don't need to speak to me in order to keep putting out amazing content. They are doing it because they see a similar future that only Bitcoin can bring. The things that will come out of this Bitcoin renaissance are going to seem unimaginable in the same way that if you took someone from 100 years ago and played them a podcast with your iPhone they would be freaking out looking around for the person speaking.\n\nThe world is full of weird paradoxes. When you learn you become smarter by ending up with more questions. Monopolies have brought about some of the most prosperous and technologically advanced times in human civilizations while also making Orwell's 1984 look like a very plausible path for humanity. Bitcoin benefits the most when the Government is stealing from the people via money printing (quantitative easing) because a lot of its holders still treat it like a risk on asset. The internet is connecting people like never before and at the same time loneliness is reaching all time highs. Self custody of bitcoin is hitting all time highs because one of the largest exchanges in the world blew up and people realized that they owned a paper claim to bitcoin not the actual thing. Greed is what attracts people to Bitcoin because they want to increase their purchasing power yet many stay because they realize Bitcoin is the true effective altruism movement. It is quite mind bending to think of all these paradoxes. I don't have the answers to why this is but I do think there is value to be had from chewing on these ideas.\n\nIf you are reading this piece you have likely heard of Bitcoin and might even be deeper down the rabbit hole than me, if not then don't trust me; go verify for yourself. It's easy to get bogged down with all the bleeding going on in the fiat world. Bitcoin is the band-aid to fix it. Focus your energy there and you will be amazed at how quickly those wounds turn into scabs which turn into barely noticeable scars. As a human I have biases and flaws. I still live and participate in our current system which means I don't want to see some massive crash that sets humanity back hundreds of years. I'd much prefer the current fiat system to go out with a whimper as Bitcoin replaces it. Thus, I'm spending more time trying to build in the new system while leveraging the old system when necessary. The more those at the top bend the rules of the game to benefit themselves the more people who will leave the unfair game to play a more fair one. Bitcoin is the fairest game humanity has ever created. It is the best chance the people have at separating money and state so the free market can flourish. Bitcoin will stop the bleeding when more people use it as their unit of account and realize it is a completely new system rather than a way to get rich in the old one.\n\n**Sources:**\n\n**A Lily Bit. _What The Fuck Is Going On_, [https://alilybit.substack.com/p/what-the-fuck-is-going-on](https://alilybit.substack.com/p/what-the-fuck-is-going-on).**\n\n**\"Hard Money Show With Natalie Brunell\" _YouTube_, YouTube, 17 Nov. 2022,[ https://www.youtube.com/watch?v=W6CTHoTTMyo.](https://www.youtube.com/watch?v=W6CTHoTTMyo.) Accessed 25 Nov. 2022.**\n\n**Jeff & Peter. \"Finding Bitcoin Signal with Jeff Booth.\" _YouTube_, 23 Nov. 2022,[ https://youtu.be/3lqqD8JgKyg.](https://youtu.be/3lqqD8JgKyg.) Accessed 27 Nov. 2022.**\n\n**Mises, Ludwig Von, and Bettina B. Greaves. _Human Action: A Treatise on Economics_. Liberty Fund, Incorporated, 2014.**\n\n**The Atlas Society. _Objectivism and Bitcoin_. _YouTube_, 19 Oct. 2022,[ https://www.youtube.com/watch?v=uix5BrzMTBM&t=1s.](https://www.youtube.com/watch?v=uix5BrzMTBM&t=1s.) Accessed 16 Nov. 2022.**\n\n**\"The Future Is Bitcoin with Michael Saylor | Moonshots & Mindsets.\" _YouTube_, 3 Nov. 2022,[ https://youtu.be/v4na2pycrcc.](https://youtu.be/v4na2pycrcc.) Accessed 16 Nov. 2022.**\n\n**Preston & Peter. _Bitcoin Is the Answer with Preston Pysh_. _YouTube_, YouTube, 16 Nov. 2022,[ https://www.youtube.com/watch?v=9b1boWwTvNw.](https://www.youtube.com/watch?v=9b1boWwTvNw.) Accessed 17 Nov. 2022.**\n\n11/28/22\n\nConor Jay Chepenik",
  "wordCount": 3809,
  "readingTime": 15.206918238993712,
  "claps": 0,
  "voters": 0
}