{
  "id": "1bc8288a603f",
  "title": "Day 202",
  "createdAt": "2022-10-11 01:26:44",
  "tags": [
    "sports",
    "coding",
    "habitchain"
  ],
  "url": "https://chepenikconor.medium.com/day-202-1bc8288a603f",
  "content": "# Day 202\n\nPlayed some pickup basketball today. Sports are one of my favorite ways to exercise. Doesn't even feel like a workout because sports always help me get in the flow state. Plus the fall weather in Mass felt fantastic to hoop in.\n\n![](https://miro.medium.com/1*ppmZrSc19-Mt-CVJEciX6w.jpeg)\n\nAfter the game I rode in a nice Audi S4 to get Chick Fil A. There is something so cool about a high powered petrol engine. The way the thing sounds, the feeling you get when the driver guns it, everything about a nice sports car feels cool. Didn't have to work today because of Columbus day which was nice. Only working one day this week anyways because I'm going down to Atlanta for a Bitcoin conference. Excited to meet some Bitcoiners IRL.\n\nI'm working on making my first app Habit Chain which I talked about many posts ago. Happy to actually be taking some baby steps to make it happen. Here is the first draft of a logo which I presume will change as I get better at design.\n\n![](https://miro.medium.com/1*ejz714_iAuWh8Oa1FJt00Q.jpeg)\n\nUsing Xcode to create apps is pretty awesome. I've only just begun dabbling but its amazing how powerful some of these coding platforms are becoming. The amount of resources out there are both overwhelming and exciting because of all the things I can build.\n\nComputer Science seems to be all about logic. Some things I need to think through in my own app is what kind of features I want to build.\n\n1. Allow people to add blocks to their habitchain.\n\n2. Let blocks include text/variables/images/other stuff potentially.\n\n3. Time stamp each block so people can see what days and times they add blocks.\n\n4. Create celebrations for adding habits.\n\n5. Create a button and learn how to leverage an API that records inputs for feedback.\n\nJust some rough ideas to get me going but as I learn more about coding on Swift I think this is a good start of things to keep in mind for HabitChain. When I create the app I will use it and create a HabitChain for days I've coded. Medium is doing a good job helping me keep a habitchain for writing so I'm excited to get another habit going.\n\nFinally, I'd like to take a second and appreciate how beautiful Lake George is. I got this photos from my girlfriend who is visiting there since she wasn't able to board a cruise ship because the cutoff is 24 weeks for pregnant women.\n\n![](https://miro.medium.com/1*V7aAtKh3Xx1nx1CASDX-Kg.jpeg)\n\n![](https://miro.medium.com/1*vN8EJ08DT-lmrbYSDBIFJQ.jpeg)\n\nEverything happens for a reason. She seems to be enjoying Lake George and spending time with her Mum and Sisters so all is good. She even got a massage today and Sloan was kicking around the whole time. I speculated it is because when Momma feels good so does the baby and the massage was helping Sloan relax which made her want to move around and loosen up. Hahahahha I have no clue but this gif my girlfriend sent me about the whole thing was cracking me up. Excited to meet Sloan around New Years :)\n\n![](https://miro.medium.com/1*qWxpj23vl2Hv0chL0gQPXQ.gif)\n\n10/10/22\n\nConor Jay Chepenik",
  "wordCount": 507,
  "readingTime": 2.7465408805031446,
  "claps": 0,
  "voters": 0
}