{
  "id": "1c8586a8eca",
  "title": "Day 82",
  "createdAt": "2022-06-13 00:02:20",
  "tags": [
    "buzzfeed",
    "ducks",
    "commentary",
    "golf",
    "birthing"
  ],
  "url": "https://chepenikconor.medium.com/day-82-1c8586a8eca",
  "content": "# Day 82\n\nWasn't sure what to write today so I'm going to do commentary on 19 facts that I found on Buzzfeed. Here is the link.\n\n> [**19 Facts That Are As Wild As They Are Random**](https://www.buzzfeed.com/morganmurrell/random-facts-you-should-know)\n\n1. Male ducks have cork-shaped penises. Lmao wild that ducks have wine openers for a penis.\n\n![](https://miro.medium.com/0*1ahBkf_KvpUEKY33)\n\nAt least my guy can open a nice bottle of red before he gets frisky. Doesn't ever have to worry about making sure he has a corkscrew on hand. Ducks are cool. My Grandpa has a sweet walking cane with a green duck like this for the handle. I've always admired ducks and I won't let their weird genitals change that haha.\n\n2. The longest English word is [189,819 letters long](https://www.wbtw.com/entertainment-news/worlds-longest-word-takes-3-5-hours-to-pronounce/) and takes about 3.5 hours to say. What kind of useless word could this possibly be. That's like a damn book. For one word. Not sure why that is a thing.\n\n3. Sea otters hold hands while they sleep so they don't drift away. Awww that is actually mad cute. Sometimes I snuggle my girlfriend too hard when I sleep and she gets annoyed but it's out of love. Maybe I was born a sea otter in another life.\n\n4. In an attempt to make their menu more nutritious, Mcdonald's once created broccoli that tasted like bubblegum. How can anyone think that bubblegum-flavored broccoli is healthy? If you put enough chemicals on broccoli to give it the flavor of bubblegum I imagine you have ruined the nutritional value. Not to mention that sounds absolutely disgusting. If you are eating at Mcdonalds you might as well enjoy your damn meal instead of pretending like you're eating anything healthy. Maybe back in the day when it first opened the food was somewhat not horrible for you, but at this point, it's all a chemical-induced sludge fest of a meal so just get the damn burger, nugs, or mcflurry (on the off chance the ice cream machine is working.) FFS in the chat for this horrible idea.\n\n5. President Theodore Roosevelt had a pet hyena named Bill. That is actually pretty badass. Roosevelt was a hell of a President. I remember learning about Teddy in my history classes and how he was a part of the [rough riders](https://www.nps.gov/thrb/learn/historyculture/tr-rr-spanamwar.htm). From what I've gathered reading about Teddy it was his success during the Spanish-American war that would go on to launch his successful career in politics. Different times I guess. Now we just have jerk-offs like Biden who are happy to fight proxy wars in Ukraine knowing damn well the citizens he sends aren't going to be himself or his family. I understand Teddy did his fighting before he was elected. My point is it seems that the world would be better off if we still had Presidents who understood how challenging war is rather than ones who are career politicians. Career politicians are the type to boast about what a great job they're doing when our economy has never been worse.\n\n6. Humans are born with two innate fears: the fear of falling and the fear of loud noises. The rest are learned. This one surprised me. It makes sense that we developed the loud noises fear through evolution to avoid predators. The fear of falling is the one I don't understand. Those dreams where I'm falling are terrifying. I always wake up flailing. I guess humans developed the fear of falling after watching too many of their ancestors not respect gravity hahaha.\n\n7. Ancient Egyptians would use the paste from dead mice to cure toothaches. Now we have fluoride in our tap water for toothaches. Jokes aside, I do think animals have all sorts of incredible properties. Today most people, myself included, have no clue how to gut an animal and utilize every part. Crazy to think about how much more resourceful our ancestors were when it came to utilizing animals. It's a double-edged sword because life has never been easier, but we also have this new set of challenges with technology. Like not becoming obsessed with social media that has incredible algorithms that feed us constant dopamine and provoke emotion.\n\n8. David Bowie launched his own internet provider in 1998 called BowieNet. David sounds like he might've been a Bitcoin maxi had he lived longer. I like the idea of not relying on ISPs for my internet. I'm paying Comcast an arm and a leg right now.\n\n9. Miss Piggy's original name was Piggy Lee. This fact seems useless.\n\n10. A woman in England once [called the police](https://time.com/2819288/woman-calls-police-because-not-enough-sprinkles-on-ice-cream/) because her ice cream didn't have enough sprinkles. Lmao. I got ice cream with sprinkles the other day and I regret getting sprinkles. Should've gotten chocolate chips instead. Sprinkles low-key taste like play-doh paste. My stomach didn't feel too good after eating those sprinkles.\n\n11. Cruise ships have their own morgues. This is pretty morbid, but I guess it makes sense if someone dies at sea. A lot of old people go on cruises since they end up retiring and what better way to enjoy retirement than traveling and exploring new places.\n\n12. Ladybugs defend themselves from predators by releasing a foul-smelling chemical from their knees. Is this where \"do the stinky leg\" came to be a thing. It is incredible all the different capabilities animals evolve to have so they can protect themselves from predators. I do wish humans had developed the ability to fly. Would save me a lot of money on gas.\n\n13. Brad Pitt tore his Achilles tendon while playing Greek warrior Achilles in the movie Troy. The irony. Having a torn achilles seems like one of the worst injuries one can have. I do hope that I never have to experience something like this.\n\n14. There's a rare neurological condition called Alice in Wonderland Syndrome, which causes people to feel larger or smaller than they actually are. When I was in a frat during college they called me the Cheshire cat pleb because of my large smile. The Cheshire cat was one of the coolest characters in that film so I'll take it.\n\n![](https://miro.medium.com/0*LriHhr6xpBEz78Je)\n\n15. Barcode readers only scan the white part and not the black. Today I learned barcode scanners are racist. It's 2022 I thought we were past this as a society. 🙄\n\n16. Martin Luther King Jr. earned a \"C\" in his public speaking class during his first two semesters of seminary school. I think this says more about the education system than it does MLK considering that MLK was such an incredible speaker he inspired generations to come and had the opposition assassinate him because he was getting through to the masses. Einstein also did poorly in school. The system is clearly broken and doesn't like exceptional students. I do think public education is more about learning to be an obedient citizen rather than an outstanding one.\n\n17. There's a rare ant breed that can only be found in a 14-block section of Manhattan and nowhere else on the planet. City aunts built different. Wonder what these aunts were living off of in Manhattan that made them unique to this 14-block section of NYC. Maybe they're the only aunts that pay federal, state, and city taxes. 🤣\n\n18. The first oranges were actually green. I couldn't imagine calling it green juice. This would probably ruin OJ for me since it would look like slime.\n\n19. And lastly, a grizzly bear's bite is strong enough to crush a bowling ball. My girlfriend came across a bear when she was hiking around her hometown in Jersey. Needless to say, she is terrified of bears and I am as well lowkey. These beasts don't mess around. I remember seeing a bear track in the snow when I was in Montana and it makes me a little scared to hike out in the wilderness without a gun. Always better safe than sorry.\n\nThis was an interesting way to do my daily writing. Half of these facts were useless, but it was fun commentating on some of them. What I'd expect from BuzzFeed. I used to love doing all the random tests in high school that BuzzFeed offered.\n\nDragged my buddy out to play some Golf today and that was a good time. I am horrible, but luckily so is my friend and I won a dollar on the last hole. (We played $1 a hole and the score was tied heading into the 9th) Had a few good shots and those are what keep you coming back. Made chili for the girlfriend and got some ice cream. Life really is sweet and I'm so fortunate to have everything I do. Easy to look around and worry when shit seems like it is going to hit the fan, but truth be told the algorithms of Twitter are going to feed me B.S to invoke an emotion. Smelling the ocean while playing 9 today is a great reminder I am so lucky. Plus, I got to come back to my beautiful girlfriend who showed me some based documentaries about what a shitshow the U.S birthing system is. I'm proud of her for putting in the work to learn how to give birth naturally and not be afraid. The culture in the states surrounding birth is stressful, but I have the utmost confidence my girl is going to crush giving birth and be an incredible mother. I picked a good one no doubt.\n\n6/12/22\n\nConor Jay Chepenik",
  "wordCount": 1593,
  "readingTime": 6.394654088050315,
  "claps": 0,
  "voters": 0
}