{
  "id": "1cdbd7828640",
  "title": "Day 939",
  "createdAt": "2024-10-16 23:55:49",
  "tags": [
    "los-angeles",
    "bitcoin",
    "week"
  ],
  "url": "https://chepenikconor.medium.com/day-939-1cdbd7828640",
  "content": "# Day 939\n\nThis morning I took a flight to LAX from JAX and it amazes me how much we can learn from being connected to others via our cell phone. I listened to a [solid podcast with a guy named Clint](https://www.youtube.com/watch?v=XgLpXAEbtsA) (Many know him as Liberty Lockdown) and he mentioned going from a mortgage broker to a person who reaches 10, sometimes 100s of millions of people online via his twitter account. It sounded like Covid was the catalyst for him getting out of the mortgage industry but it is amazing what we can do with social platforms.\n\nNow of course there is a lot of bad from these platforms.\n\n![](https://miro.medium.com/1*XyxtCQPk6yxSC4kx5ovyHg.png)\n\nThat does not mean these tools, if used correctly, can't help you in life. For example, I avoided some radiation and preserved some liberty this morning because of things I learned on X.\n\n![[https://x.com/ConorChepenik/status/1846480759189647537](https://x.com/ConorChepenik/status/1846480759189647537)](https://miro.medium.com/1*0LQcJyv3vvM9hUIS2C3hEg.png)\n\nIt's a small thing but I think it's wrong they are trying to scan everyone's face at the airport. To steel man the argument some might say what about safety to which I would respond with Ben Franklin's famous quote.\n\n![](https://miro.medium.com/1*ZayyY1MiSaVhwuidCr6TEw.png)\n\nI did not sign up for biometric face scan and I will continue to opt out as long as it is legal to do so. I was of course polite and it's awkward getting padded down. However, it's well worth it. I also noticed the TSA agent rolled her eyes when I did not do the face scan thing. Seemed a bit odd to be annoyed that you have to look at a person instead of a computer screen but never the less I am proud of myself for doing it. The guy patting me down was also nice.\n\nOne thing I'd like to think about moving forward as I continue to tinker and build stuff is how to build apps without the internet. Apps that connect to other devices maybe via bluetooth so you can do moree peer to peer type stuff? I get companies love having that data come back into their central servers but it sucks when you get on a plane and can't even play a stupid iPhone game because it wants wifi. Luckily, Google has the dinosaur thing you can play when your wifi is not working. Also I downloaded a bunch of podcasts before getting on my flight because I know better. Just something to keep in mind.\n\nI do wish I had downloaded some LLMs locally. Just the fact you can do that is amazing. You don't necessarily need to hit the servers of OpenAI every time. While those models are at the cutting edge and the most advanced I do think there is value in having a less advanced model downloaded locally that runs without internet.\n\nExcited to be in LA for the next couple of weeks and meet more Bitcoiners in person. Bullish on the people in this space, bullish on Bitcoin, bullish on humanity. We are going to win as more people wake up. Sadly pain might be the forcing function here. Inflation, health issues, war all jolt people awake pretty fast. Yet during hard times strong men are made and that's how I know we will win.\n\n10/16/24\n\nConor Jay Chepenik",
  "wordCount": 535,
  "readingTime": 2.568867924528302,
  "claps": 0,
  "voters": 0
}