{
  "id": "1d34b5c42a81",
  "title": "Day 144",
  "createdAt": "2022-08-13 20:22:59",
  "tags": [
    "search",
    "texts",
    "powerful",
    "relationships",
    "simplicity"
  ],
  "url": "https://chepenikconor.medium.com/day-144-1d34b5c42a81",
  "content": "# Day 144\n\nGot this text from a friend today. This shit made my day.\n\n![](https://miro.medium.com/1*HKuv5PwDVKDeGzEnwMTSNQ.png)\n\nTotally out of the blue. Not sure what prompted my friend to text me that, but it sure does feel good. You never know what impact you can have on someones life by being a genuine, kind, and truth seeking person. People who do nothing but complain love to make it seem like everything is pointless, but texts like this remind me that our actions have a massive impact on this world. Especially as it relates to those we care about.\n\nOverall, it's been a fantastic Saturday. Got to play a round of Golf, eat at a diner with my girlfriend, and chill around the house afterwards. The algorithms that filter me my news make it seem like the world is going to shit, but days like today remind me I'm living through one of the most peaceful and prosperous times in human history. There is no doubt times of change are on the horizon, but that also mean opportunity to make a positive difference.\n\nThe world is what you make of it. I'm going to make of it \"good things\". Hahahahaha that just cracked me up. Often times humans overcomplicate the shit out of easy things. I notice it all the time working in a corporate setting. Bureaucracy leads to bullshit. Simplicity leads to incredible things. The best companies can deal with the bullshit better and figure out how to scale. Often times it comes down to simple things. Happy Saturday anon.\n\nP.S today I saw a Twitter thread about how younger children are using TikTok instead of Google to search stuff. That is a fascinating idea to me. One of the points made was that they like watching a video rather than having to read shit. While they will read if needed, many would prefer to just have a video that explains whatever they want to know. Super interesting stuff. I wonder if this has to do with the whole \"humans will always take the path of least resistance\". While the best and brightest push themselves it does seem on a massive scale people are much more likely to take the easy route and this thread makes me think that hypothesis is correct.\n\n8/13/22\n\nConor Jay Chepenik",
  "wordCount": 383,
  "readingTime": 1.6452830188679244,
  "claps": 0,
  "voters": 0
}