{
  "id": "1e19fa902bae",
  "title": "Day 228",
  "createdAt": "2022-11-06 02:27:18",
  "tags": [
    "saylor",
    "rabbit-hole",
    "bitcoin",
    "bleeding",
    "healing"
  ],
  "url": "https://chepenikconor.medium.com/day-228-1e19fa902bae",
  "content": "# Day 228\n\nI'm gearing up to write another Bitcoin Magazine Article and the working title I got right now is \"Bitcoin Stops The Bleeding\". I was inspired by this podcast and the wisdom Saylor eschewed during this conversation. I'm so grateful to live in a time where I have access to billionaires and their knowledge via the internet. Never before could a \"pleb\" just watch two wildly successful individuals just talk casually for an hour and a half for essentially free. There are of course the cost of my hardware, internet, and time spent dealing with ads on youtube, but for more content than you could ever watch in a lifetime that is a pretty good deal.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fv4na2pycrcc%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dv4na2pycrcc&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fv4na2pycrcc%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nSaylor often equates the metaphor of blood being drained from an athlete before competition to the economy when Central Banks print money out of thin air. Makes sense to me. Hard to perform on the football field after having a liter of your blood drained out. Hard to make business decisions when the cost of money and how much of it is out there is determined by 12 humans who are just as prone to error as the rest of us. Central Banks are communist institutions and have caused the world to experience a gross set of incentives. It is a big reason, in my opinion, why so many three letter agencies are more concerned about the interests of wealthy and powerful institutions than they are with the people and citizens they have been tasked with either protecting or keeping healthy.\n\nI also want to quote from the book _Eating Animals_ by Jonathan Safran-Foer in my new article. I'm using this piece today to brainstorm things I will talk about. It is pretty disgusting to read up on how awful factory farming is. It is cruel and inhumane what they do to most animals that end up on our plate. I don't like thinking about it but it's also important that I do so I can try and be more conscious of what I put in my body. I love meat and if you have spent a good amount of time on Bitcoin Twitter it's clear that meat is some of the healthiest food out there. Especially if you can get your meat from a rancher who raises it right. Factory farming seems to be the problem. I understand there are a lot of people to feed and many farmers are doing their best to get by. However, it all goes back to incentives and in our current system meat is being treated more like a commodity throughout its entire life rather than an animal that needs time outside, sunlight, and proper care.\n\nThe good news is Saylor reminded me that if we can stop the bleeding we can fix the majority of our problems. The first thing a Doctor does for a criticality injured patient is stop the bleeding. You can't help someone if they are bleeding out. Once you have capped the wound then you can look to fix whatever the problem is, but without first stopping the blood loss any other procedure is useless. Central planners want to act like increasing the bleeding via stimulus checks and more welfare is going to fix things. It will do the opposite. Just like George Washington's Doctors who thought they were helping but ended up killing the first President.\n\nWe're going to win. But first we must all stop the bleeding together. If you want to stop the bleeding go down the Bitcoin rabbit hole and decide for yourself if fiat or bitcoin is a better way to store your life's value. Doubt many will end up concluding fiat created out of thin air by governments is ideal.\n\n11/5/22\n\nConor Jay Chepenik",
  "wordCount": 630,
  "readingTime": 2.3773584905660377,
  "claps": 0,
  "voters": 0
}