{
  "id": "1e434a441481",
  "title": "Day 128",
  "createdAt": "2022-07-29 02:44:30",
  "tags": [
    "bitcoin",
    "meetup",
    "alex-jones",
    "michael-malice",
    "podcasting"
  ],
  "url": "https://chepenikconor.medium.com/day-128-1e434a441481",
  "content": "# Day 128\n\nExcited to attend another Bitcoin meetup tonight and talk with fellow plebs about my favorite form of money. Perfect timing to discuss a new system as the U.S economy sinks into a recession, despite those in charge trying to change the definition of a recession. Life is a lot like sports, but what I appreciate more about sports is A. Most athletes enter the flow zone during competition which is much harder to do during day-to-day life and B. The athletes would stop playing if the goal posts got moved, changed, etc in the middle of the game. It is very frustrating to see the White House try and save their tail by doing everything in their power to redefine a recession when it is clear that we are in the technical definition a recession. I did a quick google search and was happy to see they defined a recession as, \"a period of temporary economic decline during which trade and industrial activity are reduced, generally identified by a fall in GDP in two successive quarters.\" I honestly thought they would've changed it by now so glad it still is defined as two negative GDP prints, but it is important to note they did put \"generally identified\". Generally identified unless you are in the White House and trying to make yourself look incompetent. All about perspective though. I hate seeing people struggle and a big part of this struggle, as far as I can tell, is a result of the fiat booms and bust that are caused by the Fed trying to centrally plan the price of money. There is nothing I can do about the Fed's actions though so I will focus on myself and educating others on why we no longer need a credit based system. I don't know where I saw this so apologies for not giving credit but I love the quote \"Satoshi opened a checking account for everyone in 2009 with Bitcoin\". It's true. A system not based in credit, but debit. A system anyway can participate in if they have the will power. Even if you don't have bitcoin already or a way to buy it with fiat you can download a muun wallet on your phone and accept bitcoin for your goods and services. That is some powerful shit. I would encourage those who have the means and desire to run their own node (you can even do so on a rasberry pi with a 1 tb hard drive or an old laptop) but for those with just a mobile phone it's better to get started with a muun wallet or something. Shout out all the goats making it easier to use this new system. It's so beautiful. No middlemen taking a cut or charging fees to go and lend out your own money on the backend as they run fractional reserve banking system.\n\nI need to practice more restraint with social media. It's a good and bad thing what these platforms provide. Amazing ways to network, learn, and grow. Also an app that is designed to flood your brain with dopamine and get you addicted. I read a powerful thread (on social media ironically enough) about how it's making people lazier, more arrogant, and irritable. I know this to be true because when I doom scroll all day I can often fall into many of these things. Life is about getting better little by little and while I will continue to use social media I do plan to be better about how I'm utilizing it. The first step of overcoming an addiction is admitting you have an addiction. The smart ass in me is thinking about a joke about social media anonymous like AA, but the truth is society might need something like that. Then again, comedy is all about truth so that's why it is funny to me.\n\nListened to Alex Jones on Micheal Malice's Your Welcome podcast.\n\n[https://youtu.be/cZxcPDHKpvc](https://youtu.be/cZxcPDHKpvc)\n\nIt gives me hope to hear that people are recognizing they should be allowed to hear what he has to say. At least according to Jones. He gets a bad wrap but as one of the Youtube comments so eloquently put it, \"Before I heard Alex Jones talk, I only knew of him because everyone called him a crazy conspiracy theorist. When I finally heard him speak for the first time, I quickly realized he was actually the most reasonable guy imaginable. This is why the higher-ups want censorship. They don't want people to discover what I did: That the supposed \"bad guys\" are actually the ones trying to steer us in the right direction.\" Hearing Alex talk of the struggle he had to go through in public and how those struggles as flipped since more and more people are waking up is super empowering. Lot of bad actors in WEF circles but truth is going to prevail. We the people will uphold the values of the constitution and the kleptocrats will fade into irrelevance as more people realize they are the stain on our earth.\n\nOutside of that I'm just thinking about how humans use more and more data to try and quantify stuff. While good data can lead to a lot of insights it's amazing how flawed much of this data is. It's so hard to account for all the complex variables out there. Not to mention the variable that is the human being do the work. AWS stats on football games are cool and all, but that will never tell the whole story. So much of the game is mental. Getting to the end zone in 5.2 seconds from the 46 yard line is a cool stat to see, but kind of irrelevant for the player who is trying to dodge 11 dudes trying to take his head off. I don't know really know my point here. Just saying we should always try and remain humble no matter how much \"good data\" we think we've observed. Not saying don't use data to better your life, but instead realize the data is imperfect.\n\nP.S this last part is being written after attending the bitcoin meetup and it was awesome. God I love going to Bitcoin meetups. Had such a good time I almost forgot to post this, but ya boi remembered write before falling asleep anon! Let's go the streak continues😈\n\n![Photo by David McBee: [https://www.pexels.com/photo/round-silver-and-gold-coins-730564/](https://www.pexels.com/photo/round-silver-and-gold-coins-730564/)](https://miro.medium.com/1*jRvo5Z5y35r0Mfo89EAzqw.jpeg)\n\n7/28/22\n\nConor Jay Chepenik",
  "wordCount": 1070,
  "readingTime": 4.237735849056604,
  "claps": 50,
  "voters": 1
}