{
  "id": "1ebecd612086",
  "title": "Day 961",
  "createdAt": "2024-11-08 04:39:41",
  "tags": [
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-961-1ebecd612086",
  "content": "# Day 961\n\n![](https://miro.medium.com/1*gV35zYPlNRnw4eD16lmRNg.png)\n\nI'm determined to build a web app from start to finish - something truly meaningful. It's going to be about preserving wisdom and passing on knowledge, a way to share life's most valuable lessons with generations yet to come. How can I best complete this? The goal is to offer guidance, to prepare future generations for the pitfalls they'll inevitably face, and equip them with the tools to overcome. But it's not just about the warnings. It's also about celebrating what makes life beautiful: love, family, God🙏\n\nSo I will build something that is like a time capsule. It will prompt users to answer ten really important questions over 10 days. I have thought about building this app before. Even written down ten questions. I'm going to do it again. This time with new questions I come up with on the spot.\n\n1. What is money?\n\n2. What excites you the most? Honestly though. Not some bs answer....\n\n3. Are you a God fearing person?\n\n4. What do you think your favorite meme of all time is and why?\n\n5. If you won the lottery what is the first thing you would do?\n\n6. What is the biggest goal you have that you really believe if you achieved would make you happy?\n\n7. Why does answering good questions always just lead to even more good questions?\n\n8. What is the shittiest part about being human... and how do you overcome it to kickass in life?\n\n9. If you are not a God fearing, what scares you? If you are a God fearing person do you think it has made you a better person?\n\n10. What can you learn from the best 10 days of repeating a habit? My advice - start reenforcing the good habits in your life by committing to doing them everyday and try to cut out the bad habits.\n\nI shall allow people to type, record, or even just voice dictate their answers. Then at the end I will present the users a very nice looking screen with all the answers 1–10. It will look cool.\n\nI will call this app **AncestralKnowledge**\n\n![](https://miro.medium.com/1*HxOFZTSJ4PR3-pp9tehHmg.png)\n\n11/7/24",
  "wordCount": 348,
  "readingTime": 1.6965408805031446,
  "claps": 0,
  "voters": 0
}