{
  "id": "2022bd7d77d7",
  "title": "Day 945",
  "createdAt": "2024-10-23 02:25:10",
  "tags": [
    "swapido"
  ],
  "url": "https://chepenikconor.medium.com/day-945-2022bd7d77d7",
  "content": "# Day 945\n\n**From Tyranny to Innovation: The Rise of Swapido**\n\nIn the midst of global upheaval and stringent pandemic restrictions, [Gustavo Flores Echaiz ](https://x.com/gustavojfe)found an unexpected catalyst for innovation. Fleeing the tightening grip of COVID-19 mandates in Canada, he relocated to Mexico - a move that not only granted him more personal freedom but also ignited a mission to revolutionize Bitcoin usage in Latin America. Today, as the founder of Swapido, Flores is at the forefront of making Bitcoin a seamless part of everyday transactions in Mexico.\n\n![[https://www.swapido.com/en](https://www.swapido.com/en)](https://miro.medium.com/0*9mnXCMsjccANDqfU)\n\nGustavo's foray into the world of digital assets began in 2015, when he was just 18 years old. Driven by a simple desire to make money online, he dabbled in various altcoins without much understanding of the underlying technology or economics. \"Through the ups and downs - mostly the downs - I was forced into learning,\" he recalls. This baptism by fire not only honed his expertise but also ignited a passion for Bitcoin's transformative potential.\n\nBy 2018, Gustavo had launched his first Bitcoin venture: a mining farm in Montreal. Though the project didn't achieve lasting success, it set the stage for his next endeavor. In 2019, he founded Veriphi, a Canadian self-custody white glove support service that caught the attention of Bull Bitcoin. The company[ ended up being purchased by Bull Bitcoin in 2021](https://www.bullbitcoin.com/blog/bull-bitcoin-acquires-veriphi-to-double-down-on-non-custodial-bitcoin-exchange-and-launch-of-new-international-self-custody-support-service).\n\nThe onset of the pandemic brought unforeseen challenges. Canada's stringent lockdowns and the looming threat of vaccine passports became too oppressive for Gustavo. \"Not being able to go out of your house after 8 p.m., not being able to invite even one friend over - not even for Christmas or New Year's,\" he laments. Sensing the walls closing in, he made a decisive move to Mexico, one of the few countries with no entry restrictions.\n\nIn Mexico, Gustavo experienced a newfound freedom. But as a tourist without residency status, he faced a different set of challenges - namely, the lack of access to traditional banking services. Earning his income in Bitcoin, he began using the digital asset for daily transactions out of necessity. This hands-on experience with Bitcoin's practical limitations and potentials in Mexico sowed the seeds for Swapido.\n\nRecognizing the barriers that both locals and foreigners faced in using Bitcoin for everyday transactions in Mexico, Gustavo envisioned a solution that would make the process seamless and inclusive. Swapido was born out of this vision.\n\nSwapido is a platform that enables users to convert Bitcoin into Mexican pesos instantly, depositing the funds directly into any Mexican bank account. Leveraging the speed of the Lightning Network and Mexico's efficient [SPEI interbank system](https://www.banxico.org.mx/services/spei_-transfers-banco-mexico.html), Swapido offers a non-custodial, user-friendly experience. \"It's a combination of the speed of the Lightning Network, the SPEI network, and the non-custodial experience,\" Gustavo explains. \"You pay a Lightning invoice, and within seconds, the recipient gets the money in their bank account.\"\n\nOne of Swapido's standout features is its inclusivity. The platform is available to almost everyone globally - though, due to regulatory constraints, U.S. residents are unfortunately excluded. Whether you're a tourist, an expatriate, or a local resident, Swapido simplifies the process of using Bitcoin in Mexico. Users can sign up with any government-issued ID and start making transactions that are fast, secure, and efficient.\n\nBuilding Swapido was not without its challenges. Mexico's regulatory environment for digital assets is complex and, at times, contradictory. \"Technically, a Mexican company cannot offer Bitcoin or crypto services to Mexicans, but a foreign entity can,\" Gustavo notes. To navigate this legal maze, Swapido operates as a Panama-based entity, while still complying with Mexican regulations through necessary reporting.\n\nBanking partnerships were another hurdle. Traditional banks are often hesitant to engage with digital asset businesses due to compliance concerns. Swapido overcame this by partnering with The Bitcoin Company, a like-minded startup that provides crucial infrastructure and licensing support. \"They help us out with infrastructure and licensing. We do compliance and take risks on our end,\" says Gustavo.\n\nWhat sets Gustavo apart is his commitment to grassroots engagement. Residing in Mexico City, he is an active participant in local Bitcoin meetups and events across the country. \"For us, it's very important to be close to the community and the country,\" he emphasizes. \"It's different when you're trying to solve Latin American problems from a New York office than it is being on the ground in Mexico.\"\n\nThis hands-on approach not only keeps Swapido attuned to the needs of its users but also fosters collaborations within the Bitcoin ecosystem. Gustavo is open to partnerships and is continually seeking ways to enhance the platform's offerings. Upcoming features include the ability to buy Bitcoin, send on-chain transactions, use stablecoins, and participate in an affiliate program that rewards users for referrals.\n\nGustavo's journey from a young Bitcoin enthusiast to a pioneering entrepreneur embodies the resilience and innovation that define the Bitcoin community. Through Swapido, he is breaking down barriers and making Bitcoin accessible to a broader audience in Mexico and beyond.\n\n\"In the end, it's about solving real problems for real people,\" he reflects. \"We're leveraging technology to create financial freedom and convenience, especially for those who have been overlooked by traditional systems.\"\n\nGustavo's passion for community engagement shines through his active participation in Bitcoin meetups across Mexico. Based on his interview with us here at Bitcoin News, it is clear Gustavo is a catalyst for change in a region ripe for financial innovation. By seamlessly integrating Bitcoin into everyday transactions, Swapido is redefining what's possible by connecting fiat currency and sound money.\n\nAs the world continues to grapple with economic uncertainties and evolving regulatory landscapes, pioneers like Gustavo are charting a course toward a more inclusive and decentralized financial future.\n\nYou can learn more about Swapido [here](https://www.swapido.com/).\n\n10/22/24\n\nConor Jay Chepenik",
  "wordCount": 966,
  "readingTime": 3.845283018867925,
  "claps": 0,
  "voters": 0
}