{
  "id": "21704923ef8b",
  "title": "If You’re Going To Spend Money Living In Society You Might As Well Spend Wisely",
  "createdAt": "2022-02-20 23:46:15",
  "tags": [
    "skiing",
    "freedom",
    "bitcoin",
    "optimization",
    "happy"
  ],
  "url": "https://chepenikconor.medium.com/if-youre-going-to-spend-money-living-in-society-you-might-as-well-spend-wisely-21704923ef8b",
  "content": "# If You're Going To Spend Money Living In Society You Might As Well Spend Wisely\n\nDespite 🤡 🌎  ramping up their aggression on the working-class people the masses are starting to wake up and realize who really holds the power. (Hint: not authoritarian governments) Check out this v[ideo ](https://twitter.com/NobodyCaribou/status/1495207732881899525?s=20&t=OMVHKWlPXcfp1t24UOs3Fw)of people in Canada just vibing during a freezing cold winter. Corrupt cops are clearing out downtown Ottowa because wanna-be dictator, Justin Trudeau, ordered it. This still hasn't stopped the protesters from emitting love and good energy. Trudeau's psy-op of labeling the working-class people the fringe minority who are racist and transphobic has been upgraded to domestic terrorist. The government is now freezing the assets of those who participated and helped the freedom convoy. The silver lining is helping people realize the importance of both cash and Bitcoin, but an unfortunate price to pay for a lesson. I was worried the tyranny might've scared protestors but they continue to grow in Canada. It's incredible to see and I think it has awoken many outside of Canada as well. If this bullshit can happen in a \"western democracy\" it means it can happen anywhere.\n\nThis brings me to the point of this medium post. Our assets are only our assets in so far as we can use them. Do you know why U.S public schools don't teach people about the financial system? It is because the U.S public would be pissed about the fractional reserve banking system and Quantitative Easing. Commercial Banks make most of their money by lending out the money you put in them. The Federal Reserve creates money by giving the U.S Treasury government bonds which are more or less a fancy financial I.O.U. As citizens, we are encouraged to take on debt because commercial banks are eager to lend money they got for free from both the federal reserve and their customers. That's how they keep printing money. Give it to the banks and let them charge interest on money they magically get added to their internal ledgers. On a bank's balance sheet the customer's cash is treated as a liability. \"[American household debt hit a record $14.6 trillion in the spring of 2021, according to the Federal Reserve.](https://www.debt.org/faqs/americans-in-debt/demographics/)\"\n\nSo anon you might be asking at this point what the hell do I do about it? My advice would be to continue learning as much as you possibly can! Every situation is different and my needs will not be the same as yours. That said, you can be aware of the risks you take on when you keep all your money in one bank. Taking steps to diversify your personal \"balance sheet\" could prove very helpful if you are ever targeted by an adversary. I keep Bitcoin on many different platforms. Some of my 🌽   (🌽   =bitcoin for the nonplebs) is self-custodied and some are kept in custodial services. The reason I do this is that if one platform is compromised I will have many other platforms with backup funds. Based on my research I'm convinced bitcoin is the best asset in the world to hold. I know many financial advisors would argue a diversified portfolio is better, but Bitcoin is only getting priced once and I'm convinced I hit the lottery living through this time. Bitcoin gives the user no counter-party risk (if you hold your own private keys) while being the hardest form of money to date (meaning the most difficult to create). If you want Bitcoin without spending fiat it requires hardware, open-source software, and a lot of electricity to mine. The protocol can be audited by anyone without a third party and the longer it continues to exist the more likely Bitcoin will exist forever. Thus, every paycheck I receive 25% of my pay is used to purchase bitcoin. I keep enough cash to cover my bills and credit card. I use credit and debit cards that give me rewards back in cash or crypto. I try to spend any remaining cash on good meals, books, technology, and traveling. Avoiding consumer bullshit typically is the right call. Every now and again there will be an article of clothing, a tiny trinket, or a consumer product that provides deep sentimental value or advances my career (mostly technology products for the latter). When you see these items you get a gut feeling and they are usually worth purchasing. Just make sure the item is one that isn't going to provide a limited period of enjoyment followed by just being clutter.\n\nOne thing I have never regretted spending money on is traveling. Took two weeks starting on the 15th of February to go out to Montana and explore. I am very blessed to have a stepfather with a ranch near Bozeman and a job that allows me to work remotely when I desire. Went skiing with my buddy Dono and got to watch him do sicko stuff down the mountain while I cherished being in nature and not falling. Money spent enjoying life via experiences is usually money well spent. Here is a picture of Dono and me atop one of the Mountains at Big Sky, MT.\n\n![](https://miro.medium.com/1*J6X_bR38NV0bIuLN-4kugg.jpeg)\n\nFor those wondering I got the ski overalls at Goodwill for 14 bucks and the Patagonia jacket was one of those consumer purchases I do not regret spending some money on.\n\nIn conclusion, maximize cash/crypto back when spending money. Only spend on things you really value like traveling, consumer products with high sentimental value or the ability to advance your career, and assets (like bitcoin) that you think will appreciate greatly in the years to come. Dollar-cost average so you don't get emotional when your assets have red days. Keep your assets diversified so you have cash on hand, seed phrases ready to rip, and various lines of credit at your disposal. That way if you ever get targetted for wrong think it becomes much harder to seize all your assets and essentially ban you from transacting in modern-day society. 🤡 🌎  isn't going to give up on their digital QR code system easily, but the masses hold the power. Optimize your life so you are healthy, happy, and secure in the fact your belongings can't be seized by an illegitimate government that thinks of its citizens as cows rather than customers. We've seen the playbook of those in Canada. Claim your citizens are domestic terrorists because they oppose the ridiculous and unethical mandates of the cronies at the W.E.F. I support the Freedom Convoy and can't wait to watch them win so the world can get on a bitcoin standard instead of a social credit score standard. There is so much incredible stuff that is going to happen in this information technology revolution we are living through right now. The tools to becoming a reasonably self-sovereign individual are all around us. It just takes an open mind, a can-do attitude, and some time spent learning. Good luck Anon. I hope we can both continue to grow in our pursuit of happiness.\n\n2/20/22\n\nConor Jay Chepenik",
  "wordCount": 1186,
  "readingTime": 4.675471698113208,
  "claps": 0,
  "voters": 0
}