{
  "id": "21aa3b103e26",
  "title": "Day 252",
  "createdAt": "2022-11-30 04:00:35",
  "tags": [
    "bitcoin-articles"
  ],
  "url": "https://chepenikconor.medium.com/day-252-21aa3b103e26",
  "content": "# Day 252\n\nOk I know I mentioned I was going to stop using these posts to update my article but I got some good advice from the Bitcoin Magazine team on how to improve my writing so I spent a lot of time cutting down the redundant parts and trying to get this thing around 2000 words. Tomorrow I'll be back to writing about other stuff but I'm happy to say I think this one is going to get accepted and posted. Here is my 5th update on the article hahahahaha. It is slightly above 2000 words but I'm not sure what else to cut. Fingers crossed this one gets approved!\n\n**Why Bitcoin Stops The Bleeding**\n\nWhen a Doctor operates on a wounded patient the first thing they do is make sure they can stop the bleeding. No point operating if you can't get the bleeding under control because the patient will die. Money facilitates mutual exchange and helps market actors coordinate price discovery, it is the literal blood of the economy. As fiat currencies slowly bleed out in value they incentivize less people to save. If you want to stop the bleeding in your financial life you are going to need to find a way to store your wealth in something else. There are plenty of options but only one that is programmed to stop all bleeding in 2140.\n\nAs people's money is bled out so are their education, time, and I'd even argue mental sanity. Blood isn't oozing out egregiously but rather being siphoned off from tiny cuts so most people do not even realize it's happening. This is a hard pill to swallow. Most Western societies teach people not to question authority, raise your hand if you want to ask questions, and trust the experts. Breaking out of this mentality is difficult. Watch this[ clip](https://twitter.com/canindependent/status/1595460390045028352?s=20&t=qIFHdHF4A-8z4nmfle5Mqw) of the White House Press Secretary to get an idea of how those at the top will treat people who dare question the narrative.\n\nNarrative is everything when trying to coerce the masses to accept a \"Great Reset\". If you have no idea what the Great Reset is you can read about it [here](https://alilybit.substack.com/p/what-the-fuck-is-going-on). The scope of this article won't cover what Davos is attempting to impose on the rest of the world, but rather why Bitcoin stops money from bleeding out. Trying to calculate all the variables that bring about the emergent complex behavior of society is futile. Governments stole trillions of dollars via quantitative easing and blamed their theft on covid-19. It should not be a surprise that what followed has been chaos in the form of riots, protests, and supply chain issues. The Federal Reserve is following up its quantitative easing with tightening monetary policy at record paces trying to get inflation under control. This demand destruction is wreaking havoc all over the economy but is necessary to weed out unprofitable businesses.\n\nFor better or worse, pain is the best teacher. Hard Money recently reported that Trezor has seen a 300% increase in sales revenue after the FTX debacle. The whole point of Bitcoin is to not trust but verify for yourself. Many ignored this because FTX had the stamp of approval from every mainstream news outlet, politician and celebrity in the space. In the wake of their blow FTX created tons of new Bitcoin maximalists who now understand why not verifying bitcoin with your own node means you are trusting potentially corrupt third parties. The M.S.M is not doing itself any favors with puff pieces like the one below. Articles like this only serve to increase the pain of those who were robbed and convince more people that the mainstream narrative is corrupt.\n\n![](https://miro.medium.com/0*EUBY4HM0rcwMStsA)\n\nThe remedy to most of these problems is a better education. Tools like Saylor.org, Udemy, & plenty others have lowered the barrier tremendously. It just requires a desire to learn. For me I found that desire by going down the Bitcoin rabbit hole. Ironically, answering one question would lead me to more questions and that number grew exponentially. It made me wonder how much people are not taught intentionally during their traditional schooling. There is only so much time in the day and teachers must prioritize their curriculums accordingly. I just don't understand why taxes, how to vote, and basic financial literacy aren't at the top of most public school curriculums. The reader can come to their own conclusions. What's important is finding a teacher that speaks your language and a subject that brings out your natural curiosity. Learning becomes one of the most euphoric feelings in the world when those two needs are met.\n\nThe standard way of learning has horrible mental models for teaching people, like memorizing things for a test. Oscar Wilde is quoted saying \"Experience is merely the name men gave to their mistakes.\" People are so focused on learning from the experts they forget that those who changed the world didn't ask for permission to do so. They just did it. People want a hero to fix all their problems but the truth is no one is coming to save you. I'm not saying don't find great mentors; it's super valuable being able to listen to those who have become experts in their field in order to learn. I'm saying don't worship people like Gods who can't make mistakes. Just look at S.B.F who many thought was a hero.\n\n![](https://miro.medium.com/0*IOqvkFF0Ar3ykpAo)\n\nDespite all the educational content out there the reality is most people will come to understand the difference between paper bitcoin and bitcoin you actually hold the keys for via an expensive lesson. When the majority of Bitcoiners self custody their coins, and stop blindly trusting their heroes is when we will see fireworks in regards to Bitcoin's price action. Every person is different and has various forms of risk tolerance. For those who are discouraged by recent events, remember Rome was not built in a day. Sometimes the only way to get a lesson through someone's head is for them to suffer the pain of said mistake.\n\nWhat's interesting about watching FTX fail so rapidly is the same thing would happen with our traditional financial system if we didn't have Central Banks acting as lenders of last resort. FTX violated their terms of service by using customer funds to make bets, but 99.9% of the world just turns a blind eye when banks do this because their terms of service legally allow fractional reserve banking. In his book _Human Action_ Mises writes,\n\n\"The rich, the owners of the already operating plants, have no particular class interest in the maintenance of free competition. They are opposed to confiscation and expropriation of their fortunes, but their vested interests are rather in favor of measures preventing newcomers from challenging their position. Those fighting for free enterprise and free competition do not defend the interests of those rich today. They want a free hand left to unknown men who will be the entrepreneurs of tomorrow and whose ingenuity will make the life of coming generations more agreeable. They want the way left open to further economic improvements. They are the spokesmen of progress.\"\n\nTechnology getting better should lead to massive deflation from productivity gains. Regulatory moats and monopolies prevent this. Fractional reserve banking creates an inflationary environment where tons of capital is misallocated. In a free market most commercial banks would be insolvent. FTX tried to create their own fractional reserve monopoly by lobbying Congress and creating a regulatory moat around their business which would've made it impossible for competitors to compete in the crypto ecosystem. The world is fortunate their system blew up before FTX was able to get their way with D.C. Mises was right: it is not the incumbents who will create a more agreeable future, it is entrepreneurs and ideas competing in a free market. Bitcoin has over 10,000 competitors and that number is growing everyday. Many if not all of these tokens are ponzi schemes in my opinion, but the idea D.C could do a better job deciding this than the free market is ridiculous.\n\nI understand regulation is difficult when technology is changing things at such rapid rates. The little piece of glass in our pocket allows us to hail a ride, order food, and listen to some of the greatest minds on the planet whenever we want. All these things would seem magical to someone who lived before the creation of smartphones. There are going to be hiccups along the way as humanity tries to come to grips with these new tools. This is why I keep this Hal Finney quote as my Twitter header..\n\n![](https://miro.medium.com/0*Bwmu09kMGGQ36tzd)\n\nFor all the wonders technology can do for humanity it can also drive a whole new level of control. Free markets lead to optimal price discovery. Too much central planning and markets start to break. Price discovery in a free market is like a hash function. It takes inputs of data and spits out an output that only goes one way. With a normal hash the algorithm works so that it is unfeasible to reverse calculate the data. You can verify a hash by making sure the same output is achieved based on the input but you can't take the output and figure out the input. In this same vein a free market will set the price of a good but you can't figure out how all the labor, work, travel, and other variables created the price of the good. The function only goes one way. Market actors get upset when the coercion variable is notched up and price increases happen. The blame is typically pushed on to the producers rather than the central planners who are causing such issues. Sound familiar? Like say the U.S government who is calling out \"greedy fossil fuel companies\" for raising the price of gas while at the same time advocating for the end of fossil fuel use. If price controls are imposed, price discovery completely breaks down resulting in shortages. Until the creation of money is no longer heavily intermingled with politics these issues will continue to play out.\n\nAs CBDCs and digital identities are rolled out it has never been more important to point out why Bitcoin is the remedy. Bitcoin allows the individual to go down a hero's journey where they can keep the value of their labor in their head. CBDCs and digital IDs offer Governments a tool to enact monetary policy at the individual level, be at the center of every transaction, and turn off people's money as they see fit. Bitcoin offers a better system. One that no one can cheat if they want to be in consensus with the rest of the network.[ Preston Pysh](https://twitter.com/PrestonPysh) said it best \"Bitcoin is like the infinity stone.\" It takes a great deal of faith to hold on to an asset that has had multiple 70–90% drawdowns before recovering to new all time highs. Not many can hang on to their bitcoin but those who do over long periods of time are greatly rewarded. The network effects of Bitcoin are insane. There is a[ Bitcoin website](https://bitcoin.rocks) paying people 21,000 satoshis to post a sticker around your city that they ship to you. Think about that. You can earn sats and increase the value of those sats by helping raise awareness. Bitcoin is full of these win-win scenarios. The tech is exciting, but the passion I see from Bitcoiners in real life is unlike anything I've ever seen before.\n\nBitcoin as a technology, a new form of money, and an idea are bringing hope to humans around the world who have been disadvantaged because Governments have a monopoly on violence. Bitcoin empowers the individual to fight back like never before. There will be growing pains along the way and more turmoil in the short term for those obsessed with measuring things in fiat. The way to fix that is to orient yourself around the new system. The possibilities that will come out of this Bitcoin renaissance are endless. Grappling with what this new form of money means is difficult because the world is full of so many paradoxes. When you learn you become smarter by ending up with more questions. Monopolies have brought about some of the most prosperous and technologically advanced times in human civilizations while also making Orwell's 1984 look like a very plausible path for the future. The internet is connecting people like never before and at the same time loneliness is reaching all time highs. Number go up technology is associated with greed and what initially attracts people to Bitcoin yet many stay because they realize Bitcoin is the true effective altruism movement. These paradoxes are a bit mind bending but I do think there is value to be had from chewing on these ideas.\n\nIt can be easy to get bogged down with all the bleeding going on in the fiat world. Bitcoin is the band-aid to fix it. It gives me a lot of confidence knowing my money is secured by open source software and math rather than 12 individuals who decide when it is okay to steal and when it's time to practice fiscal austerity. I'm glad the Fed has finally decided to do the right thing for the economy but they have manipulated the cost of capital for so long they now risk destroying the entire system if they keep tightening. The problem is the Fed's only other option is to lower rates again which causes more bleeding via inflation. Bitcoin offers humanity a way out of this paradox where central planners try to fix the bleeding by psyphoning more blood out of the patient. Everytime central planners manipulate the cost of capital it becomes more clear market participants are playing a rigged game. Bitcoin is the fairest game humanity has ever created and the best chance we have of separating money and state.\n\n**Sources:**\n\n**Autism Capital. \"Unhinged Text Messages from SBF Shared with a Vox Reporter. .\" _Twitter_, Twitter, 16 Nov. 2022, [https://twitter.com/AutismCapital/status/1592984494814171137?s=20&t=aPloOviX400g7uSnBb9SZw.](https://twitter.com/AutismCapital/status/1592984494814171137?s=20&t=aPloOviX400g7uSnBb9SZw.)**\n\n**A Lily Bit. _What The Fuck Is Going On_, [https://alilybit.substack.com/p/what-the-fuck-is-going-on](https://alilybit.substack.com/p/what-the-fuck-is-going-on).**\n\n**\"Hard Money Show With Natalie Brunell\" _YouTube_, YouTube, 17 Nov. 2022,[ https://www.youtube.com/watch?v=W6CTHoTTMyo.](https://www.youtube.com/watch?v=W6CTHoTTMyo.)**\n\n**Independent, The Canadian. \"Watch: Bidens White House Press Secretary Refuses to Allow a Reporter to Question Dr. Anthony Fauci. Pic.twitter.com/06SRLUQwd9.\" _Twitter_, Twitter, 23 Nov. 2022, [https://twitter.com/canindependent/status/1595460390045028352?s=20&t=qIFHdHF4A-8z4nmfle5Mqw.](https://twitter.com/canindependent/status/1595460390045028352?s=20&t=qIFHdHF4A-8z4nmfle5Mqw.)**\n\n**Mises, Ludwig Von, and Bettina B. Greaves. _Human Action: A Treatise on Economics_. page. 83. Liberty Fund, Incorporated, 2014.**\n\n**Musk, Elon. \"WSJ Giving Foot Massages to a Criminal.\" _Twitter_, Twitter, 24 Nov. 2022, [https://twitter.com/elonmusk/status/1595889743958798336?s=20&t=aPloOviX400g7uSnBb9SZw.](https://twitter.com/elonmusk/status/1595889743958798336?s=20&t=aPloOviX400g7uSnBb9SZw.)**\n\n**Preston & Peter. _Bitcoin Is the Answer with Preston Pysh_. _YouTube_, YouTube, 16 Nov. 2022,[ https://www.youtube.com/watch?v=9b1boWwTvNw.](https://www.youtube.com/watch?v=9b1boWwTvNw.)**\n\n11/29/22\n\nConor Jay Chepenik",
  "wordCount": 2449,
  "readingTime": 9.791509433962265,
  "claps": 0,
  "voters": 0
}