{
  "id": "21c095b1fa6b",
  "title": "Day 300",
  "createdAt": "2023-01-17 03:30:32",
  "tags": [
    "data",
    "twitter",
    "economy",
    "bankruptcy",
    "billions"
  ],
  "url": "https://chepenikconor.medium.com/day-300-21c095b1fa6b",
  "content": "# Day 300\n\nDamn 3 x 💯  days of writing on this Medium. Good stuff.\n\nLet us keep the ball rolling. I thought this tweet from Peter Schiff was pretty spot on.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/peterschiff/status/1615083298551726081&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nTo think they call bitcoin a ponzi scheme😂 . Insanity. I'm curious if they will end up raising the debt ceiling. My guess would be yes, but I'm not sure how it all plays out. Feels like we should really start practicing some fiscal austerity but I also understand that there is negative political will to do so.\n\nAnyways, clown world is not just in the fiat space. Crypto is full of this stuff too. If I lost 3.5 billion in a few days I like to think I'd be sitting on the sidelines for awhile but shooters going to shoot I guess?\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/grdecter/status/1615129016633016324&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nNot that I have 25 million to invest in this bankruptcy business, but if I did I would just buy Bitcoin and self custody it. Also, the idea that they are going to sell the claims from a bankruptcy court is peak fiat. I would not touch those bankruptcy claims with a ten-foot stick but I'm sure someone out there would.\n\nOn another note I need to be better about just living in the moment. I have like 1000 things I would like to do and I can't do all of them at once. It's important I remember to breath and enjoy the little things throughout my day. Like when I can just hold my partner and child. Those are special moments and I'm going to be better about appreciating those moments when they come. Life is short so remember to not waste it worrying about \"what could be\". At least not for the majority of your time. There is a time and place to dream big.\n\n![](https://miro.medium.com/1*mxmg9BnS5TGS_DXvCRpymg.png)\n\nI found this data to be interesting. Look at the ticket prices. Philly vs NYG is a big deal because it's a division game and it looks like San Fran will be playing Dallas which I believe is an old rivalry. Interesting stuff. I got love for the Jags since I'm from Duval but I suspect most people are writing them off against KC so less people are willing to buy tickets compared with some of the other games.\n\nFinally, I enjoyed writing this Twitter thread and two part tweet.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1615100789755715593&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1615162831636398082&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFeels good writing Twitter threads. Your follower count online is not that important of a number, but I do hope to one day spend my time doing solely what I love and that would be shitposting, writing, and podcasting for a living. Can't do that with 587 followers but if I keep up the good work I'm confident this number will grow. Bang bang let's keep getting after it day after day! Can't stop won't stop.\n\n1/16/23\n\nConor Jay Chepenik",
  "wordCount": 471,
  "readingTime": 1.9773584905660377,
  "claps": 9,
  "voters": 1
}