{
  "id": "22129d81101d",
  "title": "Day 1145",
  "createdAt": "2025-05-10 23:54:53",
  "tags": [
    "thoughts",
    "on",
    "artificial-intelligence",
    "a",
    "fitting-name-really"
  ],
  "url": "https://chepenikconor.medium.com/day-1145-22129d81101d",
  "content": "# Day 1145\n\nPlayed basketball for the first time in a long time, and it felt great to compete again. Basketball is definitely one of my favorite forms of cardio.\n\nWhile guarding the person I was playing against he ran into my quad and it has been aching since. I'll be fine, but it is funny how soft your body can get when you are not using those muscles daily. Or maybe I'm just getting old and I don't recover like I used to. Regardless, our bodies are prone to atrophy if we don't use them.\n\nI need to remember this particularly for my brain. It is so easy to outsource my thinking to a machine. LLMs and other AI tools can increase productivity and help me do amazing things, but I'm the one in control. Not a bunch of 0s and 1s. This is a lesson I must pass onto my children for their own success. It is also one I need to remember myself. I find that more and more I get an urge to pop open a new tab and say \"chat improve this\".\n\nIf I don't pass this onto my children they will make mistakes that previous generations learned through pain. Such is life I guess since pain is the best teacher, but if I can help them avoid some of these painstaking lessons I would like to do so.\n\nNot even sure what the lesson is exactly. \"Hey you can do amazing things with the computer but don't rely on it to do amazing things\". Bit of a paradoxical message, but it's the one I need to pass on. Maybe I can rephrase it better. \"Use the computer as a tool, take advantage of it, create with it, be proud of what you build with it, but never forget you are the final say, the one who decides what is and what is not worthy. Do not outsource your thinking to the machine. Enhance your thinking with it\".\n\nYeah that is better.\n\n5/10/25\n\nConor Jay Chepenik",
  "wordCount": 340,
  "readingTime": 1.2830188679245282,
  "claps": 0,
  "voters": 0
}