{
  "id": "22e7ffb9b00e",
  "title": "Day 216",
  "createdAt": "2022-10-25 00:48:48",
  "tags": [
    "propaganda",
    "un",
    "climate-change",
    "mainstream-media",
    "first-principles-thinking"
  ],
  "url": "https://chepenikconor.medium.com/day-216-22e7ffb9b00e",
  "content": "# Day 216\n\nWent for a nice walk with my girlfriend after dinner today and had a lovely conversation about first principles. Walking after a large meal is a great way to help work off the food you just ate as well as spark some deep conversation if you can bring along a walking buddy. My girlfriend and I got on the conversation about climate change and energy. I can confidently say my views on these things have done a full 180 since going down the Bitcoin rabbit hole. Before I get into what we discussed I'd like to share these two tweets. One is saddening and ridiculous, the other is the internet doing its thing to crack me up.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/disclosetv/status/1584219828914569217&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/laymanlogic/status/1584221266340245505&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nA painting worth hundreds of millions of dollars that people want to destroy to make a point. Pretty sure these things are protected by glass but what an insane way to try and get your point across. It's like me slashing someone's tire for driving a petrol vehicle and telling them they need drive an electric vehicle if they don't want this to happen. It is sad society has gotten so far away from first principal thinking. My girlfriend made an excellent point that these people probably think they're doing \"the right thing\" and that they are helping. Based on what I learned during my education growing up I was terrified of climate change. That changed after I went down the Bitcoin rabbit hole and read books like Alex Epstein's _Fossil Future_. It is the cheap, plentiful, abundant energy provided by fossil fuels that make modern life possible. Children die in less developed countries when hospitals can't get reliable electricity to run the modern day hospital equipment, refrigerate vaccines, and use the internet to get an answer they might need. Our modern day world needs more energy to thrive not less. I couldn't travel to work if there wasn't a train powered by electricity that was generated from fossil fuels. I couldn't travel to South Carolina/Georgia for a Bitcoin conference and to see family if we didn't have planes powered by fossil fuels. Hell for people pushing electric cars you couldn't have them if we didn't have fossil fuels to power the machines that mine the precious metals that make your electric vehicles. I'm not saying people shouldn't be innovating to try and come up with the best, cleanest, most innovate solution out there. No, what I'm saying is if we want to create a vibrant, healthy, abundant world we are going to need to use more fossil fuels to achieve this. The only way to give the great innovators of our time their damn time back so they can innovate is by relying on energy to power the things that make modern day life possible. If it wasn't for massive fossil fuel powered machines that farmers use to farm food for society people wouldn't have time to write online for fun. It is because of the technological innovations and cheap energy fossil fuel provides that I am able to sit here and type out why I think these people advocating for the end of fossil fuels are ridiculous. Fossil fuels have allowed people like myself to live in a city because otherwise we wouldn't be able to produce enough food to feed people in urban settings.\n\nI think nuclear power presents some exciting opportunities to help create cheap, abundant, and plentiful \"CO2 free\" energy for the world. I don't know enough about CO2 and the environment to truly know if it is causing our planet to heat up a significant amount that will cause my home state of Florida to be underwater. I do however find it \"sus\" that scientists were claiming in the 1970s we were going to face [global cooling](https://en.wikipedia.org/wiki/Global_cooling) and now we're facing global warming which seems to have just been changed to climate change at this point. Al Gore made some claims about ice caps melting by 2013 and you know these claims are legit because the [fact checking police had to fact check it](https://www.reuters.com/article/factcheck-climate-change/fact-check-al-gore-did-not-predict-ice-caps-melting-by-2013-but-misrepresented-data-idUSL1N2RV0K6). I use to have a lot of respect for Reuters and the AP and many more mainstream publications. Now I'm at the point where if I see they are fact checking something my gut reaction is to believe the opposite. I try and give these organizations the benefit of the doubt but lie after lie makes it hard. These companies seem to be bought out corporate shills vying for whatever \"current thing\" their owners are pushing. I'm grateful the mainstream media is rapidly losing credibility and individual's are able to use social media to discuss and share ideas they have come across through their own work and interests. Alex Epstein reminded me in his book that nature is a brutal place and it is fossil fuels that allow us to live comfortably year round with A/C in the summer and heating in the winter. So to try and say we need to eliminate fossil fuels and do so by destroying fine art is heinous. I don't know wether to feel bad for the people who have been psy-oped so badly they think they are helping or to let them experience pain and realize what they are advocating for is asinine. Luckily, I don't run a museum so I guess I won't have to make the decision I will just write about how ignorant I think these people are on my personal blog. This is what I'm reminded of when I see these people.\n\n![](https://miro.medium.com/0*SDsTtGA7rjNvYTKx)\n\nPain is the best teacher and over a long enough time horizon I'm sure people will realize humanity thrives with more, not less, energy use. Hopefully more wake up and realize science isn't something you can own.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/disclosetv/status/1576522107051446273&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI hate the censorship on Twitter but damn has this platform been helpful in showing me how corrupt many of our current corporations, politicians and governments have become. Good will win out anon. Just remember next time someone tries to destroy something to prove their point they are likely either incomptent or malicious and should be treated with disdain. I want to see humanity thrive and I don't know how it can do so when there are powerful people in charge who think you can own the science. I did learn the scientific method during high school and I don't recall the part where you pay off people to own the science. Maybe I just wasn't paying enough attention?🤣\n\nJoke aside, these people take themself too seriously so don't be afraid to meme them, mock them, and show them we can all thrive if they stop being such jackasses. I do want a healthy world but we can't lose sight of first principles and the fact that the Earth has a harsh climate all over and it is cheap abundant energy that makes our modern day life so convenient. I'm not a scientist by trade but I do like to believe I'm smart enough to realize when I'm being fed bullshit. Maybe I'm missing something in my analysis but it is so off-putting to realize that your search results are being manipulated by Google & the UN because they own the science. If that doesn't make you think most of what \"they\" are saying is propaganda then I have a bridge to sell you👀\n\n10/24/22\n\nConor Jay Chepenik",
  "wordCount": 1229,
  "readingTime": 4.837735849056604,
  "claps": 0,
  "voters": 0
}