{
  "id": "2307d5c0ae48",
  "title": "Day 127",
  "createdAt": "2022-07-28 01:44:39",
  "tags": [
    "bitcoin",
    "future",
    "ozark",
    "federal-reserve",
    "metaphor"
  ],
  "url": "https://chepenikconor.medium.com/day-127-2307d5c0ae48",
  "content": "# Day 127\n\nBeen thinking a lot about how bitcoin will get distributed over the coming years. This [tweet](https://twitter.com/derekmross/status/1546280375525277696?s=20&t=TlMq6Fh30h06lnDKx6Btrg) from Derek Ross has me excited about people, like myself and Derek, who will be distributing corn by using it to pay our children for chores. I also think Fedimints will do a lot to bring bitcoin into the hands of those who aren't able to utilize KYC/AML exchanges to purchase some corn. This Bitcoin Magazine article was really interesting and has me wondering what is going to happen.\n\n> [**Can Fedimints Help Bitcoin Scale To The World?**](https://bitcoinmagazine.com/culture/will-fedimints-bring-bitcoin-to-the-world)\n\nThis quote from the article really stood out to me. \"In any event, in authoritarian regimes and dictatorships - which constitute most emerging markets - Bitcoin use may be already legally limited or banned. For example, in Nigeria, [citizens cannot connect their bank accounts to cryptocurrency exchanges](https://bitcoinmagazine.com/business/bitcoin-will-persist-in-nigeria-but-the-ban-changes-things), lest they get their funds frozen and financial services cut off. So the local exchanges operate in a peer-to-peer (P2P) model.\" While I feel bad the people in Nigeria that can't connect their bank to a crypto exchange it's positive that these same people are trading in a P2P manner. I use exchanges because it's so much easier to dollar cost average with something like a Strike than it is to use Bisq to find someone to buy Bitcoin from everyday. It would change the way I was able to dollar cost average if I had to do P2P transactions, but it would also provide me much better privacy. Like so many in the Bitcoin space point out there are tradeoffs with everything. Maybe it is worth getting a small non-kyc stack just in case. Plus learning how to use tools like Bisq will be good for my bitcoin journey. An exciting space indeed. I appreciated how the BTC mag article also quoted my boy Hal who said, \"There is a very good reason for Bitcoin-backed banks to exist, issuing their own digital cash currency, redeemable for bitcoins. Bitcoin itself cannot scale to have every single financial transaction in the world be broadcast to everyone and included in the block chain. There needs to be a secondary level of payment systems which is lighter weight and more efficient... Bitcoin-backed banks will solve these problems. They can work like banks did before nationalization of currency. Different banks can have different policies, some more aggressive, some more conservative. Some would be fractional reserve while others may be 100% Bitcoin backed. Interest rates may vary. Cash from some banks may trade at a discount to that from others. I believe this will be the ultimate fate of Bitcoin, to be the 'high-powered money' that serves as a reserve currency for banks that issue their own digital cash. Most Bitcoin transactions will occur between banks, to settle net transfers. Bitcoin transactions by private individuals will be as rare as... well, as Bitcoin-based purchases are today.\" Hal was a big brain. No doubt about it and the way I see it: the key to helping people onboard with Bitcoin is helping them consider tradeoffs. I've been guilty of flat out shilling bitcoin without telling people to take their $ off the exchange, to do the work, and why this new system so powerful. Bitcoin is mind blowing when you go down the rabbit hole. It's hard to unsee a lot of the things you learn while studying Bitcoin. Svetski and John joked on a Bitcoin pod that Bitcoin might be the second coming of christ and it's not an idea I'd be so quick to write off. This new asset will be a source of truth for the world in the same way the Bible has been a source of truth for the past 5,000 years. Many will attack it, many will impose their own views and preach their interpretations, and many won't put in the work. Those that do will be reward greatly and while I'm still trying to figure out if I agree with this comparison Bitcoin has literally made me want to read the Bible so I can interpret the text for myself with a middlemen. As we like to say in this space: Don't Trust; Verify!\n\nSide note, saw some people in my diversity slack chat at work mention that Pepe is a hate symbol. This is ridiculous in my opinion and I will continue to use Pepe, not as a hate symbol but as the hilarious meme the frog is. Pepe is based not hateful. Glad Bitcoin twitter has brought Pepe back in full force.\n\nToday I was enjoying the sunset on my porch with my girlfriend. It was nice looking at the cotton candy skyline. We were dancing and enjoying the moment when she made a comment about me getting her pregnant. I joked that my genitals are like the Fed's money printer and her private parts were like the masses who suffered when the Fed spun up the money printer and wreaked havoc via inflation. She didn't get the comparison but it was a funny one to me because the Fed doesn't suffer the consequences when they print but the masses do about 9 month after via inflation. You know the length of a pregnancy. Anyways, she told me not to ruin the moment by talking about money so I enjoyed the rest of the sunset and then came and wrote this. Hahahaha love me a good metaphor🤣\n\nAlso finished Ozark tonight. Solid way to end the series. Lot of respect for what Jason Batemen did with that show. Got boring for a second towards the very end but the final episode: chef's kiss.\n\n![Photo by Pixabay: [https://www.pexels.com/photo/silhouette-of-tree-near-body-of-water-during-golden-hour-36717/](https://www.pexels.com/photo/silhouette-of-tree-near-body-of-water-during-golden-hour-36717/)](https://miro.medium.com/1*sZYkD7xncjemHTE784URTA.jpeg)\n\n7/27/22\n\nConor Jay Chepenik",
  "wordCount": 969,
  "readingTime": 3.8566037735849057,
  "claps": 0,
  "voters": 0
}