{
  "id": "24e791ac785a",
  "title": "Day 191",
  "createdAt": "2022-09-30 01:24:23",
  "tags": [
    "currency",
    "fiat",
    "hard-money",
    "podcasts",
    "walks"
  ],
  "url": "https://chepenikconor.medium.com/day-191-24e791ac785a",
  "content": "# Day 191\n\nToday I had the pleasure of enjoying some good content on ze old TCP/IP protocol. Listened to this absolute banger of a podcast on my walk home from work.\n\n> [**Corrupt Money Corrupts Absolutely with Godfrey Bloom (WiM220)**](https://open.spotify.com/episode/5ZLK1H7WiFawAU8uslSosr?si=zXV119M2SA6VaqIsmsV5KA&context=spotify%3Ashow%3A25LPvm8EewBGyfQQ1abIsE)\n\nDecided to skip the T and walk home from downtown Boston. Always a good idea to walk when possible. It's only slightly over 3 miles home from my office building and walking with a good podcast is a modern day pleasure I hope many generations can enjoy. You won't hear points like the ones made by Godfrey and Robert in the mainstream media, but these gentlemen are talking about some really important stuff. Heavy topics, but alas there is hope. For those who prepare and plan at least.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/newsjunkiebreak/status/1575621816718364673&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nCame across this via DM and my god. I just thought I'd post to remind myself you can't save everyone. There are bad actors who will do bad things and not take the time to help others, seek truth, provide value, etc. However, there are also those who will try and build a better life for themselves and their kin. I hope to be in the latter and I'm grateful Bitcoin helps me do this because it allows me to store my wealth in money that can't be debased.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/dka218/status/1575550673969479680&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThis was such a beautiful metaphor by Daniel about how every crash just helps Bitcoin find more long term hodlers. We are not going anywhere and will only put more of our \"value\" into this new system. Every time the price crashes the traders or \"buildings built of wood\" leave and wait for the next cycle. Over a long enough time horizon you end up with very little wood or \"paper hands\" left in the system. Now that I think about it this metaphor brings a whole new meaning to the term paper hands hahahaha.\n\nRound about way to say it is wild times out there. So much crazy stuff is going on and I'm just grateful that I'm young and get to live through Bitcoin being monetized for the first time. I'm honestly so fortunate. Maybe I'm wrong but I doubt it. I have great conviction that I will look back on these posts and be very grateful I started saving in money that turned out to be deflationary rather than very inflationary fiat.\n\nAs a matter of fact I expect the inflation to get even worse as central banks devalue currency even more to pay for expenses that there is no mathematical way they can pay without printing. \"Printer is coming\". This chart was wild and what's even more messed up is despite this chart my dollars can still buy me less than they could in 2020.\n\n![](https://miro.medium.com/0*lXBabC5zMzmSOVah)\n\nOh 🐋 . Not financial advice but I would recommend learning about Bitcoin anon. No one in fiat land is coming to save you but they might devalue your fiat and tax it as well so they can hand it out to your lazy neighbor who doesn't want to work. All that to say: Good vibes. Stay positive. Focus on what you can control. Remember to let off steam when need be. Learn from this kitty.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/tweetsofcats/status/1575545521443598336&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n9/29/22\n\nConor Jay Chepenik",
  "wordCount": 553,
  "readingTime": 2.286792452830189,
  "claps": 0,
  "voters": 0
}