{
  "id": "25d8ddcf789d",
  "title": "Day 80",
  "createdAt": "2022-06-10 17:55:25",
  "tags": [
    "law-abiding-citizen",
    "soveirgn-individual",
    "atlas-shrugged",
    "coffee",
    "good-weather"
  ],
  "url": "https://chepenikconor.medium.com/day-80-25d8ddcf789d",
  "content": "# Day 80\n\nLovely Friday weather up here in Cambridge, Mass. Went and got a coffee with my girlfriend this morning and I must say I love going to coffee shops. I know it's not the most practical way to spend money with CPI inflation coming in at a whopping 8.6% this morning, but sometimes you got to splurge. Plus it's lovely taking a walk with the girlfriend when the sun is shining. Not sure what I want to do this weekend. Maybe I'll go hiking. A quick google search yielded me the Emerland Necklace conservatory around Fenway. I know the area pretty well and it is a great spot. The Boston MFA is right around there and they've had some cool exhibits in the past. Being in nature always makes me feel better. Yesterday I went and sat in the local park next to the Cambridge Public Library and read _The Sovereign Individual_. Nothing spells \"what a chill guy\" like reading that book. Hahahaha jokes aside it is actually a fantastic book and it was so calming sitting in nature. It is so hard to not get caught up staring at screens all day and every time I step outside I'm reminded my DNA is encoded to be in nature. It is good to find stuff that soothes us. Pretty much the only way to deal with all the demands of the modern world that don't include pharmaceuticals.\n\n![](https://miro.medium.com/1*Yei9EFOIMBbKg4UEV067hw.jpeg)\n\nBeen thinking about this tweet recently. An excellent point indeed. I've heard it said that the male brain isn't fully developed until 25 anyways. The government might have had the best of intentions passing these laws (probably not but for argument's sake, let us say they did). It is wild to think that an 18-year-old can do the 3 things above but still can't go and get a 6 pack, some smokes, and bear arms unless they enter the military. We need strong father figures showing our men how to behave like a responsible law-abiding citizens. Not a bunch of lawmakers coming up with laws that ultimately don't do much except criminalize activities that most 18–20-year-olds will figure out a way to do anyways. Europe has plenty of problems but I've always respected the drinking culture. If you tell people they can't have something you can rest assured they will want that thing. By taking away the taboo part of drinking it is no longer a big deal to have a pint of beer at dinner. I've seen countless examples throughout my life of kids getting sick from alcohol because they tried to drink too much. I firmly believe if we showed kids how to responsibly drink rather than having them wait till college where they binge drink we would be much better off.\n\n![](https://miro.medium.com/1*bQZZxaVMPoAcHZeWkP16bw.jpeg)\n\nThe same goes for weapons. Guns can be a tool of destruction but they can also save lives. The founding fathers knew governments might become tyrannical so they put in our constitution the right to bear arms. If you have people who know how to respect a weapon and understand why it is never okay to point a gun at someone (even if you have checked and made sure the gun is empty) we wouldn't need to pass laws regulating gun use. Criminals don't abide by these laws anyway so to take away the rights of citizens doing the right thing because of some sick individuals is counter-intuitive. _Atlas Shrugged_ was an incredible book and Ayn Rand was right about governments making the activities of law-abiding citizens illegal to protect themselves. This is how you get a nation to enter a dark place. I know good will win out, I just pray it is sooner rather than later. Whatever happens, God has my back and he is going to give me the courage to face any challenge that comes my way.\n\nI got faith in this great country to get back on its feet. The bad guys aren't going to be able to enforce their top-down controls forever and I just hope more plebs like me start to see the light and use Bitcoin to opt out. The Great Reset will not be what the WEF thinks it will be. Good people are going to win. Happy Friday anon I hope you have an amazing weekend or day depending on whenever the hell you read this.\n\n6/10/22\n\nConor Jay Chepenik",
  "wordCount": 740,
  "readingTime": 3.1757861635220124,
  "claps": 0,
  "voters": 0
}