{
  "id": "26b2c1c5f40d",
  "title": "Day 11",
  "createdAt": "2022-04-02 12:48:55",
  "tags": [
    "newport",
    "colombia",
    "imf",
    "peer-to-peer-trade",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-11-26b2c1c5f40d",
  "content": "# Day 11\n\n![](https://miro.medium.com/0*jlXPs6JK8YOTIZPz)\n\nAlcohol is such a love hate relationship for me. I'm down in Newport for the weekend, got an Air BNB with the ole ball and chain. We had dinner last night and 4 drinks later we are both passed out in bed the second we get back to our residence. Luckily, the place we got dinner was less than half a mile away so it was an easy walk back. I'm excited to go exploring Rhode Island today. Been in Newport once to visit a buddy who went to Salve Regina, but only stayed for the day. Excited to experience Newport for a full weekend. Life is hard, but traveling has got to be one of the best things about it. Exploring new places and meeting the locals is one of my favorite activities. Traveling also helps me keep an open mind. I went to Colombia the summer before my senior year of college and it was very humbling seeing how others lived. Colombia is a beautiful country and life was not so different from the states. The one thing that was humbling was seeing poverty as I had never seen it before. The United States is weird in the sense that we do have poverty, but it's much more out of sight. Depends on your city but I've lived in Jacksonville, FL and Boston, MA the majority of my life. Both places have homeless people but they usually keep to themselves. In Colombia, homeless people rode the bus and sold all sorts of goods. So did kids, blind people, and even mothers with small children. In a sense, they are all entrepreneurs and it was very convenient that I could buy a snack on my way to work in the morning.\n\nMy guess is it's America's bureaucratic bullshit that hides poverty in most places throughout my country. Anyone trying to sell stuff on a bus would likely be stopped and given a ticket for not having a permit. When poor people steal from the poor (or try and sell them goods illegally) it's called robbery. When the rich steal from the poor it's called business or government policy. I love the ethos of The United States, but 99% of our politicians are a joke. Looking forward to a future where people can trade in a peer-to-peer manner without having to worry that Uncle Sam is lurking around the corner making sure he gets his cut. I also think the reason Latin America is not more developed in some places is because of the IMF and its greedy/predatory lending practices. _[Confessions Of An Economic](https://www.thriftbooks.com/w/confessions-of-an-economic-hit-man_john-perkins/248413/item/133755/?mkwid=%7cdc&pcrid=77584453551348&pkw=&pmt=be&slid=&product=133755&plc=&pgrid=1241348881775103&ptaid=pla-4581183928899667#idiq=133755&edition=2562117)_ Hit Man by John Perkins really opened my eyes. Latin America is incredible and the people are so kind. They have a rich culture and from the little bit I got to experience a beautiful land. It's a shame that countries like the U.S and organizations like the world bank and IMF screw these countries over while claiming to be helping them. Bitcoin will fix this.\n\n4/2/22\n\nConor Jay Chepenik",
  "wordCount": 508,
  "readingTime": 2.116981132075472,
  "claps": 17,
  "voters": 1
}