{
  "id": "283476029fb",
  "title": "Day 283",
  "createdAt": "2022-12-30 14:57:55",
  "tags": [
    "black-pill",
    "white-pill",
    "orange-pill"
  ],
  "url": "https://chepenikconor.medium.com/day-283-283476029fb",
  "content": "# Day 283\n\nIncreased productivity that technology enables should make everyone wealthier via deflation in money. As the price of goods and services become cheaper our money has increased purchasing power. Since our system is set up on debt and credit this doesn't take place. The inflationary force of a Central Bank fights the deflationary force of technology. The idea we need inflation to stimulate the economy is ridiculous. It is asinine to think that because deflation is taking hold people will not spend money. If you knew your money would be worth more in the future and your two choices were save that money or buy groceries and avoid starvation any sane person would pick the latter. Sure people might end up saving more in a deflationary environment but they will still spend to get the goods and services they need to live. Not to mention saving should be encouraged. In our current fiat system there is not much difference between savings and investing when they should be two completely different things. When savings and investing become intermingled it leads to a massive misallocation of capital. Let's give deflation a chance! Many of these ideas came from the Closing The Loop podcast and as far as I can tell no one explains this stuff better than Jeff Booth. Highly recommend listening if you think I'm missing something in my analysis above.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F6eXXuAaLfbLoOMZUZdJanQ%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F6eXXuAaLfbLoOMZUZdJanQ&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f996a37c7ad5fe7fd17d6863a&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nMy biggest takeaway is that we all have on fiat tented glasses that obfuscate the things we see in society. Thomas Massie tweeted this out today and it has me thinking about how flawed some of our measuring sticks are.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/repthomasmassie/status/1608826375552794624&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nTake GDP for example. If the Federal Government is accounting for roughly 24% of GDP what is stopping them from theoretically printing more money to increase the GDP to any number they want? Why couldn't they manipulate the numbers to make it seem like everything is great? Why do we measure jobs as this incredibly important thing when most jobs are doing menial tasks people hate rather than innovating and trying to create solutions that provide value in a free market? My conclusion: so they can keep up their massive grift. Jobs, GDP, and CPI are all manipulated metrics that do not give a clear picture of the state of things. Value is subjective and there is no way to measure it precisely. The job of a functioning free market is to eliminate scarcity by letting price signals play out between two parties who are acting without coercion from a top-down authority. It is simple supply and demand and these price signals get broken when the market has coercion applied from an authority figure who prevents market actors from choosing freely.\n\nOne thing I do ponder is would the U.S have been able to win World War 1 and World War 2 had we not had a Central Bank? Then again, I'm not sure these wars would have taken place had the world not had Central Banks. These wars seem to be fought over a break down in money. It is no coincidence after World War 2 a new monetary order was set up at Bretton Woods in New Hampshire.\n\nI don't have all the answers to creating a perfect society. Human nature has shown us many times that if the money can be corrupted it will be corrupted to enrich a select few. There are many such cases throughout history including, but not limited to, Rome, Weimar Germany, and the U.S today. At some point the grift becomes so egregious that the money fails. I hope Bitcoin can help fix this before the entire system collapses because a lot of people still don't get it. I thought this meme posted by Elon was very apt to what I'm discussing.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/elonmusk/status/1608828315581976576&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe \"system\" is not going to teach people how to break out of it. How to free yourself from fiat currency where some people have to spend all their labor working for the thing that others can literally create out of thin air. This is not to black pill anyone even though discovering this kind of sucks. No this piece is about white pilling people. Which for me was taking the orange pill. The orange pill might as well be the white pill lmao. All the Bitcoiners I've met in real life at Bitcoin meetups are so excited for what we can build. The friendships forged and ideas discussed will create a better world. The network effect of Bitcoin is growing everyday and while those here for the short term gains will likely get flushed out because of the USD price, the builders, the innovators, the dreamers are here to stay. It sucks having to relearn everything but trust me (go verify for yourself actually) it is worth it. At least it was for me. If we didn't have Bitcoin I would have a nihilistic view on society. It is because of Bitcoin that I have the utmost faith good is going to win out!\n\n12/30/22\n\nConor Jay Chepenik",
  "wordCount": 841,
  "readingTime": 3.1735849056603773,
  "claps": 0,
  "voters": 0
}