{
  "id": "2897fc1cfee6",
  "title": "Day 14",
  "createdAt": "2022-04-06 00:30:34",
  "tags": [
    "hey-now",
    "languages",
    "express-yourself",
    "pick-up-sports",
    "love"
  ],
  "url": "https://chepenikconor.medium.com/day-14-2897fc1cfee6",
  "content": "# Day 14\n\nHey now hey now hey now. I like this phrase. Don't know why but it's fun to say and people have cracked up when I used it while playing pick-up sports. I was playing pick-up basketball the other day and right before someone tried to go into the cookie jar I picked the ball up, yelled hey now, and passed it to the best player on my team. Try it out next time you are playing sports anon. Shoot a goal, Hey Now, Swish a three, Hey Now, Score a touchdown, HEY NOW!\n\nI was listening to Robert [Breedlove's Podcast with Mike Hill](https://open.spotify.com/episode/61SLnljTm1e3j9kxKUawJT?si=awsp2U3UTTiY8JiBh36ddQ) the other day and Mike said something that I haven't been able to stop thinking about. He said that language is a subset of metaphors. I'd always assumed it was the opposite. According to Google \"A metaphor is a figure of speech that, for rhetorical effect, directly refers to one thing by mentioning another. It may provide clarity or identify hidden similarities between two different ideas.\" When people say \"The facts explain it clearly\" they are personifying \"the facts\". This is just one example and Mike gives much better ones in the podcast which I highly recommend.\n\nIt just amazes me how necessary metaphors are to everyday life. If you listen closely to anyone talk it is like they are just making a bunch of metaphors to get their point across. We as humans are literally restricted to what we can say based on our language. I'm glad I speak English, one of the most common languages in the world, but I'm eager to learn more languages so I can express myself more dynamically. No wonder people who speak multiple languages have more pathways in the brain. They can literally express themselves better.\n\n![](https://miro.medium.com/0*ivPjh9Le_0Kaezbg)\n\nHablo un picito espanol pero neccesito aprendar mucho mas. I also need to figure out how to add the Spanish keyboard so I can add the proper squibbles above certain letters.\n\nLife is good amigos. The Bitcoin price is just under 45k last I checked and I feel fortunate that I'm going to be living through hyperbitcoinization. Orange pilled by buddy Keenan recently which has felt amazing and he was texting me today asking for bitcoin resources. Life is so funny and so awesome. Sometimes it's hard and other times it feels like you can just manifest things. Got to keep a good attitude so I can keep doing the latter. Hopeful to have a farm one day and sell stuff for bitcoin. Need to stop dreaming about it and go make it happen. Hey now!XD\n\nConor Jay Chepenik\n\n4/5/22",
  "wordCount": 440,
  "readingTime": 1.860377358490566,
  "claps": 0,
  "voters": 0
}