{
  "id": "2b1522d60657",
  "title": "Day 200",
  "createdAt": "2022-10-08 16:32:20",
  "tags": [
    "sun",
    "treasury",
    "federal-reserve",
    "poker",
    "engineers"
  ],
  "url": "https://chepenikconor.medium.com/day-200-2b1522d60657",
  "content": "# Day 200\n\nDay Woah I'm talking Daniel Jones. No clue where that comes from nor do I really like Daniel Jones but I love saying the phrase DAY WOAH DANIEL JONES to my friends. The same friends who I played Poker with last night and won a couple of $hit coins. By shitcoins I mean USD of course hahahaha. Poker is a fascinating game with more strategy than I had initially anticipated. It's always more fun when you start out hot but I felt like I played a fantastic round last night. Got off to an early lead with a straight and just started rolling. It helps getting out front early because if you have the majority of chips you can take some chances and even loose a few hands without any major problems. It was a 25$ buy in so win or lose it didn't break the bank but I can imagine there are some tense games played when big money is on the line. I also appreciate playing Poker with people who understand Poker. There are mind games to it and being able to bluff with conviction is a hell of a skill. For example, on one of the hands last night a kid had a pair of Jacks and Queens and the other player had diddly squat. The player with diddly squat goes you have the Jack and Queen don't you and then raised it to all in. There was a King on the flop so the Kid with Jack and Queen assumed his opponent had the better hand and folded. The dude with diddly squat revealed his hand after and I couldn't stop laughing because he bluffed that so perfectly. The kid got super lucky guessing what the kid had but the fact the player with an actual hand answered \"YES!\" was so perfect because immediately the dude with nothing knew he could bluff and take the hand.\n\nI don't think something like that would happen at an actual Casino because when you're playing with friends it's easier to crack jokes, get in each others heads, etc. That said, there is something nice about playing with people you're comfortable with and I'm still laughing about my buddy getting bluffed out of a great hand. Texas Hold Em is a great game. I'm tempted to learn some other poker games but then again less is more. Better to specialize and get really good at one thing than be mediocre at a bunch. Especially if that thing is going to involve money on the line. Narrow your focus to hone your energy.\n\nGoing to play some golf with my friends later today and I'm looking forward to that. Woke up feeling a little groggy so I took a cold shower and went for a walk to the nearest coffee shop. It always amazes me how much better the ☀️ can make me feel. I remember hearing on a J.R.E clip that the sun turns on like 500 positive switches in your body. I believe it. The sun is the literal life giver. It provides the energy so our planet doesn't freeze. While that might seem like a \"no shit\" type of thing it is not something I think about enough. Without the sun's energy we would not exist and it also reminds me how crucial energy is to life. I listened to this synopsis of Saylor and Breedlove's super long series yesterday and Micheal made the point he knows society will have made it when we have monetary engineers in the same way we have nuclear, aeronautical, electric, and every other kind of engineer. Having monetary engineers running the money rather than lawyers and politicians would make society so much more productive.\n\n> [**Synopsis of The Saylor Series with Michael Saylor (WiM221) | The \"What is Money?\" Show**](https://whatismoneypodcast.com/episodes/synopsis-of-the-saylor-series-with-michael-saylor-wim221)\n\nJerome Powell, the head of the Federal Reserve, literally has a background as a lawyer. It is no surprise the money is corrupted when we have political whims impacting everyone's finances rather than people engineering it to be optimized fairly. God bless Satoshi for being the OG monetary engineer I guess. Using energy as a way to measure money is the key to abundance and prosperity. Bitcoin does this and I'm with Saylor about looking forward to the day when monetary engineers are figuring out the best way to mine Bitcoin optimally rather than having this clown show running the money.\n\n![](https://miro.medium.com/0*Y5MV60xGbjJeWUu-.jpg)\n\nAnyways, I digress. These people are the last type of people we should be asking for thoughts on Bitcoin. It would be like asking a factory worker what he thinks of robot automation. I'm sure they would be pissed about losing their job to a technology that makes their position obsolete. Maybe there is a factory worker out there with the skill to go produce value in the economy in other ways so they are happy to see a machine make their redundant job not necessary anymore. For the unskilled person though I don't think they would feel this way. This might not be the best metaphor because factory workers historically don't make insane amounts of money while Powell and Yellen do for being kleptocrats. If you were making insane amounts of money for simply giving speeches and deciding what capital should cost with backwards looking data you would likely be terrified about the idea of computer code making your job obsolete. Enough shit talking the Fed, Treasury, and the people running these communist organizations that steal from people via quantitative easing.\n\nI have a golf game to go enjoy.\n\n10/8/22\n\nConor Jay Chepenik",
  "wordCount": 955,
  "readingTime": 3.8037735849056604,
  "claps": 2,
  "voters": 2
}