{
  "id": "2ba6eeacc23b",
  "title": "Day 1038",
  "createdAt": "2025-01-24 03:42:28",
  "tags": [
    "cryptocloaks"
  ],
  "url": "https://chepenikconor.medium.com/day-1038-2ba6eeacc23b",
  "content": "# Day 1038\n\n**CryptoCloaks: From Turkey Plants to A Full Time Bitcoin Business**\n\nIn 2017, Rick was knee-deep in corporate monotony, working at a turkey processing plant, overseeing the demise of 36,000 turkeys a day. But Bitcoin, as it so often does, sparked a radical shift. \"I got really sick of the corporate bulls***\" Rick candidly admits. That realization led him to an unlikely intersection of interests: Bitcoin and 3D printing.\n\nRick's journey started with a simple problem - where to store his Ledger Nano S without it cluttering his desk. Armed with a newly acquired 3D printer, he designed a discreet mount for himself. Soon, he realized he wasn't the only one with this need, and CryptoCloaks was born. \"I figured maybe other people would want to buy them,\" Rick recalls. He began selling his creations on Etsy in late 2017, juggling long hours between his day job and his growing side hustle. \"For the next five years, I'd work at the Turkey plant, come home, and then start building CryptoCloaks. Eventually, I got sick of 20-hour days and made the full-time jump.\"\n\n**Innovation in Bitcoin Accessories**\n\nCryptoCloaks quickly expanded beyond simple mounts. Today, they offer an array of 3D-printed Bitcoin accessories, from functional node cases to artistic pieces like Bitcoin Grenades. The ethos is clear: practical, creative, and deeply rooted in Bitcoin's cypherpunk ideals of privacy and decentralization.\n\n![You can find more of their products at [https://www.cryptocloaks.com/product-category/btcgoodies/](https://www.cryptocloaks.com/product-category/btcgoodies/)](https://miro.medium.com/1*rIicjCIXxqo1Zs0OM0lw7A.png)\n\n\"Every Bitcoiner should own a 3D printer,\" Rick says with conviction. \"It's self-sovereignty on a whole different level. You have Bitcoin for the money, and now you have 3D printing as everything else for the most part.\"\n\nTheir product lineup reflects that philosophy. Take the 'Tomb,' for example - a cleverly disguised container for seed phrase backups. \"It says 'Caution: Do Not Ingest, Insect Deterrent' on top, so nobody touches it.\"\n\n**Bitcoin-Powered Business Growth**\n\nFrom the start, CryptoCloaks has embraced Bitcoin. They've run their own BTC Pay Server for seven of the eight years they've been in business. Accepting Bitcoin allows them to operate with low fees, global reach, and the confidence that their money isn't controlled by a third party.\n\n\"We've been running our BTC pay server since we realized we wanted to keep our own Bitcoin,\" Rick explains. \"Bitcoin makes it easier to deal with international customers without worrying about currency exchanges or bank nonsense.\"\n\n**The Future of 3D Printing and Bitcoin**\n\nThe 3D printing industry has evolved rapidly, and CryptoCloaks has been riding that wave. From the early days of unreliable, fire-prone printers to today's sleek, plug-and-play machines like the Bambu Labs A1, the space has transformed dramatically. Rick sees the next frontier in metal 3D printing.\n\n\"Right now, metal 3D printing is a $100,000 investment, but just like how FDM (Fused Deposition Modeling) printers have become household items, I think metal printers will follow. Imagine printing seed phrase backups or even hardware wallet components in metal right from home. That's the future I'm excited about.\"\n\n**Home Mining and 3D Printing: A Perfect Match**\n\nOne of the most promising synergies between Bitcoin and 3D printing lies in home mining. \"Heat reuse is going to be huge,\" Rick says. \"We've already experimented with cases that turn an S9 into a space heater, and I think we'll see even more innovation here.\"\n\nThe potential for decentralization in mining excites him, but he acknowledges the challenges. \"Home miners need to scale up and keep pace with the industrial guys. It's tough, but if we keep building and innovating, we can get there.\"\n\n**Lessons Learned and Advice from a Succesful Bitcoin Business**\n\nRick's biggest advice to newcomers? \"Backup and recovery should be your number one thing!\" He's seen too many people learn the hard way. A pro tip: test your backup. \"Before you commit to storing your Bitcoin, wipe the device and recover it from your backup. If something's off, you'll be glad you tested it first.\"\n\nFor Bitcoiners interested in 3D printing, Rick encourages them to dive in. \"It's liberating.\" You really can print useful things around the house, and once you get comfortable with 3D printing, the sky's the limit. It's amazing to see someone take a passion project and turn it into a full fledged Bitcoin business.\n\n**Keep Building**\n\nCryptoCloaks isn't a solo effort anymore. \"We're a small but mighty team,\" Rick says, giving credit where it's due. Bruff handles the web engineering, Mopar runs their Florida operations, and Stuart drives business development. \"2024 was our biggest year yet, and I couldn't have done it without them.\"\n\n[CryptoCloaks](https://www.cryptocloaks.com/) has grown from a side hustle into a full-time gig, proving that passion and persistence, plus a little help from Bitcoin, can turn a simple idea into a thriving business. Whether it's helping Bitcoiners stay secure or providing functional art pieces, Rick and his team are doing so with CryptoCloaks.\n\nAnd if you ever need a discreet place to hide your seed phrase, just remember: \"Caution: Do Not Ingest.\"\n\n![Op-sec made easy with The Tomb - discreet, secure, and clever. [https://www.cryptocloaks.com/product/the-tomb/](https://www.cryptocloaks.com/product/the-tomb/)](https://miro.medium.com/1*kCg0GrlyeMoIFQEf2Nk3hQ.png)\n\n1/23/25\n\nConor Jay Chepenik",
  "wordCount": 832,
  "readingTime": 3.5229559748427675,
  "claps": 0,
  "voters": 0
}