{
  "id": "2bfd3617f5ae",
  "title": "Day 1004",
  "createdAt": "2024-12-21 01:55:21",
  "tags": [
    "there",
    "is",
    "nothing",
    "like-a",
    "soul"
  ],
  "url": "https://chepenikconor.medium.com/day-1004-2bfd3617f5ae",
  "content": "# Day 1004\n\nI saw an X post today that made me think about what the future is going to look like. One word: different.\n\n![[https://x.com/NickADobos/status/1870181128021344486](https://x.com/NickADobos/status/1870181128021344486)](https://miro.medium.com/1*krHD27IVzSKU78WsGXlyWg.png)\n\nYesterday I used AI to help me build this app in less than an hour: [https://quotestoansweryourquestions.replit.app](https://t.co/xnpj7xiSCz) I'm far from a professional coder, but just talking to chatGPT o1 I was able to refactor and improve this app to be pretty happy with it.\n\nNow imagine when AI is so cracked it can connect to a DB, optimize payments, eat 99% of the entire SaaS industry whole because everyone just builds internal tools with an AI bot.\n\nI agree with Nick that those who learn to use the technology will fair better in the future as not having an AI integrated into your machine will make it hard to compete with those who do.\n\nStill, I don't want to rely _too_ heavily on the machines. There's real value in wrestling with an idea until you finally break through to understanding. It reminds me of reading a book. At first, it may not feel stimulating, but push through that initial barrier and soon you're fully engaged, getting that \"dopamine drip.\" Social media and certain AI-driven solutions give you a quick hit without any effort. If AI solves your problems instantly, why would you ever push through that tough mental work that makes the final \"click\" so rewarding?\n\nThe key is to use these tools wisely. Allow them to enhance your capabilities, not replace your judgment. Trust your instincts. I was talking with a friend yesterday about the importance of gut feelings. Most people give off a certain \"vibe\" if you're willing to pay attention. My buddy had dealt with some questionable individuals in his past, and he noticed that how their dogs behaved toward him often predicted their owners' intentions. Friendly dogs usually meant friendly people; hostile dogs tended to mean trouble. It's a crude heuristic, but it underscores the importance of instinct.\n\nMy personal challenge is to trust my intuition more. I don't want to outsource my gut feeling to a machine that can't truly discern right from wrong the way my mind, body, and soul can. The future is exciting, but we should move forward with careful discernment.\n\nI like how PBD phrases it. Be 51% optimistic (the future looks bright, etc.), and 49% only the paranoid survive. Humanity is set to thrive; just make sure you don't sign a deal with the devil.\n\nNo matter how advanced AI becomes, it can never replicate the quality that makes humans truly unique: our souls. Unless God decides to bestow AGI with a soul of its own, it will never possess the essence that defines us as human beings made in the Creator's image. AI can empower us, connect us, and enable achievements we once thought impossible, but it will never replace that intangible, God-given spark.\n\n![Image promp used with chatGPT's Dalle: \"A high-contrast, futuristic cityscape at twilight with glowing neon lights blending into natural greenery. In the foreground, a human silhouette stands on a small hill, half bathed in warm, natural light and half lit by the city's neon hue. In one hand, they hold an old, well-worn book; in the other, a subtle holographic interface hovers. Overhead, a faint golden outline hints at a spiritual presence - a soft, ethereal glow encircling the figure's head. The scene should feel both hopeful and cautionary, capturing the tension and harmony between human intuition and rapid technological growth.\"](https://miro.medium.com/1*6RxLzFBuglElHvf3kMrZ7w.png)\n\nListen to your gut. Trust that inner compass that is so easy to tune out and ignore in our noisy world. When it comes to investing there is a saying \"when in doubt zoom out\". The same applies to the future as a human. When in doubt look inwards. You will find the important answers inside yourself. Not from a machine.\n\n12/20/24\n\nConor Jay Chepenik",
  "wordCount": 545,
  "readingTime": 2.439937106918239,
  "claps": 1,
  "voters": 1
}