{
  "id": "2c40eea6a326",
  "title": "Day 894",
  "createdAt": "2024-09-02 03:35:38",
  "tags": [
    "math",
    "bitcoin",
    "golden-ratio",
    "i",
    "think"
  ],
  "url": "https://chepenikconor.medium.com/day-894-2c40eea6a326",
  "content": "# Day 894\n\nWholesome activities\n\n- Time spent with family\n\n- Exercise\n\n- Learning\n\n- Breathing\n\n- Entering flow state by doing hard things I care about\n\n![](https://miro.medium.com/1*_aCKRZAvHUkQgLpQ1-RMfA.png)\n\nSmall positive changes in our daily habits and mindset can make a big difference over time.\n\nHere are three reason why math is cool.\n\nThe Golden Ratio in nature and art: The golden ratio, approximately 1.618, appears repeatedly in nature and has been used in art and architecture for centuries. It's found in the spiral of a nautilus shell, the arrangement of leaves on some plants, and even in the proportions of the human face. Artists and architects have used it to create aesthetically pleasing compositions, from the ancient Greeks to modern designers.\n\n![I'm told this image is a representation of the Fibonacci spiral, whatever](https://miro.medium.com/1*vRYFL8TnauVlCU5b9hy5fw.jpeg)\n\nThe usefulness of imaginary numbers: Imaginary numbers, based on the square root of -1 (i), might seem like a purely abstract concept. However, they're crucial in many real-world applications. They're used in electrical engineering to describe alternating current, in quantum mechanics to describe the behavior of particles, and even in computer graphics for creating realistic 3D animations.\n\n![](https://miro.medium.com/1*Aj4IB-xEEa4iR8lXDj46kw.jpeg)\n\n![My updated version](https://miro.medium.com/1*_aCKRZAvHUkQgLpQ1-RMfA.png)\n\nThe unexpected connection between prime numbers and cryptography: Prime numbers, those divisible only by 1 and themselves, are at the heart of modern cryptography. The difficulty of factoring very large numbers into their prime factors is the basis for RSA encryption, which is used to secure much of our digital communication. This shows how a seemingly abstract mathematical concept has direct, crucial applications in our daily lives.\n\n![great color scheme indeed anon](https://miro.medium.com/1*_-zD5nBAvRf0eqA-RepNpg.png)\n\n![Nostr](https://miro.medium.com/1*5Paxs-kJxN0hAN13wgOWMA.png)\n\n![Chair, coffee, table](https://miro.medium.com/1*tyzrxBLA16TkYf4AWZVB2A.png)\n\nA new month. Let's get it.\n\n9/1/24\n\nConor Jay Chepenik",
  "wordCount": 249,
  "readingTime": 1.989622641509434,
  "claps": 0,
  "voters": 0
}