{
  "id": "2c59b5a9c234",
  "title": "Day 957",
  "createdAt": "2024-11-04 01:21:57",
  "tags": [
    "george-washington",
    "fiat",
    "money",
    "bitcoin",
    "continental-currency"
  ],
  "url": "https://chepenikconor.medium.com/day-957-2c59b5a9c234",
  "content": "# Day 957\n\n![8-bit style image of George Washington and his boy enjoying a beer](https://miro.medium.com/0*uM3ZDmOCfrKvFaHu)\n\nPicture this: It's 1780, and George Washington's sitting in his camp, fuming over a pile of worthless \"Continental Currency.\" He's got soldiers to pay, supplies to buy, and - surprise! - his money's basically monopoly bills. \"Not worth a Continental,\" they say, and Washington's thinking, \"Great. I've been waging war with Chuck E. Cheese tokens.\"\n\nFast forward to today, and you've got the Federal Reserve, sitting like some financial wizard behind the curtain. \"What do we do when we want to 'stimulate' the economy?\" Oh, just print some more! And who's paying attention to that pesky thing called inflation? Pfft, what's a little erosion of savings and the destruction of purchasing power among friends?\n\n![](https://miro.medium.com/1*ixVAEMG_G9NQZnxw7InFnA.png)\n\nWashington saw it coming a mile away. He could've been a time traveler in 1786 when he wrote to Jefferson like a prophet: \"Paper money? Oh, that stuff's gonna ruin commerce, oppress the honest folks, and make fraud a national sport.\" He basically predicted modern fiat currency with the same energy you'd use to warn someone about a 3 a.m. Taco Bell run. You know it's gonna end badly, but nobody listens.\n\nAnd here we are in the modern day. Central bankers are printing dollars like they're handing out flyers for a bad garage band, acting like it's not a problem. They tell us, \"Don't worry, trust the system. We've got this under control,\" while inflation balloons and our savings evaporate faster than a Snapchat message. Want to save money for retirement? Just kidding, your savings will be worth a cup of coffee by the time you hit 65. Maybe.\n\nMeanwhile, these central banks are treating fiat currency like it's their own private \"invisible tax\" machine. \"Let's print some more money, nobody will notice!\" Oh, we notice alright, especially when it costs $20 for a hamburger and housing is more unaffordable than ever. But hey, at least it's not Weimar Germany - yet.\n\nBitcoiners and libertarians are on the sidelines, eating popcorn and laughing. \"See? Told you so.\" They've got their algorithmic control, a fixed supply, and not a central banker in sight. \"Wait, so the money supply is just... fixed? Like, no one can print more?\" Exactly. It's like Washington's dream come true - no more funny money, no more hyperinflation, no more financial crises caused by overzealous bureaucrats treating the economy like a piñata.\n\nFiat currency? It's the classic hustle. Fractional reserve banking? Well, that's just like selling tickets to a concert that doesn't even have a venue yet. But hey, as long as the music's playing, keep dancing, right? Just don't ask what happens when everyone tries to cash out at the same time.\n\nIn the end, Washington's ghost is sitting somewhere, shaking his head, sipping on some ethereal whiskey, watching the chaos unfold. \"I warned you,\" he says. And if he knew about Bitcoin, he'd definitely be a maximalist by now.\n\n11/3/24\n\nConor Jay Chepenik",
  "wordCount": 485,
  "readingTime": 2.2135220125786166,
  "claps": 10,
  "voters": 1
}