{
  "id": "2d9907293199",
  "title": "Day 57",
  "createdAt": "2022-05-19 00:24:08",
  "tags": [
    "appendicitis",
    "health",
    "grateful",
    "streak",
    "god-bless"
  ],
  "url": "https://chepenikconor.medium.com/day-57-2d9907293199",
  "content": "# Day 57\n\n*Graphic image of my stomach below after my surgery*\n\nToday I had to get surgery to remove my appendix. Health is something we all take for granted until we have a major issue or problem arise. Hospitals are scary places lol. The staff is really nice though. I am grateful that I have people in my life, like my girlfriend, to help me type this out because I am quite loopy. It was an incredibly humbling experience suffering all day until they finally removed my appendix. Now it's a different kind of pain, so I must rest and take it easy so my abdomens can recover from this surgery. Not going to lie part of me was quite worried that I was going to break my writing streak and not be able to post today. Weird thought to have while absolutely going through it, but a sign that I'm forming a positive habit. God bless the doctors for getting me in and out in a single day and making sure my appendix didn't kill me. Got too much to live for now. Can't wait to see little Satoshi pop out one day (no clue what I'm actually going to name the kid but Paige always rolls her eyes when I reference our child as Satoshi). Don't think she realizes this is the biggest compliment I could pay someone since Satoshi freed us from the fiat system. That said, days like today remind me we have made some incredible advancements despite a corrupted system. I'm just excited to watch our species get better and better, and create a world of abundance as we learn to live with rules, not rulers.\n\nRemember don't ever take your health for granted anon. God bless.\n\n![](https://miro.medium.com/1*Wz9qHnt8mbCCJfsL33xe6g.jpeg)\n\n5/18/22\n\nConor Chepenik (transcribed by Paige because I am loopy and it was an absolute effort even transcribing this post).",
  "wordCount": 312,
  "readingTime": 1.3773584905660377,
  "claps": 0,
  "voters": 0
}