{
  "id": "2e14fea036c1",
  "title": "Day 635",
  "createdAt": "2023-12-18 02:39:14",
  "tags": [
    "war",
    "robert-greene",
    "strategy",
    "psyops",
    "metaphor"
  ],
  "url": "https://chepenikconor.medium.com/day-635-2e14fea036c1",
  "content": "# Day 635\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1736562259726356557%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAnother quote about war I like is\n\n> \"Against war one might say that it makes the victor stupid and the vanquished malicious. In its favor, that in producing these two effects it barbarizes, and so makes the combatants more natural. For culture it is a sleep or a wintertime, and man emerges from it stronger for good and for evil.\"\n\n> - Friedrich Nietzsche\n\nHere is another one!\n\n> \"Nature has made up her mind that what cannot defend itself shall not be defended.\"\n\n> - Ralph Waldo Emerson\n\n![](https://miro.medium.com/1*TuNtyeNSGo6DuYCHss13tA.png)\n\nI just started reading Robert Greene's _War_ and it is great so far. I like how he talks about the importance of strategy. I've only read the preface but even that has been packed full of these amazing quotes which I am sharing on my own socials.\n\nGreene's insights on strategy are fascinating. They compellingly mirror the concept of psychological operations (psy-ops) even though Greene does not label them as such in the preface. Greene unravels the intricate dance between strategists, who mastermind the grand plans, and tacticians, who execute these plans often unaware of their broader implications. This interplay illuminates a stark reality: many of us unknowingly play the role of pawns in a game orchestrated by unseen masters. The strategists' success hinges on maintaining this ignorance, for if the pawns were aware of their manipulated roles, they might refuse to participate. This is why I think about psy-ops because that is what helps keep the pawns ignorant.\n\nThis theme, though rooted in ancient warfare, strikingly parallels our modern world. Psy-ops are not relics of the past; they are alive and well, subtly shaping our perceptions and decisions. Today's strategists, whether in politics, media, or corporate spheres, deftly maneuver the public, often keeping them in the dark to advance their agendas.\n\nIn this context, Greene's work becomes more than historical analysis; it's a lens through which to view our current societal dynamics. It prompts critical reflection on our roles as individuals within these larger machinations. Are we the pawns, tacticians, or strategists in our own lives and societies? And more importantly, how can we shift from being unwitting participants to informed, active players in the grand strategy of our times?\n\nThe old adage \"ignorance is bliss\" overlooks the fact that knowledge and awareness are crucial for making informed decisions and understanding the complexities of the world. While ignorance may provide temporary comfort, it often leads to missed opportunities for growth, learning, and the ability to effectively navigate life's challenges.\n\n12/17/23\n\nConor Jay Chepenik",
  "wordCount": 425,
  "readingTime": 1.8037735849056604,
  "claps": 50,
  "voters": 1
}