{
  "id": "2eb47eb6a04f",
  "title": "Day 64",
  "createdAt": "2022-05-26 01:57:54",
  "tags": [
    "guns",
    "politics",
    "fatherhood",
    "fortunate",
    "law-abiding"
  ],
  "url": "https://chepenikconor.medium.com/day-64-2eb47eb6a04f",
  "content": "# Day 64\n\nMy heart goes out to all those who lost a loved one due to the mass shootings that took place in Texas and New York. Disgusting acts of violence that led to innocent people being murdered. It saddens me deeply that there are people who are so mentally ill they could commit such atrocities. It is also heartbreaking to see politicians use these deaths to call for gun control. They should be mourning the loss of life, not trying to pass off their agendas. I don't know how to fix this, but I don't believe stricter gun control laws are the answer. Criminals will find a way to get a weapon and commit mass murder regardless of the law. Law-abiding citizens should not have their 2nd amendment rights restricted because criminals went and murdered innocent people. It seems as if these criminals are specifically targeting areas they know have strict gun control laws in place since these are the areas that won't be able to defend themselves. I don't think giving teachers a gun is the answer either, but public schools should have police ready to respond. Instead of sending 40 billion to Ukraine to fund a proxy war we should be urging diplomacy and using that money to beef up school protection. I'm not an expert and it is terrifying to think that the United States society is so broken people are committing these acts. It just seems like the politicians in this country are looking to use a horrible situation to further their own agenda which is also disgusting.\n\n![](https://miro.medium.com/1*1U27Vo4uxz1AIoI7HZ8_1g.jpeg)\n\nEnough doom and gloom for this post though. Life is too short to dwell on the negatives. It is important to address the bad things but dwelling is not how you honor the lives of the fallen. Cherishing your life and living to the best of your ability is. Last night I got to do the first minute in my stand-up set in front of my comedy class. It was an incredible time and I got some good laughs. There really is something special about opening up about yourself in comedy. Audiences resonate with people who they can relate with and one of the best ways to get an audience to relate is by discussing stuff that happened in your own life. I cracked jokes about how my Dad lived a little too vicariously through me and my sister's sporting events. I also cracked jokes about Bitcoin, having a kid, and the financial struggle or freedom they will experience based on what happens. I know diversifying is key when investing, but I truly believe I'm saving with Bitcoin. Most people wouldn't call saving USD a stupid choice, but many call saving in Bitcoin \"ridiculous\". If you look at the chart of how the US dollar has retained its value over the years it isn't pretty. Bitcoin on the other hand has been extremely volatile but my god has it appreciated massively over the course of many years. Thus, it is great to joke about since most people think Bitcoin is just an investment, but I truly believe it to be the best savings technology the world has ever seen. If bitcoin is corrupted the world will face some serious bullshit with fiat currencies. Obviously, I need fiat to pay bills and what not but I don't think saving in USD is a great idea. Funny how cash is trash but cash is also king. Both are true. I will only keep enough fiat to pay my bills. Looking forward to the day when I can pay my bills with sats.\n\nOrdered 120 lbs of beef last night and bought a freezer on Offerup/Letgo tonight. My girlfriend was not very happy, but ya boi needs his grass-fed beef. I pray to God we don't see food shortages because of this proxy war in Ukraine, but if less developed countries are any indication it is not looking pretty. Seeing videos of people rioting in Sri Lanka because of food shortages and power outages is both humbling and terrifying. I'm so fortunate to have all my basic needs met and sometimes I take all of it for granted because I don't love my job. Truth be told there are parts I very much enjoy, but selling can just suck sometimes. That's part of life though and it has taught me some very practical skills. I've also been cooking a lot with my newly purchased cast-iron skillet which has been fun. Spoke with my Dad on the phone today and he said that he also bought a cast-iron skillet recently. Funny we both got into cooking on a cast-iron, and I don't plan on ever going back. The thing is so great to cook on and mad tasty. Didn't watch the doc about how bad teflon is for you, but my buddy Keenan told me it's pretty god awful. I will take his word for it. It is kind of a pain in the ass to clean the cast-iron, but that is such a small price to pay for a better flavor and healthier cooking experience.\n\nSpoke with my Grandfather tonight as well and had an incredible conversation. My Papa is the man and I'm so lucky to have both a Father and Grandfather who raised me to be the man I am today. I'm far from perfect, but I'm proud of who I am. I try to keep an open mind and think critically. I pay my taxes and I'm mostly a law-abiding citizen. Some laws are stupid as shit and ya boi does his fair share of jaywalking (after looking both ways of course) but I do my best to be a stand-up citizen.\n\nFinally, I'm excited for this Memorial Day weekend. My buddy Pierce is coming up and a lot of old football buddies from Tufts are coming back into town. Life is short and now that I'm out of college it is such a treat getting to hang with old friends. Love you Anon. God bless. Stay safe and don't ever apologize for your right to defend yourself. I'm grateful to live in a country that has the 2nd amendment allowing citizens to protect themselves from those that wish to do them harm and I pray this evil stops. Remember asking your government to protect you is like asking a pimp to respect you.\n\n5/25/22\n\nConor Jay Chepenik",
  "wordCount": 1080,
  "readingTime": 4.275471698113208,
  "claps": 0,
  "voters": 0
}