{
  "id": "2ee6841814ef",
  "title": "Day 455",
  "createdAt": "2023-06-21 03:26:13",
  "tags": [
    "bitcoin",
    "blackrock"
  ],
  "url": "https://chepenikconor.medium.com/day-455-2ee6841814ef",
  "content": "# Day 455\n\nBitcoin doesn't rely on BlackRock, but BlackRock could potentially benefit from Bitcoin. While their involvement in the space might attract more institutional investors and drive up adoption, entrusting BlackRock to hold your bitcoin poses significant drawbacks. Sovereign individuals who truly value their financial autonomy understand the importance of retaining control over their private keys and refrain from handing them over to third-party entities.\n\n![](https://miro.medium.com/0*vF4h5RejkoxL6t2C)\n\nDrawbacks to entrusting your bitcoin to BlackRock include:\n\n- Lack of Control and Counterparty Risk: By entrusting your Bitcoin to BlackRock, you relinquish control over your private keys, exposing yourself to counterparty risk. You lose the ability to independently transact, store, and secure your bitcoin, relying instead on BlackRock's security measures. If they fail, your bitcoin is at risk.\n\n- Centralization: Trusting BlackRock with your private keys contradicts the decentralized nature of Bitcoin. Bitcoin was designed to operate without intermediaries, and relying on BlackRock contributes to centralization. This undermines the principles of decentralization and financial sovereignty that Bitcoin stands for.\n\n- Loss of Privacy and Potential Restrictions: Using BlackRock as a third-party service may require you to disclose personal information, undergo identity verification, and comply with regulations. This compromises the privacy that Bitcoin can offer. Additionally, third-party services may impose limitations on accessing or using your bitcoin, potentially restricting your freedom to manage your assets.\n\nOne can understand why an institution might opt for not self-custodying Bitcoin due to legal reasons, such as compliance requirements or regulatory frameworks. However, as an individual self-custodying ensures that you have complete control over your own funds. By using reputable wallets and running your own node, you can maintain sovereignty over your bitcoin without relying on third parties or intermediaries. The erosion of purchasing power in fiat currency will cause \"whales\" to acquire large amounts of bitcoin and there are only ever going to be 21 million bitcoin. Trust yourself to find a chair and benefit from the potential long-term value appreciation of bitcoin before fiat musical chairs stop playing. If and when that happens you are not going to want to rely on institutions that may not have the same alignment of interests as you.\n\n![](https://miro.medium.com/1*0N5xglUKNbAVJcKaJLjMFg.jpeg)\n\nIn times when the monetary system is functioning relatively smoothly, it is often taken for granted and people may not deeply ponder the question, \"What is money?\" However, when inflation begins to erode the value of traditional currencies, it becomes imperative to examine the fundamental functions that money should ideally fulfill: store of value, medium of exchange, and unit of account. In this context, an increasing number of individuals are acknowledging the inherent shortcomings of fiat currency and turning to bitcoin as a potential alternative.\n\nWhile it's natural for individuals to desire their bitcoin's value to go up in USD terms, the true beauty of Bitcoin lies in the level of control it affords to its users. One of the key advantages of Bitcoin is its finite supply, which safeguards against government-induced inflation. This network aligns self-interest with the benefits of a sovereign form of money.\n\nEntrusting institutions like BlackRock with Bitcoin introduces various concerns, including a lack of control, counterparty risk, centralization, loss of privacy, and potential restrictions. In contrast, Bitcoin empowers individuals with financial sovereignty. By self-custodying their bitcoin, individuals can ensure a currency that is finite, under their control, and secure when properly managed. The recent filing by BlackRock for a potential Bitcoin ETF (Exchange-Traded Fund) raises specific concerns, particularly regarding their role in a situation called a \"fork.\" A fork occurs when the Bitcoin network undergoes a significant change, resulting in the emergence of two separate versions, each with its own rules and characteristics. In this context, there is apprehension among node runners and Bitcoiners about entrusting BlackRock with the power to determine the validity of different chains during a fork. This carries significant risks. There is a fear that BlackRock may manipulate the market by favoring the less valued chain, selling actual bitcoin while propping up their own \"fake\" version. Such actions could undermine faith in the financial system and damage Bitcoin. Despite these concerns, there is also optimism that Bitcoin will emerge stronger from such situations. It is crucial for node runners and Bitcoiners to closely monitor BlackRock's actions and ensure the preservation of Bitcoin's integrity. Self-custody remains the best way to protect against potential manipulation and maintain control over one's own funds. Furthermore, it is worth noting that during a previous fork called Bitcoin Cash, most cryptocurrency exchanges supported both resulting coins. If BlackRock fails to do the same in the event of a split, it could have detrimental consequences for Bitcoin holders and the overall ecosystem. In simple terms, a fork in the context of Bitcoin is when the existing network undergoes a significant change that results in the emergence of two separate versions. Each version has its own rules and characteristics, creating two distinct paths for the future of the cryptocurrency. This can happen due to differences in opinions, technical upgrades, or other factors. It is important for Bitcoiners to be aware of forks and the potential implications they may have on the network and their holdings. Recently, James O'Keefe made an interesting discovery regarding BlackRock's recruiting practices. Watching the video raises concerns about having these people control your money. Anyone with common sense and an understanding of Bitcoin would not trust someone else to hold their keys, especially not a firm that charges fees and potentially engages in unscrupulous activities.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=d04bfffea46d4aeda930ec88cc64b87c&schema=twitter&url=https%3A//twitter.com/JamesOKeefeIII/status/1671262303319392259%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3D4fce0568f2ce49e8b54624ef71a8a5bd\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe common sense approach is to educate yourself extensively about Bitcoin. By doing so, you will recognize the importance of holding your own private keys and taking control of your financial assets. War might be good for big business but it's horrible for those who don't seek violence to solve our problems. Money that is backed by open source software and math is better than money backed by debt and violence. Use your common sense and join the peaceful revolution so we can live in a world that is united by the spirit of America instead of harmed by it. Winston Churchill once famously observed that Americans will always do the right thing, only after they have tried everything else. Giving up the global reserve currency is not ideal, but it must be done if we want to be a nation who prioritizes the fundamental tenets of Family, Freedom, and Security. Printing money detracts from all of this. Bitcoin fixes it with it's hard capped supply of 21 million and perfect supply schedule issuance.\n\n![](https://miro.medium.com/0*OiqzxnCAe7RKly5w.png)\n\nI got to take a look at this tomorrow but it's a start...\n\n6/20/23\n\nConor Jay Chepenik",
  "wordCount": 1106,
  "readingTime": 4.723584905660378,
  "claps": 0,
  "voters": 0
}