{
  "id": "2f7e0b1dc42",
  "title": "Day 178",
  "createdAt": "2022-09-16 22:00:06",
  "tags": [
    "focus",
    "patience",
    "maine",
    "city",
    "nature"
  ],
  "url": "https://chepenikconor.medium.com/day-178-2f7e0b1dc42",
  "content": "# Day 178\n\nMaine is unreal. Today I walked outside with my shoes off, did a deep squat, and looked through trees to see a magnificent pond. Afterwards we walked down the hill to the little dock at the BnB I'm staying and took a selfie. My girlfriend, my Dad, and myself basked in the rays and agreed to come back in the evening for a quick dip in the pond. It was a pretty damn big pond almost verging on a lake. My girl looked at me this morning when we came back into the house and said \"It's time we leave the city\". Can't argue with that. This AirBNB we are staying at is awesome but my god being in nature is what makes it so special. The air, the trees, everything about it just makes me feel so connected with the earth. One of my old football coaches would always say \"You can't be upset and grateful at the same time\". The first time I heard that I thought he was being cheesy. As most things go, the older I got the more I realized there is so much truth to that statement.\n\n![](https://miro.medium.com/1*MyEfAgQV7MaQRaapUCWyOg.jpeg)\n\nI'll always have love for the city but being in a metropolitan area does makes me feel like I need to keep my guard up. Hard to tune in with the rest of nature and \"just be\" when I'm constantly on the lookout for threats. Not saying every human is threatening but between the cars, pedestrians, and constant construction on massive skyscrapers it is important to be alert so you don't get hurt in a city. The air is also not as fresh and crisp as it is in the middle of nowhere. There are more bugs out here in nature but that's okay. Bugs > large dumpster rats lol.\n\nThe stores around this part of Maine are also awesome. The food tastes so good and driving around is nice because there is beautiful scenery everywhere. I don't know what the future holds but I do know that the New England outdoors will always have a special place in my heart. I'm excited to raise my child in this part of the world and show them what a special place New England is. I do love Florida where I grew up but I didn't get to truly experience the seasons. I've grown fond of winter sports and true sweater weather.\n\nI was listening to a new Udemy course about computers and the teacher started off talking about gratitude and focus. Most of the first part can just be attributed to \"You can't be upset and grateful at the same time\" but the focus part made me think. The teacher mentioned that taking 5 minutes everyday to close your eyes and do what you can to just focus on the feeling of breathing is really powerful. Pretty much meditation is what he is talking about. Sounds so simple but recently I've noticed I have had difficulty focusing. Partly my own doing spending so much time looking at a screen. TCP/IP is truly incredible. The internet is a vast place and I'm very grateful for what it has allowed humanity. I also need to remember that too much of anything is not a good thing. By taking 5 minutes every day and remembering to be persistent and patient with my practice I can be build some solid focus. I got faith anon.\n\n9/16/22\n\nConor Jay Chepenik",
  "wordCount": 579,
  "readingTime": 2.384905660377359,
  "claps": 0,
  "voters": 0
}