{
  "id": "302fd8289079",
  "title": "Day 41",
  "createdAt": "2022-05-02 17:02:43",
  "tags": [
    "liberty",
    "world-economic-forum",
    "hypocrisy",
    "twitter",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-41-302fd8289079",
  "content": "# Day 41\n\nFeels like I'm in the middle of a movie waiting to see what is going to happen next with global markets. An absolutely wild time to be living through and I'm grateful to be 25 rather than 75 so my retirement isn't getting smoked in a 60/40 bond, stock portfolio. Also wild to see the crap they put out on the MSM. Here is a [quote tweet](https://twitter.com/ConorChepenik/status/1520959742310760450?s=20&t=32XiqqzmuTC4fLVAJa8tsQ) of mine from a video I still can't believe is real. I'm not sure if these people spend any time thinking critically or if they are just happy to stroke a paycheck and say whatever they are paid to say. I know there is corruption in the world but it seems like they are exposing themselves at this point. It doesn't take a rocket scientist to see through this B.S but man do these people make a big deal out of a rocket scientist arguing for what is in the constitution. Freedom of Speech is a right for every American (hopefully one day a right for anyone being born) and the points being made in this clip are heinous. Money is a tool to allow people to cooperate. I can't believe someone on CNN tried to get his point across by saying,\"Those guys believe in making money\". Buddy, I got news for you. So does anyone who is offering a good or service.\n\n![](https://miro.medium.com/1*8LErL0YsCLcoYCAjY9JSxg.jpeg)\n\nAlso, didn't realize that Ron Desantis was not at the correspondent's dinner but the people who are rolling out a Disinformation board \"Ministry Of Truth\" are lying about him being there so they could crack jokes at his expense. Watch this [video](https://twitter.com/therecount/status/1521137015533842432?s=20&t=32XiqqzmuTC4fLVAJa8tsQ). The more they try and bad-mouth Desantis the more respect I gain for this man. Trevor could've joked about Desantis anyways. I have no idea what they hoped to gain by pretending he was in attendance. This type of stuff is so stupid and it just makes the \"elite\" look like clowns. These people seem to be elite at one thing and that's being hypocritical. I enjoyed Trevor's stand up but learning about this made me sad. It is honestly infuriating to see these people lie and at the same time try and justify their disinformation board. As I said, feels like I'm living through a movie. Might as well be because I watch most of this stuff from a screen. You have to be pretty high up to attend any of these things in person. I digress though.\n\nWorking on my new and (final) Podcast. Going to call it The Conor Chepenik Podcast and talk about Bitcoin amongst other stuff. Eager to do it on Podcast 2.0 which I learned today was created by Adam Curry after Apple kicked Alex Jones off their platform under the guise of \"hate speech\". People need to be able to speak freely and if they can't we don't live in a free country. That is plain and simple. The abuse of power by governments around the world is unacceptable. I will not live under a WEF standard where I own nothing, have all my movements tracked, and have to use a central bank digital currency for money. This [video](https://www.youtube.com/watch?v=DpE5cBgl11U) about what the WEF wants for the world got me thinking and so I made this tweet.\n\n![](https://miro.medium.com/1*y-fFHVhTkZHAIWgH3EclXg.jpeg)\n\nWhile it was partly a joke I wouldn't be surprised to see something like this come true. Now is the time to fight back. China seems like an absolute nightmare to live in currently. I want the freedom to lead my life the way I want. Not a life optimizing for what the government deems acceptable while avoiding things that will ding my social credit score. I imagine any sane person who is not in a position to be a part of the new ruling class would feel the exact same way. Inclusive Communities > Globalism. God bless our founding fathers because if it were not for the constitution we would be in a dark place right now.\n\n5/2/22\n\nConor Jay Chepenik",
  "wordCount": 670,
  "readingTime": 2.911635220125786,
  "claps": 0,
  "voters": 0
}