{
  "id": "309e499d4d05",
  "title": "Day 546",
  "createdAt": "2023-09-20 00:44:28",
  "tags": [
    "software",
    "innovation",
    "ancestral-knowledge",
    "chepcodes",
    "youtube"
  ],
  "url": "https://chepenikconor.medium.com/day-309e499d4d05",
  "content": "# Day 546\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FsCcSmJzEeMQ%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DsCcSmJzEeMQ&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FsCcSmJzEeMQ%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nCreating coding videos has proven to be more challenging than anticipated, but it's a passion of mine. This process serves as an excellent catalyst for pushing myself to learn in a real-world context. For this video I refrained from any post-production editing; I simply coded for approximately 45 minutes straight and promptly uploaded the video to YouTube.\n\nWhen it comes to coding just know that when you encounter difficulties, it's essential to remember that the root cause often traces back to your own actions, not the computers. A harsh truth I wish I had learned sooner. Believe me when I say one ; can you cost hours of sleep if you're not careful.\n\nStill, from my vantage point it continues to stand as a truly awe-inspiring endeavor. The software industry has catapulted human innovation well beyond the confines of most other disciplines, bestowing upon humanity the ability to achieve extraordinary feats through the synergy of robust hardware and cutting-edge software solutions. It's often with the benefit of hindsight that the true significance of emerging technologies becomes obvious. Consider the printing press, which faced initial opposition from the privileged elite upon its inception. The profound impact of remarkable engineering has indelibly shaped and transformed our world.\n\nAlthough software wields the power to profoundly influence the world's GDP, it remains unable to encompass every dimension of our existence. Within the tapestry of the human experience, there exist intricate facets that defy replication by any software. I firmly hold the belief that no code crafted by humans will ever supplant the essence of the human soul. While I mustn't allow myself to be overly captivated by my silicon companions, I cherish the privilege of witnessing this epoch in human history. Simultaneously, I am determined to impart to my children the significance of treasuring tangible, real-life experiences over their digital counterparts.\n\nThis endeavor is no small feat; one need only ponder the paradoxical nature of platforms like Twitter, which exist as virtual spaces yet possess a tangible sense of place in our lives. Nevertheless, I find satisfaction in utilizing software to craft this new avi for the chepCodes Youtube channel. I must admit I'm quite pleased with the result. Wojaks are the best.\n\n![Sunset Wojak Action :D](https://miro.medium.com/1*izVXcIzcAuVSyQWjnFcB1g.jpeg)\n\n9/19/23\n\nConor Jay Chepenik",
  "wordCount": 380,
  "readingTime": 1.6339622641509433,
  "claps": 3,
  "voters": 1
}