{
  "id": "3105dc8b338f",
  "title": "Day 903",
  "createdAt": "2024-09-11 03:25:46",
  "tags": [
    "harris",
    "trump",
    "2024",
    "presidential",
    "debate"
  ],
  "url": "https://chepenikconor.medium.com/day-903-3105dc8b338f",
  "content": "# Day 903\n\n![[https://x.com/shaunmmaguire/status/1833692671065640978](https://x.com/shaunmmaguire/status/1833692671065640978?s=42)](https://miro.medium.com/1*N3EI_ofeWc9ouF7ekdW5Ag.png)\n\n![[https://x.com/ConorChepenik/status/1833671197562744896](https://x.com/ConorChepenik/status/1833671197562744896)](https://miro.medium.com/1*o__uie-7HCuKX-u1xbbdDQ.png)\n\nJokes aside, watching the debate can really set off the emotional fireworks. We're talking about hot-button issues here: abortion, war, immigration, gun rights, and the ever-present duo of lies and jokes. If your head's spinning, remember it's okay to step back, breathe, and maybe dive into some balanced info from sources that aren't just screaming into the void. Focus on what genuinely impacts your world.\n\nWhich, ironically, makes me want to steer clear of politics. Just typing that, Plato's words echo in my mind:\n\n> \"One of the penalties for refusing to participate in politics is that you end up being governed by your inferiors.\" - Plato\n\nYet, there's wisdom in discussing these matters respectfully, finding ways to engage that don't leave you needing a week-long digital detox or break from a friendship.\n\nNow, imagine explaining social media to a kid today. Seriously, if you've got any brilliant insights or must-reads on this, drop them below. It would be much appreciated!\n\nHere's a thought: by the time my daughter reaches my current age, she might be navigating immersive virtual reality spaces as her playground. Social media could evolve from merely scrolling through feeds to engaging with friends and acquaintances in VR environments that redefine social interaction. It's an exciting yet daunting prospect.\n\nSocial media remains the Wild West of idea exchange - a place where connections are forged and battles waged. As we move more of our life into the digital ether of 1s and 0s, it's crucial for parents, educators, and caregivers to anticipate these changes and prepare our children for this.\n\nApple Vision Pro and Meta Quest have shown some what this new reality might look like, but we've only scratched the surface of what's possible in VR. It is a world where social interaction will be redefined in many ways. I'm excited.\n\nIt also sucks in many ways because if you build a panopticon it stares back. Like many of lifes paradoxes we will learn and grow from the challenges we face. We should fight to maintain privacy, yet also use this transparency hold the corrupt accountable. Good debate and analysis are important. Shout out to PBD for good analysis in this summary tweet of the debate: [https://x.com/patrickbetdavid/status/1833699352000496124](https://x.com/patrickbetdavid/status/1833699352000496124)",
  "wordCount": 376,
  "readingTime": 1.802201257861635,
  "claps": 0,
  "voters": 0
}