{
  "id": "314610fe5449",
  "title": "Day 236",
  "createdAt": "2022-11-14 00:31:11",
  "tags": [
    "bitcoin",
    "heroes-journey",
    "coffee-shop",
    "lofts",
    "interactive-css"
  ],
  "url": "https://chepenikconor.medium.com/day-236-314610fe5449",
  "content": "# Day 236\n\n![[https://creator.nightcafe.studio/](https://creator.nightcafe.studio/)](https://miro.medium.com/0*ovQs_iItt32VpJ51)\n\n## Bitcoin Stop The Bleeding\n\nWhen a Doctor operates on a patient who was just badly wounded the first thing they do is make sure they can stop the bleeding. No point operating on someone if you can't get the bleeding under control because they will die. The same goes for your wealth. Fiat currencies are bleeding out and if you want to stop the bleeding in your financial life you are going to need to find a way to store your wealth in something else than cash. There are plenty of options but only one that is programmed to stop all bleeding in 2140.\n\nWestern society teaches people to not question authority, raise your hand if you want to ask questions, and trust the experts. It's hard to break out of this mentality when it has been engrained in you from a young age. It's a horrible mental model. Those who changed the world for the better didn't ask for permission to make the world a better place. They just did it. People want a hero to fix all their problems but the truth is no one is coming to save you. The heroes journey starts with identifying your heroes and the dysfunctional relationship that might be present.\n\nIt's great to listen to those who have become experts in their field to learn. The problem starts when you start worshipping them like they are Gods who can't make mistakes. Our world is changing so rapidly and if you want to be in the elite groups of society you are going to have to keep learning for the rest of your life. If you can do this you can figure out a weigh to stop bleeding with the rest of society.\n\n...\n\nWelp that's all I got in me for my Bitcoin Magazine article today. I used [Rytr](https://app.rytr.me/ryte) to help me come up with this line. \"The heroes journey starts with identifying your heroes and the dysfunctional relationship that might be present.\" Powerful AI to help get your writers block unstuck. However, AI is only so good at this point and I'm kind of stuck. That's okay it will come. Patience is key. As long as I keep flexing my writing muscle I'll churn out a solid article.\n\nToday was a nice lowkey Sunday. Hit up a coffee shop in Somerville called Bloc that is a converted bank > niche coffee shop. I liked enjoying my breakfast sandwich and cold brew coffee in a bank vault. I've always been a fan of lofts and this old bank kind of reminded me a bit of cool lofts with its brick walls.\n\nI'd love to renovate an old brick warehouse, bank building, industrial building into a badass loft. Just putting it out there: do your thing Universe. Also spent some time working on the transitions section of my personal webpage where you can see how powerful basic HTML and CSS are to make an interactive webpage. Didn't even have to touch Javascript. Kind of tired of writing for today so I'm going to go play around some more with that and let this Bitcoin magazine article brew in my subconscious. Until tomorrow anon.\n\n11/13/22\n\nConor Jay Chepenik",
  "wordCount": 536,
  "readingTime": 2.2226415094339624,
  "claps": 0,
  "voters": 0
}