{
  "id": "314e03325c5a",
  "title": "Day 1225",
  "createdAt": "2025-07-30 03:29:32",
  "tags": [
    "i",
    "like",
    "to",
    "play",
    "golf"
  ],
  "url": "https://chepenikconor.medium.com/day-1225-314e03325c5a",
  "content": "# Day 1225\n\n![[https://x.com/FoundersPodcast/status/1950213274349523217](https://x.com/FoundersPodcast/status/1950213274349523217)](https://miro.medium.com/0*eDPHzGl6K9ckZydt)\n\nWe live in a culture obsessed with \"hustle\" and doing more. Social media feeds are filled with entrepreneurs juggling 21 different projects, productivity gurus preaching about optimizing every minute, and influencers launching new ventures weekly.\n\nBut the uncomfortable truth is that most of us would be far more successful if we did less, not more. There is a hidden cost of scattered attention. For example, say you have two hours of free time and you could either:\n\n**A -** Spend those two hours improving your existing project, maybe writing better content, refining your product, or reaching out to more customers.\n\n**B -** Spend 10 minutes each exploring 12 different \"opportunities\" you saw online.\n\nMost people instinctively choose Option B. It feels productive. It feels like you're \"exploring your options\" and \"keeping doors open.\" I know I'm guilty of this sometimes. But what is actually happening is you are destroying your potential for real progress.\n\n**Focus Creates Exponential Returns**\n\nThink of skill-building like climbing a mountain. Every hour you spend working on something is like taking a step up that mountain. The higher you climb, the better your view becomes, and the more valuable each additional step.\n\nWhen you're just starting (at the bottom of the mountain), each hour of work gives you basic improvements. But when you've been focusing on something for months or years (higher up the mountain), each additional hour creates dramatically better results.\n\nThis is called \"increasing returns\", a fancy way of saying that the more you invest in something, the more you get back from each new investment.\n\n**The Mathematics Behind Mastery**\n\nLet's break this down with a simple example:\n\n**Scenario 1: The Focused Approach**\n\n- Month 1–3: You're learning the basics, making small progress\n\n- Month 4–6: You start seeing real improvements, building on your foundation\n\n- Month 7–12: Your skills compound, each hour of work produces significant results\n\n- Year 2+: You're operating at an expert level where small tweaks create huge impacts\n\n**Scenario 2: The Scattered Approach**\n\n- Month 1: Try photography\n\n- Month 2: Switch to podcast hosting\n\n- Month 3: Attempt dropshipping\n\n- Month 4: Explore crypto trading (Please don't do this one, treat Bitcoin as savings if you actually want to improve your life and stay mentally sane lol)\n\n- Month 5: Start a blog\n\n- Month 6: Try affiliate marketing\n\nIn Scenario 2, you're perpetually stuck at the bottom of multiple mountains, never climbing high enough to see real results from any of them.\n\n**The Opportunity Cost Trap**\n\n**Opportunity cost** is economist-speak for \"what you give up when you choose one thing over another.\"\n\nEvery time you start something new, you're not just spending time on that new thing, you are giving up the chance to get better at what you were already doing.\n\nHere's the kicker: The thing you were already doing probably has way more potential than you realize. You just haven't climbed high enough up that mountain to see it yet.\n\nWe're wired to get excited about new opportunities. This is totally normal and psychologists call this \"novelty bias\". Our brains literally release dopamine when we encounter something new and potentially rewarding. I feel it all the time when I walk into a space I've never been before.\n\nBut this biological programming worked great when we were hunter-gatherers looking for new food sources. It works terribly in the modern world where success comes from deep, sustained effort over time.\n\nEvery new business idea, every new skill you want to learn, every new project feels exciting precisely because it's new. Meanwhile, your current project feels boring because you've been doing it for a while.\n\nThis is your brain tricking you into self-sabotage.\n\n**The Convex Curve Principle**\n\nHere's where it gets really interesting. Most valuable activities have what's called a \"convex output curve.\"\n\n**Convex curve** = A fancy way of saying that your results start slow but then accelerate rapidly.\n\nThink about:\n\n- **Writing:** Your first 100 articles might get barely any readers. But articles 500–600 could go viral because you've developed a unique voice and audience. Or you could use the skills gained to become a professional writer. I'll admit when I started this blog over 1220 days ago I didn't set out to be a professional writer, but doing this everyday did end up allowing me to get paid for my work. Which feels amazing.\n\n- **Business:** Your first year might barely break even. But year three could be incredibly profitable because you've refined your systems and built customer loyalty.\n\n- **Investing:** Your first $1,000 invested might not feel like much. But that same investing skill applied to $100,000 creates life-changing wealth. Plus learning to set aside money to save is a great skill and when you see the returns start to happen most people want to double down.\n\nThe magic happens in the later stages of the curve, but only if you stick around long enough to reach them.\n\n![](https://miro.medium.com/1*WI1JK8j9X9QotUxo45HJTQ.png)\n\n**When Should You Actually Switch?**\n\nThis doesn't mean you should never try anything new. But before you jump ship on your current focus, ask these questions:\n\n1. Have I really explored the full potential of what I'm currently doing? Most people quit projects at 20% of their potential.\n\n2. Is this new opportunity genuinely 10x better than improving my current situation? If it's not dramatically better, stick with what you know.\n\n3. Am I running toward something better, or running away from the hard work my current project requires? Be honest about your motivation.\n\n4. What would happen if I spent the next 6 months becoming genuinely excellent at my current focus instead of starting over?\n\n5. Do I genuinely love what I'm doing enough to become great at this thing or am I doing it because of someone else?\n\nOnce you have answered these question commit to the climb. Give yourself at least 12–18 months before you evaluate whether to switch directions. This gives you time to reach the interesting part of the curve. It also helps to keep a record of your improvements. I will admit seeing the number increase everyday with these Mediums has helped me tremendously so I stick with it. When you feel like quitting, you'll have evidence of how far you've come.\n\nAnother worthwhile thing to do is get out the pen & paper so when new opportunities arise (and they will), you can write them down in a \"someday maybe\" list. When you revisit it in ~6 months most will seem far less appealing by then.\n\nWarren Buffett didn't become wealthy by trying a new investment strategy every year. He found an approach that worked and spent decades getting incrementally better at it.\n\nStephen King didn't become a bestselling author by switching between poetry, screenwriting, and novels. He focused on writing compelling stories and got better with each book.\n\nThe most successful people aren't the ones with the most diverse portfolios of activities. They're the ones who found something valuable and had the discipline to stick with it long enough to reach mastery. I'll admit my journey into Bitcoin has been like this. Deciding to focus on Bitcoin specifically and avoid the siren song of alt-coins was a great decision for me.\n\n**In Conclusion**\n\nIf you got value out of this, great, but I wrote this for myself. So I would sit down and think through what would happen if I gave the things I wanted to do my full attention for the next year, instead of dividing my energy among multiple pursuits.\n\nThe opportunity cost of scattered attention is not just the time I waste on dead-end projects. It's the exponential returns I will not get to experience because I did not climb high enough up any single mountain to reach the summit.\n\nSo to myself I say this: Choose your mountain. Start climbing. And resist the urge to switch trails every time you see a different peak in the distance.\n\nThe view from the top is worth the focused journey to get there.\n\n![I never actually did dropshipping lol](https://miro.medium.com/1*oWAsDmFXBPv9yo5Lw0sJiQ.png)\n\n7/29/25\n\nConor Jay Chepenik",
  "wordCount": 1329,
  "readingTime": 5.565094339622641,
  "claps": 0,
  "voters": 0
}