{
  "id": "321eeb1352c7",
  "title": "Day 490",
  "createdAt": "2023-07-26 00:49:10",
  "tags": [
    "bitcoin",
    "usa",
    "1st-amendment",
    "god",
    "bless-america"
  ],
  "url": "https://chepenikconor.medium.com/day-490-321eeb1352c7",
  "content": "# Day 490\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/GMONEYPEPE/status/1683646901466587139%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI don't necessarily agree that Bitcoin is intended as war-fighting technology, but I do find myself in agreement with all of Jason's points. It's quite ironic since Jason's main argument is that Bitcoin is #softwar. Among his compelling arguments, the one that resonates with me the most is the notion that Bitcoin shouldn't fall under the direct management of the U.S. Treasury.\n\nTo elaborate on this, I believe Bitcoin's decentralized nature is one of its most significant strengths, and attempting to manage or control it from a centralized authority would undermine its core principles and potential benefits. Instead, it should continue to function as a global, borderless digital asset, empowering individuals with financial sovereignty and promoting innovation in the financial landscape. Public \"financial\" infrastructure in cyber space if you will.\n\nI recommend watching the video provided in this Nostr link to gain further insights on the topic. Exploring diverse perspectives is essential when discussing complex subjects like Bitcoin's implications on various sectors, and I'm always eager to learn more from credible sources which, in my humble opinion, can only be found outside the MSM.\n\n> [**binmucker**](https://primal.net/e/note1g9c8kgw8qs9tjravsg7lehkpxexhzn4w25gcnmyv2pcttkdyvg8sxqyt2x)\n\nThis clip I posted on Nostr from this [podcast](https://youtu.be/vfWArs17Oc4) explains how the \"arsonists\" who caused the inflation are now the firefighters trying to put out the problem they created. To be fair it is insane that we have the same Central Bankers who brought us bailouts, Q.E & Z.I.R.P still running the show. It's not just about money tho. \"You gotta get that power!\"\n\nAnyways, I like this perspective about factions. Personally can't think of a good steel-man to combat this argument. Like Lowery said power is decentralized and since the beginning humans have competed for scarce resources. It's why we have 195 countries in the world according to Bard.\n\n![](https://miro.medium.com/1*P4m_ATYrVQp7F9CB_sAeAA.png)\n\nDidn't realize Elon had said something about this until I saw this note. So I checked Twitter/X.com and it is for sure a tweet/xeet.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=d04bfffea46d4aeda930ec88cc64b87c&schema=twitter&url=https%3A//twitter.com/elonmusk/status/1683852156749729793%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3D4fce0568f2ce49e8b54624ef71a8a5bd\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWild to be alive just documenting this stuff. I don't know if the 💉  is what caused Bronny to have a cardiac arrest, but Musk is correct about not knowing what caused it. It still blows my mind this was a mandated medical product to eat at restaurants or keep a job in some cases. We need science to be an open source process where people can question things out in the open and collaborate freely to make sure humanity moves in a positive direction. Say what you want about Elon but I'm happy to see on Twitter people can now question these things without getting kicked. The first amendment of the United States is so important, especially in the digital age.\n\n![](https://miro.medium.com/0*mgHsWQIZ6mMeRo8K)\n\nGrateful for the Founding Fathers & our Bill Of Rights. God bless The United States Of America.\n\n7/25/23\n\nConor Jay Chepenik",
  "wordCount": 467,
  "readingTime": 2.14559748427673,
  "claps": 1,
  "voters": 1
}