{
  "id": "3340e96ba8d4",
  "title": "Day 352",
  "createdAt": "2023-03-10 04:04:43",
  "tags": [
    "mass",
    "spirit-of-america",
    "tyrants",
    "constitution",
    "liberty"
  ],
  "url": "https://chepenikconor.medium.com/day-352-3340e96ba8d4",
  "content": "# Day 352\n\n![](https://miro.medium.com/0*rRTRG5I2lIRbp45H)\n\nMassachusetts has played a vital role in shaping America's history and culture, earning it the nickname \"Spirit of America.\" Historic events such as the Boston Tea Party and the Battle of Bunker Hill are big reasons why America was able to achieve its independence. Anyone who has spent time walking around the Boston area can tell that there is an incredible history to the town.\n\nDespite the progress made over the past ~250 years since America secured its sovereignty in 1776, the current state of freedom in America is uncertain. Recent political polarization, social unrest, and restrictions on free speech and the press are just some of the challenges contributing to the erosion of America's democratic values. The COVID-19 pandemic has made it clear that there are plenty of tyrants walking in the halls of our capital.\n\nI have nothing against voting, but it has become clear that we cannot vote our way out of the issues our country faces since we have a two-tiered system that makes it impossible to vote in anyone besides a Republican or Democrat. We need to vote with our money. One way to ensure America's prosperity and freedom for another 250 years is by demanding a non-corrupted monetary system that cannot be taxed through inflation.\n\nThe current system has led to economic inequality, leaving many Americans struggling to make ends meet while a few benefit disproportionately. As long as the Federal Reserve can print money there is no way our democracy can continue to function properly. The 'Spirit Of America' is based on her citizens securing their unalienable rights of Life, Liberty, and the pursuit of Happiness. It is our right as a people to alter or abolish any government that becomes destructive to these ends.\n\nLet me remind you that the second paragraph of the Declaration of Independence famously states,\n\n> We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. - That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, - That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness.\n\nThe principles of freedom and self-governance that inspired the birth of America remain as relevant today as they were 250 years ago. While past generations may have resorted to armed revolution to secure their rights, we now have more peaceful means to protect ourselves from tyranny. A trojan horse if you will. Bitcoin does not require any militias to be spun up or lives to be lost on a battlefield. It is computer code and math which allows for a decentralized digital currency that cannot be manipulated by corrupt governments or central banks. By opting out of the current financial system and using Bitcoin instead, we can reclaim our financial sovereignty and ensure that our unalienable rights of Life, Liberty, and the pursuit of Happiness are secured for generations to come.\n\nThat is the goal of MassAdoption. To help businesses in the New England area realize we can be the change we want to see in this world. To show as many people as possible that we don't need to ask permission from tyrants to secure the unalienable rights our founding fathers granted to us when they signed the constitution. New England is a special place, and we must work together to keep it that way for generations to come.\n\n...\n\nMade a lil progress. I have no clue how long I want to make this piece but I'm glad I got another draft written. I'm not sure how but I would also like to bring Nostr into this. Seems highly relevant. Been using that platform a lot to shitpost and share memes. Even been zapped a couple of times and I must say it feels good to be paid for shitposting. Nostr does tie in with the whole idea of freedom of speech so maybe that is the angle I will take. Will work more on it tomorrow.\n\nMy brother from another mother Keenan is coming to Boston tomorrow so I'm pumped to see him. We are going to hoop, eat steak and go for runs. Excited to spend time with the homie. If I'm lucky he will have both a Nostr and a Stacker News account by the time he leaves. I can't get any sats for reffering people to Nostr but if you haven't signed up for St[acker News you should here](https://stacker.news/r/Chep). High signal and you get paid sats for posting quality content... what's not to like?\n\n3/9/23\n\nConor Jay Chepenik",
  "wordCount": 830,
  "readingTime": 3.3320754716981136,
  "claps": 1,
  "voters": 1
}