{
  "id": "347d4641aa21",
  "title": "Day 266",
  "createdAt": "2022-12-13 17:08:11",
  "tags": [
    "bitcoin",
    "balaji",
    "lex",
    "blockchain",
    "pendulum"
  ],
  "url": "https://chepenikconor.medium.com/day-266-347d4641aa21",
  "content": "# Day 266\n\nBalaji gets a lot of hate in the circles I hang out on Twitter because he is no longer a Bitcoin maxi but I would be lying if I said this conversation was not fascinating.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FVeH7qKZr0WI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DVeH7qKZr0WI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FVeH7qKZr0WI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nFocusing on what the future can bring is so exciting! New models for science, governance, money and pretty much everything else. This podcast made me think deeply about what a big role the F.D.A plays on the lives of well ... almost everyone in the world. I found out from this podcast that Kobe actually flew to Germany to get stem cell treatments because that was something not green lit in the states. I don't like the idea of killing babies so we can have stem cells, as a matter of fact I hate that. Not sure if that is the only way to get stem cells, maybe one day we would be able to create them with a 3d printer and carbon? I don't know the reason I brought it up is because technology will solve so many of our health, wealth, and governance issues yet it is hindered from regulatory agencies who care more about companies playing nice with them than they do about the company benefiting the free market. While the F.D.A might've been beneficial at one point in time this podcast made it clear that the organization is to fixated with their own power. The past two years have shown they are not that concerned with actually protecting the end consumer. I didn't know this, but apparently Balaji was getting considered to be an advisor or regulator on Trump's F.D.A. I forgot what position exactly but a position on the F.D.A. It seems he didn't take it but I can imagine he learned a lot in the process.\n\nIt is annoying to think about the fact that no one at the F.D.A is beholden to anyone in the free market. Instead they answer to other politicians and regulators. The F.D.A can box out companies who they don't like even if that company is bringing important goods and services to the market. I hadn't thought much about how almost no one at the F.D.A was really a public figure and this kind of changed in 2020 with Covid. Now almost everyone knows who Fauci is as well as other like Francis Collins. It seems these people have qualms about being in the spotlight as they lash out on the M.S.M about how they are in danger. I don't want to see them hurt but I do hope if they committed any crimes (like suppression of the first amendment amongst other things) they are tried in a court of law and while Elon isn't perfect his sunlight is the best disinfectant policy in regards to Twitter has been refreshing after two years of censorship. I don't know how we reform the F.D.A but I wish they would prioritize truth and safety over their power to regulate. It's amazing how much influence the F.D.A and the S.E.C have on the rest of the world. Not all countries abide but the U.S legal, medical, and financial regulatory framework but a massive portion do. The United States carries a great deal of influence and while this might be breaking down now for a long time other countries just went off the U.S regulations for a variety of things. At least this is the case according to Balaji I'm by no means an expert on regulatory frameworks.\n\nOne point that kept getting brought up is how there is a pendulum swinging between decentralization and centralization. Fascinating topic to think about. On the one hand centralized coordination can allow for massive productivity until that power gets corrupted and decentralization starts to occur as a result. Then when the decentralization becomes too much and nothing gets done stuff starts to centralize again. This is a gross over simplification but the idea makes sense to me. Both have their benefits and negatives. Decentralization in a monetary network is important so one actor ca not corrupt it for themselves. However, outside of Bitcoin the decentralization trilemma makes it so other blockchains are pretty useless.\n\n![](https://miro.medium.com/0*9f96zKhFNIkeGX4o.png)\n\nAt least that is how I see it at this point. Maybe there is a case for stable coins as scaffolding while humanity weens itself off fiat but most crypto tokens gave up on decentralization so they could address scalability and security. USDC and circle being a great example of this. They got scale and security but the whole thing is reliant on Circle as a centralized controller. Ironically as more people give up on decentralization this seems to lead to retail getting rekt almost every time when the insiders of a coin dump their holdings. I'm not sure if there will be actual uses for blockchains outside of Bitcoin but this conversation convinced me to think there potentially might be. However, the odds of me personally finding the .01% of crypto that isn't garbage outside of Bitcoin seems unlikely so I will keep stacking sats and ignoring the rest until I see something so compelling I can't look away.\n\nOutside of that life is good. I got some coding to do today so that's all for today's post. Oh I subscribed to Twitter Blue so I will be officially verified soon. Pretty cool Elon opened that up to the public. Looking forward to being a reply guy who gets ranked to the top because of my blue check mark😂 🤝\n\n12/13/22\n\nConor Jay Chepenik",
  "wordCount": 919,
  "readingTime": 3.667924528301887,
  "claps": 14,
  "voters": 1
}