{
  "id": "35b7d0d6d4f9",
  "title": "Day 911",
  "createdAt": "2024-09-19 01:35:05",
  "tags": [
    "deepfakes",
    "politics",
    "founding-fathers",
    "1st-amendment",
    "truth-vs-lies"
  ],
  "url": "https://chepenikconor.medium.com/day-911-35b7d0d6d4f9",
  "content": "# Day 911\n\n**Deepfakes Don't Mean We Get To Disregard The First Amendment**\n\nGovernor Newsom's recent decision to criminalize deepfakes in California is sparking a heated debate about the balance between protecting the public from deception and upholding the sanctity of free speech. At first glance, this move might seem like a noble effort to safeguard the public from misleading digital content. However, upon closer scrutiny, it becomes apparent that this legislation might trample on the very foundations of the First Amendment.\n\n![[https://x.com/GavinNewsom/status/1836188721663873324](https://x.com/GavinNewsom/status/1836188721663873324)](https://miro.medium.com/1*-gDAon7TJEoybv0USvDSkg.png)\n\nThere were 3 bills signed which people can read more about on [the State of California's website](https://www.gov.ca.gov/2024/09/17/governor-newsom-signs-bills-to-combat-deepfake-election-content/).\n\n- **AB 2655**: Requires large online platforms to remove or label deceptive, digitally altered, or created election-related content within specified periods. It allows candidates, elected officials, election officials, and certain other authorities (including the Attorney General and district or city attorneys) to seek injunctive relief against platforms that fail to comply.\n\n- **AB 2839**: Expands the timeframe during which distributing deceptive AI-generated election content is prohibited. It extends beyond the prior 120-day limit to also cover the period up to 60 days after an election. It authorizes affected parties to file civil actions to enjoin the distribution of such content.\n\n- **AB 2355**: Requires that electoral advertisements using AI-generated or substantially altered content include a clear disclosure that the material has been altered. The Fair Political Practices Commission is authorized to enforce compliance through injunctive relief or other remedies under the Political Reform Act.\n\nAt present, humor remains legal, but history shows us that regulations tend to become more restrictive over time. Consider the income tax, initially targeting only the ultra-wealthy, which now affects nearly half the population. It's conceivable that in the not-too-distant future, something as innocuous as a satirical photo could be criminalized.\n\n![[https://x.com/MostlyPeacefull/status/1836211859898159137](https://x.com/MostlyPeacefull/status/1836211859898159137)](https://miro.medium.com/1*nU5wM57V3iZKIN4gC9ntVQ.png)\n\nThe First Amendment protects a wide spectrum of speech, even when it borders on the false or misleading. Historically, the Supreme Court has upheld the right to free expression, recognizing that even false statements are covered unless they lead to specific harms like defamation or fraud. This broad protection extends to deepfakes, no matter how misleading they may be. While deepfakes can distort reality, banning them outright raises troubling questions. Should the government have the power to decide which forms of expression are permissible? Art, satire, and parody have long used manipulation as a tool to provoke thought, and deepfakes, in a way, can be seen as a digital extension of these forms.\n\nBy taking a stance against deepfakes, Newsom's legislation opens a Pandora's box. Who gets to decide what's real and what's not? This legislation could set a dangerous precedent where the government is empowered to police speech more than it already is, leading to a chilling effect on free expression. The very purpose of the First Amendment is to prevent governmental overreach into the marketplace of ideas. If authorities are granted the power to determine the veracity of content, this could easily be weaponized against political opponents or critics, silencing dissent under the guise of combating deception. Look at what happened with the debate. There were no deepfakes, but according to a whistleblower at ABC News they gave Kamala the questions beforehand and they only fact checked Trump.\n\n![[https://x.com/kylenabecker/status/1835347966586171523](https://x.com/kylenabecker/status/1835347966586171523)](https://miro.medium.com/1*P1qk6XbNv90xqTJQSaOnjg.png)\n\nDeepfakes often intersect with political discourse, a realm where speech enjoys the highest level of protection. The Supreme Court has repeatedly emphasized that political speech is the core concern of the First Amendment. If politicians are given the authority to ban deepfakes about themselves, it would be akin to granting them the power to suppress satire, parody, or any form of political critique that employs digital manipulation. The essence of a democratic society is its ability to endure and challenge even the most provocative and misleading forms of expression.\n\nThe Supreme Court has long championed the principle that the antidote to false or misleading speech is not censorship but more speech. Instead of banning deepfakes, the focus should be on exposing and countering them through public discourse. This approach upholds the marketplace of ideas, where truth and falsity are debated openly, and the public is trusted to discern between them. Banning deepfakes, in contrast, suggests a lack of confidence in the public's ability to engage with complex and sometimes deceptive content.\n\nHumans have an innate desire to seek and protect the truth. Newsom's legislation reflects a common fear of deception, yet the First Amendment's framers placed their faith in human reason rather than governmental oversight. The idea was that an open and robust discourse would be the best defense against falsehoods. By attempting to legislate truth, we risk undermining the very principles of free and open inquiry that are essential to a democratic society.\n\nIn a twist of irony, Newsom's attempt to ban deepfakes could be seen as a deepfake of the First Amendment itself. By manipulating the concept of free speech to include only that which is deemed 'real' or 'truthful,' we create a distorted version of the First Amendment. This approach not only contradicts the spirit of free expression but also paves the way for government overreach.\n\nThe [Hustler Magazine v. Falwell (1988)](https://www.oyez.org/cases/1987/86-1278) decision provides a crucial legal precedent in this discussion. The Supreme Court ruled that a parody, which no reasonable person would believe to be true, is protected free speech. This ruling underscores the importance of safeguarding even the most outrageous forms of expression under the First Amendment. If deepfakes can be construed as a form of parody or satire, they too should fall under this protective umbrella, no matter how distasteful or misleading they may seem.\n\nEven if we grant Governor Newsom the benefit of the doubt, it's crucial to remember that the road to hell is paved with good intentions. While his efforts to combat deepfakes might stem from a genuine concern for public welfare against digital deceit, they venture dangerously towards encroaching upon First Amendment rights. In a free society, the solution to malicious speech, including deceptive deepfakes, isn't censorship but exposure through criticism. Here, the collective judgment of a decentralized, diverse hive mind - people from myriad backgrounds, perspectives, and life experiences - serves as a far more dynamic and just adjudicator than any government censor, whose position is funded by the very taxpayers they aim to regulate. This collective scrutiny not only preserves but also strengthens our democracy, ensuring that the response to deepfakes is guided not by fear, but by a dedication to the resilience of free expression. Just as the Founding Fathers intended.\n\n9/18/24\n\nConor Jay Chepenik",
  "wordCount": 1085,
  "readingTime": 4.6443396226415095,
  "claps": 0,
  "voters": 0
}