{
  "id": "36f34eed5075",
  "title": "Day 974",
  "createdAt": "2024-11-21 04:05:57",
  "tags": [
    "habits"
  ],
  "url": "https://chepenikconor.medium.com/day-974-36f34eed5075",
  "content": "# Day 974\n\nHabits: the silent architects of our lives. They are easy to overlook, but they stack up, building either the palace of your dreams or the ruins of your potential.\n\nWhat habits are you building? Ones that accumulate wealth? Ones that spend it? Both?\n\nI'll be honest: I strive to cultivate good habits. I run, write, and read daily. Consistency is my bedrock. But let's not sugarcoat reality - I've got my demons. Scrolling is one of them. Social media is _too good_ at holding my attention. The TL is lit right now and that's one of the excuses I use.\n\n![[https://x.com/nayibbukele/status/1859433926206325107](https://x.com/nayibbukele/status/1859433926206325107)](https://miro.medium.com/1*r6-l1zTBlZdlDhzTPkDFDg.png)\n\nOur digital lives online are important. If you are going to be on a timeline do your best to make it a good one. Avoid echo chambers to the best of your ability.\n\n![](https://miro.medium.com/1*Ijn-uuFV7zhxShrJQ37U9A.png)\n\n![[https://primal.net/e/note17lau078ws47ydj2wd2qx79x5afhnpe2au9pugpumk3g0xl6ectjs8k9u6s](https://primal.net/e/note17lau078ws47ydj2wd2qx79x5afhnpe2au9pugpumk3g0xl6ectjs8k9u6s)](https://miro.medium.com/1*p1qoHJCp_TDxlbQ8-ydhcg.png)\n\nI've been using Nostr and X (formerly Twitter) - tools of freedom tech. Both platforms have flaws, sure, but they also expose me to unique voices I wouldn't encounter elsewhere. There's a lot of noise in these digital spaces, but within the noise, you can find valuable signals.\n\nMaybe this is my way of justifying my time on social media. A dopamine hit here, a scroll there - aren't we all addicts in some way? A while back, I wrote about being a dopamine addict. Looking back, it feels prophetic. Social media thrives on dopamine loops, and here I am, caught in one.\n\nBut awareness is half the battle, isn't it? Habits can either enslave us or set us free. The question is: **which ones are you feeding today?**\n\n11/20/24\n\nConor Jay Chepenik",
  "wordCount": 268,
  "readingTime": 1.5613207547169812,
  "claps": 2,
  "voters": 1
}