{
  "id": "3718956ee12",
  "title": "Day 303",
  "createdAt": "2023-01-20 04:35:00",
  "tags": [
    "tao",
    "parenting",
    "reminder-for-myself"
  ],
  "url": "https://chepenikconor.medium.com/day-303-3718956ee12",
  "content": "# Day 303\n\nTo be or not to be. Let us be!\n\n> [**What the Tao Teaches About Living a Better Life**](https://medium.com/yardcouch-com/what-the-tao-teaches-about-living-a-better-life-b781f18fa838)\n\nThis Medium was excellent. I followed it up by asking chatGPT to write 10 of the top quotes from the book. Will probably turn this into a Twitter thread tomorrow.\n\n1. \"The Tao that can be spoken is not the eternal Tao.\"\n\n2. \"Nature does not hurry, yet everything is accomplished.\"\n\n3. \"He who knows others is wise; he who knows himself is enlightened.\"\n\n4. \"The journey of a thousand miles begins with one step.\"\n\n5. \"Silence is a source of great strength.\"\n\n6. \"The more you know, the less you understand.\"\n\n7. \"The truth is not always beautiful, nor beautiful words the truth.\"\n\n8. \"The greatest virtue is to follow Tao and Tao alone.\"\n\n9. \"The weak in courage is strong in cunning.\"\n\n10. \"It is easy to hate and it is difficult to love. This is how the whole scheme of things works. All good things are difficult to achieve; and bad things are very easy to get.\"\n\nThat last one is so true. Reminds of the saying \"You'll never me a hater who is richer than you\". I think I heard David Goggins say that but I could be wrong. Either way lot of wisdom in that book. I'm going to have to see if I can check it out at my local library.\n\nAfter a quick search they have various translations and interpretations but I don't see any like this one which seems to be the OG version. Probably still value in some of the interpretations but I'm trying to read directly from the source.\n\n> [**The Book of Tao: Tao Te Ching - The Tao and Its Characteristics**](https://www.amazon.com/Book-Tao-Ching-Its-Characteristics/dp/1604500980)\n\nEastern wisdom seems to be full of quality insights. Mcgill U in Canada helped me find out that \"According to tradition, it was written around 600 BCE by the [Taoist](https://www.cs.mcgill.ca/~rwest/wikispeedia/wpcd/wp/t/Taoism.htm) sage [Laozi](https://www.cs.mcgill.ca/~rwest/wikispeedia/wpcd/wp/l/Laozi.htm) (or Lao Tzu, \"Old Master\"), a record-keeper at the Zhou Dynasty court. A careful reading of the text, however, suggests that it is a compilation of maxims sharing similar themes. The text's authenticity, authorship, and date of composition or compilation are still debated.\"\n\nAmazing. Humanity constantly forgets lessons we have learned over and over again. What are you going to do?!\n\nCernovich has me thinking about the freemium model. I liked his Substack. I think transparency is key in most approaches. I'd much rather someone be up front with me about trying to sell something than hide it initially only to jam it down my throat later.\n\n> [**$50,000,000 and the Freemium Business Model**](https://mikecernovich.substack.com/p/50000000-and-the-freemium-business)\n\nI have yet to subscribe to his substack, or any for that matter, but maybe one day. I never thought I'd pay for social media but then Twitter Blue under Elon offered a chance to get a blue check mark and at the moment I am content paying 8 bucks for it. So Cernovich keep up the good work and maybe one day I will. Dude is a bestseller on Substack anyways so I don't think he is worried about my measly $7 a month, but I digress.\n\nHad a good call today about massadoption.net here is a list of things I need to focus on for my own sake.\n\n- integrating chatGPT (free open-source version Ron was telling me about) and Stable diffusion so our website is more interactive.\n\n- Learn up on BTC pay-server and Strike API so we can start taking donations in a better fashion than just Mash.\n\n- Make a meme section on binmucker.com\n\n- Write a blog tomorrow\n\n- Continue to crush runs. Ran 4 miles today which felt great. Humble brag LFG running is like a drug except the more you run the better the high feels with running😂 \n\n- Mention the story you heard on Modern Wisdom Podcast with Micheal Malice about a Ukranian Mom becoming so hungry from starvation that when her baby was crying because she couldn't feed it she ended up beating the baby to death. Heart wrenching story that serves as a reminder we are animals, without food people literally go insane, and that despite the intial challenges of parenthood we have it so good in our modern world.\n\n![](https://miro.medium.com/1*SKZWeEyvde67DQ6brfCixA.jpeg)\n\nAsked AI to generate the TAO and this is what it gave me. No clue what made it look like this but I like the image. Sometimes our instincts serve us much better than our rational brains. Food for thought 🤔\n\n1/19/23\n\nConor Jay Chepenik",
  "wordCount": 788,
  "readingTime": 3.1735849056603773,
  "claps": 0,
  "voters": 0
}