{
  "id": "38ea625cd904",
  "title": "Day 87",
  "createdAt": "2022-06-17 15:25:40",
  "tags": [
    "friday",
    "bitcoin",
    "strike",
    "blockstream",
    "central-banks"
  ],
  "url": "https://chepenikconor.medium.com/day-87-38ea625cd904",
  "content": "# Day 87\n\nBlessed to wake up on this fine Friday. Going down to New York to visit my Grandparents, cousins, and Aunt after work today. Looking forward to a nice long weekend since I don't have work Monday. My girlfriend has been listening to some based podcasts recently that talk about the bullshit that occurs in the modern medical system. It's amazing how modern medicine can save lives and also wreak havoc on young mothers at the same time. Encouraging epidurals and formula for newborns is not the move. Formula is literally filled with seed oils which are horrible for a child. I understand there might be some situations where that stuff is necessary for a mother experiencing severe pain,, but mindset is everything and we shouldn't be stressing out those about to give birth. Women need support, love, and comfort when giving birth. They should be moving around and standing upright so gravity does its job. Laying on your back to give birth seems to be a pretty recent phenomenon and makes it more difficult for a women to have a natural birth. I'm so proud of my girl for doing the work and looking into this stuff.\n\nEasy to get distracted with our phones and social media algorithms constantly feeding us stuff to provoke an emotion. Not many people are incentivized to do the work, but seeing my girl look into this stuff is so encouraging. I need to keep putting in the work with Bitcoin, the bible, and how to raise a healthy child outside the medical system. There might some surgeries or stuff that requires me to take my kid to a doctor but overall it seems there are some very corrupt incentives. I was saddened to see the U.S go forward with a vax for 6 month olds to 5 years. Young kids can easily get over covid if they catch it and it doesn't seem they need anything outside of their immune system. Oh well. I'm not a doctor, just a person who is trying to seek truth in a world that is fabricating a lot of stuff.\n\nHopeful for the future though. Saw this thread from Adam and Jack today and while part of me would love to see 10k bitcoin so I can hit my stacking goals another part of me is excited about bitcoin hitting 100k USD. Either way win-win.\n\n![](https://miro.medium.com/1*yWCMnIjyBjwDI5KGZz7PVg.jpeg)\n\n![](https://miro.medium.com/1*y8329yhz7UMVzMl9GEtM9w.jpeg)\n\nCan the Fed keep talking tough or will they have to turn back on ze old money printer? Only time will tell but I got faith that Bitcoin is just going to keep adding blocks every ten minutes. Obviously, we do need to drag inflation down, but if that means bankrupting everyone and everything I do not know if the Fed can go through with it. Only time will tell. The more erratic the Fed gets with their decisions the more I think they don't have a clue what to do anymore and are getting desperate. Luckily, the programmatic central bank, A.K.A Bitcoin, knows exactly what to do. Which is keep decreasing the block reward by half every 4 years. Not 12 unelected officials planning the price of money. Just energy money making the incentive of violence less and giving back control to soverign individuals. God I love what Bitcoin represents for the people and the world. So exciting to see nation-states getting involved and plebs continually stacking. If we have to go lower to wipe out those offering paper claims on bitcoin so be it. Need a legit return to a hard money standard. Hate to see people get wrecked who sought yield on their bitcoin, but truth be told pain is one of the best teachers.\n\nBitcoin maxis will arise out of the ashes of shitcoin and paper claim exchanges imploding. The future is bright and I'm so grateful to be living through the early stages of Bitcoin's monetization. Rejoice anon we are going to make it (if you take custody of your coins, avoid leverage, and have a low time preference) Not financial advice of course, just a recommendation to do the work and learn why the 🌽  is going to change everything for the better.\n\nIt's amazing how much I think about Bitcoin. It really is, but I'm excited for what it means for humanity and it's great having this outlet to vent my thoughts. Life is good man. Life is fucking good. Going to crush a run now and bask in this great Friday energy I feel.\n\n6/17/22\n\nConor Jay Chepenik",
  "wordCount": 757,
  "readingTime": 3.239937106918239,
  "claps": 0,
  "voters": 0
}