{
  "id": "39ee6b4f799e",
  "title": "Day 796",
  "createdAt": "2024-05-27 01:25:31",
  "tags": [
    "politics"
  ],
  "url": "https://chepenikconor.medium.com/day-796-39ee6b4f799e",
  "content": "# Day 796\n\nYesterday at the LP National Convention, Trump promised to pardon Ross Ulbricht if he gets elected. Talk about a solid political play. This dude just gained a ton of libertarian-leaning voters with that one. He also fully embraced crypto as a legit asset class and said he'd keep Elizabeth Warren and her goons away from people's Bitcoin stashes. That's some pretty slick pandering right there.\n\nYou gotta admit, it's wild watching politicians flip on crypto so fast. Just a few years ago, most of them were calling it a scam or criminal money. Some still are but they are seeing what an awful political strategy that has turned out to be. Now many of them are tripping over each other to look crypto-friendly and get in on that sweet, sweet blockchain block of voters. Trump's going all-in trying to out-crypto the other candidates. Shit, even Biden and his dinosaur crew just strong-armed the SEC into approving an Ether ETF. Few if any would've predicted that a couple months ago? Things are definitely looking up for the crypto realm in terms of mainstream acceptance and legitimacy, at least on a surface level. I still personally think Bitcoin is the only one that can serve as good money, but I'm just glad to see this overall shift from politicians flat-out attacking it to desperately pandering to all the HODLers and crypto enthusiasts.\n\nDon't get me wrong, I'm not saying we should trust any politician to actually protect our coins or internet freedom longterm. These people just do whatever polls well in the moment. But damn, it's kinda amazing to see them rapidly evolving their stance on this whole sector as it keeps blowing up. Crypto really is too big for the establishment to ignore now. The genie's out of the bottle on this one.\n\n![[https://x.com/ConorChepenik/status/1794770830808793497](https://x.com/ConorChepenik/status/1794770830808793497)](https://miro.medium.com/1*KsL2DabwGczFz5iYF1GR8A.png)\n\n5/26/24\n\nConor Jay Chepenik",
  "wordCount": 314,
  "readingTime": 1.3849056603773584,
  "claps": 0,
  "voters": 0
}