{
  "id": "3aa4c1999d34",
  "title": "Day 126",
  "createdAt": "2022-07-26 21:51:57",
  "tags": [
    "social-media",
    "algorithms",
    "web",
    "bitcoin",
    "open-mind"
  ],
  "url": "https://chepenikconor.medium.com/day-126-3aa4c1999d34",
  "content": "# Day 126\n\nDid a Podcast with a friend yesterday who goes by Q. It was a fun pod. I don't think \"web 3\" and the tokens used by these projects will be big in the future but it's cool to hear another person's perspective. My guess is that these tokens will be deemed securities and are just a better way to distribute equity in the companies/ DAOS that make these things up. I thought it was overall a productive conversation and I'm proud I was able to share my thoughts and why Bitcoin is the important thing in my perspective. While many completely right off everyone in this space always keeping an open mind so I can continue to learn and seek truth is important. Conversations like this one with Q give me a lot of hope for the future. The world would be no fun if everyone just agreed with each other and there was so sovereign individuals.\n\nBeen thinking about technology a lot recently. The thing I don't like about social media is that it encourages people to put their self worth into an algorithm we know little about. Unless you're a skilled engineer few people, if any, understand how these algorithms calculate what to show us. Funny way to think about it, but that's exactly what they're doing. Using people's likes/favorites/followers/views and posting patterns to decide what to show others. These apps are designed so people get a dopamine rush when they see likes/favorites/followers/views on their own profile. Instant gratification 24/7/365 at the tip of our fingers. I myself fall into this trap on Bitcoin Twitter and would by lying if I said I don't appreciate my echo chamber. Nature is good. Need more of that to help resist and restore my brain. Running and golf also help which is why I am always trying to do more of them. Think I should hit at least 30 miles ran in July 2022 which is always a solid month for me. Cities are cool in many ways and I love living in one at times but being in the wilderness is so peaceful. Hard to beat that. Technosapien is the way I feel in the city lol. Homosapien is how I feel it out in nature. Here is a cool photo I found online.\n\n![Photo by Дмитрий Трепольский: [https://www.pexels.com/photo/rock-tombs-in-the-mountain-8285880/](https://www.pexels.com/photo/rock-tombs-in-the-mountain-8285880/) thanks for the photo Greek Dude](https://miro.medium.com/1*NocDiER1jD1JjZ32l9yXLQ.jpeg)\n\nNow I got a Pod with my friend Lilly. Here goes Conor Chepenik Podcast #5 :D\n\n7/26/22\n\nConor Jay Chepenik",
  "wordCount": 406,
  "readingTime": 1.7320754716981133,
  "claps": 1,
  "voters": 1
}