{
  "id": "3b1b870e3aab",
  "title": "Day 220",
  "createdAt": "2022-10-28 19:17:11",
  "tags": [
    "night-out",
    "meta",
    "amazon",
    "q3",
    "q4"
  ],
  "url": "https://chepenikconor.medium.com/day-220-3b1b870e3aab",
  "content": "# Day 220\n\nUsed an AI art generator to make me a photo of \"Night Out With The Boys\" because all my college buddies are back in town for the Halloween weekend. This was the result.\n\n![[https://creator.nightcafe.studio/](https://creator.nightcafe.studio/)](https://miro.medium.com/0*aIycp7EBUM3HOJYV)\n\nHahahahaha looks like AI still has its work cut out for it but cool photo. Today started kind of slow as I had to pick my friend up from the airport then go to the dealership to get a service change. Brakes, axel fluid, inspection sticker, and a replaced tube for my wiper fluid cost a little over $1600. Brutal way to kick off a Friday but my girlfriend's safety is priceless so I'd rather cough over that money and make sure my brakes work during the winter then have something happen. Today was a good reminder that cars are liabilities not really assets. Liabilities that provide great convenience but nevertheless expensive pieces of rubber and metal.\n\nPretty wild to see Meta and Amazon trading like Dogecoin yesterday. Obviously their earnings calls were unimpressive but SHEESH. Something is wrong with the money if some of the biggest stocks in the United States are trading like this.\n\n![](https://miro.medium.com/1*fLX_7TfvzbrlhBU_UQrqgQ.png)\n\n![](https://miro.medium.com/1*dntqHD-3NfP-ThtiZ98yRg.png)\n\nThe year to date is ugly but yesterday was equally brutal. Both Jeff and Mark are billionaires and have enough money to do whatever they want so I don't exactly feel sympathy. I'm just saying this is wild to watch. I wouldn't have expected Bitcoin to be one of the least volatile assets during Q3. Q4 should be fun.\n\nLooking forward to spending some time with close friends this weekend. Don't have much else to write about today. Going to finish my work day, crush a run, and go get dinner with people I love. I'm feeling grateful. Stay happy anon.\n\n10/28/22\n\nConor Jay Chepenik",
  "wordCount": 296,
  "readingTime": 1.6669811320754717,
  "claps": 0,
  "voters": 0
}