{
  "id": "3c1fa5b6e6b2",
  "title": "Day 780",
  "createdAt": "2024-05-10 14:50:55",
  "tags": [
    "freedom-technology"
  ],
  "url": "https://chepenikconor.medium.com/day-780-3c1fa5b6e6b2",
  "content": "# Day 780\n\n[An Interview With Jack Dorsey (piratewires.com)](https://www.piratewires.com/p/interview-with-jack-dorsey-mike-solana)\n\nThis piece of journalism by Mike Solana is fantastic. Here is a summary:\n\n\"Jack Dorsey left Bluesky, the company he had founded to create a decentralized protocol for social media, because he felt it was repeating Twitter's mistakes by becoming a centralized platform with moderation tools and a board of directors.\n\nDorsey's original vision was to build an open source protocol layer that social media apps could be built on top of, removing the need for centralized content moderation. However, Bluesky ended up building just another Twitter-like app with its own policies, going against Dorsey's goal of censorship resistance.\n\nInstead, Dorsey is now supporting the development of the Nostr protocol, which he sees as truly decentralized and censorship-resistant with no company or leadership behind it. He believes centralized platforms will inevitably be compromised by government and advertiser pressures.\n\nAt Twitter, the advertising business model made it beholden to brands that could pull ads over content issues, exemplified by the Trump ban. Dorsey intended to take Twitter private and transition to an open protocol, but was hindered by an activist investor on the board.\n\nDorsey is skeptical any centralized platform can remain censorship-resistant long-term without moving to open protocols like Nostr. A key advantage of Nostr is its use of public/private key pairs, allowing users to verify identity and message authenticity without relying on corporations or governments.\n\nLooking ahead, Dorsey predicts Bitcoin will surpass $1 million by 2030 and revolutionize identity verification online. He warns upcoming elections could be impacted more by AI misinformation than social media policy changes.\"\n\nDecentralized communication platforms like Nostr hold immense promise in an era of AI deepfakes and censorship threats. Jack Dorsey is right to champion Nostr's approach of using public/private key pairs, which could prove crucial in authenticating and verifying content in a world where AI-generated misinformation is a growing concern.\n\nMoreover, Nostr's decentralized architecture, devoid of a central attack vector, makes it resilient against censorship attempts by governments or other entities. Unlike centralized platforms like Twitter, which can be coerced into implementing distopian censorship measures, Nostr's hydra-like design ensures that if one server is taken down, others can emerge to keep the network alive.\n\nWhile Elon Musk's efforts to promote free speech on Twitter are commendable, the platform's centralized nature leaves it vulnerable to external pressures. In contrast, Nostr represents a truly free and open communication technology, built on principles of decentralization and individual sovereignty.\n\nLong live free speech. Long live Nostr. Long live freedom technology.\n\n![Stay weird Nostr!!!](https://miro.medium.com/0*HEPwzxFIuRMYJrpf)\n\n5/10/24\n\nConor Jay Chepenik",
  "wordCount": 431,
  "readingTime": 1.8264150943396227,
  "claps": 0,
  "voters": 0
}