{
  "id": "3c58187b44a8",
  "title": "Day 201",
  "createdAt": "2022-10-09 23:25:35",
  "tags": [
    "guns",
    "cash",
    "bitcoin",
    "monetary-policy",
    "valuable-paper"
  ],
  "url": "https://chepenikconor.medium.com/day-201-3c58187b44a8",
  "content": "# Day 201\n\nToday I was listening to the Once Bitten podcast by Daniel Prince and couldn't help but laugh when they started talking about how the fiat money we use is not only stolen from us via \"money printing\" but it also bears the faces of those who control(ed) the country. Depends on the place you reside whose face is going to be on the fiat money but there is a lot of truth to how ridiculous it is that people value paper with powerful humans on said paper.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F1hIFBQx95DSch7b7NfE1a5%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F1hIFBQx95DSch7b7NfE1a5&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f9ca5797da773ef6d2cd36e99&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nI'm grateful to live in the United States and was actually thinking about how it is kind of based we have Ben Franklin on our 100 dollar bill. I went to a firearms store to make a purchase and as I was giving over the cash I was reminded of what \"a libertarian freak\" Ben Franklin and the rest of the founding fathers were. I'd like to note that firearms should always be handled with utmost care, never pointed at anyone unless you are defending your life, and a powerful tool that should be used with extreme caution. I'd also like to note that the idea that \"the Government\" is the only one worthy of owning firearms is mind blowing to me. People have a right to defend themselves and their property. While the U.S Government has used stuff like the patriot act and many others bills to wither away at our constitution we still have the greatest \"piece of paper\" in the world for protecting the rights of citizens.\n\nI guess it is not that much of a stretch for people to accept pieces of paper as valuable if a piece of paper is what protects the people's constitutional rights. Most people don't verify they trust. I mean everyone is guilty of that since humans are born helpless and need to trust their parents or guardian to take care of them. However, as we grow up there are things we need to start verifying ourselves. I'm grateful to live in a country who doesn't bear a monarch on its fiat. Fiat on the US dollar is filled with people who came up with the best bill of rights ever created for protecting people from corrupt nation-states. It makes sense that Americans have the right to protect themselves via the 2nd amendment and use fiat paper to purchase tools made for protecting private property. After a quick google search I discovered only 3 countries in the world protect citizens right to bear arms.\n\n> [**Only 3 countries in the world protect the right to bear arms in their constitutions: the US...**](https://www.businessinsider.com/2nd-amendment-countries-constitutional-right-bear-arms-2017-10#only-15-constitutions-in-nine-countries-ever-included-an-explicit-right-to-bear-arms-according-to-the-new-york-times-1)\n\nThe U.S, Mexico, and Guatemala. That is a pretty crazy statistic and while I know the U.S has many problems I am grateful our constitution still gives the citizens of our great country the rights that few others in the world have.\n\nAll this to say we need better money. Guns wouldn't be as necessary for law abiding citizens to protect themselves if we had better money. I've personally always liked guns, enjoyed going to a range, learning about different types of guns/calibers, and was lucky enough to have a Grandfather who taught me the importance of gun safety and how to properly handle a firearm at a young age. However, they still terrify me to a degree. It is kind of surreal holding a gun and knowing the power this tool contains. I don't take gun safety lightly and while I enjoy the range I will never tolerate someone not following the rules. When a human life is at stake there is no reason to not follow gun safety rules at the range. My hope is that over a long enough time horizon guns will become less necessary as Bitcoin makes it so people can use their memory to store their wealth. Guns held by the Government is what I mean. Less reason to hold weapons and hire people to use said weapons if necessary so Governments can move around armored trucks and what not. Bitcoin makes it so transferring gold, cash, or other valuables can be done over the internet (well the value part anyway the good might still have to be shipped/delivered to a person). Bitcoin also makes it so there are less people in the world pissed off about being stolen from via money printing by Governments. There is not much citizens can do to control monetary policy but as a whole it does not help humanity thrive when literally everyone who uses the nations money has their purchasing power devalued from quantitative easing or yield curve control.\n\nOnce something is out of the bottle it can't be put back in. Gunpowder and Bitcoin are two great examples. Both have helped decentralize power and that is a great thing in my opinion. My hope is that Bitcoin can make the world a safer and more cooperative world where more humans thrive and can experience abundance. I know our world is far from perfect though so I just wanted to take this Sunday to reflect how grateful I am that the United States has the amendments it does and absolute libertarian beasts (at least some of them anyways) on our money. The Founding Fathers did everything in their power to make a system that would allow the people to stand up to a tyrannical Governments. While Bitcoin is the best store of value I am grateful we have cash in our current world because people deserve to transact privately if they want. Especially when crap like this is going on.\n\n> [**Major credit card companies are making it easier to track gun sales**](https://www.npr.org/2022/09/11/1122261276/visa-mastercard-american-express-gun-sales)\n\nOf course I don't want any mass shootings to occur. I just think this policy will not help stop mass shootings in anyway. It kind of reminds me of KYC where the intention is the opposite of the outcome. In this case law abiding gun owners could get unfairly labeled and that could cause them to not have the arms or ammunition needed to defend themselves. In the case of KYC requirements there are many criminals who are able to hack into databases and steal the information on millions of users because companies like Coinbase, Binance, Kraken, and plenty others were required to record the information of their customers. I like to believe deep down there are good people out there genuinely trying to help, but I'm saddened that many of these policies have the exact opposite effect of what is intended. Not to say there are not situations where maybe these things actually had beneficial outcomes. I'd also like to note the examples given above are purely speculative and made up by me on the spot, but if I was a betting man I would put my money in the camp of these policies will do more harm than good. So yea I'm grateful we have cash to use for now until hyperbitcoinization makes fiat irrelevant over a long enough time frame.\n\n![Photo by John Guccione [www.advergroup.com:](http://www.advergroup.com:) [https://www.pexels.com/photo/100-us-dollar-banknotes-3531895/](https://www.pexels.com/photo/100-us-dollar-banknotes-3531895/)](https://miro.medium.com/0*_GA-5uY1Y7yxM5G5)\n\nFinally, I'd like to remind myself to keep taking the little steps to achieve what I want. Start making progress on your app habitchain, set up that personal website, work more on MassAdoption, keep exercising daily, keep an open mind, and keep spreading love, memes, and joy to those you interact with. Life is too short to fixate on the bullshit.\n\n10/9/22\n\nConor Jay Chepenik",
  "wordCount": 1270,
  "readingTime": 4.99245283018868,
  "claps": 27,
  "voters": 4
}