{
  "id": "3daa64a20e76",
  "title": "Money: The Tool That Creates Debt Instead of Paying it Off",
  "createdAt": "2023-03-02 05:05:51",
  "tags": [
    "bitcoin",
    "fiat",
    "hard-money",
    "gold",
    "banking"
  ],
  "url": "https://chepenikconor.medium.com/money-the-tool-that-creates-debt-instead-of-paying-it-off-3daa64a20e76",
  "content": "# Money: The Tool That Creates Debt Instead of Paying it Off\n\n[https://www.hardmoneyfilm.com/](https://www.hardmoneyfilm.com/)\n\n![](https://miro.medium.com/0*7XkXxXQORy5eI2GV)\n\nI was inspired to write this post after watching an incredible short film about money. America sure does pride itself on free market capitalism while completely ignoring the fact our money runs on a socialist system. Marty Bent pointed out in one of his newsletters that a debt based money is an oxymoron. Haven't been able to stop thinking about this idea since I read it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/MartyBent/status/1630766436758028290%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe current monetary system is based on debt and the threat of violence. Our money is created when a bank lends money to someone, and that person promises to pay it back with interest. This system, known as fractional reserve banking, allows banks to create money out of thin air and charge interest on it. The result: a never-ending cycle of debt. You might be asking yourself how the hell does the bank ever lose if they can create money out of thin air? Well they found a way in 2008. Luckily, they had bigger banks, like the Fed, step in to print taxpayer money to bail them out.\n\nThe problem with a debt-based monetary system is that it encourages excessive borrowing and spending, which can lead to a never-ending cycle of debt and financial instability. As the amount of debt in the system grows, so does the amount of interest that must be paid on that debt, which can lead to inflation and economic instability. Additionally, the constant need for growth in order to service the debt can lead to environmental degradation and other social problems.\n\nAs both Marty Bent and the short film above have pointed out, a debt-based money is an oxymoron because money is supposed to be a tool to pay back debt, not a tool that creates debt. In a system where money is created as debt, there will always be more debt than there is money to pay it back, which ends up creating a lack of trust in the monetary system.\n\nIt is essential to consider alternative models that can promote sustainability and stability. Although gold was used as money for a long time, it had significant drawbacks. It was not portable enough to allow for global trade, and it is not easy to verify in large quantities which made it difficult to adapt to changing economic circumstances. As a result, we ended up with the fiat experiment, where money is not backed by a commodity but instead by the government's trust and creditworthiness.\n\nSatoshi Nakamoto said, \"The root problem with conventional currency is all the trust that's required to make it work. The central bank must be trusted not to debase the currency, but the history of fiat currencies is full of breaches of that trust.\" Therefore, it might make sense to learn about Bitcoin. I've never seen someone regret investing in their education. I've also never seen someone spend 1000 hours studying Bitcoin and come out convinced our current fiat system is better. Satoshi also said, \"It might make sense just to get some in case it catches on. If enough people think the same way, that becomes a self-fulfilling prophecy.\" You can chase the debasing dollars being shot out of a money printing helicopter or you can board the Bitcoin plane and take off from this 50+ year fiat nightmare the world has been on since [1971](https://wtfhappenedin1971.com/).\n\n![](https://miro.medium.com/0*a7a2TMV7l2M0IKw2)",
  "wordCount": 570,
  "readingTime": 2.5342767295597484,
  "claps": 0,
  "voters": 0
}