{
  "id": "3df91a0354a0",
  "title": "Day 434",
  "createdAt": "2023-05-31 02:59:44",
  "tags": [
    "freedom",
    "of",
    "speech",
    "ukraine",
    "russia"
  ],
  "url": "https://chepenikconor.medium.com/day-434-3df91a0354a0",
  "content": "# Day 434\n\nThere is an American citizen in jail right now for criticizing Zelensky allegedly. I did a google search and did not find anything about it. To be fair here is my google search \"us citizen in Ukraine prison for going against the narrative\" when that yielded nothing I did one more \"us citizen in Ukraine prison for speaking out against Zelensky\". Again, nothing relevant turned up.\n\nSo I went to Twitter to get the guys name because there is still some form of freedom of speech there. This video is saddening.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/stillgray/status/1662947845526388737%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWords. Nothing but empty words. Claims to support \"the exercise of freedom of speech anywhere in the world\" but won't do anything about Gonzalo. Well after I got the guy's name I was finally able to use Google to find some articles and here is what I got. The same article twice on two different platforms.\n\n> [**'Red Pill' Dating Coach Gonzalo Lira, Accused of Shilling for Putin, Is Arrested in Ukraine**](https://www.thedailybeast.com/gonzalo-lira-red-pill-dating-coach-who-is-accused-of-shilling-for-putin-is-arrested-in-ukraine)\n\n> [**'Red Pill' Dating Coach Gonzalo Lira, Accused of Shilling for Putin, Is Arrested in Ukraine**](https://money.yahoo.com/red-pill-dating-coach-gonzalo-192259132.html)\n\nI just skimmed the article. From what I gathered they are debunking this guy's story. My personal opinion is Putin is no hero, but neither is Zelensky. It's a gross situation and there are truly no heroes in war. This whole thing is sad. Both sides have their problems but to see a U.S citizen get arrested in Ukraine is insane considering how much money we have sent to them under the guise of defending democracy.\n\nLot of darkness in the world, but that just means all the more reason to stand up for what's right. It's easier said than done. Here I am blogging from the comfort of my home. I hope it makes a difference but I'm not located where the hot war is taking place calling out blatant corruption. I don't know much about Gonzalo other than what I've found out about him tonight. I do know that if this story is true it is absolutely disgusting that the United States is not furious and depending for him to be freed. We live in a complicated world. Understand Google, the United States Government, and other powerful entities in the world do not have your best interest in mind. They have their own interests in mind. These organizations are not human but they are run by humans. Analyze everything, think for yourself, don't expect to be saved by a peace of paper, even if the U.S constitution is the greatest peace of paper that ever existed for securing our rights. Stand up for your rights, especially when it is most difficult.\n\n5/30/23\n\nConor Jay Chepenik",
  "wordCount": 481,
  "readingTime": 1.8150943396226416,
  "claps": 1,
  "voters": 1
}