{
  "id": "4007d19d21c0",
  "title": "Honk Honk",
  "createdAt": "2022-02-04 15:12:10",
  "tags": [
    "truckers",
    "freedom-convey",
    "clown-world"
  ],
  "url": "https://chepenikconor.medium.com/honk-honk-4007d19d21c0",
  "content": "# Honk Honk\n\nI can't help but smile as I sit in my warm apartment on a cold winter day. Truckers are fighting for freedom in Canada by occupying the capital of Canada while Prime Minister, Justin Trudeau, calls them names from an undisclosed location. It's ridiculous that the supposed \"leader\" of a country calls the working class racist, transphobic, and lesser than.\n\nThese Truckers are giving hope to billions around the world who don't want to live in a pod, have a social credit score, eat bugs, and own nothing. This might have sounded like a conspiracy theory to someone in 2019, but it is exactly what the World Economic Forum is advocating for. Do not give in to their asinine goals. Learn about bitcoin, become as independent as possible, make piece with your neighbors, and stop watching the propaganda that is on almost every mainstream media outlet.\n\nThe White House literally [urged](https://www.dailymail.co.uk/news/article-10465799/White-House-urges-Spotify-combat-misinformation-amid-Joe-Rogan-backlash.html) Spotify to censor Joe Rogan the other day. Spotify is a private company and the first amendment of the United States means Joe Rogan can say what he wants without fears of censorship. The White House is blatantly violating the constitution. Democrat or Republican this is wrong on so many levels. The people need to unite as a country and demand better from the oval office. Unacceptable is an understatement. The lockdowns, the masks, all of it needs to end. The government is weaponizing science by claiming everything that doesn't agree with their narrative is misinformation. The truth is the people who are labeling everything misinformation are the ones who have constantly spread misinformation throughout this pandemic. How many times was the public told vaccines would prevent you from getting and spreading covid?\n\nMost people would rather be lied to than admit they were lied to. If this is you anonymous, please wake up. Learn about money that can't be debased or confiscated, read more books, and don't spend your money at places that require you to show proof of vaccine. We are entering segration 2.0, but instead of race it is based on medical history. Science is being weaponized when science should be about questioning everything and changing conclusions when new data presents itself. The end is near thanks to truckers standing up for basic freedoms, but now is not the time to be complacent. We will win by showing our friends, family, and neighbors love. We will not submit to tyranny, but instead stand up and show governments around the world are rights as human beings are not to be tampered with. No one wants to live in a pod, own nothing and eat bugs. So stop playing their games. Opt out of a corrupt fiat system where you take on debt so the commercial banks can get money printed out of thin air and charge you interest on it. Dollars are backed by the full faith and credit of our government and everyday people are losing faith in this government. I love my life and I won't have the best parts about it stripped by an incompetent government who seeks to destroy it citizens. Bitcoin has encouraged me to go down a rabbit hole of truth and I feel at piece knowing I will go live in another country before I am stripped of my rights in the name of my \"health\".\n\nNever have the good guys been the one forcing people to do stuff against their own will. If the vaccines really did stop people from spreading and catching covid there might be an argument for why mandatory vaccination needs to be considered. I would still argue otherwise, but it would be easier to understand why many want the vaccine to be mandatory. Since vaccines just make catching covid less deadly, according to the experts, trying to argue mandatory vaccination is wrong. Vaxxed or unvaxxed you should not be treated any differently. I remember a time when H.I.P.P.A meant something and restaurant hosts didn't ask about my medical history.\n\nThank you Truckers for taking a stand against tyranny. I am an open-minded individual and if I'm missing something please share books, links, and anything else that could expand my perspective. I don't seek to shit on the vaccine because honestly it was a great feat of science to make a vaccine so quickly. What I despise is mandates for a vaccine that we still don't know the long term effects of because only time and trails will reveal that.\n\n2/4/2022\n\nConor Chepenik",
  "wordCount": 750,
  "readingTime": 2.830188679245283,
  "claps": 0,
  "voters": 0
}