{
  "id": "40678de94000",
  "title": "Day 683",
  "createdAt": "2024-02-04 03:04:26",
  "tags": [
    "good",
    "evil"
  ],
  "url": "https://chepenikconor.medium.com/day-683-40678de94000",
  "content": "# Day 683\n\n\"Evil is the force that believes its knowledge is complete.\"\n\n― Jordan B. Peterson\n\nThis is a quote I heard while listening to this podcast. I have not been able to stop thinking about it since.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F0A6WABXhNcM%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D0A6WABXhNcM&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F0A6WABXhNcM%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nHaving the humility to know what you don't know is powerful. Good will win because until we die and meet God it's impossible to know everything. The mere idea you can know everything is a sure fire way to fail and that is why evil will not win in the long run.\n\nIf we take this quote in the inverse then it would be \"Good is the force that believes its knowledge is not complete.\" This journey of learning is perpetual. Each day is an opportunity to expand our understanding, driven by the humility that what we know is but a fraction of what can be known. This humility doesn't weaken us; it empowers us. It opens our minds to endless possibilities, encouraging a lifelong pursuit of knowledge and understanding.\n\nWithin this framework of thought I can better assess the world. I have deep convictions that Bitcoin will become the next global reserve currency. My research and observations lead me to believe in its transformative power to address systemic flaws in our financial systems. Yet, this conviction is tempered with the understanding that the world is complex and unpredictable. While I stand by my insights, I remain aware that unforeseen events could challenge my perspectives.\n\nThis balance - between confidence in our understanding and openness to the unknown - is vital. It's a reminder to approach our beliefs and predictions with both conviction and caution. Our journey towards knowledge is infinite, and it's this recognition that guards us against the arrogance of assuming we've reached its end. Seek knowledge, but never become evil enough to think you've found every answer.\n\n2/3/24\n\nConor Jay Chepenik",
  "wordCount": 312,
  "readingTime": 1.1773584905660377,
  "claps": 0,
  "voters": 0
}