{
  "id": "4068e27dab4e",
  "title": "Day 673",
  "createdAt": "2024-01-25 03:19:54",
  "tags": [
    "surrealism",
    "avant-garde",
    "stream",
    "of",
    "conciousness"
  ],
  "url": "https://chepenikconor.medium.com/day-673-4068e27dab4e",
  "content": "# Day 673\n\n![](https://miro.medium.com/0*2sFDgrq0nBE-zoTc)\n\nWhy do artists struggle today? I mean, aside from the age-old starving artist cliché that's as classic as instant noodles in a college dorm. Here's a thought: modern artists have a nemesis, and it's not a lack of inspiration or overpriced art supplies. It's social media, lurking beside their blank canvas, whispering, \"Forget that masterpiece, come see a cat playing piano!\"\n\nDistraction has never been so easy. Faced with the daunting void of a blank canvas, an artist now can choose to dive into the endless sea of online banter. It's both a blessing and a curse. A curse wrapped in cat videos and memes. I guess the blessing or curse really depends on how you leverage the algorithms that influence all of us who are online.\n\nI'm glad I exist in this era, though. Imagine a world without points for sugary espresso drinks or the ability to satisfy sudden cravings for Chinese food with a quick phone call and a car. Don't get me started on Doordash... I'd rather drive myself than pay ten bucks for delivery - I guess that is just my wallet talking though.\n\nBut I digress. Art changes with the times, and so do artists. It's intriguing to think what the greats would've done today. Would Monet have painted lilies or just posted them on Instagram? Would Van Gogh have shared his starry nights or just scrolled through ours?\n\nCurrently, I'm reading Ayn Rand's \"The Fountainhead,\" and it blows my mind. But let's be real, if Rand had access to the internet, the book might've just been a collection of her favorite memes.\n\nMy recent routine? Run at night, drink an AG1 supplement (because, why not?), then scroll through social media while my blank canvas judges me. Eventually, the anxiety turns into words on a screen. Tonight, for instance, here I am, rambling about... well, everything.\n\nIn college, I took this class called 'Film & the Avant-Garde.' It was all about surrealism and letting your thoughts flow. But let's face it, my typing speed can't keep up with my brain. Maybe one day, we'll have computer-brain interfaces for that. Until then, I'll stick to good old typing, typos and all.\n\nI love you, anon. Keep scrolling, keep dreaming and remember: every blank canvas was once a scroll away from being a masterpiece. Or a meme...who knows?\n\n1/24/24\n\nConor Jay Chepenik",
  "wordCount": 400,
  "readingTime": 1.709433962264151,
  "claps": 0,
  "voters": 0
}