{
  "id": "407c59a855cb",
  "title": "Day 672",
  "createdAt": "2024-01-24 03:04:31",
  "tags": [
    "value",
    "subjective",
    "hot-wheels",
    "passion",
    "sex"
  ],
  "url": "https://chepenikconor.medium.com/day-672-407c59a855cb",
  "content": "# Day 672\n\n![Masks & hot wheels!](https://miro.medium.com/0*jx9Q6-Dp1AutX1x9)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/FromKulak/status/1749951685240267000%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n![](https://miro.medium.com/0*cuz0d2CJYWfFptgP)\n\nThis is undoubtedly one of the most hilarious things I've ever encountered online. Everyone has their quirks, after all. To be frank, the idea does sound intriguing, but there are clear reasons why I haven't tried it myself. Yet, there's something genuinely refreshing about being reminded of the oddities and wildness inherent in human nature. We're all just animals, each with our own peculiar set of desires.\n\nOf course people are good at wearing masks. I'm just pointing out that it feels good to let the mask down. I'm reminded of another random tweet I saw the other day while wasting time on X...\n\n![](https://miro.medium.com/0*sG7HOoefglfjSfjL.jpg)\n\nThe thought of introducing Hot Wheels into the bedroom, purely for comedic effect, is both absurd and amusing - one of the most bizarre yet funny thoughts I've ever expressed. It prompts me to consider what I truly value in life. The most admirable aspect of Mr. Hot Wheels, in my view, is his authenticity. He embraces his passion not because society dictates it, but because it's genuinely important to him.\n\nI'd like to see more of this. Here is to doing what I want because I want to do it, not because society said so. Judging things based on what the masses think is a recipe for failure. Use internal judgement for value based decisions and you will be a lot happier.\n\n![](https://miro.medium.com/0*8woC7Go31JzdrXAC.png)\n\n1/23/24\n\nConor Jay Chepenik",
  "wordCount": 233,
  "readingTime": 1.579245283018868,
  "claps": 1,
  "voters": 1
}