{
  "id": "40c513de40bb",
  "title": "Day 745",
  "createdAt": "2024-04-06 03:34:17",
  "tags": [
    "parenting"
  ],
  "url": "https://chepenikconor.medium.com/day-745-40c513de40bb",
  "content": "# Day 745\n\nToday is the first day since my child was born that she won't sleep in the same bed as her Mother. What a crazy stat! I've been away for various travel, so I have slept without my little lady next to me, but her Mother can't say the same until after tonight.\n\nI'm beyond grateful to have family that can watch her. Co-sleeping was without a doubt the right decision for my family. I know Sloan feels comfortable next to us in bed, and while at some point she will have to move to her own bed, I like having our child sleep next to us.\n\nThe early years are so important, and I love telling my kid that I love her, I'm proud of her, I know she'll do amazing things, and that I'm lucky to be her Dad. It's the truth, and words are powerful. She'll be the one who achieves greatness on her own, but I'm confident part of that greatness will come from the fact that she was fed positive affirmations.\n\nIt's amazing the power of the tongue. Communication is key in life, and you can build others up or tear them down with what you say.\n\nI'm so blessed to have family that built me up growing up, and I hope to pass that down to my little girl. I also hope to have more kids, God willing, and pass that on to them. God bless parents who do right by their kid. I think one of the hardest things to do as a parent is to let your kid grow up, which means letting them experience pain. Which seems counterintuitive, but if you never let your kids deal with reality, you are just prolonging pain they could've avoided had you not done so.\n\nI don't know; parenting is hard, and I'm taking it day by day. I know letting Sloan have a sleepover with her Baba was very hard for her Momma, but I do think it was the right decision.\n\nIf you one day read this when you grow up Sloan, know Daddy loves you so much. You have brought so much joy and light to your Mother and myself. You have given me faith in a creator. You make me want to be a better man and you crack me up. Also I can now relate and understand videos like this much better.\n\n> [**Tyler Champagne on Instagram: \"If my 2 year old had a motivational podcast... #parenting #dadlife...**](https://www.instagram.com/reel/C5FGexwtSAj/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==)\n\nThe above video (hopefully link rot doesn't ruin it by the time you read this) Had us crying tears from laughing so hard!\n\n![](https://miro.medium.com/0*5ZRxGKik-Y9SSOYj.jpg)\n\n4/5/24\n\nConor Jay Chepenik",
  "wordCount": 465,
  "readingTime": 1.9547169811320755,
  "claps": 2,
  "voters": 2
}