{
  "id": "41a8af8133a1",
  "title": "Day 15",
  "createdAt": "2022-04-06 21:24:46",
  "tags": [
    "thermodynamics",
    "software",
    "geopolitics",
    "spreading-joy"
  ],
  "url": "https://chepenikconor.medium.com/day-15-41a8af8133a1",
  "content": "# Day 15\n\nOh boy. I'm on break this week since I don't start my new sales gig until April 11th. I've been using this time to consume content, sleep in, and just do my thing (which typically involves playing a bitcoin podcast while I enjoy 72 virtual holes of Golf on PGA 2k21) It's a simple life, and this morning I made the mistake of switching up my regularly scheduled bitcoin podcasts to throw on [Joe Rogan's recent episode with Gavin de Becker](https://open.spotify.com/episode/3rAa8cJGt5cDSu71y9YC2A?si=NMrJNHXbRiSiqZqVBlLKOw). \"HEY NOW\" is an understatement. Before this episode, I had no idea who Gavin was, but after listening to him speak I think he is best described as a security expert. My man was spewing some knowledge on a group called the NSO which is an Israeli cybersecurity company that sells a system called the Peagus (now Peagus 2.0) that essentially lets people have access to anything on a phone from a remote location. System 1.0 used to require the person with the phone to click something, but 2.0 just requires the user have the phone number of the person they are targeting. Here is their [website](https://www.nsogroup.com/). The first thing on it says \"NSO creates technology that helps government agencies prevent and investigate terrorism and crime to save thousands of lives around the globe.\" This in theory sounds fantastic, but I doubt this is how these advanced spying systems get deployed.\n\n![](https://miro.medium.com/0*HTUbBNVwBx-MexgA)\n\nThere are no fair fights in the world of thermodynamics. Whoever brings a gun to a knife fight is winning. *Unless they are the world's worst shot🤣* It is likely nation-states are using these Peagus programs to spy on anyone they deem \"important\". I'd be surprised to find that innocent until proven guilty holds up when it comes to searching someone's data online. Terrifying to think people can use software to get intimate access to your life. Humans are willingly recording massive amounts of data on their smart phone. The amount of data to be uploaded is likely to grow exponentially as more people get smart phones and the processing power and data storage of these phones gets better. On the one hand, it's great because it will allow humanity to learn from its past mistakes and not have so many missing spots due to lack of transcription. On the other hand, if we don't decentralize the power of cyberspace we are looking at a very dystopian society. This v[ideo ](https://twitter.com/aliceysu/status/1511558828802068481)is not from a movie: it is CNN coverage showing the horrendous human rights crimes occurring in Shanghai. From Alice Su on Twitter \"As seen on Weibo: Shanghai residents go to their balconies to sing & protest lack of supplies. A drone appears: \"Please comply with covid restrictions. Control your soul's desire for freedom. Do not open the window or sing.\"\" My god. Control your soul's desire for freedom? Not something I'm tryna to do now or ever CCP. No thank you. God Bless America and the foundation it was built on.\n\nAll this to say I'm glad I am not on the main stage of geopolitics right now, or even a pawn for that matter. Ya boy just wants to save through hyperbitcoinization and will do so by talking good on the phone with strangers. One day when the dust settles I will purchase a farm and open a local pub that accepts bitcoin for food and drink. I love being outside and moving. I'm thankful for pickup sports so I can get that feeling of being in the zone while I still reside in a major metropolitan area. Life is too short to worry about the geopolitical bullshit of the world, but it's damn hard to avoid it when you got \"the thought police\" on every social media feed trying to show you the approved narrative while censoring those who point out otherwise.\n\nCrazy times we are living through. Going to try and remember that when using my phone it is possible anyone could gain access to it. AI has been very helpful in some senses. My music playlists are personalized, my Twitter feed is full of bitcoin maxis, and I can use Medium's servers to store whatever one might call this online journal I got going here. They also recommended me good articles which I enjoy. The problem is I wonder how much stuff I have done/thought/acted out because I was convinced via some software on a screen. Thus, I'm eager to have a farm and get back to a natural surrounding. Words on a screen might seem harmless, but they are not. Words are powerful and the best cybercriminals are incredible social engineers who can pull some malicious tricks on people. Be careful out there anon. Do stuff that makes you happy and spread love into the world. Be creative if you're sad. It helps to express yourself. At least it has in my own experience.\n\n4/6/22\n\nConor Jay Chepenik",
  "wordCount": 819,
  "readingTime": 3.290566037735849,
  "claps": 1,
  "voters": 1
}