{
  "id": "42c80368c949",
  "title": "Day 473",
  "createdAt": "2023-07-09 02:14:08",
  "tags": [],
  "url": "https://chepenikconor.medium.com/day-473-42c80368c949",
  "content": "# Day 473\n\nCreated two Youtube shorts from what I wrote yesterday. I've still got a lot of work to do in terms of production quality, but I'm making some progress. Making conâ›º ï¸is more time consuming that one would anticipate. It's very enjoyable tho :) Here are the two shortsðŸ¤ðŸ˜¤\n\n> [**Proof Of Work Vs Proof Of Stake**](https://youtube.com/shorts/HSLPqmKcvp0?feature=share)\n\n> [**Without Freedom Of Speech A Democracy Is Not A Democracy**](https://youtube.com/shorts/2bTq4CfnEaY?feature=share)\n\nOne thing I've been thinking about recently how smartphones make us cyborgs. The devices ability to expand our capabilities and connect us like never before is amazing. It aligns with the principles of individualism. Individualists value personal freedom, autonomy, and the primacy of individual rights and choices. Smartphones, with their vast array of functions and connectivity, empower individuals by providing them with knowledge, efficiency, and instant communication. The access to information and communication at our fingertips enhances individual sovereignty and self-reliance.\n\nHowever, it's important to acknowledge the potential downsides of this tech-driven world. Safeguarding privacy, managing screen time, and maintaining human connections are crucial aspects to consider. While smartphones offer incredible convenience and connectivity, they can also lead to privacy concerns and addiction-like behaviors. Balancing individual freedoms with collective responsibilities is key in addressing these challenges and ensuring a healthy society.\n\nIn this context, encryption-based technologies play a vital role in supporting individual sovereignty. Encryption provides a layer of privacy and security, allowing individuals to safeguard their personal information and communication from unauthorized access. By enabling individuals to control and protect their digital interactions, encryption empowers them with a sense of autonomy and control over their own data. This emphasis on individual privacy and empowerment aligns with the core values of individualism, reinforcing the idea that encryption supercharges the individual over the collective.\n\nI believe this is a good thing. We need to have sovereign tribes working towards a greater good. It's my view that this greater good works better when the individual is respected.\n\n![Few.](https://miro.medium.com/1*8pwW62VLO4SxwnhsP5Wyow.jpeg)\n\nI'm bullish on Bitcoiners !!!\n\n7/8/23\n\nConor Jay Chepenik",
  "wordCount": 343,
  "readingTime": 1.4943396226415093,
  "claps": 0,
  "voters": 0
}