{
  "id": "42e3901efac6",
  "title": "Day 893",
  "createdAt": "2024-09-01 01:38:19",
  "tags": [
    "coding"
  ],
  "url": "https://chepenikconor.medium.com/day-893-42e3901efac6",
  "content": "# Day 893\n\n![[https://x.com/ConorChepenik/status/1830051033793409407](https://x.com/ConorChepenik/status/1830051033793409407)](https://miro.medium.com/1*qR5c-ywUJ9ziAjbXsl5KlQ.png)\n\nArmed with AI and a dream, I'm going to build a kick-ass web app and use it to free myself from a 9–5. It might take some time, but Rome wasn't built in a day, and neither was Facebook (though with AI, maybe it could've been a long weekend project). It might take some time, but I'm going to do it. For all the haters:\n\n![[https://x.com/rileybrown_ai/status/1829939614213148940](https://x.com/rileybrown_ai/status/1829939614213148940)](https://miro.medium.com/1*Qk0wHeUDshaK00tk30PHug.png)\n\nIf you chuckled at that tweet, congratulations! You've probably experienced the joy (and existential dread) of staring at lines of code until your eyes crossed. Welcome to the club - we have semicolons and imposter syndrome!\n\nNow, don't get me wrong. I love my 9–5 gig. It pays the bills, and allows me to stay up to date about Bitcoin. With that said - AI will continue to crash through the tech world like a caffeinated toddler in a china shop. We're talking internet-level disruption, but this time it's part two. Remember when the internet was just a series of tubes? Now it's a series of cat videos and cryptocurrency scams. Progress!\n\nJokes aside though, we're on the cusp of seeing billion-dollar startups, and what's next, trillion-dollar... megacorns? Let's roll with that. This time around though these future giants will run leaner than a high school chess team. AI is going to let companies scale with far fewer employees than we have seen in the past.\n\nThis is because you don't need to be a code maestro to create amazing digital things anymore. If you can craft a decent tweet, you're equipped to build a web app. Coding? It'll be like knowing how to fix a typewriter in the age of touchscreens - quaint but not crucial. With AI's wizardry, it's not long before you'll see everyone and their Mother deploying websites quicker than we can say 'What's a manual?\n\n![A coder using an IDE before coding became writing psuedocode in English while the 0s & 1s on the backend optimized your code](https://miro.medium.com/1*OGoacgusOhYESyBWwAk83A.png)\n\n8/31/24\n\nConor Jay Chepenik",
  "wordCount": 315,
  "readingTime": 1.7386792452830189,
  "claps": 1,
  "voters": 1
}