{
  "id": "434c37fce00b",
  "title": "Day 293",
  "createdAt": "2023-01-10 01:37:15",
  "tags": [
    "bitcoin",
    "fiat",
    "running",
    "runners-high",
    "social-engineering"
  ],
  "url": "https://chepenikconor.medium.com/day-293-434c37fce00b",
  "content": "# Day 293\n\nWent for a run today and it felt like I took some seriously good molly. I've yet to try molly, but I imagine it feels a bit like runners high. Lucky to have family around to help with Sloan so I had the time to hit that run today. Listened to this podcast while on the run. Only heard the first 30 minutes but I'm looking forward to finishing it. Lynn Alden is a smart cookie and the BCB guys crack me up. What they're doing is so important because it allows the layman to understand Bitcoin. This is not to say that the hosts of this show aren't smart dudes, it is quite the contrary, they just speak like common dudes and crack jokes. They make it so the average person can understand some pretty complex topics.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F5JqY9RJQcZU0CdJ4E8xMOp%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F5JqY9RJQcZU0CdJ4E8xMOp&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fc4ca1d4ef2bda7675e2cfba2&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nThere are many other Bitcoin podcasts I enjoy but if you haven't spent at least 100 hours researching this stuff many of those podcasts would sound like gibberish to the untrained ear. The BCB guys do an excellent job breaking down complex topics for those who aren't as deep down ze good ol' rabbit hole.\n\nRead this in Human Action today. So good I had to tweet about it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1612612792497934337&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThis is so spot on and kind of scary how relevant it is for today's world. There are many at the World Economic Forum who think humans are a tool to engineer. Two separate classes, one to do the engineering, and one to suffer from the engineering. I reject this personally. It is a large reason why I am a Bitcoiner. This is not to say I don't think science and technology are incredibly important. It is the opposite. I think both things are incredibly important. I just don't think we should be focused on engineering humans. We should focused on engineering the things that make human life easier. Like Bitcoin!\n\nAnyways, life is good. I'm building a better future. I got a fellow Bitcoin Magazine contributor coming on my pod soon which I'm super excited about.\n\n> [**Choose Your Fighter: Bitcoin Maxis Vs. Fiat Maxis**](https://bitcoinmagazine.com/culture/bitcoin-is-clear-fiat-obscures)\n\nThis is the article that prompted me to reach out and ask him on my podcast. This paragraph in particular really resonated with me.\n\n> In a weird way, the preferred monetary medium is irrelevant (at least in the vacuum of this framing). What is relevant is the outcomes of human behavior seemingly created by each system. I often wonder what size the effect of the chosen monetary system has upon the individuals within said system. It's as if Bitcoin is a forcing function for facts while fiat is a forcing function for falsehoods.\n\nRead that last line a couple times. So good. If you don't believe me go to your local Bitcoin meetup and feel the energy. Afterwards go to a bank and feel the energy. That should do the trick🤣🤣🤣\n\n1/9/23\n\nConor Jay Chepenik",
  "wordCount": 508,
  "readingTime": 1.9169811320754717,
  "claps": 0,
  "voters": 0
}