{
  "id": "448b783812c6",
  "title": "Day 98",
  "createdAt": "2022-06-28 19:53:02",
  "tags": [
    "podcast",
    "beef-hearts",
    "running",
    "smiling",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-98-448b783812c6",
  "content": "# Day 98\n\nMan, I'm reminded today how fortunate I am to live in a time where I can listen to brilliant people converse with a couple clicks of my iPhone. Usually, when I run I've been a big music guy but recently I've been listening to podcasts. So many incredible podcasts out there and if you have the desire to learn you can't go wrong. It is nice playing pods on my run because when I finish up the run I end up walking a bunch of extra miles to also finish my podcast. So much alpha out there the hardest part is figuring out what pods are worth listening too. For me, my current favorites are Breedlove's What Is Money Show, Lex Fridman's Podcast, J.R.E, The Pomp Podcast, TFTC by Marty Bent, and Preston Pysh's We Study Billioniares. There are plenty more great podcasts I like but for the time being this is mostly who I've been blasting. It's a brave new world and for those willing to put in the time you can learn anything.\n\nAfter my run today I ate some beef hearts which was honestly pretty tasty but also strong. Hahahahaha when my girlfriend walked in and asked what I cooked she was not buying \"steak\". I said it is steak of the heart baby but she still wouldn't eat any. She is pregnant so maybe not the best idea to be acquiring a taste for beef heart but apparently my bitcoin twitter friends tell me the organs are some of the most nutritious parts of the animal.\n\nPut on this banger by Yung Gravy and she did come out and dance in the living room. Gravy stays playing the hits. Big fan. Maybe one day he will come on my podcast. Just got to manifest it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Ftrack%2F03lcoVFQXlRdiXHPO2Lu6c%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Ftrack%2F03lcoVFQXlRdiXHPO2Lu6c&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67616d00001e0215f04c6e3d7c57a5a4348bca&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"80\" width=\"456\"></iframe>\n\nTonight is the first dry run of my whole stand up comedy set. Looking forward to it. Just going to have fun and crack jokes about Bitcoin and my father who liked his children's sports a little too much. I'm grateful he did though because without him there is no way I would've ended up playing D3 football.\n\nFinally, if you feel so inclined anon I just released my podcast on both Youtube and Spotify. Here is the link if you want to hear me talk about Bitcoin stuff.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FlINpEJlZe0o%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DlINpEJlZe0o&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FlINpEJlZe0o%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nSmile baby it's good for you!\n\n6/28/22\n\nConor Jay Chepenik",
  "wordCount": 400,
  "readingTime": 1.509433962264151,
  "claps": 0,
  "voters": 0
}