{
  "id": "44af58a4cd3f",
  "title": "Day 326",
  "createdAt": "2023-02-12 03:46:32",
  "tags": [
    "five-generations",
    "family",
    "grandparents",
    "white-pill",
    "black-pill"
  ],
  "url": "https://chepenikconor.medium.com/day-326-44af58a4cd3f",
  "content": "# Day 326\n\nMy child got to meet her Great-Great-Grandmother tonight. Talk about a special moment. Seeing family that is five generations apart in the same room is not something I thought I would ever get to see in my lifetime. My Grandma Jo's husband literally stormed the beaches at Normandy.\n\n![](https://miro.medium.com/1*0MIaQ5kiz9cQW-fviLLUIw.jpeg)\n\nGod is good. Lot of news today about jets being deployed and Montana becoming a no fly zone. Didn't look much more into it than that but saw the Defcon and Justin Trudea were tweeting some freaky stuff.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/DEFCONWSALERTS/status/1624585105653235712%3Fs%3D20%26t%3DtVaVQMsMSH7U9kaEzFuw-w&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/JustinTrudeau/status/1624527579116871681%3Fs%3D20%26t%3DtVaVQMsMSH7U9kaEzFuw-w&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n![](https://miro.medium.com/0*mWdJpaQU8vDvMUnM.jpg)\n\nWeird things seem to be happening. I bring all this up because my main goals will not change no matter what is happening on an international stage. My family is the most important thing to me. I'm praying things remain peaceful and nations can work through their beefs. However, my focus is on spending as much time with family as possible and raising a healthy child. It is so wild to think my Great Grandma Jo has lived such a long incredible life and had a partner who served in World War 2. Thank God he lived and they ended up having my Grandpa Tommy who has been such an awesome part of my life. Technically speaking he isn't my biological Grandpa but he is my blood. My Mother's father passed when she was a small child so I never got to know the man who my middle name is after. Luckily, Tommy was there to raise me and it wasn't until I was a teenager that I understood he was not technically my biological Grandpa. I hope to be the kind of Grandpa to my children's children that Tommy was to me.\n\nBlessed man. No other words for it. I'm so truly blessed for my health, my family, and my relationships. Yesterday's post was, not dark, but troubling. Yea I think troubling would be a good word for it. I don't want to fight anyone, especially not the United States Government which is the most powerful military in the world. I have to believe that if the Kleptocrats tried to get the army to kill American citizens they would put the guns down and refuse to do so. At least most military members. I'm sure there are some black op deep state assets who are ruthless enough to do anything for a certain amount of money. I also don't want to fight people in foreign nations. Other cultures are dope and I'd like to try their food and learn about cultures that I know nothing about. That said, it does feel like the world is gearing up for something big and I'm grateful for the 2A. I thought this tweet from Bruce encapsulated my ideals on violence properly.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/brucefenton/status/1624421351024099328%3Fs%3D20%26t%3DaKi21OfPDMXLdbNscINj5w&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nSo to wrap up my thoughts about taking up arms. It is only something moral if you are defending yourself. Using force against peaceful people is completely immoral. Hopefully the world can stay peaceful now that we have Bitcoin. I'm a white pill type of guy but good to be ready in case of the black pill of outcome. Better safe than sorry.\n\nAlso saw something about this horrible blow up in Ohio. UMMMMM. Hahahaha I don't know what to say. It's not funny. It is just that sometimes all you can do is laugh. Insane thread. Hope it's false but I got a feeling Government incompetence could have done this.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/JoshuaSteinman/status/1624524084456603648%3Fs%3D20%26t%3DaKi21OfPDMXLdbNscINj5w&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/FalconryFinance/status/1624051231554510848%3Fs%3D20%26t%3DaKi21OfPDMXLdbNscINj5w&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nEnough black pills. Well maybe this article is a black pill but I'm proud it got published. Check it out anon.\n\n> [**The US Dollar Is A Ponzi You Shouldn't Invest In**](https://bitcoinnews.com/us-dolla-ponzi-scheme/)\n\nLet's remain hopeful and grateful. Dwelling on the negatives serves to distract us when in reality the world has so much potential to be amazing. Final thought. I watched Captain Ron tonight with my Tommy, & my Partner. Hilarious, I highly recommend.\n\n> [**Captain Ron (1992) - IMDb**](https://www.imdb.com/title/tt0103924/)\n\n2/11/23\n\nConor Jay Chepenik",
  "wordCount": 689,
  "readingTime": 2.9833333333333334,
  "claps": 0,
  "voters": 0
}