{
  "id": "451a5e6aab30",
  "title": "Day 171",
  "createdAt": "2022-09-09 20:38:54",
  "tags": [
    "friday",
    "meetups",
    "pomp",
    "bitcoin",
    "humility"
  ],
  "url": "https://chepenikconor.medium.com/day-171-451a5e6aab30",
  "content": "# Day 171\n\nWent to a Bitcoin lunch today and talked about how we can grow the Boston Bitcoin meetup. Exciting times and it has been amazing meeting and talking with fellow bitcoiners in person. Thinking of calling the group massadoption. Get it cuz massachusetts plus what's coming with Bitcoin. Hahahahha life is good.\n\nCrushed a 3 mile run and getting ready to head over to my buddies to hang. Thus, going to be a short post on this fine Friday. I'd like to shout out the Nike Run Club for motivating me to keep running and for tracking my runs so I can finish this fine Friday in first place for the month. I'd also like to shout out my boy Keenan who has been crushing runs to compete with me and motivate me to run even when I don't want to run.\n\nFinally, I would like to lay out some things I need to improve and do this weekend. Which includes looking up and potentially purchasing the domain name massadoption.com. Coding up a spec website for massadoption. Learning more web development and cleaning my bathroom. Oh and finding a way to macgruber the washing machine my mum got for my apartment that seems like it is going to be a challenge to create. Fun times ahead.\n\nAlso, I'd like to mention that I have a lot of respect for the way Pomp handled getting called out by Bitcoin maxis on Twitter. I love the maxis because they do not forget and call out anyone who has made mistakes. Which as humans is all of us. What's amazing though is Pomp addressed his mistakes, admitted he wants to be the student not the teacher, pointed out the haters motivate him, and did so in a humble way by writing about it in his newsletter. If you are human you are bound to make mistakes. Learning from them and admitting they happened takes a grown man. Some people double down when they are wrong (Peter Schiff on Bitcoin lol). I respect the way Pomp handled getting blasted by the Bitcoin maxis. If I ever mess up and get put in those crosshairs (hopefully not because Bitcoin maxis know how to talk shit lol) I hope I can handle the situation with the same honesty and humility.\n\nUntil tomorrow anon :D\n\n9/9/22\n\nConor Jay Chepenik",
  "wordCount": 393,
  "readingTime": 1.4830188679245282,
  "claps": 0,
  "voters": 0
}