{
  "id": "460b4cd5e362",
  "title": "Day 1019",
  "createdAt": "2025-01-04 13:04:26",
  "tags": [
    "opago"
  ],
  "url": "https://chepenikconor.medium.com/day-1019-460b4cd5e362",
  "content": "# Day 1019\n\n**OPAGO: Revolutionizing European Retail with Lightning**\n\nFrom a Greek restaurant to Austria's largest electric car dealership, OPAGO is improving how European businesses handle digital payments. Located in Bavaria, OPAGO wants to transform how European businesses process digital payments. Founded by Michael Dülk and his team, the company has developed an elegant solution for merchants to accept Bitcoin payments via the Lightning Network, bringing the speed and efficiency of Bitcoin's layer 2 solution to traditional retail environments.\n\nThe company began in October 2022 with a clear vision: create a simple, user-friendly way for merchants to accept Bitcoin payments using lightning. Within just five days of their December 2022 launch, they secured their first client, a Greek restaurant eager to embrace Bitcoin. Since then, OPAGO has rapidly expanded its presence, now serving between 200–250 merchants across Europe, ranging from small businesses to significant enterprises.\n\nOne of the things that sets OPAGO apart is their dual approach to merchant solutions. They have built a signature yellow point-of-sale device that allows small to medium-sized businesses to start accepting Bitcoin payments within minutes. For larger enterprises, OPAGO offers API integration with existing point-of-sale systems, making it possible for established retailers to seamlessly incorporate Lightning Network payments into their current setup.\n\n![Caption: It is a sleek device for easily accepting payments that could pass as a calculator if someone did not know better.](https://miro.medium.com/1*5f3HBz65Gbg0YlGUXs7EcA.png)\n\n\"Our service is really doing the lightning transaction including all the transaction reporting with a licensed company in Europe,\" explains Dülk. \"We really want to have a solid, reliable solution for commerce to accept Bitcoin payments.\"\n\nOPAGO's hard work hasn't gone unnoticed. They have won multiple awards, including the Fintech World 24 award in Berlin and the BTC Prague startup pitch contest. Perhaps most notably, they became the first Bitcoin company to receive recognition from the German Ministry for Climate Action and Economics, highlighting the energy efficiency of Lightning Network transactions compared to traditional payment systems.\n\n\"They saw we were able to actually have up to 1 million transactions per second without using mining,\" Dülk explains about their recognition from the Climate Action Ministry. \"For their knowledge base, that was something which is really innovative because they just knew Bitcoin transactions with mining with seven transactions per second.\" While [Bitcoiners understand that mining](https://bitcoinnews.com/mining/dirty-coin-bitcoin-mining/) is actually quite beneficial for the environment many who have not put in the 1,000 hours to understand Bitcoin don't understand this.\n\nYet, it is more than just the speed and amount of transactions that is attracting people to adopt Bitcoin for payments. \"The marketing effect is actually one of the biggest draws for merchants,\" explains Dülk. He notes that businesses aren't just attracted by the practical benefits, such as near-instant settlement and protection from chargebacks, which are of course nice benefits as well, but also by the ability to attract tech-savvy customers and international tourists who prefer to spend their Bitcoin. This dual benefit has helped OPAGO attract diverse clients, from car dealerships and supermarkets to dentists and physical therapists.\n\nOPAGO's commitment to flexibility shows in their approach to payment processing. Merchants can choose between self-custody solutions or custodial ones to receive their lighting payments, with fees lower than traditional credit card processing. OPAGO charges a 1% flat fee which is much cheaper than the 3% average charged by most credit card companies. In the coming year, they plan to allow clients to convert to euros for an additional ~0.9%.\n\nLooking ahead, OPAGO wants to expand its presence in the European market, focusing particularly on integrating with larger retail chains and payment platforms. It's great to see the best of German engineering combined with Bitcoin's permissionless payment technology. OPAGO is positioning themselves at the forefront of Bitcoin's integration into everyday commerce in Europe.\n\nFor businesses interested in accepting Bitcoin whether for the marketing appeal, to avoid chargebacks, or because they are tired of their fiat currency losing value OPAGO offers a straightforward onboarding process, regulatory compliance, and dedicated support. As Bitcoin adoption continues to grow in Europe, OPAGO is helping bridge the gap between traditional commerce and people who want to use Bitcoin as a medium of exchange.\n\n_Learn more about [OPAGO on their website](http://www.opago.com/) or on [X(Twitter)](https://x.com/opagopay)_\n\n1/4/24\n\nConor Jay Chepenik",
  "wordCount": 692,
  "readingTime": 2.811320754716981,
  "claps": 0,
  "voters": 0
}