{
  "id": "462d63e6e41",
  "title": "Day 20",
  "createdAt": "2022-04-12 03:09:42",
  "tags": [
    "lion",
    "plebs",
    "adult",
    "central-banks",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-20-462d63e6e41",
  "content": "# Day 20\n\nI once heard someone describe smartphones as adult pacifiers. Anyone who has ever lost their phone can probably attest to how true this statement is. My eyes honestly hurt because I stare at screens so much. If you just look around any major metropolitan city you'll see a lot of people staring at the palm of their hand. [99.99%](https://twitter.com/BuckSexton/status/1513577323051859971?s=20&t=Kut04mTAvlS36HKNDxUgTg) of the time that hand has a phone on top of it. There used to be spy movies showcasing people planting bugs in their enemies house. Now people carry a potential \"bug\" everywhere and rely on it to direct them, feed them, and entertain them. Think of all the times someone has used a phone to avoid awkward social contact. Don't want to acknowledge someone as you pass them? Just look down at your phone! I try and use my phone to keep an open mind and learn more about humanity. More often than not I end up looking at dumb stuff. A great friend named Dr. Bondi once told me \"Twitter makes you 2x smarter and 4x less productive.\" As a Twitter addict that one hit different🤣🤝😎🙏\n\nThere is hope. Social media is far from perfect but if you follow the right people it can give you some good signal. Crazy to think how much smart phones have changed the human species. Smart phones have made the human race way more efficient, connected, and recorded. Overall, I would think smart phones are a net plus despite many negatives listed in the first paragraph. I'm hopeful bitcoin can be an overwhelming positive but there is likely to be pain for many. At least those who don't educate themselves, don't lower their time preference, and think the central banks will bail them out with their b.s money printing they call \"quanitative easing\".\n\n![Grace Chepenik Art](https://miro.medium.com/1*2I0OwQ7sSp39X__eOVBgzw.png)\n\nCherish the little moments anon. Central bank policy grinds my gears but then I remember there is bitcoin so there is hope. Study it, embrace it, play with the blockchain. For me seeing 🌽  in my wallet and being able to send it really helped me gain faith. I didn't have to trust cuz ya boi verified. Learn about the future of money and do your part to help. Maybe that is writing and maybe that is orange pilling everyone you know. Whatever it might be we need you and we love you. Plebs strong together ❤\n\n4/11/22\n\nConor Jay Chepenik",
  "wordCount": 403,
  "readingTime": 1.7207547169811321,
  "claps": 0,
  "voters": 0
}