{
  "id": "466abcca41b1",
  "title": "Day 345",
  "createdAt": "2023-03-02 18:31:31",
  "tags": [
    "art-of-war",
    "sun-tzu",
    "quotes",
    "advice",
    "win"
  ],
  "url": "https://chepenikconor.medium.com/day-345-466abcca41b1",
  "content": "# Day 345\n\nJust finished The Art of War by Sun Tzu this morning. Here are 7 of my favorite quotes.\n\n![](https://miro.medium.com/1*qQea2g58Ol8NF5iXhVKrew.jpeg)\n\n1. The supreme art of war is to subdue the enemy without fighting.\n\n2. All warfare is based on deception.\n\n3. To fight and conquer in all our battles is not supreme excellence; supreme excellence consists in breaking the enemy's resistance without fighting.\n\n4. Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.\n\n5. Opportunities multiply as they are seized.\n\n6. In the midst of chaos, there is also opportunity.\n\n7. The skillful employer of men will employ the wise man, the brave man, the covetous man, and the stupid man.\n\nMy personal takeaways.\n\n\"The supreme art of war is to subdue the enemy without fighting.\" This reminds us that the best way to achieve our goals is not always through brute force or aggression. In the modern world, this could mean using diplomacy, peaceful confrontation, negotiation, or persuasion to find a way to achieve our objectives. Violence should be a last resort option.\n\n\"All warfare is based on deception.\" This can be applied to any situation where people are trying to gain an advantage over others. Whether in business, politics, or personal relationships, people often use deception to get ahead. Be aware of this reality and remain vigilant in protecting yourself from deception and manipulation.\n\n\"To fight and conquer in all our battles is not supreme excellence; supreme excellence consists in breaking the enemy's resistance without fighting.\" It's better to be a monster and not have to use your strength than a teddy bear who hopes you don't encounter a situation where you need to defend yourself. In today's modern world there are tools that can help you remain prepared. For example, firearms, knives, pepperspray, and plenty others. However, the best way to avoid situations where violence is necessary is by avoiding situations that might call for it. Don't go walking around a city late at night unless it is absolutely necessary. Avoiding bad situations is the number one way to avoid violence.\n\n\"Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.\" Make moves silently and then when the time is right seize your opportunity. Make sure to be strategic and careful in your planning, but also act decisively and with force when ready. In the modern world, this could mean being prepared for contingencies and having a clear plan of action, but also being adaptable and willing to make quick decisions when necessary.\n\n\"Opportunities multiply as they are seized.\" Be proactive about what you want. I've heard successful people mention that at a certain point they hit takeoff speed and then their schedule becomes quite hectic because so many people are vying for their attention. This can be a good thing if you are prepared. Take advantage of opportunities when they arise, rather than waiting for them to come to you.\n\n\"In the midst of chaos, there is also opportunity.\" When everyone is distracted by too much noise there are often opportunities to be found. In the modern world, this means being creative and flexible in adapting to changing circumstances, and being open to new possibilities and ways of doing things. Look for the signal while everyone else is preoccupied with \"the current thing\".\n\n\"The skillful employer of men will employ the wise man, the brave man, the covetous man, and the stupid man.\" Successful leaders and managers need to be able to work with people of all different backgrounds and personalities. Those who can effectively manage and motivate people with different strengths and weaknesses will make a lot of money. Find the strengths of people you work with and focus on those. Also find the weaknesses and make sure you don't ask someone who is a poor writer to draft an important email. Would you take your car to a doctor? Or better yet, would you ask a mechanic for medical advice? Of course not, so figure out what skills the people you employ have and let them focus on the things that they exceed in... Don't set someone up for failure and then get upset when they fail\n\n3/2/23\n\nConor Jay Chepenik",
  "wordCount": 705,
  "readingTime": 2.8603773584905663,
  "claps": 1,
  "voters": 1
}