{
  "id": "475873522c20",
  "title": "Day 52",
  "createdAt": "2022-05-13 21:17:43",
  "tags": [
    "wrestling",
    "endurance",
    "pain",
    "bitcoin",
    "exercise"
  ],
  "url": "https://chepenikconor.medium.com/day-52-475873522c20",
  "content": "# Day 52\n\nWarm day here in Mass so I went for a 5k and had to take a quick break at the halfway point because my body was struggling. Felt great to crush a run and now I'm feeling better than ever. I've started to view exercises as a chance for my body to clean itself. A way for my blood to get new nutrients into my cells and take the garbage out. Using air, water, and food as energy to allow me to do the stuff I do. Which is a pretty average exercise routine since I no longer play competitive sports outside of my adult pickup soccer league🤣. Still, kind of crazy to think that even mild exercise in the developed world is more than most do. A good workout can be painful during but typically makes one feel better for the rest of the day. Can't imagine how lethargic one must feel if they stop exercising and eat poorly. Don't ever underestimate your body's ability to do incredible things anon. It is never too late to develop good habits. Even if you just go for walks! Your body needs to move or it will grow weak and cause you tons of problems. I could've probably pushed through the little mini-break I gave myself on the 5k but I'm not trying to break any records. I just want to be healthy and listening to your body and airing on the side of caution is probably a good idea unless you are competing on a sports team. In which case you need to force yourself to get comfortable with brutal pain and exhaustion. I remember many of my wrestling matches in highschool were won because I wanted it more. At the end of some of those matches the other kids just gave up and that is what allowed me to win. Most specifically, my junior year when I beat my arch-nemesis (lol dude was actually a good kid I just hated him at the time because he had beat me the previous year) in overtime because he got tired, took a poor shot, and I was able to get the take down by defending the shot and spinning around on top of him. Wrestling was brutal during, but I look back on those matches with fondness. Kind of like my run today.\n\nI bring this up because anyone invested in the markets has likely experienced some absolutely brutal pain recently. Guess what? Good! This is where fortunes are made! This is what separates those who get tired and quit (or in this case become paper hands and sell). Is it possible that we see more pain? Hell yea. I just don't think it ends up being that bad over a long time horizon. Especially if you do some research and figure out there is only one truly scarce asset on this planet. Dollar-cost averaging is probably the best way to invest. Lot of people think they can do better trading (my past self included) and get absolutely wrecked. Pain is good though because it teaches us a lesson. It shows one that maybe I'm not meant to trade against Wall Street who is using complex algorithms to execute their positions.\n\n![](https://miro.medium.com/1*tQMg0neXeTeQRWByyu12nQ.jpeg)\n\nI can only imagine what the world will look like on a Bitcoin standard. It won't fix every problem, but it will fix a lot of them. At least that is my hope. If you have hope you have a reason to keep going.\n\n5/13/22\n\nConor Jay Chepenik",
  "wordCount": 592,
  "readingTime": 2.4339622641509435,
  "claps": 0,
  "voters": 0
}