{
  "id": "48761292c2da",
  "title": "Day 632",
  "createdAt": "2023-12-15 02:51:55",
  "tags": [
    "dink",
    "policy",
    "sailing",
    "sports",
    "gambling"
  ],
  "url": "https://chepenikconor.medium.com/day-632-48761292c2da",
  "content": "# Day 632\n\nYou know if you wanted to make a lot of money sports betting what one should do is record all your picks and then have a friend fade all the picks for you. Keep it simple, print out the games for that day you want to bet on, circle the winners, then give the slip to a friend and say fade every single one of these. 99% of people would do better that way. It's kind of like sailing. *****(this is not gambling or financial advice)*****\n\n![](https://miro.medium.com/0*vdtt3PxjNlUzWgfL.jpg)\n\nToday I learned that in Hungary, Prime Minister Viktor Orbán introduced a policy where Hungarian women who have four or more children are exempt from paying income tax for life. This initiative, part of a broader \"Family Protection Action Plan,\" is aimed at tackling the country's shrinking population without relying on immigration. Hungary, like many other developed nations, faces a declining population, with a fertility rate of just 1.45 children per woman, which is below the level needed to maintain the population.\n\nGovernments often use incentives to influence societal behaviors, especially in demographics. The D.I.N.Ks in Hungary are down bad. Jokes aside, I think this policy will be much more effective for a flourishing society than China's one child policy which China reversed on because they realized they were creating a demographic problem.\n\nHuman nature is like water in the sense that it takes the shape of its container. Incentives rule the world and this Hungarian policy illustrates how powerful incentives can be in shaping individual and collective behavior. I would love to see the data on if this policy is effective. Personally, I think it's great to encourage people to have kids but I'm also not sure if this is the best way.\n\nWhile this policy is likely more effective than China's one child policy, it's still debatable if it's the best route. A free market approach could be more effective in the long run, as it allows for more organic growth and adaptation to the needs of the population. However, the Hungarian policy does have its merits in addressing the country's demographic challenges. Time will tell if it is successful in reversing the population decline and fostering a flourishing society.\n\n![](https://miro.medium.com/0*OUMi_7ky-Kd9eO8V)\n\n12/14/23\n\nConor Jay Chepenik",
  "wordCount": 374,
  "readingTime": 1.7946540880503143,
  "claps": 0,
  "voters": 0
}