{
  "id": "4903d20858ff",
  "title": "Day 686",
  "createdAt": "2024-02-07 04:59:19",
  "tags": [],
  "url": "https://chepenikconor.medium.com/day-686-4903d20858ff",
  "content": "# Day 686\n\n**Fractional Reserve Banking Makes For Bad Money**\n\nFractional reserve banking, a cornerstone of the modern financial system, has been met with significant criticism by anyone who understands what constitutes good money. This system, which allows banks to hold only a fraction of their deposits in reserve while lending out the remainder, is riddled with systemic risks and ethical concerns that have only been exacerbated in recent times. [In 2020 the Fed announced](https://www.federalreserve.gov/newsevents/pressreleases/monetary20200315b.htm)\n\n\"​​The Board has reduced reserve requirement ratios to zero percent effective on March 26, the beginning of the next reserve maintenance period. This action eliminates reserve requirements for thousands of depository institutions and will help to support lending to households and businesses.\"\n\nThis unprecedented policy effectively abolished the obligation for banks to hold any of their deposits in reserve, granting them carte blanche to leverage depositor funds in entirety.\n\n**War Is Included in GDP**\n\nPolitico [ran an article titled](https://www.politico.com/news/2023/10/25/biden-ukraine-aid-messaging-00123466)\n\n\"The White House is losing the messaging war on Ukraine. Now it's changing the message. The president's team is privately urging lawmakers to focus on the jobs that can be created by money spent on the war.\"\n\nFiat funds war. These systems, under the pretense of stimulating economic growth, expand the money supply via a contentious \"multiplier effect.\" Banks, predicated on the belief that simultaneous withdrawal demands by depositors will not occur, engage in the creation of money from nothing. This newly minted currency is then allocated towards various ends, including the procurement of military hardware and operations. Such financial activities contribute to economic indicators like GDP, albeit through a process that fundamentally relies on debt expansion and places the economic system's stability at risk.\n\nFractional reserve banking has a base layer built on a house of cards. The risk of bank runs is ever-present; the fear that a bank will not be able to fulfill withdrawal requests can lead to a self-fulfilling prophecy, causing financial panic and potentially collapsing the bank. Despite safeguards like deposit insurance and central banks acting as lenders of last resort, these measures are band-aids on a system fundamentally prone to crises.\n\nFractional reserve banking requires inflation to survive. As banks continuously expand the money supply through lending, the value of currency dilutes over time, eroding purchasing power. This is unnatural as markets are deflationary. Inflation becomes a tax on savings which creates more risk takers because those who practice prudent financial behavior are punished. The 2008 financial crisis serves as a stark reminder of how excess credit and opaque financial practices can lead to catastrophic economic downturns.\n\n**The Incentives Are Better In Bitcoin**\n\nFortunately, an alternative system exists that diverges from the traditional model built on debt and violence. Bitcoin introduces digital scarcity through its capped supply of 21 million coins, setting it apart from conventional banking systems plagued by inflationary policies. This cap ensures Bitcoin's value is preserved over time, in stark contrast to fiat currencies, which suffer from devaluation due to limitless printing. Unlike the opaque operations of fractional reserve banking, Bitcoin's framework is built on transparency and trust, with every transaction publicly recorded to ensure accountability and negate the need for reliance on unreliable institutions. The technology enables anyone to operate a node using relatively inexpensive hardware, marking a shift towards a more transparent and stable financial system.\n\nBitcoin starkly contrasts with the traditional banking system's propensity for using money as a means of control. Bitcoin is a protocol that allows individuals to transact directly without the need for permission or oversight from central authorities, thereby promoting financial sovereignty and independence.\n\nIronically, the very principles of fractional reserve banking, which might initially resist such a shift, could find incentives to back their currencies with Bitcoin to prolong their viability. Eventually, central banks, with the power to create money from nothing, may recognize Bitcoin's value and resort to printing money to acquire it, highlighting a pivotal realization of Bitcoin's significance in the financial landscape.\n\n![[https://primal.net/e/note13mdr7hpmhspuxzayvr47xahpnezktqgdywekcx5xryg47vlyryzstne7m8](https://primal.net/e/note13mdr7hpmhspuxzayvr47xahpnezktqgdywekcx5xryg47vlyryzstne7m8)](https://miro.medium.com/0*4ORmc-dV_q63L3G2)\n\n**Opt Into Free-Markets**\n\nFractional reserve banking changes the normal incentives of free markets. It is a flawed and risky mechanism that has repeatedly shown its vulnerabilities and propensity for causing economic distress. The move to a 0% reserve requirement during the COVID-19 pandemic is a testament to the system's recklessness, highlighting a disregard for financial stability in favor of short-term economic incentives.\n\nStop giving the system it's [\"liquidity\"](https://x.com/jamesviggy/status/1271245028770234368?s=20). By choosing Bitcoin you're advocating for a financial ecosystem that prioritizes transparency, stability, and the preservation of value over time. As the digital era progresses, the dichotomy between these financial paradigms grows more evident, hinting at a future where traditional banking must either embrace the innovations introduced by Bitcoin or face obsolescence. While the future remains uncertain, Bitcoin's innovations are prompting exploration of so many new possibilities. Public-key cryptography, the technology underpinning Bitcoin offers a powerful tool for secure transactions and a future where dependence on monopolized monetary systems is no longer necessary.\n\n2/6/24\n\nConor Jay Chepenik",
  "wordCount": 827,
  "readingTime": 3.3207547169811322,
  "claps": 0,
  "voters": 0
}