{
  "id": "49aeb6495ad8",
  "title": "Day 460",
  "createdAt": "2023-06-26 02:29:21",
  "tags": [
    "time-preference",
    "the-internet"
  ],
  "url": "https://chepenikconor.medium.com/day-460-49aeb6495ad8",
  "content": "# Day 460\n\nI need to listen to my internal dialogue more. I feel like it's telling me to fast.\n\nI'm going to Florida soon for over a week to see family. Maybe when I get back. A 7 day fast is manageable. Nice detox for my body.\n\nYou know what is so amazing about the internet? I didn't know what to write so I popped open another tab and went down a quick rabbit hole. Ended up screen grabbing this.\n\n![](https://miro.medium.com/1*ogQbdBxQ-HyED4x9p_nDvA.png)\n\nI am grateful to Nostr for providing me with an opportunity to connect with a remarkable community of individuals. Lately, I have come to realize the importance of practicing moderation in my consumption habits. With an overwhelming abundance of resources readily available at my fingertips, it becomes a challenge to resist the urge to indulge in excess. The sheer volume of information available on the internet is truly astounding, surpassing what one could possibly assimilate even in the span of a hundred lifetimes. Contemplating the exact number of lifetimes required to process it all evokes a sense of wonder, as it likely exceeds any figure I could accurately articulate.\n\nLife is good though. I've been writing everyday for 460 days and I feel like this has helped sharpen my thinking a lot. Interestingly, writing itself can be likened to a form of meditation, as it compels me to pause, reflect, and delve into the depths of my thoughts and experiences each day. Nonetheless, I believe that integrating additional reading and meditation into my routine will further enrich my personal growth and well-being.\n\nConsider this as a reminder to delve deeper into my true desires and aspirations. It is crucial to allocate ample time for introspection, allowing me to gain clarity on my goals, passions, and the underlying purpose driving my life's journey. At the forefront of my mind is the unwavering commitment to being the best parent possible for my daughter. This necessitates being fully present during our shared moments, recognizing that time flies swiftly, and before I realize it, she will have transitioned into adulthood.\n\nMany of our actions serve either immediate gratification or long-term benefit, rarely both simultaneously. It is essential to cultivate a preference for engaging in low time preference activities, those that contribute to long-term personal growth and fulfillment. By prioritizing these endeavors over high time preference activities that yield fleeting pleasures but jeopardize future joy, we can create a more promising and rewarding path for ourselves.\n\n![I don't know but I generated it with adobe firefly :)](https://miro.medium.com/1*rRyaYQA110kyhxeNceN-Hg.png)\n\n6/25/23\n\nConor Jay Chepenik",
  "wordCount": 418,
  "readingTime": 1.9606918238993711,
  "claps": 0,
  "voters": 0
}