{
  "id": "49f080e23033",
  "title": "Day 877",
  "createdAt": "2024-08-16 02:54:50",
  "tags": [
    "bitcoin",
    "abundance",
    "health",
    "wealth",
    "accelerate"
  ],
  "url": "https://chepenikconor.medium.com/day-877-49f080e23033",
  "content": "# Day 877\n\nRemember those clunky phones from the 90s? I don't, 'cause I was still in diapers, but I've read about them. They were like bricks you could call people with, and it cost you a kidney to use them. Fast forward to today, and your iPhone can do everything short of making coffee. It's like having the entirety of human knowledge in your pocket, plus the power to capture, create, and connect in ways those brick-phone users could only dream of.\n\nTechnology is incredibly deflationary. We should be getting more for less, year after year. In many sectors, we do - just look at how much computing power you can fit in your pocket today. But flip the coin, and you'll see a different story.\n\n![[https://x.com/DylanLeClair_/status/1748012214794006802](https://x.com/DylanLeClair_/status/1748012214794006802)](https://miro.medium.com/0*_HFoC83qOBckQEaG)\n\nOur fiat money printing and bureaucratic systems seem stuck in the Stone Age, actively working against this deflationary trend. The ability to print money out of thin air creates a moral hazard that's hard to overstate. History has shown time and again that if you give humans the power to create money, they'll inevitably abuse it. This inflationary force of money printing is in constant battle with the deflationary force of technological progress, creating a tug-of-war that affects every aspect of our lives.\n\nThe SEC 'protects' us from getting wealthy by limiting investment opportunities to accredited investors with a certain net worth, while paradoxically allowing anyone to gamble their life savings on lottery tickets or in Las Vegas. The FDA 'protects' us from getting healthy by slowing down drug approvals and driving up costs. The FDA recently declined a potentially [life-changing MDMA therapy for PTSD](https://www.nbcnews.com/health/health-news/fda-rejects-psychedelic-mdma-assisted-therapy-ptsd-rcna165531), a drug that could have profound benefits for those returning from war. And [Eroom's Law](https://en.wikipedia.org/wiki/Eroom%27s_law) (the opposite of Moore's Law) ensures that the price tag for 'progress' in fields like medicine and energy keeps ballooning.\n\nIt's as if we're being held back by an invisible force, preventing us from entering an era of abundance. This force, though obfuscated, stems from the ability to manipulate the money supply. It allows those controlling the money printers to siphon wealth from the productive sectors of society, creating artificial scarcity in a world of potential plenty.\n\nOur current system is a bit of a Frankenstein, cobbled together by misaligned incentives and short-term thinking. But here's the kicker: innovation doesn't wait for permission. Individual biohackers on Twitter aren't asking for the FDA's approval to cure themselves.\n\n![[https://x.com/bryan_johnson/status/1824078073018581129](https://x.com/bryan_johnson/status/1824078073018581129)](https://miro.medium.com/1*eYd0pijQKQvxb2MFnxvGLw.png)\n\nDecentralized financial systems aren't begging for central bank bailouts. They're offering monetary supplies that are auditable to anyone with a computer and internet connection.\n\n![[The Bitcoin Central Bank's Perfect Monetary Policy | Satoshi Nakamoto Institute](https://nakamotoinstitute.org/mempool/the-bitcoin-central-banks-perfect-monetary-policy/)](https://miro.medium.com/0*DWC0LJZtyzuaO-0i.jpg)\n\nThe path forward is clear, but it requires individual action. We need to embrace sound money principles that align with technological progress, forcing efficiency and innovation rather than inflation and rent-seeking. We need to question outdated regulations that stifle progress under the guise of protection. And most importantly, we need to recognize that the power to shape our future lies in our hands.\n\nFor all our flaws, humanity has managed to do amazing things. We've cured diseases, explored the depths of space, and connected billions of people across the globe. We can continue to push the boundaries of what's possible, but only if we're willing to challenge the status quo and embrace the deflationary power of technology.\n\nThe future is bright, but it's up to us to seize it. Don't ask permission from those who benefit from maintaining the old system. Instead, educate yourself, innovate, and be part of the solution. Together, we can make abundance the norm, not the exception.\n\n8/15/24\n\nConor Jay Chepenik",
  "wordCount": 597,
  "readingTime": 2.8028301886792457,
  "claps": 3,
  "voters": 1
}