{
  "id": "4a43eac82db5",
  "title": "Day 377",
  "createdAt": "2023-04-03 23:28:07",
  "tags": [
    "bitcoin",
    "mmt",
    "money",
    "society",
    "quantitative-easing"
  ],
  "url": "https://chepenikconor.medium.com/day-377-4a43eac82db5",
  "content": "# Day 377\n\n![](https://miro.medium.com/0*6CQU4dbskq3eMa9N)\n\nMoney is a critical component of our modern society, enabling us to exchange goods and services and make rational decisions about allocating our resources. However, when money becomes corrupted or manipulated, it loses its ability to serve as a reliable measure of value, rendering it an unpredictable and unreliable tool for planning and decision-making. Therefore, it is essential that we have a trustworthy monetary system in place, free from corruption and manipulation.\n\nOne such example of manipulation is the government's decision to print more money, also known as quantitative easing, to stimulate economic growth. The idea is to make sure people have enough money to spend, which in turn boosts the economy. However, if too much money is printed, it loses its value, resulting in hyperinflation.\n\nHistory has shown us numerous examples of such hyperinflation, such as the case of Germany in the early 20th century. The government decided to print more money to pay off its debts, resulting in the value of money dropping to such an extent that it became practically worthless. People had to carry wheelbarrows of cash just to buy basic necessities in Weimar Germany.\n\nAnother example is the fall of the Roman Empire. As the empire expanded, the government had to print more coins to pay for wars and infrastructure projects, leading to inflation and a decrease in the value of money. Back then they did not have computers to print money digitally. They actually clipped the physical gold coins and replaced it with cheaper metals. Eventually, people lost faith in the currency and turned to other forms of trade. I wouldn't be surprised to see barter on an individual level pick back up in a post dollar world.\n\nThese examples demonstrate the negative consequences of printing too much money, which can result in economic instability and hardship for ordinary people. As such, quantitative easing should be approached with caution and forbidden to prevent hyperinflation.\n\nLuckily, there are alternatives to traditional currency, such as Bitcoin, that have no mechanism for printing money, making them immune to the negative consequences of quantitative easing. While Modern Monetary Theory (MMT) may suggest that governments can print as much money as they need to stimulate the economy without causing inflation, history has shown us that this is not always the case. While MMT may sound great in theory, it has yet to prove itself in practice.\n\nMoney is such a vital technology for allowing people to lead fulfilling and prosperous lives. However, when money becomes corrupted, society starts to break down. As such, it is essential that we have a trustworthy monetary system in place. Those with the power to print money are not going to give it up willingly. Opt out while you can before excess quantitative easing results in hyperinflation. MMT proponents believe that we owe it to ourselves to borrow but the negative consequences of excessive money printing have been seen too many times to believe this is not a naive take. Don't go out and buy Bitcoin because you might be bullish after reading this piece. Go and verify for yourself that a possible solution to this problem is convincing more people to adopt Bitcoin.\n\nThen, if you really do feel based on your own research, it might be a good idea to buy and self custody some bitcoin [here is a link](https://invite.strike.me/MZKOQO) to Strike so we can both earn 5 US dollars worth of Bitcoin. I recommend dollar cost averaging since Bitcoin is volatile but every person will have different needs. Figure out what works best for you anon🤝\n\n4/3/23\n\nConor Jay Chepenik",
  "wordCount": 602,
  "readingTime": 2.4716981132075473,
  "claps": 64,
  "voters": 2
}