{
  "id": "4a65ea3f726a",
  "title": "Day 328",
  "createdAt": "2023-02-14 03:56:23",
  "tags": [
    "parenting"
  ],
  "url": "https://chepenikconor.medium.com/day-328-4a65ea3f726a",
  "content": "# Day 328\n\nNot going to dwell on the Super Bowl because it was amazing spending time with friends and family. Just wish the ending of that game was not decided by a horrible pass interference call. Definitely one of the most aggravating ways to watch your team lose the ultimate sportsball game😂 🥲. On the bright side I caught up with people who I don't get to see everyday because they live in the Atlanta area.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1624916420113973254%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhile I was annoyed right after the game I feel much better about it today. The Eagles are my favorite NFL team but since I'm not a player it is not that big of a deal. Much different experience rooting for a team vs actually playing on one. Much love to all the Eagles who are probably still feeling the pain of a hard fought loss to end an incredible season.\n\nOn another note, I was disappointed to learn that my Dad did not want me to come through Anderson, SC on the way back up to Boston. I've been driving all day thinking about if I wanted to write such a personal blog and release it online. I landed on yes because I believe it is cathartic to put your thoughts down on paper (or in this case digital paper) even if you don't end up acting them out. Good humans grow, learn, and constantly change their mind throughout life. When I was a small child my Dad got my siblings and I journals to write in. He promised us that he wouldn't read them. Around this time my parents were either going through a divorce or had officially gone through one. I can't remember, the details are foggy as I was around ten years old. What I vividly remember is writing some really mean stuff in my journal discussing how much it hurt me that my parents were separating. One day after writing in those journals for awhile my Dad said to my sisters and I that he wasn't going to say by whom but that his feelings were really hurt by what we had written in our journals. This really upset me when I first heard it. My Father had promised not to read our private journals and did so anyways. I have no idea if my sisters had written something mean but I know I wrote some nasty stuff. It was infuriating as a kid to know there was didly-squat I could do in terms of fighting back. It was a fiat thing of my Dad to do. After some time had passed I felt relieved. I didn't want to hurt my Dad's feelings but I did want him to know my feelings about the whole divorce. I've always speculated that a child becomes and adult when they realize their parents are not perfect. As a matter of fact I listened to a ton of podcasts today and in this one specifically they mentioned the idea that evil stems from someone/something that thinks it knows everything.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F9J9daHYHt_w%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D9J9daHYHt_w&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F9J9daHYHt_w%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nLife is constantly changing and our knowledge needs to grow with it. I agree with this idea about evil. Those that go through life assuming they are always right create a recipe for evil to spread in the world. How does this tie in with my Dad? Well I think it has to do with the fact we could both be wrong about this situation. Naturally our assumptions are that we are in the right.\n\nLet me preface this letter by pointing out I don't think my Dad is ever going to read this. Maybe one day but at this point in my life I'm not living in his house and I don't send him these so I would be suprised if he reads it. So with that disclaimer I'm going to write him a letter as if he were reading this.\n\nDad it upset me that you told me not to come visit you today. I understand that on this trip you felt like you got the short end of the stick in terms of time spent with your children. However, I was not planning on taking a trip down to Florida. I did so because you convinced me it was crucial to come see Grandma. As a matter of fact I'm glad Paige and I made this trip so G could meet her Great-Granddaughter. It ended up working out well and Sloan got to meet multiple Great-Grandparents as well as her Great-Great-Grandma and her Grandpa on Paige's side. In a way I got what I wanted which was to do this trip when Paige was really not ready to do so because she was still dealing with postpartum. She sucked it up because she didn't want me driving all the way down to visit Grandma alone. It was amazing visiting family and I was planning on making time to come and see you. When I called you this morning you told me you hadn't heard from me since last Tuesday and that you were slammed with work so I shouldn't come. When I called you Tuesday I thought I made it clear I was going to visit Monday. It was clear that you were upset I was only going to spend one night in Anderson but I explained why that was the case and I feel like my reasoning was fair. Nothing changed between Tuesday and today. I was very much looking forward to seeing you! I have no idea if I had called between today and Tuesday if that would have changed anything. I feel like you are gaslighting me by saying it has to do with the fact you did not hear from me until today. Anyways, it is a mute point now. I will be in Jersey soon with Paige's family and then back in Boston. At one point in the car today I was running through scenarios of things I should have said on the phone. Like calling you out for acting like a teenage girl about this whole situation. You told me that when you have a kid your life whole changes and you can't understand till you have one. Well now I got one and I'm doing the best I can to show her to everyone while making sure her and Paige are happy. It's not easy. I don't like upsetting you or \"jipping you\" in regards to time spent together. I feel like you aren't respecting my families needs when you tell me not to come visit because one day isn't enough for you. You didn't say that directly but that is what is implied by telling us to forget about coming up. You have been a great Dad in a lot of ways. Without you I wouldn't have played college football. I wouldn't have 3 amazing sisters. Hell I wouldn't have my life(shoutout Mom too because it takes two to create a life). You care deeply about my sisters and I which makes me grateful. Despite your flaws I know you would jump in front of a bullet if it meant saving my life. That gives me a lot of confidence knowing I have parents who love me no matter what. Despite my frustrations today with the whole situation I'm glad I typed this all out. It reminds me of you reading my journal as a kid. Initially the situation irked me beyond belief. Now I'm grateful you broke your word so you understood how I felt about you and Mom separating. I'm sure I will make plenty of mistakes with Sloan. I'm going to do my best and strive to be a great Dad. There will be a lot of ways I parent that I learned from you. For example, instilling a solid work ethic in Sloan. There are also parenting methods I will use that you might not agree with. The beauty of it is that Sloan is my kid and as the Grandparent you can just enjoy your time with her without feeling the need to parent her like you would one of your own kids. I doubt you'll read this, but if you ever do Dad know I love you so much. Words can't articulate how grateful I am to have you in my life. Today was frustrating but I already feel better after this word salad. Glad I didn't call you a teenage girl on the phone because that would've gotten us nowhere except maybe more entrenched in our positions. I might wait a few days before calling you but I'm going to call you soon. Life is too short to dwell on the bullshit. Love, Conor.\n\nA bit of an unorthodox post today but I needed to get that off my chest. Part of me hopes my Dad reads that and another hopes he doesn't so I can just call him soon and move on without having to rehash this whole debacle. Not good sweeping feelings under the rug but there is nothing in this argument I want to die on a hill about it. The whole situation saddened me but life goes on and I want him to spend more time with both me and Sloan. The lesson I learned from that whole journaling incident is that the truth about your feelings are important to express. Writing something that scares you to publish is important. I remember having this sinking feeling in my gut after my Dad mentioned to my sisters and me he had read our journals. It felt like my world was going to end. It didn't and now I'm proud to have published plenty of articles on both Bitcoin Magazine and bitcoinnews.com criticizing the most powerful Government on Earth. God bless the constitution for giving me the right to do so, but I was also nervous to publish those at first. The feedback has been great and I plan to publish many more.\n\nAnother reason I'm happy to have written that whole letter is because I hope Sloan and potentially my other Children and Grandchildren can read these Mediums one day if they want to learn more about me. I would love to have read 365 days worth of writing from Parents, Grandparents, and even Great-Grandparents who I never really got to know. I'm sure there will be times when I'm a bonehead parent and Sloan (or other children) if you are reading this remind me of ways I need to be better. Maybe write a long form essay venting your frustrations before doing so though hahahaha. I can 100% confirm it will make you feel better about the whole situation. It did for me anyways. Love you Dad.\n\n2/13/23\n\nConor Jay Chepenik",
  "wordCount": 1794,
  "readingTime": 6.769811320754717,
  "claps": 0,
  "voters": 0
}