{
  "id": "4af37416ad54",
  "title": "Day 320",
  "createdAt": "2023-02-06 03:28:58",
  "tags": [
    "balloon",
    "sailing",
    "based"
  ],
  "url": "https://chepenikconor.medium.com/day-320-4af37416ad54",
  "content": "# Day 320\n\nTook my Daughter sailing for the first time today. It was a special moment.\n\n![](https://miro.medium.com/1*wbCZHWOEiAFfA-kx9bZw1g.jpeg)\n\nOne month ago she was coming out the birth pool and now she is navigating the St. John's river. Time moves fast hahahaha.\n\nBeing on the water is awesome, but I've found I'm prone to getting sea sick. They make pills to help fight this but make sure you take them before getting on the boat. Luckily, I wasn't on the boat long enough to have to worry about this today but note to self next time I plan to take a long trip on the water get the seasickness medicine. Which according to a quick google search is\n\n**\"Scopolamine (Transderm Scop)**.\n\nMost commonly prescribed medication for motion sickness. You have to take it before symptoms start. It comes in patch form to put behind your ear 6 to 8 hours before travel. If the patch is left in place, effects last up to 3 days.\"\n\n6–8 hours before even getting on the boat is probably better than right before lol. It's amazing how much we can learn with a few clicks of our keyboard.\n\nI know I joked that I wasn't going to let the balloon take up more brain space the other day but this tweet by Thomas Massie is too good not to include in this Medium.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/RepThomasMassie/status/1622384433528541186%3Fs%3D20%26t%3DrdGOPbu65Uu0A5d0Z0-pPw&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIncluding article link as well to save two clicks by having to go to Twitter and then click article. I just wanted to point out a sitting Congress member, who I am very proud to be followed by because he is one of the few patriots left in office, tweeted this out.\n\n> [**Pentagon testing mass surveillance balloons across the US**](https://www.theguardian.com/us-news/2019/aug/02/pentagon-balloons-surveillance-midwest)\n\nI went ahead and read the article and it fits with what I said yesterday. They have to increase surveillance to fight drug traffickers. You know invade on people's privacy to stop the bad guys of course. Life has a funny way of having us make connections when we learn something new. Kind of like when you buy a new car and start seeing the same car everywhere. Not that the number of those cars has increased, our perception just focuses in on it because we drive the same car. I know our brains are designed to find meaning and sometimes it finds meaning in things that might not potentially be there. However, in this case something seems off. I don't know what the heck is happening with these balloons but I dislike the idea of big brother floating around in the sky tracking everyone \"for our safety\" of course.\n\nWhen I went to visit my Grandma in the hospital earlier today I met one of her friends. I'm not going to delve into the specifics but I'll just say this woman was quite based. It's nice finding someone else, especially a woman who could be my grandmother based on age, seeing the problems going on in the world as well. People are waking up and those who wish to coerce others are losing. I know age for some can mean people are wiser. Yet, it also makes people more set in their ways. Depends greatly on who you are talking with, but my point is that it doesn't take the up and coming generation to see there are problems that need fixing in our world. It starts by discussing them and how we improve them. Keep the faith anon! I tried to discuss Bitcoin and while my Grandma's friend was perceptive it's definitely a tall order trying to explain this network to someone who doesn't have the technological background. Baby steps. The masses are waking up, the future is looking bright, and I released a new pod today. Life is looking up! (no balloon pun intended) :P\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F6G715HWF68p9gRLajSC18K%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F6G715HWF68p9gRLajSC18K&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f5e9a377ce5df79481d7814b8&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\n2/5/23\n\nConor Jay Chepenik",
  "wordCount": 655,
  "readingTime": 2.6716981132075475,
  "claps": 0,
  "voters": 0
}