{
  "id": "4b540d0168a3",
  "title": "Day 1000",
  "createdAt": "2024-12-17 04:23:43",
  "tags": [
    "1000",
    "days-out",
    "i",
    "did",
    "it"
  ],
  "url": "https://chepenikconor.medium.com/day-1000-4b540d0168a3",
  "content": "# Day 1000\n\nMy Dad recently shared some profound advice with me. I was discussing my strategy to hold onto my Bitcoin without ever converting it to fiat currency over the next decade, certain it would secure my financial future (which I am quite confident it will). However, he questioned my focus by asking, \"Why are you only concerned with safeguarding what you have? Why not strive for more?\" He urged me to embrace a growth mindset, to not merely hold but to create, build, innovate, and lead. His message was clear: by adding value and actively supporting others' success, you pave your own path to greater achievements. Karma, as he implied, is very real. Whether you're baking or building businesses, the act of contributing positively to others' lives can lead to your own prosperity. Thank you Father for that wisdom.\n\nYou would think after doing this writing thing for 1000 days it would get easier to write on demand. Yet, it doesn't. There are few things more challenging than a blank slate and most of us still seem to seek the blank slate. We start a project then get bored with it and move on to a new one. We start a piece of art and hate it so we scrap it. We build something and then get bored with it. We decide we are going to write every day for the rest of our lives, assuming Medium does not go out of business, and we show up each day with a new blank slate.\n\n![Use this knowledge to your advantage, there is a difference between an expert and a bullshitter. Ironically, the latter is often called the former.](https://miro.medium.com/1*Mi3pZDVXWvAhcTFAOaEhTg.png)\n\nI'm proud of reaching one thousand days of writing because I've learned that 90% of the challenge is just showing up. Now, I'm a professional writer, paid for many of my articles and essays, and I'm gearing up to write a book that will feature many memes. None of this would've been possible without my relentless consistency on Medium.\n\nI love the idea of committing to something and seeing it through. It's easier said than done, but the sense of achievement when you do it is unparalleled. Some days, the words are straight gasoline, hot enough to need a fan on my computer. Other days, it feels like my toddler could outwrite me. It's on those tough days that showing up matters most, when it's the last thing I want to do, yet I do it anyway.\n\nWe're all destined for greatness. Each of us holds a divine spark in our being gifted to use by the Creator. A soul God gave us within this vessel we call our body. You have the power to change the world anon. The question is, how will you impact it? Will you leave it better or worse? Do people usually feel uplifted after interacting with you? Over your lifetime, do you approach life with joy or sorrow? I hope it's the former, but God has given us all free will. So choose wisely.\n\nI also learned after 1000 days of writing that Bitcoin is good money and will save humanity from fiat debt slavery. So that is pretty cool.\n\n![[https://x.com/ConorChepenik/status/1868853437729063137](https://x.com/ConorChepenik/status/1868853437729063137)](https://miro.medium.com/0*eE4GveI8B5H7oOyz)\n\n12/16/24\n\nConor Jay Chepenik",
  "wordCount": 515,
  "readingTime": 2.326729559748428,
  "claps": 50,
  "voters": 1
}