{
  "id": "4c4514ffcbdd",
  "title": "Day 30",
  "createdAt": "2022-04-21 21:23:20",
  "tags": [
    "love",
    "hopium",
    "small-business",
    "dreams",
    "accepting"
  ],
  "url": "https://chepenikconor.medium.com/day-30-4c4514ffcbdd",
  "content": "# Day 30\n\nWoke up at 7am again: got the hattrick - 3 days in a row. No alarm just immediately jolted awake at the exact same time. It's wild what the body can do. Not sure why mine keeps waking itself up early but maybe it's trying to tell me that it's time to have another productive ass day XD. Been trying to learn how to program websites recently. Feel like this could be big in the future hahahahaha. Funny because it's already massive but not going anywhere anytime soon. I'd like to spin up my own website and sell stuff for 🌽 . Writing it here as a reminder to get to it.\n\nLife is more fun when you're learning. I genuinely mean that. Our brains are always looking for meaning and I've found few things quite fulfill that itch outside of solving a difficult problem. This is what learning is all about: teaching yourself to solve problems. Preston mentioned on that Podcast I was listening to yesterday that the World is full of problem identifyers but very few problem solvers. Be the latter if you want to be successful anon.\n\n![](https://miro.medium.com/1*DU1wCo06qJYogrlS4rYF0Q.jpeg)\n\nI got a good feeling about the future of my portfolio. I identified a problem which is our current system is leveraged to the max and is all based on debt. Kind of a ridiculous system for our money to be based on debt but I didn't stop there. No I started obessing over bitcoin and learning as much as I could. I can't fix every problem in the world but I can work on fixing my own. Thus, I have put the majority of my wealth in the 🌽 . This should solve my problem of retirement when I turn 65 and want to stop working. Might even be able to stop well before 65 if I'm correct in my predictions. If we get on a bitcoin standard I will open a small business. My girlfriend enjoys flower and baking. I enjoy stand up and coffee. Thus, maybe will make a coffee/flower shop that has a stage for stand up and only accept bitcoin. I really am not eager to have a certain # in my account. I just want to be happy and have the sovereignty to spend my time doing whatever I want.\n\nIn other news I renamed my Twitter from the @thebinmuckerpod to @ConorChepenik today. Saw something that talked about how in real life people have freedom of speech but don't usually say heinous stuff because they would get pushback. When you are online as an anonymous account it is a whole different story. Not that my account was ever fully anon, but I do believe having a face and name is worth it. My objective is to hold myself accountable. Often times I want to tweet out mean stuff to point out how stupid some of these takes are on Twitter. By not being pseudo-anonymous I will have to think twice before putting out a mean tweet. Truth be told if an idea is that stupid I am doing nothing by engaging with it. I want to be better at accepting rather than wanting. Of course I want the world on a bitcoin standard where people can control their own wealth without the fear of debasement via central banks and political spending. Do I think this will happen, yes. However, no one knows how it will play out and quote tweeting bad takes is not going to help me create a better world. Focusing on accepting myself, expanding my education, and only focusing on things I can control (which is basically my own actions) will put me in a better spot to accept what happens in the world. Lex Fridman had a great quote on his recent episode with Andrew Huberman that basically went \"Whenever someone comments something negative on my stuff online I just wish them LOVE and move on\". Simple yet profound. When people lash out they are likely going through it. You can stoop down to their level or you can accept and move on.\n\n4/21/22\n\nConor Jay Chepenik",
  "wordCount": 688,
  "readingTime": 2.7962264150943397,
  "claps": 0,
  "voters": 0
}