{
  "id": "4d01530ef67e",
  "title": "Day 101",
  "createdAt": "2022-07-01 17:18:56",
  "tags": [
    "comedy",
    "butterfly-effect",
    "podcasting",
    "value",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-101-4d01530ef67e",
  "content": "# Day 101\n\nInvited a bunch of my buddies to my stand-up show this Tuesday. I'm really excited and since my friends actually know me I think they will appreciate the jokes even more. I was practicing my set in the shower this morning after my run this morning and I'm starting to get pretty comfortable with all the lines. Writing and creating make life a lot better. So often I feel this overwhelming sense that I'm not doing enough but when I express myself via medium, writing comedy, or even doing a podcast I feel better. Our modern world is always ready to give us a hit of dopamine and taking the time to slow down and think through creating something is quite therapeutic. Can't wait for the show this Tuesday. I'm going to put a smile on a lot of faces.\n\nTomorrow I'm doing a podcast with my Dad. Episode #3 of the Conor Chepenik podcast. Excited to do a long-form conversation with the man that helped create half of my DNA. Need to think through what I want to ask him. #1 How do you feel about turning half a century old in a few days? Hahahha He'll love that one. #2 What are some of the most important lessons you have taken away from opening and operating your own businesses. #3 Why is having a child so life changing. #4 Outside of me constantly talking about it, what made you want to invest your money in Bitcoin. #5 Perks and drawbacks of being a realtor. #6 You've been around fitness most of your professional life and continue to be with Sofia (my younger sister) and her lacrosse stuff. Why do you think fitness is good at bringing out the flow state. #7 How do you think the world will change by 2030. #8 How do we fight this surveillance state that seems like it's constantly growing and encroaching on basic rights. #9 What content do you consume the most, social media, podcasts, TV, books, or something else. #10 What do you want to accomplish in the next ten years.\n\nNice start to get some good conversation going. I'm excited to interview my Dad and keep growing my podcast. It's fun to have conversations with people who can expand my perspective and teach me new things. I look at all the podcasts I love listening to and hope one day to go on some of them (if I can build up a big-enough audience to become credible enough that those legends would want to talk with me). Even if I never get that big I'm still having a great time podcasting and if I can provide value to one more person who knows. Maybe that person will spread the good word of Bitcoin to a person that goes on to spread it to millions, if not billions of people. The [butterfly effect](https://www.americanscientist.org/article/understanding-the-butterfly-effect) is some crazy shit. We are powerful as individuals even if at times it seems like we are helpless. Keep going anon, keep smiling, keep remaining relentlessly optimistic and remember good will win out against evil.\n\n![](https://miro.medium.com/0*ZxSM4_RSoF2tsuiH)\n\n7/1/22",
  "wordCount": 524,
  "readingTime": 2.177358490566038,
  "claps": 0,
  "voters": 0
}