{
  "id": "4d0b71bff110",
  "title": "Day 335",
  "createdAt": "2023-02-21 03:40:49",
  "tags": [
    "war",
    "bitcoin",
    "christianity",
    "bcb-podcast",
    "run"
  ],
  "url": "https://chepenikconor.medium.com/day-335-4d0b71bff110",
  "content": "# Day 335\n\nOnly 30 more days of doing this and I will have officially written for a year. That's pretty incredible to think about. Not that writing everyday is hard. Just the fact every single day I did it. I saw something today on [Jimmy Song's substack](https://jimmysong.substack.com/p/bitcoin-tech-talk-332) talking about how there is no magic bullet to anything. Motivation is essentially a scam and it's all about discipline. I think there is a lot of truth to that. Showing up everyday and trying to get better is a lot easier said than done. Especially when Monday rolls around after a long weekend and you don't want to do much of anything. The motivation will eb and flow but if you have discipline you will succeed at some point. Glad I've been disciplined about writing and running. It has made a positive impact on my life in ways I did not see happening. Never did I think I would complete a half marathon, get into publishing articles for various reputable bitcoin media outlets, or take joy in the activity of putting one leg in front of another over and over again.\n\nSpeaking of running I crushed the first half of this podcast today while crushing a 5k.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F3hg5nNldiryJixnwwiKmbv%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F3hg5nNldiryJixnwwiKmbv&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f678eac4cb8169a757cae46fa&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nLooking forward to finishing the rest later. One of the things discussed in this podcast is Christianity and how it relates to Bitcoin. There are a lot of interesting metaphors between the second coming of Christ and Bitcoin. Bitcoin is an immutable ledger that can't be changed unless you have your private keys and want to spend some UTXOs. It's similar to the Bible in the sense its a source of truth for anyone who wants to use it. The Bible has lasted thousands of years and Bitcoin about 14 so this might seem like a stretch. However, I think the metaphor holds value because if I was going to record something and I wanted to be sure it lasted the test of time I can't think of anything better than Bitcoin to do so. Even if I recorded something on a piece of Gold there is no guarantee that metal doesn't get lost, stolen, or forgotten about. If I put it on an immutable ledger in cyberspace though it's a different story. I hope my ancestors run a node and look up some of the bitcoin transactions I made. Going to be pretty cool telling them I used the layer 1 pretty frequently back in my day.\n\nOne thing I learned listening to this podcast is that the Bible claims money is the root of all evil. As a Bitcoiner it is easy and fun to think \"Have Fun Staying Poor\" when a no-coiner, or even better someone with Bitcoin derangement syndrome, starts mouthing off about how Bitcoin can't work as money. To some degree I think there is value in the toxicity Bitcoiners can display because it helps some people see the difference between shitcoins and Bitcoin. After listening to this podcast I'm now considering that the path of humility might be better. Which does not mean I shouldn't call out scams when I see them. What I mean by this is to stop being so dogmatic about Bitcoin. To not pick fights with those who don't wish to learn and would rather argue. My understanding is that bitcoin will never stop appreciating against fiat currency. The math makes it clear that over a long enough time horizon Bitcoin is trending towards infinity and fiat is trending towards zero. Which would make Bitcoin sort of a Noah's ark type thing. More Bible references. I should be thinking of Bitcoin as something I can help people leverage if they are interested, but not something I have to get in fights over. Fixing money so it's a fair tool to measure things with is very important to society. If we can do that I believe with every fiber of my being we can fix the world. However, money is just that: a tool. Bitcoin seems to be the best money we've ever had but that still doesn't fix human nature. It just makes it harder for a small group of people to rob from a big group of people without fiat currency to do so. Life is not about money, followers, likes, and all the other accolades you can receive from playing on cyber space. It's about finding meaning, forming meaningful relationships, and helping others. The former seems to be the true goal in life, but I'd argue that the last two things will help with finding meaning.\n\nSo what's next for me on my bitcoin journey? Stay humble; stack sats as the wise Odell says. If Bitcoin does what I think it is going to do I'll be looking back in 10 years with more money than I need. Which would be great but money can't buy happiness. Studying, learning, networking, and growing as a person are things I need to focus on during my personal journey to find meaning. I will give credit to Bitcoin for piquing my interest in doing some of these things because I found going down the rabbit hole to be an enjoyable experience. Constantly obsessing over the fiat price is not good for me though. I've gotten much better during my second bear market here and it feels good to see Bitcoin start to run up again in 2023. Yet, I should take my own advice and realize measuring bitcoin in fiat terms is ridiculous. 12 people who sit on the F.O.M.C control money in the U.S.A. Of course bitcoin is volitaile in fiat terms when fiat money is controlled by a small set of humans. Until money is controlled by humanity ie through Bitcoin we will keep having crazy boom and bust cycles.\n\nI've been thinking about this whole idea money is the root of evil nonstop since hearing it on my run. Proud of myself for crushing the run today because ya boi almost got lazy. My dedication came thru doe. Will have to get in another tomorrow so I can finish the podcast and better organize my thoughts. I'm not sure what to make of this dilemna. I know, for a fact, Bitcoin can fix many of the world's problems. At least as close as one's opinion can get to a fact lol. Again, shouldn't be so dogmatic but it just seems so apparent the farther down this rabbit hole I go that Bitcoin fixes this. Reminder to myself: money can't fix everything. It can buy you nice things, it can help left people out of poverty, and it can allow people to trade more efficiently. It can't buy you real love, it can't show you acts of kindness, and it can't fill the hole in your heart that comes from a lack of meaning and purpose. We only get so much time on this spinning rock we call Earth. I'm grateful Bitcoin exists, but I'm even more grateful for my Partner, my health, my kid, and all the other relationships I've made along the way.\n\nEnjoy the ride, stack sats, and do your best to avoid telling no-coiners to H.F.S.P. Hahahaha maybe if someone has a real case of B.D.S it might be worth it. That said, maybe a better phrase would be enjoy your currency backed by debt and violence. Or you can tell them no amount of money can buy you true happiness but a good money can prevent wars.\n\n![](https://miro.medium.com/0*kKBAcQIctG2aHRWn)\n\n2/20/23\n\nConor Jay Chepenik",
  "wordCount": 1254,
  "readingTime": 4.932075471698114,
  "claps": 0,
  "voters": 0
}