{
  "id": "4e9009249ccb",
  "title": "Day 88",
  "createdAt": "2022-06-18 18:02:16",
  "tags": [
    "family",
    "tesla",
    "vehicles",
    "corn",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-88-4e9009249ccb",
  "content": "# Day 88\n\nGot to have a lovely breakfast after staying with my Aunt and Uncles in New York last night. It was really great getting to see my Grandparents and relatives. Everyone was super supportive of my girlfriend being pregnant, but it was pretty funny when we first walked in the house and my nephew Vaughn goes \"Wait? How is Paige pregnant if you guys aren't married? Doesn't it go first comes love then comes marriage then comes a baby sitting in the baby carriage?\" Touché Vaughn. I do hope to marry my girlfriend one day, but need to save up for a ring. Which in this economy, as inflation skyrockets and assets tank, is no easy task. One day though. Now I'm in New Jersey visiting my girl's family. Lot of driving but I always try to remind myself when I'm sitting in traffic that I have millions of podcasts a click away so it really isn't that bad. Not like I'm riding a horse across the Hudson that needs to stop to eat and shit. God bless petrol vehicles.\n\n![](https://miro.medium.com/1*t29pACG7eiwS2lvl_NUU3w.jpeg)\n\nSpeaking of non-petrol vehicles, my Uncle has a Tesla Plaid and I got to ride in it on the way to the diner. It is absolutely insane what Elon and Tesla have done with those cars. It's literally a race car. It felt almost instantaneous going from 20–60 when my Uncle stepped on the gas. On the way back to their house my Grandma was in the car and hearing her go \"Jesus\" when my Uncle gunned it will always be hilarious. She was not the biggest fan but I am now. Plus the display and glass ceiling is beautiful. Riding around in that car feels like a sci-fi movie. I'll always have a lot of love for old cars and combustion engines since those are what I grew up with, but electric cars seem inevitable. Hopefully, the tyrants in D.C realize we need nuclear power, not coal mines creating our electricity if we want to have reliable and green forms of energy.\n\nWild to think many kids growing up in the future will probably not even bother with learning to drive. Between Uber and autonomous vehicles, the incentives of getting a license goes down. Driving a stick shift is a visceral feeling that many people will never understand if they don't experience it. Hopefully, we can find a fine line between innovation and cherishing the historic. This goes for homes, vehicles, and even fashion. Funny how old things tend to make a comeback. What doesn't kill you makes you stronger! Bitcoin is continuing to sell-off. Many might be worried, but think it will make a comeback. Honestly, I'm quite happy about it. Cheaper 🌽  for me. Switching my unit of account to Bitcoin was definitely the right move. Lots of macro uncertainty, but as long as blocks keep being added every 10 minutes my outlook has not changed. Going to crush another run and enjoy the bear market. Might even read a book afterward XD.\n\n6/18/22\n\nConor Jay Chepenik",
  "wordCount": 514,
  "readingTime": 2.139622641509434,
  "claps": 0,
  "voters": 0
}