{
  "id": "4edab878f21b",
  "title": "Day 116",
  "createdAt": "2022-07-16 17:26:11",
  "tags": [
    "golf",
    "podcasts",
    "inns",
    "lottery",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-116-4edab878f21b",
  "content": "# Day 116\n\nCalled my homie Travis yesterday and he couldn't podcast because he was slammed with work. While I do miss podding with my friend it's amazing to see that he is grinding. Good for you Trav. Played a round of golf today at Unicorn which was nice. Booked a solo round and was paired with 3 really funny dudes. They gave me a shot of mcguilcuddys and made the round more enjoyable. My game is improving a lot. Still a long way to go till I break 100 but I can feel it coming. It's amazing how easy it is to develop relationships on the golf course. Something about sports is so incredible.\n\nLooking forward to some R&R with the girlfriend up in Vermont this weekend. Staying at another New England Inn which is always fun. Not that I have anything against hotels, but there is something charming about a mansion with a bunch of rooms in it. I will take Inns and Airbnbs over hotels anyday.\n\nBought a lottery ticket today. Always fun fantasizing about what to do if I win, but sometimes I wonder if all that money would just be corrupting. It would be hard not to just be a fat lazy shit if I won all that money. However, it would be cool to have millions to deploy into Bitcoin companies. Also to smash buy some 🌽  .\n\nBringing up _The Soverign Individual_ to read this weekend. I'm in between like 10 books right now which is just way too many. I'm fine alternating between 3–4 but any more than that and it's just ridiculous to try and keep up. I've also been enjoying some good tv shows lately. The Boys, Stranger Things, The Orville, and Ozark. TV is not great for my education but it is enjoyable.\n\nFinally, I need to get back on my podcast grind. Been preoccupied with life but I get such a kick out of talking with friends and others. Hopefully, at the coming Bitcoin meetups I can find some more people to have on as guests. I'm about to hit the road so I'll be back tomorrow anon.\n\n7/16/22\n\nConor Jay Chepenik",
  "wordCount": 363,
  "readingTime": 1.369811320754717,
  "claps": 33,
  "voters": 1
}