{
  "id": "4f6411bf1052",
  "title": "Day 822",
  "createdAt": "2024-06-22 03:30:05",
  "tags": [
    "2nd-amendment"
  ],
  "url": "https://chepenikconor.medium.com/day-822-4f6411bf1052",
  "content": "# Day 822\n\n![](https://miro.medium.com/1*hBZTwt9bd38s8609cY4aRw.png)\n\nThe above captures Government in a nutshell. The leaders in the United States need to read the second amendment. \"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\"\n\nI know God is smiling as he chuckles at the obese ATF agents who are enforcing gun control laws, while simultaneously ignoring the Second Amendment's intent. The irony is indeed palpable. Obese ATF agents, who struggle with self-discipline in their personal lives, enforce gun control laws while disregarding the Second Amendment's intent. It's a farce. These clowns can't even regulate their own waistlines, yet they presume to control and regulate the firearms of law-abiding citizens. Ignoring the very principles upon which this country was founded is not good. The Second Amendment is clear: the right to bear arms shall not be infringed.\n\nIt seems the ATF, and plenty of other organizations in the government, have forgotten this crucial aspect of our Constitution. So, to all those who value their freedom, I say: be prepared to defend yourself, because the government will not be there to protect you when you need it most.\n\nSeriously, if criminals followed gun laws I would be the first to say let's ban guns. However, criminals don't follow laws. It's why they are criminals. By denying law-abiding citizens their right to self-defense, we inadvertently empower the very individuals we seek to protect ourselves against. It is a foolish and shortsighted policy that jeopardizes the safety of all.\n\nLetting criminals be the only ones with guns is like putting a rapist in a room with beautiful women and saying we banned rape in here so don't do it and then locking the door with no one to protect them. It's a horrible metaphor but I believe it does prove my point. Law abiding citizens don't commit crimes with firearms. Throughout history, various leaders such as Adolf Hitler, Joseph Stalin, Mao Zedong, Robert Mugabe, Hugo Chávez, and other despots have implemented gun control measures or outright banned firearms as part of their efforts to consolidate power and suppress dissent. It's not a great list to be on and these examples illustrate the potential dangers of gun control.\n\nDid not mean to go off on a tangent about the government and guns but that meme was both hilarious and infuriating. On a lighter note I found a cool AI tool I want to try soon.\n\n> [**GitHub - turing-machines/mentals-ai: Build agents in markdown syntax (loops, memory and tools...**](https://github.com/turing-machines/mentals-ai)\n\nI also watched most of the lego batman movie tonight and it was great:\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/ConorChepenik/status/1804334163568324619&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGrateful that despite all the gun grabbers I live in the United States. God bless the freedom's enshrined in our constitution. I am beyond thankful I get to be a citizen of this country even if I despise most of the people in positions in power. Which in America's short ~250 year history is how it has been and how it will continue to be. Light will prevail because it always does with enough time. Keep the faith🤙🫡\n\n6/21/24\n\nConor Jay Chepenik",
  "wordCount": 540,
  "readingTime": 2.237735849056604,
  "claps": 0,
  "voters": 0
}