{
  "id": "4f878a9c07de",
  "title": "Day 581",
  "createdAt": "2023-10-25 02:19:23",
  "tags": [
    "life",
    "building",
    "automation",
    "ai",
    "improvement"
  ],
  "url": "https://chepenikconor.medium.com/day-581-4f878a9c07de",
  "content": "# Day 581\n\nI need to start automating my work calls so I can stop taking notes. Today I had a great call with my co-founder and we spent a lot of the meeting recording our notes. Which is a great habit to have but it also takes up a lot of time. So I did some research and found these two tools.\n\n> [**Krisp | Noise Cancelling App**](https://krisp.ai/)\n\n> [**Airgram | AI Assistant for Automated Meeting Notes & Summary**](https://www.airgram.io/)\n\nI have another call Thursday with my partner Q and I'll report back on what I think of Airgram & Krisp once I get a chance to actually use both tools. Clicking around on the websites it seems they both do exactly what I'm looking for. I also tried them by myself on a google meet and it seems promising but hard to get an idea of how useful something is saying mic check mic check lol.\n\nBack to improving [Valueware](https://www.valueware.ai/) One of the things we wrote down in our notes from today's meeting is this: **So what does Valueware do, exactly?**\n\n**We dig deep to understand what's truly driving your revenue. Then we streamline those critical processes and supercharge them with automation. In short, we help you sell more, serve better, and scale smarter.**\n\nSounds great on paper. Now I need to keep grinding so that becomes reality. One of the things we noted in the call is asking others to work with us before we start charging. The two people we had in mind, my Dad and Q's friend David. The reason? We want to make sure we can do this and iterate our process before we start charging people a good bit of money for our services.\n\nSo far I've built two websites for other Bitcoiners and now I feel embolden to charge more for my services. I also know that next time I build a website for someone I'll have a better idea of what I can automate and what I need from the customer. Trying things, even if you fail at first, is how you learn and get better.\n\nLife is a never ending process of iterating and improving your craft. At least if you want to be a succesful person ;)\n\n![](https://miro.medium.com/0*qMA1bl-l0oYGuvQv)\n\n10/24/23\n\nConor Jay Chepenik",
  "wordCount": 411,
  "readingTime": 1.7509433962264151,
  "claps": 4,
  "voters": 1
}