{
  "id": "4f91b6afca81",
  "title": "Day 442",
  "createdAt": "2023-06-07 16:21:40",
  "tags": [
    "politics"
  ],
  "url": "https://chepenikconor.medium.com/day-442-4f91b6afca81",
  "content": "# Day 442\n\n![](https://miro.medium.com/0*iH5-lAbLS1_gsFtw.jpg)\n\nAt the time of this writing this video has ~62.4 million views. It is damn good to see Tucker call out the deep state cabal who everyone in America should despise, unless of course you believe the MSM has your best interest at heart.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/TuckerCarlson/status/1666203439146172419%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe gloves have come off and if you can throw your politics to the side it's great to see Tucker shred apart the Uniparty. BuT hEs A ConSErvaTIve. Well he roasted Lindsey Graham in this video who is also a conservative. People get so blinded by politics they stop thinking critically and go along with whatever bullshit their own side is spewing. I mean seriously the democrats used to be the party of free speech and now they are the party of censorship. The republicans are full of problems as well. Neither side cares about the good, honest, hardworking citizens of America. Once you realize that no side is your friend the world becomes a lot better.\n\nIt's the money. We can't vote our way to a better democracy, but we can opt out of debt based money. Simple as that really. If you are buying \"risk-free\" treasuries you are funding a corrupt government keen to start world war 3. Well the neo-cons anyway, there are a handful of congressman and senators who seem to realize that another world war is in the interest of no one besides the Davos class.\n\nLooking forward to watching more videos that Tucker puts out. I hope more people stop tuning in to Fox & CNN and start watching independent journalist. As long as advertisers are paying money to the MSM so they can have some editorial control the American people are going to keep being fed lies. So simply stop watching and consume media that doesn't get your upset about partisan politics. It is not red vs blue. It is the uniparty vs you.\n\nCheers!\n\n6/7/23\n\nConor Jay Chepenik",
  "wordCount": 324,
  "readingTime": 1.4226415094339622,
  "claps": 0,
  "voters": 0
}