{
  "id": "4f9c0ba01f3",
  "title": "Day 110",
  "createdAt": "2022-07-10 14:48:12",
  "tags": [
    "bitcoin",
    "fiat",
    "newsletters",
    "writing",
    "the-profiles"
  ],
  "url": "https://chepenikconor.medium.com/day-110-4f9c0ba01f3",
  "content": "# Day 110\n\n![](https://miro.medium.com/0*GyhSSlmQZo0h0Df5)\n\nLike most aspiring writers I am subscribed to a very large number of newsletters and this morning Polina's _The Profile_ gave me a nice idea to write about. I've posted nearly the entire article because the ideas that sparked my interest to write are so relevant to Bitcoin.\n\n\"I recently read an article titled, \"[Why Facts Don't Change Our Minds](https://substack.com/redirect/af46f3d7-2b80-4c04-be95-56ed1ff71115?u=15308263).\"\n\nIn it, cognitive scientists Steven Sloman and Philip Fernbach propose an interesting thought experiment: Think about the toilet in your home, an item with which you are quite familiar.\n\nNow, you know what happens when you press the handle and the water goes down the drain, through the pipes and into the sewage system. But do you know how this _actually_ happens?\n\nIf you're anything like the Yale graduate students in this experiment, you probably don't know as much as you think you do. In the study, the students were asked to rate their understanding of devices they encounter every day - like toilets, zippers, and cylinder locks. Afterward, they were asked to write a detailed, step-by-step explanation of how those things _actually_ work. It turned out that all of these devices are way more complicated than you might imagine - and those are things you encounter every single day.\n\nSloman and Fernbach call this \"the illusion of explanatory depth,\" which refers to the belief that we know way more than we do.\n\nHere's an excerpt from [the article](https://www.newyorker.com/magazine/2017/02/27/why-facts-dont-change-our-minds?utm_source=pocket_mylist&utm_medium=email) that sent a shiver down my spine:\n\n> _\"_Where it gets us into trouble, according to Sloman and Fernbach, is in the political domain.\n\n> _\"_It's one thing for me to flush a toilet without knowing how it operates, and another for me to favor (or oppose) an immigration ban without knowing what I'm talking about.\n\n> _\"_Sloman and Fernbach cite a survey conducted in 2014, not long after Russia annexed the Ukrainian territory of Crimea. Respondents were asked how they thought the U.S. should react, and also whether they could identify Ukraine on a map. The farther off base they were about the geography, the more likely they were to favor military intervention. (Respondents were so unsure of Ukraine's location that the median guess was wrong by eighteen hundred miles, roughly the distance from Kiev to Madrid.)\".\n\nWe can all learn something from this study. Next time that you feel a strong opinion coming on, ask yourself: Can I write a detailed step-by-step explanation before sharing my thoughts with others? In other words, figure out how the toilet works first and only _then_ opine about it.\"\n\nNow take money, one of the simplest and yet most complex technologies humanity has. Something almost every human being has used at some point or another in their life to buy things. If you asked the average person to explain how money works, in the same way you might ask them what happens exactly when they flush a toilet, the answer probably wouldn't be correct. I'm proud to say I've changed the handle on my toilet, installed bidets, and read _The Fiat Standard_ and I still couldn't give a great explanation of how all this stuff works. I understand that the toilet fills with water in the back, when you flush it drains the water in the bowl down the pipes, and refills it with the water in the back of the toilet. At that point, the water in the back is refilled and the water in the bowl is fresh again. I understand in our fiat system the Central Bank can create money out of thin air by pressing a few numbers on their keyboard and updating an SQL database. They can use this money to do quantitative easing or tightening, usually the former, as they claim to not be concerned with \"the market\" but as we see with more and more intervention it's clear the Central Bank is the biggest reason why stocks went so high after the initial covid crash of 2020.\n\nWhile I like to think I have a decent understanding of both toilets and fiat money I know there are massive parts of my knowledge I'm missing. Many people who use money in the U.S.A likely use cash or their checking account. With cash you don't even have to think about how money works because the U.S dollar has been one of the better currencies inflation-wise, which isn't saying much because all Central Banks are in a race to debase their fiat money. I'm sure users of cash these past 2 years are getting annoyed with inflation which means they need more cash to buy the same goods. Hopefully, it causes them to look into how money works so they can understand that Central Banks are screwing them over. At least cash users can rest assured their transactions are private. Checking accounts let banks see all the transactions we make with our cards, which luckily in the U.S requires law enforcement to get a warrant to access, at least at this point in time. However, banks are leveraged 25x [according to my man Greg Foss](https://youtu.be/tmFzhc8omtI) and are able to do this because they are backed up by the F.D.I.C and ultimately the Federal Reserve. I bring all this up because think about how pivotal a tool money is to everyone in society for cooperation and think about how little most people know or understand about this tool.\n\nNow to Bitcoin. Money that I am still constantly trying to learn more about every day. I have a decent understanding of how it works at this point, but still have a lot more to understand. It's a double-edged sword because it's humanity's lack of understanding that allows plebs, like myself, to stack life-changing wealth for my family. It's also wild to think at this current price big players, like Central Banks, could snag a ton of it up for what would be like pennies to a Pleb. I'd hate to see Central Banks buy Bitcoin because I want to see them become irrelevant but whether or not they do acquire some 🌽  will ultimately have no impact on the Bitcoin network adding blocks every ~ten minutes. Really glad this piece from Polina dropped into my inbox this morning because it's a reminder most people wildly overestimate what they understand about any given topic and the ones shouting the loudest know the least. None of this is financial advice, always do your own research. From my own research, I believe Bitcoin will help make money a fair and just thing again. I guess my biggest concern is people will get lazy and not put in the time to understand how this new form of magic internet money works. Luckily, most that go down the rabbit hole seem very concerned with making sure the network is doing its thing and the rules are being enforced whereas the fiat network is just this big race to debase the currency and make the 1% of society even wealthier as assets are inflated and peoples purchasing power is decimated.\n\nMaybe I'm missing something but the louder \"experts\" scream about Bitcoin the more hopeful I become it will do a lot to bring in a just society with just rules instead of rulers. Bitcoin is building from the bottom up and I'm excited to see what the future looks like while being humble enough to admit there are plenty of things to come that I never saw coming.\n\n7/10/22\n\nConor Jay Chepenik",
  "wordCount": 1251,
  "readingTime": 4.920754716981132,
  "claps": 0,
  "voters": 0
}