{
  "id": "4fd5ca22a71d",
  "title": "Day 409",
  "createdAt": "2023-05-06 02:14:22",
  "tags": [
    "but-for"
  ],
  "url": "https://chepenikconor.medium.com/day-409-4fd5ca22a71d",
  "content": "# Day 409\n\nListened to a fantastic Tim Ferris podcast episode on my walk back home from coding bootcamp today. There is a lot of talk from politicians about how Bitcoin is used by criminals. They are correct and this episode proves it.\n\n> [**Podcast Notes Playlist: Latest Episodes - #499: Katie Haun on the Dark Web, Gangs, Investigating...**](https://fountain.fm/episode/1721155426)\n\nWhat they don't tell you is that those criminals are inside the government. Luckily these cimes were exposed because of Bitcoin's transparent ledger that anyone can access. Katie points out that if it were not \"but for the blockchain\" there would have been no way to catch the FBI agent who was extorting Ross, the creator of The Silk Road. I didn't finish this episode but I'm super excited to finish it soon. Fascinating hearing the perspective of someone who got to prosecute the person who was originally put in charge of bringing down the silk road, ended up playing both sides, and almost got away with it too! As Tim points out it sounds like something that should be in a screenplay.\n\nSoftware is so incredible. Got to keep using it for good. Blows my mind that the one thing which would've made that FBI agent stupid rich (had he been able to hodl) was the same thing that brought him down. Like I talked about yesterday Bitcoin is just a tool. Can be both used for good & bad. Same goes for guns, video games, this laptop I'm writing my mediums with, etc. Speaking of, I am excited about that article I wrote yesterday for Bitcoin Magazine. I had to make some tweaks but I think the tweaks improved my article a lot. Appreciate the editors over there for keeping me sharp.\n\nIn other news I've decided I'm going to contribute to the Stacker News open source project. Ahhhhh I'm open sourciiiing. Personally, I'm a big fan of how on Stacker News karma is denominated in sats. Appreciate Reddit's idea of Karma but the way they do it is no longer as cool as the V4V way😎 . Value 4 value will be so powerful over the coming years. I was looking through the pull requests today and since I've been coding an actual project during my coding bootcamp it's starting to make a lot more sense. Good to see :D\n\n> [**Sorry! It's just that you're going to have to pay or ask permission to use Bitcoin. - @jarolrod**](http://jarolrod.com/you-must-pay/)\n\nThis is an interesting article I found on Stacker News. I'm hopeful that open-source devs can figure out some of the challenges this article points out.\n\n> [**GitHub - stackernews/stacker.news: It's like Hacker News but we pay you Bitcoin.**](https://github.com/stackernews/stacker.news)\n\nHere is the Stacker News github for those curious. My eyes are sore at this point because I'm been staring at a computer screen so I'm going to wrap this up. I'll leave this post with a pod I plan to watch tomorrow.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FnA0OXZuaG0g%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DnA0OXZuaG0g&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FnA0OXZuaG0g%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nDEBATES LIKE THIS ARE THE WAY! Not cut up, censored, and skewed debates where candidates say nothing of substance and squabble over bullshit.\n\n![](https://miro.medium.com/1*WuBtdjCxtRD10RG6W3CiPg.jpeg)\n\n5/5/23\n\nConor Jay Chepenik",
  "wordCount": 567,
  "readingTime": 2.3396226415094343,
  "claps": 0,
  "voters": 0
}