{
  "id": "5004c7e82c4a",
  "title": "Day 123",
  "createdAt": "2022-07-24 00:52:26",
  "tags": [
    "decentralized-ledger",
    "fixing-the-world",
    "fuckthewef",
    "bitcoin",
    "conversation"
  ],
  "url": "https://chepenikconor.medium.com/day-123-5004c7e82c4a",
  "content": "# Day 123\n\nPlayed a nice round this morning in the heat. Walked a solid 7 miles and won 5 bucks so it was a fantastic day on the links. Unfortunately, I'm still orange pilling my boy Cody so I won 5 dollars of USD aka United Shitcoin Dollars, but one day I know the kid will be sending me sats. I got faith, I'm planting the seeds. Listened to a fantastic \"read\" from Svetski today on the way to my round. God I love how we can consume pods when we have downtime. If I'm driving, riding, or walking it's likely there is a pod playing in my ear. Podcasts have changed my life for the better and I'm sure they will continue to do so in the future.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fanchor.fm%2Fwakeuppod%2Fembed%2Fepisodes%2FRead-8--Bitcoin-is-the-Economic-Singularity--Bitcoin-Historic-Article-from-2011-e1lhpc1&display_name=Anchor+FM+Inc.&url=https%3A%2F%2Fanchor.fm%2Fwakeuppod%2Fepisodes%2FRead-8--Bitcoin-is-the-Economic-Singularity--Bitcoin-Historic-Article-from-2011-e1lhpc1&image=https%3A%2F%2Fd3t3ozftmdmh3i.cloudfront.net%2Fproduction%2Fpodcast_uploaded_episode400%2F2346114%2F2346114-1658453791075-cbf40627796ee.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=anchor\" title=\"\" height=\"102\" width=\"400\"></iframe>\n\nThis dude Ryan was so ahead of his time. While he didn't nail everything to a tee it's always fun to listen/read old pieces that predict the future with a fantastic degree of accuracy. Not sure if I found the right guy but I did find a Ryan on LinkedIn and shot him a message because the piece got me so excited for the future. I'm not going to play with leverage, but I must say this piece of writing makes me want to take out some fiat and leverage it to buy 🌽  .\n\nAfter I got back from the links, I went and got tacos with my girlfriend. On our return home, we had a really interesting conversation about masculinity and femininity. I joked that she was my birthing person. We laughed and she said it's ridiculous that people are saying the politically correct term is birthing person and it actually takes away from mothers and their divine femininity. I agreed and made the point that they've successfully shamed enough men and equated toxic masculinity with masculinity so the world is full of beta males. Toxic masculinity that is about disrespecting women and being an arrogant prick is obviously bad. However, that is completely different than the type of masculinity that involves sticking up for what you believe in, raising children to be critical thinkers/ truth seekers, and defending your family when someone tries to harm them. Now that they've shamed the men enough it seems they're coming for the women. Well, the convo went on for a while and my girl made the point that everything has a cost. I'm leaving out a lot of what was discussed, but this was such an excellent point. This point is why I'm so passionate about Bitcoin specifically. It makes it so everything in the world has an opportunity cost. The only thing in the world that doesn't seem to have an opportunity cost is the most powerful people/organizations printing money to fund their bullshit. Ultimately, it does have an opportunity cost and that is screwing over the much less privileged who face the opportunity cost via fighting in wars, inflation, and the other side effects that are a result of \"quantitative easing\". It was pretty hot hearing that from my girlfriend. I know she rolls her eyes the more I talk about Bitcoin, but it was so eloquently put. Everything has a cost and the fact we are living in a two-tier society where the wealthiest and most powerful can distort reality and not face a cost for printing money is resulting in everyone else paying the cost.\n\nBitcoin *not crypto* fixes this problem. Fix the money fix the world.\n\nThis [tweet](https://twitter.com/stillgray/status/1550881942408941568?s=20&t=yJMqkqqT6c6o1-LUu3Cwqw) from Ian Miles Cheong sums up pretty well what the convo I left out was just much better\n\n> It's interesting how farmers and truck drivers - blue collar workers - are leading popular uprisings around the world while the self-proclaimed \"socialists\" who talk about \"worker's rights\" while sipping their lattes are the ones attacking them.\n\n![](https://miro.medium.com/0*GkB3NhjGX7bCMcr4)\n\nTwitter as a company is on some bullshit, but the users...👨 ‍🍳  My god. If you can find the plebs on Bitcoin Twitter these people do not miss. I've got a lot of work to do on myself to be the person I know I can be. That said, I truly believe Jordan Peterson was spot on about most people wanting to tell others how to get their homes in order when their own house is a complete mess. The fact I realize I need to get my house in order is a solid first step. Bang bang baby let's get to work anon! WE GONNA FIX THE MONEY FUCKING WORLD WITH MEMES AND A DECENTRALIZED LEDGER LFG:D\n\n7/23",
  "wordCount": 757,
  "readingTime": 3.056603773584906,
  "claps": 0,
  "voters": 0
}