{
  "id": "505db0e58059",
  "title": "Day 10",
  "createdAt": "2022-04-01 16:25:15",
  "tags": [
    "bitcoin",
    "ethereum",
    "maxis",
    "vitalik-buterin",
    "april-fools-day"
  ],
  "url": "https://chepenikconor.medium.com/day-10-505db0e58059",
  "content": "# Day 10\n\nLets gooooooo. 10 days of writing and publishing something. Only 355 more to go after this. Writing is both hard and rewarding. I worry that when I read some of these pieces years from now I'll think to myself how could I be so naive? Luckily, being human means we have too much pride due to our ego and humbling yourself enough that you allow your opinions to change is good. The smartest people in the world aren't afraid to admit they changed their mind when new facts and perspectives are presented. Nothing worth doing is easy. I'm proud of myself for writing because I want to increase my mental clarity and harness my knowledge to do good in this world.\n\nSpeaking of good I am so impressed with Vitalik Buterin's latest piece \"[In Defense of Bitcoin Maximalism](https://vitalik.ca/general/2022/04/01/maximalist.html)\". For those who don't know Vitalik was the creator of Ethereum and also the founder of Bitcoin Magazine back in the day. One of the first quotes that stuck out to me was Vitalik discussing how crypto communities have to fight bad actors from within. The trope that stuck out to me was \"**Corporatists**, who try to use their resources to take over the development of blockchains, and often push for protocol changes that enable centralization.\" Looking at the \"Change the code not the climate\" people. Fork away if you are serious about changing the code, but stop acting like energy use is bad. The more people who gain access to energy the better. I'm all about innovating to create cheaper, better, and more reliable forms of energy. I am vehemently against trying to debate what justifies \"acceptable\" energy use vs \"unacceptable\" energy use. [Christmas lights use more electricity than Bitcoin at this point ](https://phys.org/news/2015-12-christmas-energy-entire-countries.html)and time. No one will get to be the abarter of what constitutes acceptable energy use. If we get to this point society will regress tremoundously. The free market will be the decider and what bitcoin offers to everyone is worth every kilowatt of energy used to secure the Bitcoin network.\n\nThe reason Vitalik's piece resonated with me is that even the founder of the second biggest crypto project in the world understands the importance of Nakamoto Consensus. Vitalik lays out so beautifully how once you get co-opted to do one thing it's only a matter of time before you get co-opted to do another. Ether likely has many use cases in the future, but this piece makes clear that being censorship-resistant money is not one of them. Bitcoin with its simply consensus parameter is the only project that has any chance of being money that can't be censored, coerced, or manipulated to benefit the few at the expense of the many. Vitalik shows different pictures of what the typical \"Eth lover\" vs \"Bitcoin Maxi\" looks like.\n\n![](https://miro.medium.com/1*4Hzf_4ZQjZRU2q8q8cQ6tA.jpeg)\n\nIf shit hits the fan I'm taking the bitcoin maxi.\n\n4/1/22\n\nConor Jay Chepenik\n\n![](https://miro.medium.com/1*JMuu_wWwYMt6zVu_aMUOLQ.jpeg)\n\nP.S In the short term I think eth will exceed bitcoin so I dumped all my bitcorn to buy eth. Luckily, I had some wrapped bitcoin and it was too expensive to move with gas fees so I just held a lil wrapped BTC in case I'm wrong. Once Eth 2.0 drops I might switch back to BTC then get back in when they lay out a road map for Eth 3.0",
  "wordCount": 560,
  "readingTime": 2.4965408805031446,
  "claps": 0,
  "voters": 0
}