{
  "id": "507e4ff1ee1f",
  "title": "Day 174",
  "createdAt": "2022-09-12 23:04:07",
  "tags": [
    "canada",
    "dreams",
    "boston",
    "relationships",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-174-507e4ff1ee1f",
  "content": "# Day 174\n\nSo get this. My girlfriend last night couldn't fall asleep. I on the other hand am pretty good at falling asleep so of course right before I'm about to snooze she goes \"can you talk to me I can't sleep\". Trying to be a good boyfriend I say \"Ok sure what do you want to talk about\". She goes \"You can pick the topic, just not Bitcoin\". Hahahahaha. I told her there was no point letting me pick the topic then. We ended up having a good convo anyways and somehow I managed to avoid bringing it back to Bitcoin. Laughing helps a lot in a relationship. Grateful to have a partner who cracks jokes with me and puts a smile on my face. I think I picked her pregnancy pillow as the topic of conversation. It is this super long pillow and I must say the thing is clutch! Lowkey want one for myself but that would be way too many pillows on the bed hahaha. I just love holding a pillow when I fall asleep. Not ashamed of it.\n\n![](https://miro.medium.com/1*Dszsh2KD8dGbztE7JlbenQ.jpeg)\n\nHad a dream last night that I spent some time with my dog Kobe. Hard to recall exactly what happened in the dream but I remember being near a pool and petting Kobe as he passed on. Woke up with some tears in my eyes. It was sad but it was also really nice to feel some closure. I'm grateful I got the chance to see Kobe one more time in my dreams. I know he is in a better place now and I'm grateful he visited me last night in my subconscious. There is so much we don't know as humans and it is easy to get distracted thinking we know it all when you look around a city and think about how far humanity has come. At least that is how I feel sometimes walking around historic Boston. I know modern/high time preference architecture has its issues, but overall humanity is so fortunate for what we have. Septic treatment, the internet, modern day transportation, refrigeration, and so many other things I take for granted all the the things that make my life so much better. Getting back into Alex Epstein's Fossil Future and he drives all these points home in his book. Anyways, I know that was a weird tangent but I bring it up because last night reminded me there is some super natural stuff in this world I will never fully grasp until I pass on and go to heaven. There is also stuff in the everyday realm that is extremely hard to understand and politicians and central bankers who act like they can control these things are kidding themselves. History seems to make pretty clear the best way to have resources allocated is in the free market because that way the bad actors (Or better yet those who don't provide value to the end customer) end up going out of business.\n\nThat's why I love Bitcoin. It makes it so those \"providing value\" receive the fairest form of money ever created. I'm humble enough to know that I could never centrally plan a complex thing like the global economy (or even the U.S economy for that matter). Sure there are plenty of people with way more experience who probably mean well. But then again if they really meant well it seems like getting out of the way is the best way to let the free market rule. Everyone is self interested though and if you get in these central planner positions it seems the ability to generate wealth is too much a temptation to avoid. Luckily, this same temptation (of profit) is what drives actors in the Bitcoin network. So overtime as more people seek to profit the network will grow. A beautiful thing really.\n\nFinally, work is going better. I feel like I'm getting better at my job. Took me some time and I got off to a slow start. Recently I've just been caring less and ironically it has helped me become a much better seller. A lesson in there indeed. Also it seems like the tides are turning on the public's opinion of how the last two years were handled. I'm sure there are still bad actors planning malicious stuff, but good to see people demand more from the institutions that seek to centrally plan the world. Happy to see Pierre in Canada win the Conservative party leader seat. Hoping to see him replace Justin soon. Not really sure how the Canadian democracy works but from what I've seen Pierre is a much better person than Justin. One understands money and the other asked his people if we should \"tolerate\" those who didn't get the \\/.\n\nListened to a podcast today and someone joked that in his 20s he was an idiot but at the time he thought his shit didn't stink. I laughed because I'm in my 20s and sometimes I feel like I got it all figured out. To be fair other times I feel like an idiot. At least I recognize that I still have so much to learn on my life journey. That's a good start.\n\n9/12/22\n\nConor Jay Chepenik",
  "wordCount": 875,
  "readingTime": 3.5018867924528303,
  "claps": 0,
  "voters": 0
}