{
  "id": "51412573d6a9",
  "title": "Day 54",
  "createdAt": "2022-05-15 16:08:17",
  "tags": [
    "sovereignty",
    "freedom",
    "liberty",
    "golf",
    "family"
  ],
  "url": "https://chepenikconor.medium.com/day-54-51412573d6a9",
  "content": "# Day 54\n\nWow what a morning! I got followed by Rep. Thomas Massie for tweeting this.\n\n![](https://miro.medium.com/1*mv9x3A6DqRVR8N08csqlEQ.jpeg)\n\nThis has got to be the coolest follower I have ever gained. It is funny to think about how excited I can get over a Twitter follow. Social media is powerful stuff even though I'm not exactly sure what goes on in the back end or how the algorithm on these platforms works. The front end of Twitter I understand and it is necessary to remind myself not to get carried away. I changed my account to my name and face because I want to be responsible for my tweets. It's a lot easier to shoot off criticisms and make smart-ass comments from an anonymous account. By putting my name and face I think I've done a good job being more responsible about the stuff I put on the internet. Nothing wrong with being anonymous online and many people have good reason to do so. I'm just trying to be as eve and keel as possible as 🤡 🌎  becomes more clownish by the day. Some of the takes I see are crazy. Hard to tell what people are actually Psy-Oped beyond repair and who is just a bot spotting out points that fit within \"the narrative\". My hope is that by showing my face and name people will take what I tweet at face value rather than try to claim I am a bot made to advance Putin's agenda. War is a dangerous thing and many are quick to call anyone who opposes \"the narrative\" a traitor. Wild to see Rand Paul get called out by public officials for asking for a general to oversee where the 40 billion for Ukraine goes. It's clear they want to send that money to pump Raytheon, Lockheed Martin, and other defense companies while lining the pockets of corrupt politicians. Dark times but it is so encouraging to see we do have some decent politicians in America who are standing up to the uniparty beast that wants a war to enrich themselves. We don't need a hot war with a nuclear adversary. We should be having peace talks with Russia to try and avoid war at all costs. Diplomacy and cool heads have never been more important. I don't know how this plays out in the end but for the sake of my soon-to-be-born child, and everyone else in the world for that matter, I pray it is peacefully.\n\nGot to play golf with my girlfriend's stepfather this weekend. It is a real pleasure being out on the links. I'm not that great at Golf but it is still such a fun sport. Being in nature and spending time with people you enjoy is incredible. Plus, one good shot, and you instantly feel addicted again despite 10 bad shoots beforehand. At least that has been my experience. After the round we went to dinner, my girl, her Mum, and my girl's step Dad. Ate at Dali, one of my favorite restaurants, and got some delicious Tapas. Life is good and I'm grateful to have many people who love me and are a pleasure to be around. I do worry about the uncertainty of the future, but it is also crucial to bask in the beauty of everyday life. I'm so fortunate to be in the position I am and family has been the biggest contributor of prosperity to my life. Spoke last night about moving up to New Hampshire and starting a farm. My girl's stepdad is quite handy and he wants to help us out. I'd cherish his help and would love to see him and his wife move to Portsmouth. Would be incredible to have a farm right between Mass and Maine in one of the coolest towns I've ever been to. Who knows where we end up once we have the child. I do hope it is New Hampshire 🤣. Incredible place every time I have gotten to visit. The motto Live Free or Die is one I resonate with very much. Scary to think our politicians want to sign over our s[overeignty to the World Health Organization.](https://www.israel365news.com/269274/on-may-22-biden-to-hand-over-american-sovereignty-to-who/) Grateful to live in a country that has in its constitution the right to bear arms. God bless our forefathers who knew this was crucial to keep tyrants in check.\n\nAs always. Good will win in the end. I'm just hoping to see it happen sooner rather than later. Don't want to see people suffer so corrupt politicians can line their pocket while acting like they are \"defending democracy\".\n\n5/15/22\n\nConor Jay Chepenik",
  "wordCount": 772,
  "readingTime": 3.1132075471698113,
  "claps": 0,
  "voters": 0
}