{
  "id": "52c67db45e07",
  "title": "Day 316",
  "createdAt": "2023-02-02 02:04:44",
  "tags": [
    "writing"
  ],
  "url": "https://chepenikconor.medium.com/day-316-52c67db45e07",
  "content": "# Day 316\n\nFeels good to have made it back to my hometown of Jax, Florida after a long day of driving. Listened to a bunch of podcasts on the way down including this one.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F4ho8NBQucRw6jkLP7F5Hlr%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F4ho8NBQucRw6jkLP7F5Hlr&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fbc0c2937aa9a590036a65e2e&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nOur modern day technology is quite amazing and one of the things I heard that resonated with me was a poem about writing. Lex read it at the end of this pod and the idea is only write when it comes out naturally. Like when it just spills out of you. If you have to ask others about its quality or if you are writing for clout or if you don't feel a true need to write it then simply don't write it.\n\nInteresting idea. I do think it's important to write when you have something to say rather than for clout. I also think writing is a skill that takes practice. Some people are much better with words than others but natural talent is nothing without practice.\n\nThus, I need to say more with less. There are billions of people out there and maybe a thousand with the skills to be a world renown writer. Rough estimates of course but that means much less than .0001 percent of people on this planet have what it takes to be the best in the world at writing. Good: I like a challenge.\n\nWriting is about putting your thoughts together well on paper, or in most cases nowadays online. It's important that we be ourselves and avoid self-censoring as much as possible. Our brains are wild and unique. We all have a million thoughts going through them and being able to pick out the important ones is what make a great writer. I'd estimate the important ones are like the world renown writers: an incredibly small percentage of all our thoughts. So picking them out consistently is quite a feat.\n\nAnyways, I'm going to keep practicing on here every day and with enough time I'm confident that my skills will improve. Just keep going.\n\n2/1/23\n\nConor Jay Chepenik",
  "wordCount": 341,
  "readingTime": 1.2867924528301886,
  "claps": 0,
  "voters": 0
}