{
  "id": "52e92b07a4f6",
  "title": "Day 1177",
  "createdAt": "2025-06-12 03:41:46",
  "tags": [
    "a",
    "great",
    "first",
    "draft",
    "lets-go"
  ],
  "url": "https://chepenikconor.medium.com/day-1177-52e92b07a4f6",
  "content": "# Day 1177\n\n## Bitcoin Hodling vs Spending: The Eternal Debate\n\n**\"The question isn't whether Bitcoin has a use, but whether you have the courage to use it.\"**\n\nBitcoiners have been split for years. Is this thing digital gold? Or is it peer-to-peer cash? The truth probably lives somewhere in the messy middle, tangled up in human nature, freedom, and our own rational self-interest.\n\n**1. Two Sides of the Same Coin: Store of Value vs Medium of Exchange**\n\nSatoshi called Bitcoin a \"Peer-to-Peer Electronic Cash System.\" But he also saw something deeper. He knew that as more people used it, the value of each coin would rise. That wasn't a bug, it was part of the feedback loop. He even predicted that, long-term, transaction fees would have to replace the block reward. That only works if people are actually using Bitcoin to transact.\n\nBut early on, the psychology shifted. HODLing took root fast. That famous 2013 forum post, \"I AM HODLING\" went from typo to gospel. The idea clicked: hold your sats, spend your fiat. Over time, it became doctrine.\n\nSome of the greatest Bitcoin evangilists out there like Michael Saylor and Saifedean Ammous leaned hard into this, pointing to Austrian economics and low time preference. The argument? Bitcoin has to become a store of value before it becomes money.\n\nOthers push back. They argue that money needs to move. Hal Finney warned that without circulation, miners won't get fees and the network can't sustain itself. If no one spends Bitcoin, it risks becoming a speculative dead end, not a living-breathing currency.\n\nHere in 2025, it's still both. For many, Bitcoin is savings and money at the same time. That balance is what makes it powerful.\n\n**2. Hodlers and Spenders: What the Data Says**\n\nMost people are still holding. River Financial's 2023 report found that 89% of Bitcoin users don't spend their coins at all. Chainalysis noted back in 2019 that only about 1 to 1.5% of Bitcoin's transaction volume came from merchants.\n\nBut things are changing.\n\n- **Lightning Network**: Since 2018, it's exploded from around 1,000 BTC in capacity to over 5,300 BTC by early 2025. River pegged that at 1,200% growth in just two years.\n\n- **Merchant adoption**: BitPay processed more than 600,000 crypto transactions in 2024. About 130,000 of those were in BTC. Other gateways like CoinGate and OpenNode saw similar growth.\n\n- **Regional momentum**: In places like Nigeria, Argentina, Lebanon, and El Salvador, Bitcoin isn't a luxury. It's how people send money, get paid, and buy essentials. When your local currency is crumbling, Bitcoin becomes real fast.\n\nIn the U.S. and other developed countries, it's different. People value convenience, and taxes on small Bitcoin spends don't help. Typically it takes a 10x improvement on something for people to change their habits. Thus, the idea of spending Bitcoin isn't dead, it's just growing where it's needed most.\n\n**3. Economics 101: Gresham, Opportunity Cost, and Network Effects**\n\nGresham's Law says people spend bad money and keep good money. That's what we're doing when we hoard BTC and pay our bills in dollars.\n\nBut in places with hyperinflation or tight capital controls, the reverse kicks in. Thiers' Law says good money can drive out bad. In those environments, Bitcoin becomes the preferred medium, not because people want it to, but because they have no choice.\n\nThen there's the opportunity cost. Everyone knows the story. In May 2010, Laszlo paid 10,000 BTC for two pizzas. Those coins were worth about $40 at the time. Today? Worth a whole lot more than 2 large pizzas. That's the pain behind every sat spent, the fear that it could be worth way more tomorrow.\n\nBut here's the thing we forget. If Laszlo hadn't spent those coins, if he hadn't proven that Bitcoin could actually buy something in the real world, there's a good chance none of this happens. No early traction. No proof of concept. No momentum. Spending is what gave Bitcoin life.\n\nMoney's real strength is in circulation. Look at Bitcoin Beach in El Zonte. People there started earning in sats, spending in sats, pricing in sats. It rewired how a lot of people in El Salvador think about value. It turned Bitcoin from a static investment into a living economy.\n\nThe more people hold, the more likely merchants are to accept it. The more merchants accept it, the easier it is to spend. It's a feedback loop. But someone has to start the loop. That takes use. That takes guts.\n\n**4. Privacy and Security: Spending Ain't Free**\n\nThere's a cost to spending Bitcoin, especially if you value privacy and sovereignty.\n\nSpending on-chain can link your UTXOs and expose your stack. That's why tools like Sparrow and Wasabi exist. Coin control, CoinJoin, and smart change management matter.\n\nLightning is more private by default. Payments are routed through channels, and the transactions aren't recorded on the public ledger. Still, channel opens can leak info, and hot wallets are always exposed to some risk.\n\nThe safest place is cold storage. But if you ever want to spend, you need to think ahead. Use new addresses. Separate your wallets. Mix your coins. And make sure you're using hardware for your private keys.\n\nBitcoin gives you power. But that power demands responsibility.\n\n**5. Tools of the Trade: Spend and Hodl Like a Pro**\n\nIf you want to hold and spend without losing your mind, here's how smart Bitcoiners do it:\n\n- **Muun**: A seamless wallet that handles both on-chain and Lightning, with automatic swaps behind the scenes.\n\n- **Phoenix**: A full Lightning node in your pocket. Trust ACINQ to open a channel, then you're in control.\n\n- **Alby**: Browser extension that makes tipping and paying online as easy as clicking a button.\n\n- **Wallet of Satoshi**: Super easy, but fully custodial. Great for beginners, but you don't hold the keys. Also returning to the US soon with a self-custodial version.\n\n- **Bitrefill, Fold**: Spend BTC through gift cards or prepaid cards. No need for the merchant to accept Bitcoin.\n\nMost serious users split their stack:\n\n- Cold storage for long-term savings.\n\n- A hot wallet for spending and testing things.\n\n- A Lightning wallet for fast payments.\n\nAnd when you spend, replenish. That's the \"spend and replace\" strategy. Use it, then refill it, so you keep your exposure intact.\n\n![[https://x.com/ConorChepenik/status/1932953665008222403](https://x.com/ConorChepenik/status/1932953665008222403)](https://miro.medium.com/1*xHiqtTvHCix85G-j9CjiFg.png)\n\n**6. Culture Clash: Philosophies of Use**\n\nThere are three tribes in the Bitcoin world:\n\n- **Pure Hodlers**: Never spend. Stack and hold forever.\n\n- **Pragmatic Hodlers**: Hold most, spend some, refill after.\n\n- **Spenders and Activists**: Use Bitcoin every day. See spending as a revolutionary act.\n\nBitcoin culture reflects all of these. We celebrate **Proof of Keys Day** to promote self-custody. We laugh about **Pizza Day** to remind ourselves how expensive regret can be. But we also build **circular economies** and support #PayWithBitcoin campaigns.\n\nThe debate isn't about whether Bitcoin is good. It's about how best to _use_ that good. Is value preserved by hoarding, or expressed through exchange? Both sides care. They just express that care differently.\n\n**7. The Road Ahead: Technology, Tools, and Tipping Points**\n\nThe future is already unfolding:\n\n- **Taproot** unlocks better multisig and privacy.\n\n- **BOLT12** and **channel splicing** make Lightning simpler and more powerful.\n\n- **Sidechains** like Fedimint and Liquid could offer fiat-like features on Bitcoin rails.\n\n- **Stablecoins on Lightning** are starting to close the pricing gap.\n\n- **Privacy upgrades** like Cross-Input Signature Aggregation are on the horizon, Payjoin is finding its way into more wallets, and chaumian e-cash mints are evolving fast and bringing serious privacy to everyday sats.\n\n- **Tax reform** is coming too as more politicians become orange pilled. It's very possible more countries start exempting small transactions which would unlock more casual spending.\n\nIn a few years, spending Bitcoin might feel as natural as swiping a debit card. Layer 1 for savings. Layer 2 for payments. All in one wallet, with no friction.\n\n**8. What Should You Do?**\n\nHere's the playbook for the rational Bitcoiner:\n\n- Decide your goal. Are you saving? Spending? Both?\n\n- Divide your stack. Keep cold storage for your core savings, and a smaller hot wallet for everyday use.\n\n- Try Phoenix or Muun with small amounts on your mobile device or Alby if you like zapping people on Nostr or Stacker News. Learning the tools is the best way to see how powerful Bitcoin is.\n\n- Support Bitcoin businesses. Tip creators. Use Lightning.\n\n- Stay on top of taxes. In the U.S., services like Strike let you use dollars in your account to pay Lightning invoices, sidestepping taxable events.\n\n- Earn in BTC if you can. It normalizes spending and offers a great way to get KYC-free sats into your Bitcoin wallet.\n\n- Lock down your setup. Use biometrics, 2FA, back up your channels, and keep your keys offline.\n\n- Stay private. New addresses. CoinJoins. Lightning. All of it matters.\n\n- Most of all, aim for balance. Hodl with conviction. Spend with intention.\n\n**9. Why This Debate Will Never Die**\n\nEven if the world runs on Bitcoin one day, the debate won't disappear. It'll just get quieter.\n\nBecause once Bitcoin _is_ money, we won't argue about spending vs saving. We'll just do both, like we do with dollars. Some gets saved. Some gets spent. That's life.\n\nBut the difference is, under a Bitcoin standard, saving and investing become two _separate_ things again.\n\nSaving means putting your energy into money, a call option on the future. Investing means taking a risk, betting that a business delivers value to the market. Fiat blurs the line. It forces savers to become gamblers. Bitcoin separates the two.\n\nUnder fiat, holding dollars guarantees one thing: you lose purchasing power. With Bitcoin, saving _works_ again.\n\nRight now, we're still early. And we get to shape what Bitcoin becomes.\n\nYou can guard your treasure like a dragon, hoarding every sat. Or you can be the blacksmith, shaping the economy with every coin you spend, knowing you'll stack more tomorrow.\n\nBitcoin won't make that choice for you and that's what makes it so powerful. It's permissionless. It doesn't need your ID. It doesn't care what country you're in. But it reflects what you do.\n\nEvery act of saving or spending helps decide what Bitcoin becomes.\n\n![](https://miro.medium.com/1*i1-V0wm4iqAneHt48N48YQ.png)\n\n6/11/25\n\nConor Jay Chepenik",
  "wordCount": 1695,
  "readingTime": 6.7795597484276735,
  "claps": 0,
  "voters": 0
}