{
  "id": "54160fe1136",
  "title": "Starved For Information",
  "createdAt": "2023-02-23 05:43:10",
  "tags": [
    "joe-rogan",
    "russia",
    "ukraine",
    "biden",
    "putin"
  ],
  "url": "https://chepenikconor.medium.com/starved-for-information-54160fe1136",
  "content": "# Starved For Information\n\nIt's hard not to stay married to your thoughts. Cognitive fluidity is a good thing.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F7MDxyrrhD7gC7XMRwB0ulv%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F7MDxyrrhD7gC7XMRwB0ulv&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f5532cbc5674a0e4c4603264f&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nIt can also be a bad thing. Depends on the situation. If we are talking about war in Ukraine it is probably worth considering as many perspectives as possible. Hard not to appreciate Eric calling out why the U.S.A should tread lightly when poking a bear. We the people need to consider multiple perspectives before forming our own opinions.\n\nSun Tzu said:\n\n1. \"All warfare is based on deception.\"\n\n&\n\n2. \"The greatest victory is that which requires no battle.\"\n\nI tend to agree. If you can avoid a fight then you should. Free and open speech enables individuals to express their opinions and ideas without fear of censorship or repression. It says a lot about our culture that Eric had to apologize before speaking perfectly sane words about the situation in Ukraine.\n\nFree speech comes with responsibilities. Let us engage in respectful and civil discourse, even when we disagree with others. By doing so, we can foster a culture of constructive dialogue and a healthy exchange of ideas. [Finding signal in a noisy world](https://medium.com/@JeffBooth/finding-signal-in-a-noisy-world-57497df06a35) is hard. We must do the hard work if we want to become a more informed and engaged society.\n\n![](https://miro.medium.com/1*2YDeIzcfNBAwspXWlkU_Lg.jpeg)\n\nThere is a lot of reasons both sides are upset. Enough people have sacrificed their lives for this war. We the people have to keep urging our world leaders to work towards resolving conflicts and promoting peace.\n\nThe information age is upon us and many are starved for good information. Open and honest conversations have become a commodity during a time when people don't know who to trust online. Trust your gut and read a lot.\n\nThere are an ever increasing amount of places to find out information. The mainstream media could have an agenda based on who funds them. Same with independent journalists. Be weary of who you trust and ready to change your mind when new facts present themself.\n\nJoe Rogan is the man for having a 4 hour open conversation. Weinstein was a great guest. If you are to outsourcing your ability to evaluate what sources of information you consume then you are going to have a bad time.\n\nImagine if all the world leaders got together and did a 4-hour podcast. Biden and Putin just smoking cigars, drinking coffee, and better understanding each others cultures. I'm not holding my breath but it would dope. No doubt one of the most viewed youtube videos of all time.\n\nThe language barrier would cause some issues but technology fixes that for the most part. Here's to the United States and Russia deescalating and committing to winding down the war by peaceful means and diplomatic channels. Lot of things to sort through but the nuance can be handled with coolers heads. Revenge can become a self-perpetuating cycle, where each act of retaliation leads to further acts of revenge, making it difficult to break the cycle and find a peaceful resolution. What happens when the two things seeking revenge have nuclear weapons tho?\n\n![](https://miro.medium.com/1*VyAQclVNVKHZJDeW5pGVBw.jpeg)\n\nMushrooms or nuclear weapons. Those who choose the latter might be pessimists. If more world leaders took mushrooms and thought about the power they wielded instead of the assets they had to lose they would quickly realize trading with other nations is more advantageous than decimating the planet. At that point there will be nothing left of value.\n\nWe all have the power to make a positive impact, no matter how small or big. Our actions can inspire others to do the same. If you got value out of this piece I'd urge you to go down the Bitcoin rabbit hole #forthekids\n\nIf money is the root of all evil, fixing it might not solve everything but it could definitely help. It is not too late to demand an end to war.",
  "wordCount": 647,
  "readingTime": 2.8248427672955976,
  "claps": 0,
  "voters": 0
}