{
  "id": "5432a6c53254",
  "title": "Day 132",
  "createdAt": "2022-08-01 21:45:06",
  "tags": [
    "shitcoins",
    "bitcoin",
    "zombie-companies",
    "fiat",
    "best-business-show"
  ],
  "url": "https://chepenikconor.medium.com/day-132-5432a6c53254",
  "content": "# Day 132\n\nPomp is ending [The Best Business Show](https://youtu.be/zEnCuURfY14). Sad to see him end one of my favorite ways to consume the news, but mad respect to Anthony for putting out solid content for a year. Pomp was a big part of me becoming fully orange pilled after I heard him on the Lex Fridman podcast. He got a lot of flack on Bitcoin Twitter for talking with shitcoiners, but overall I'd argue he added a lot to Bitcoin and helped orange pill many people. It was saddening to hear Pomp talk about how broken the incentives of media are. I have even more respect for him now after he said screw this I'm not continuing to play this corrupt game. Takes a lot to do something like that when I'm sure Pomp could've easily kept stroking checks playing the internet click game. He also did the show for a year. I'm sure he learned a lot during that time and I'm glad he will continue putting out long form content via his podcast. I think something similar will happen with me after I finish writing for 365 days straight. There are days I do not want to write, but overall it's been very productive putting my thoughts on Medium. After 365 days I don't plan to stop writing I just think I'll focus on different mediums (haha pun intended). I got an absolute kick out of writing that Bitcoin Magazine article and think focusing on more long form stuff could be cool.\n\nMaybe I'll continue to write, but on actual paper. That way I can get more personal with my thoughts. Not that I don't let loose on this Medium, but if you know that no one will ever read it besides people who have access to your journal it is a different kind of writing. Maybe I'll get to day 365 and decide to keep going. Who knows. Writing on this Medium doesn't have any corrupt incentives, yet ;). I understand where Pomp is coming from when he saws that trying to get clicks to make money from advertising is a very perverse system. I'm glad I don't have to deal with that on my personal blog.\n\nI'm excited about starting my personal website. I'm going to download Atom again and start over on the Udemy class I was taking. Starting a personal brand is exciting because you can monetize down the line and learn a ton along the way. One thing I'd like to focus on is doing it the right way. I don't want to deal with corrupt systems. I'm sure this will be easier said than written as the shitcoin sirens come ringing when you get an audience. Jimmy Song had a brilliant piece about this today in Bitcoin Magazine that can be found [here](https://bitcoinmagazine.com/culture/bitcoin-songsheet-fiat-politics). Rent seeking jobs as he calls them. I want to provide legitimate value, not rent seek from those who haven't yet put in the work to understand why Bitcoin is what is important right now. I don't have anything against the idea of NFTs (or digital receipts if you will). It just seems that we so desperately need to fix the money before we do focus on other stuff. Everyone has their own path though and providing value on my own site will hopefully help many avoid the sirens of the shitcoins that I went down myself in the beginning of this journey. I also have to do a ton more technical work, but it seems like most of the stuff built in web 3 can be built with lightning. Eliminating the tokens (unregistered securities) will likely help the builders focus on putting out a solid product rather than getting listed on Coinbase. Mr. Song really crushed it with his _Fiat Politics Suck_ piece and the more I read from him the clearer a lot of these incentives become.\n\nWhile Jimmy's article gave me tons of insight about the B.S and zombie (people & companies) that get created out of politics my favorite part was this....\n\n> TWELVE NEW ALTCOINS COMING SOON:\n\n> WomanCoin - Coins for women only, with the board of governors that decide what a woman is, not you because you're not a biologist.\n\n> Diffirand - Founded by an academic that got tired of scamming a few undergrads and decided to scam the entire public instead.\n\n> BitcoinNakamoto - A fork of Bitcoin for those that believe a16z should own Satoshi's coins.\n\n> BytePecunia - Privacy-focused coin that guarantees nothing, like say, supply, future governance or even privacy.\n\n> Methamphetamine - A coin that keeps promising to change everything based on the fanciful ideas of its teenage founder, but fails to deliver because said teenage founder can't code nor has any interest in doing so because of the premine.\n\n> Trinium - Founded by some Asian guy to market to a billion Asians, but nobody in the West cares because it's only Asians that are getting hurt.\n\n> Catastrophe - Get 18% yield until the price doesn't go up anymore at which point it's a -100% yield, unless you're one of the people at the top in which case you get a 20,000% yield.\n\n> Cripple - A coin with a blockchain/database run on a piece of paper with pencil, to be better for the environment.\n\n> Daschund - It's got a cute logo and does nothing, but the hope is that a billionaire will someday jerk around the public with it.\n\n> Salami - A token in a SQL database run by ex-Wall Street investment bankers to screw over the public even more.\n\n> Sucker - Recruit 10 people to get rewarded with staking coins which can be redeemed in three years when the founder will be in prison!\n\n> SeedOilSwap - A governance token for a platform that allows exchange of synthetic asset swaps that are enforced algorithmically through the drool coming out of your ape NFT.\n\nJimmy Song is hilarious. This is how we should treat those who wish to do others harm. With mockery and a smile. If you understand most of these jokes then your are likely my people. Stay smiling anon. Sometimes (like today) I wake up feeling like fuck this life shit. So I hit a run, I do some writing, and listen to a Bitcoin podcast. If that doesn't fix my day then I eat a steak. Do stuff you want to do and your day will feel better. At least it does for me!\n\n8/1/22\n\nConor Jay Chepenik",
  "wordCount": 1080,
  "readingTime": 4.0754716981132075,
  "claps": 0,
  "voters": 0
}