{
  "id": "5585d2fda1c",
  "title": "Day 53",
  "createdAt": "2022-05-14 21:26:32",
  "tags": [
    "humility",
    "bitcoin",
    "tether",
    "adapting",
    "memes"
  ],
  "url": "https://chepenikconor.medium.com/day-53-5585d2fda1c",
  "content": "# Day 53\n\nIt's amazing how well the human body can adapt to our environment and habits. It takes time but if you set your mind to something your body can do it with enough training. It's also an important reminder to listen to what your body is telling you. For example, if you are a raging alcoholic quitting cold turkey is dangerous because your body has adjusted itself to consume tons of alcohol. Important that you wean off slowly so your body doesn't get shocked and shut down from the complete withdrawal of alcohol.\n\nIt's funny to start thinking of stuff as systems but that is essentially what everything is. Preston Pysh read a quote from Gigi's writing when he had him on The Investors Podcast. It was a passage about how both Bitcoin and humans use energy to power our systems that are constantly facing entropy. With Bitcoin you get a time chain that can't be broken unless you do the reverse work (which becomes more and more difficult the longer the system lasts) while with humans we get to avoid death and go about our day. Incredible how we take energy and convert it to something meaningful. Both systems can convert all types of energy in order to operate. Really incredible when you think about it. Doesn't matter what kind of food you eat or energy you use. The systems will do the work to convert this energy into something meaningful. That said these system work better when you eat good food and consume reliable energy in the form of hydro, nuclear, etc. Otherwise you will get fat as a human or have people spew B.S about how Bitcoin is bad for the environment. Truth is that even if you're eating fast food or rolling coal it will still get converted to energy by our systems. It is just less efficient.Meme dump:\n\n![](https://miro.medium.com/1*kMib0whoyT5KwrG62jJl3w.jpeg)\n\n![](https://miro.medium.com/1*RRxMVm8nfPDmVEyxY3PP2w.jpeg)\n\n![](https://miro.medium.com/1*NrdYTXdCnHNZBE4BRUDPoA.jpeg)\n\n![](https://miro.medium.com/1*RlFJKjpT6TPgKY9arBM_hg.jpeg)\n\n![](https://miro.medium.com/1*5Ca5NG9rjU4fdK8UrpskUA.jpeg)\n\nI thought the idea of this \"BitcoinDollar\" is fascinating. I'm sure the Fed is looking for someone to buy their treasuries and it would be incredibly ironic if Tether became the next entity to do so. Can't imagine nation-states will be lining up to purchase U.S bonds after we sactioned Russia and showed the rest of the world we are not afraid to take your assets if you do something we disapprove of. This is all hear say and there is no guarantee Tether ends up being the major buyer of U.S treasuries, but I do think demand for treasuries will dry up and the result might force the Fed's hand. No clue what the legal implications are but I would not mind seeing Jerome and Janet go to Tether with \"their tail between their legs\" to ask Tether executives to buy U.S treasuries. In exchange the Fed will open a line of credit to them. Again, all of this is merely a thought experiment at this point. I would cherish a smooth landing to the end of the Fiat system where the U.S is forced to get on a hard money standard via Bitcoin and can't print away to satisfy their spending needs.\n\nLot of possibilities for how hyperbitcoinization plays out and as a U.S citizen I am hoping for the one where the U.S remains dominant by embracing the hardest, and most censorship resistant money on this planet. We have enough resources to feed everyone on the planet, but if we get another war things will get ugly and their will be tons of pain and suffering. Fiat can only end in war because after a war debt can be reconfigured. The winners get the privilege of resetting their debt. 30 trillion is a big amount of cash and I don't how the math plays out where we pay back the debt we owe. I'm not an economist or mathematician so take what I saw with a grain of salt, but 30 trillion is a biggggggg amont.\n\nAnyways, I agree with Adam Simecka. Being a human is a struggle and to think you are better than someone else is a bad mindset. Humility is important and keeping an open mind can open opportunities you would not receive otherwise. I need to keep this in mind as the years go by and Bitcoin seems more and more inevitable. :)\n\n5/14/22\n\nConor Jay Chepenik",
  "wordCount": 719,
  "readingTime": 3.546540880503145,
  "claps": 0,
  "voters": 0
}