{
  "id": "55cff039e3ef",
  "title": "Day 358",
  "createdAt": "2023-03-16 03:21:08",
  "tags": [
    "pee",
    "army",
    "monkey",
    "hell-hath",
    "no-fury"
  ],
  "url": "https://chepenikconor.medium.com/day-358-55cff039e3ef",
  "content": "# Day 358\n\nToday I got to venture into Hoboken New Jersey. Ended up visiting with an old friend I played football with at Tufts. The trip was just to hang with my girlfriend's sister but it worked out that I got to see my friend as well. He met my daughter Sloan and I got to meet his girlfriend. Always amazing when life just hooks it up timing wise. Nothing better than spontaneous events working out perfectly.\n\nIt was nice because his younger brother was also in town so we all enjoyed some beers at a local bar. The brother actually spent a bunch of time in Kenya recently because he is in the U.S army. His stories are absolutely hilarious. He mentioned that there are a bunch of baboons in the area. Often times they are thrown water bottles and food. However, this brother pees in bottles out there because the bathroom situation is not ideal to put it mildly. So he has all these extra piss bottles and because most of the day is sitting around doing nothing the brother will throw these piss bottles at the baboon. Well of course the baboon bites into it expecting water. The face he made to show what the baboon did when it realizes the bottle is filled with piss not water cracked me up. So good I had to recreate it with an art generator.\n\n![](https://miro.medium.com/0*busYAWIJW2oD47xw)\n\nHad to prompt the AI art generator with yellow liquid because piss and pee was not allowed. LAME!!!! AI generators need to grow up. People should be able to prompt whatever they want. Then again, I can see why they might not want pornographic content because of deep fakes and minors. Pee though... I don't know. No easy solutions to the crap people will come up with. Of course there are workarounds like the one I just described above. Software developers can only try and filter out so much before people figure out loopholes. Kind of like when people used danGPT to go around the filters chatGPT has in place. If you haven't read up on that thread you should. The account is private so I can't link it but here is a screenshot from the first part.\n\n![](https://miro.medium.com/1*yzcfnlWQJXRtuc1eBCkMaQ.png)\n\nWorth following and figuring out how to find the rest. Humanity will win because people are intuitive and there are more good people than sickos. My buddy and his brother died at the AI art generated picture. So many people don't know how much AI is going to change our lives. I heard a great quote the other day that was something like \"AI won't replace humans, humans using AI will replace humans not using AI\". I believe it. Adapt or get left behind. Yes there are plenty of problems these tools could create. In the exact same way our phones have created tons of new problems. Think of all the surveillance that now goes on. Sad. Also amazing I can click a few buttons and hail a Uber or Lyft rather than drive drunk. Focus on the positive or you will drown from all the negative.\n\nGot to weigh the good with the bad. The former will win out. Hopefully we can do so without having to test the below points from Lysander Boomer. Will see though plenty of psychopaths who want to fuck around and find out.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/LysanderBoomer/status/1636204257639649280%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n3/15/23\n\nConor Jay Chepenik",
  "wordCount": 566,
  "readingTime": 2.519182389937107,
  "claps": 0,
  "voters": 0
}