{
  "id": "55f845b14b37",
  "title": "Day 281",
  "createdAt": "2022-12-28 18:35:47",
  "tags": [
    "half-marathon",
    "running-bitcoin",
    "bitcoin",
    "reading",
    "religion"
  ],
  "url": "https://chepenikconor.medium.com/day-281-55f845b14b37",
  "content": "# Day 281\n\n> [**2023 Running Bitcoin Challenge: Conor Chepenik - The ALS Association**](https://secure2.convio.net/alsa/site/TR?px=8973169&fr_id=15435&pg=personal)\n\nI've decided to participate in a half-marathon. The longest I've ever run was 6.78 miles (1 hour) non-stop so this should be fun. 2x my personal record. When I saw Fran, Hal Finney's wife, announce this I knew immediately I had to complete it. Great way to kick off 2023 on a strong note. Here is the Twitter post I'm alluding to about runningBTC21k\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/runningbtc21k/status/1607828710975229954&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMade some fusion type pad-thai today that turned out pretty decent. Used the crookpot and filled it with miso soup broth, green onions, ginger, garlic, onions, pad thai noodles and tofu. I'm not the biggest tofu guy usually but occasionally it is nice to mix it up. Cooked the stew without noodles and pad thai for 2 hours then added the final two ingredients for an additional 30 minutes on and 30 minutes with the crock pot off so it cooled. I'm happy with the result.\n\nGot a Bitcoin meetup in Londonderry,NH which I'm pumped to attend. First time going up to the live free or die state for a meetup so that should be fun. Always nice meeting Bitcoiners in the wild. Looking forward to meeting some new people. Thought this chart from Fountain was pretty interesting. Might have to lesson to some of these podcasts on my way up.\n\n> [**Hot on Fountain - Listen on Fountain**](https://fountain.fm/charts)\n\nI've talked a lot about the value for value model and I do think it's empowering to the individual. No more middlemen taking unnecessary cuts. You can give your fans direct access by letting them send you a boost as well as get paid via this platform. It makes for a closer relationship between podcaster and fan plus it incentives the creator to keep creating. No more headache of trying to deal with an agent who promises to put you on with their marketing material so they can take a massive cut of your profits.\n\nNo model is perfect and there are good agents out there. I just think for most situations the creator would be better off on a platform like Fountain. My sister texted me that her boyfriend listened to my Podcast and enjoyed it. I need to do another one soon. I love speaking with Bitcoiners and spreading the good word. It is the little texts like that which remind me I can make a difference. Even if it is just one person I convince that could have a huge impact on the world. Think about @Eric_BIGfund on Twitter who orange pilled Saylor. You never know the impact your actions could have so act accordingly! It could turn out to be fantastic.\n\nFinally, I am getting more into the Bible and I must say it's a really enjoyable read. Full of good lessons and tidbits about how to live life. I'm almost done with the first part Genesis and my biggest takeaway is keep the faith and work hard even when you are in a bad situation. You can overcome adversity if you have faith in yourself. I see why this book held up so well over the years. It is funny to see how modern times have progressed. They reference people having slaves often in The Bible and obviously having slaves is bad. I just think the form of slavery has changed so most people don't even realize the debt slavery in the world we have today. If there are people who can print money out of thin air that everyone else has to work for we are in essence slaves to those people. They can print our money and buy our time with it. Bitcoin fixes this and while I'm not sure it is the second coming of Christ there are some eerily similar lessons to be learned from both things. The biggest reason I started reading The Bible is because I believed in the ethos of don't trust; verify. It was this ethos that made me want to see what The Bible was about without an interpreter. I was eager to learn for myself and it has been the right move so far😃  Might even start reading other religious texts after I complete this 4000+ page book so I can appreciate various perspectives. I've yet to decide what religion is \"correct\". I believe there is a God and that God loves everyone and hopes we can achieve redemption. To do so it just comes down to having faith, realizing you are flawed sinner, and having the humility to both try and be a good person while realizing you will constantly fall. Life is hard but that is what makes it special!\n\n12/28/22\n\nConor Jay Chepenik",
  "wordCount": 809,
  "readingTime": 3.0528301886792453,
  "claps": 0,
  "voters": 0
}