{
  "id": "561b3ffe62c4",
  "title": "Day 290",
  "createdAt": "2023-01-06 23:51:05",
  "tags": [
    "bitcoin",
    "language",
    "taxes",
    "government",
    "improvement"
  ],
  "url": "https://chepenikconor.medium.com/day-290-561b3ffe62c4",
  "content": "# Day 290\n\n**A Language Without Gatekeepers**\n\nLanguage is the foundation of human culture and society. It is the most powerful tool we have for communicating ideas and expressing our desires. Words are constantly changing and being updated as technology advances, which is a net positive. The printing press allowed the common man to increase their education tenfold. It also led to revolutions as more people became educated and questioned the legitimacy of their rulers. As society continues to improve, it is important to be cautious of words losing their meaning; no one will benefit from the mass destruction of our modern day world. In our current attention economy, it is easy to exaggerate words. For example, if everyone is a fascist, the word \"fascist\" very quickly loses its meaning as a legitimate way to point out authoritarian dictators who believe they have the right to arbitrarily make any demand of their citizens. There are undoubtedly malicious actors who aim to make sure that the majority of the world can not agree on basic words. The ability to use language to share ideas and articulate desires has enabled individuals to stand up for their rights and make their voices heard. Our words build on each other and have led to the creation of important documents such as the Magna Carta, the U.S. Constitution, and Satoshi Nakamoto's white paper. All of these documents are examples of words being used to help preserve the rights and freedoms of the individual.\n\nThere are also many cases of words being used to manipulate and control people. Censorship is a complex and ongoing issue that sits between the rights of the individual and the needs of the state. In recent years, there has been a push to censor certain topics, which goes against the principles of free speech and expression enshrined in the First Amendment of the U.S. Constitution. The success of the U.S. Constitution can be attributed to its design of decentralizing power. By implementing checks and balances to prevent any one individual or branch of government from accumulating too much power, the system has served as a model for other countries while contributing to the stability and prosperity of the United States. With the advent of modern technology, there are concerns that the current regime may be seeking to centralize power within the U.S. government. This could potentially undermine the principles of our Constitution and the checks and balances that have been instrumental in maintaining the integrity of the republic. Preserving the rights and freedoms of the individual is vital for our democracy to function properly. We must remain vigilant if we want to ensure that the decentralization of power is preserved and upheld.\n\nWhile not perfect, the United States has done an incredible job since its birth in 1776 of creating fair rules for people to participate in a free market. Our capitalistic society, with mostly free market dynamics, has offered entrepreneurs an opportunity to build a life of wealth by providing value. The \"American Dream\" if you will. Over time this free market dynamic has turned into crony capitalism as the Federal Reserve monopolized credit and started to bail out entities they deemed \"too big to fail.\" In doing so, they hindered the free market's ability to operate. Central banks have given the green light to major financial institutions that they can privatize their gains amongst themselves while socializing any losses on the taxpayer. This is wrong. Despite all these problems, the United States still ended up as one of the wealthiest countries on the planet. No one truly knows what a world would look like if everyone was playing a fair game. Our current system is designed to enrich those highest up. If we took away the ability to print money society would optimize for providing the most value possible with the least amount of cost. When certain entities can print money while others can not a big majority of people act as parasitic middlemen positioning themselves close to the money printer rather than trying to become a productive member of society. When Satoshi created Bitcoin he gave humanity a fair game that no one could cheat to enrich themselves. No longer does society have to rely on a corrupt system that is addicted to printing money because without this \"drug\" the deflation that technology brings about would cause the system's collapse.\n\nThe relationship between the state and the individual can be complex. Depending on where you are born, the state will almost certainly end up imposing taxes on income and property as well as regulating behavior through laws and policies that may not always align with an individual's personal beliefs or values. This can lead to a lack of trust in the government. In the U.S, individuals are required to pay various taxes, such as property taxes on land they own, income taxes on their earnings, and inheritance taxes when they wish to pass wealth down to their family. A bit ironic considering we became a nation after our Founding Fathers had decided that there would be no taxation without representation. A lot has changed since 1776 and now there is even an exit tax for wealthy individuals who renounce their U.S citizenship. While these taxes are meant to fund government services and programs, they can be a major source of frustration, especially when you consider that in the United States we have the power to print the global reserve currency. Politicians often promise we could fix the system if we just taxed the rich, but this ignores that wealthy individuals seek the help of accountants and lawyers to minimize their tax burden. The tax code is complex so those who make the rules can game the system. It is important for the government to ensure that its tax policies are fair and equitable, to build trust with its citizens by being transparent and accountable. If taxes were openly debated and decided upon by taxpayers, it is possible that a more fair and equitable tax system, such as a flat tax, could be implemented. Under a flat tax system, all taxpayers would pay the same percentage of their income in taxes, regardless of their income level. This would eliminate the need for a complex tax code with different rates for different types of income and would reduce the burden of compliance on taxpayers. It would also help shrink government spending, as they wouldn't need to hire an additional 87,000 IRS agents to prosecute those who can't afford a lawyer to defend themselves from Uncle Sam. I understand it is not an easy job trying to balance the needs of the government with the ability of taxpayers to pay. By allowing taxpayers to have a say in the tax system, there is a greater likelihood that it will be viewed as legitimate and fair rather than a complete monstrosity that for some reason we are not taught about in public school.\n\nUnfortunately, it seems that there is currently little political will among those in power to implement a policy like this. Thus, the decentralization of power through open-source software and networks, like Bitcoin, can provide individuals with greater autonomy and control over their lives. This new system will facilitate the spread of ideas, including those outlined in the U.S. Constitution, around the world. The United States, with its tradition of private property and wealth creation, serves as a beacon of hope for many people. The government is there to protect private property and individual rights. This was best accomplished by the United States for a long time, but recent years have shown an erosion of the principles that made America great. Luckily under a Bitcoin standard individuals don't have to rely on anyone if they secure their private keys properly, meaning government might not be as necessary. If people are able to protect their private property without the need for a government, it raises questions about the legitimacy of the state's actions, such as the imposition of taxes that take a significant portion of wealth from the population without providing sufficient value in return.\n\nThe decision by the United States to go off the gold standard in 1971 marked a significant shift in the relationship between money and reality. Without the constraint of a fixed exchange rate with gold, the value of money became more susceptible to manipulation. When money becomes manipulated, so does everything else. There have been numerous examples since the world went off the gold standard of governments attempting to centralize power and impose mandates without engaging in open debate and justification of its actions. A great example is the United States telling Edward Snowden, who exposed the illegal surveillance practices of the National Security Agency (NSA) against U.S. citizens, that he was exiled for his actions. The state was the guilty party, yet Snowden was the one who ended up prosecuted. This should raise questions about the nature of the state's relationship with the people it governs. The state should act as a responsible arbiter of law for its citizens. The state should not be acting as a helicopter parent. A good parent will help their child grow and develop into sovereign individuals. A healthy parent-child relationship is based on trust, mutual respect, and a sense of interdependence, with both parties benefiting from the relationship. In contrast, a relationship marked by abuse and control can prevent individuals from reaching their full potential and becoming productive members of society. When the state gets in the way of productive individuals, they destroy value for the economy. It is important for the state to respect the autonomy and dignity of its citizens and to work towards building a relationship of trust and mutual benefit. History has shown us that this power often gets corrupted when an empire loses sight of what made it great.\n\nTaking an objective look at the relationship between the state and the individual is difficult, even in the United States, which has some of the best property rights in the world. We are currently dealing with an abusive relationship. If you think that the watchmen are going to fix the mess they made, I have a bridge to sell you (and yes, I accept bitcoin ;) ). Jokes aside, we should not accept this relationship. We should demand that the government stop spending money it doesn't have and get out of the way of entrepreneurs trying to improve the lives of others. There is no shame in working hard to build a business that provides people value so said individual can profit and build a life full of abundance for themself. For this to take place people need a guarantee that their property rights are not going to be violated by the institution that is responsible for upholding these rights. The world is lucky that Satoshi figured out a way to grant property rights to every single individual through the Bitcoin network. With a 12 or 24 word seed phrase, anyone can take their private property anywhere in the world, an incredible accomplishment that empowers individuals to break away from tyrannical governments. The more people who adopt this technology, the more expensive it becomes for tyranny to take place.\n\nI often take for granted the words written in the U.S. Constitution, but without them, I would not have the confidence to write this essay due to concerns about being thrown in jail or prosecuted for the \"thought crime\" of criticizing my own government. If words weren't so powerful, there wouldn't be a push by the gatekeepers of the world to censor certain topics. Next time someone tells you that your words aren't powerful, remind them that words are the base layer of a functioning society. Thanks to Satoshi we now have a base layer that anyone can use without a gatekeeper.\n\n1/5/23\n\nConor Jay Chepenik",
  "wordCount": 1981,
  "readingTime": 7.475471698113208,
  "claps": 0,
  "voters": 0
}