{
  "id": "567f07e809b6",
  "title": "Day 203",
  "createdAt": "2022-10-11 21:30:40",
  "tags": [
    "airports",
    "travel",
    "bitcoin",
    "tsa",
    "bitcoin-podcasts"
  ],
  "url": "https://chepenikconor.medium.com/day-204-567f07e809b6",
  "content": "# Day 203\n\nSpent the whole day traveling which is always lovely. Jokes aside modern day travel tends to go by quickly since we all have smartphones in our pocket ready to stimulate us. I crushed 3 podcasts on my first flight. All three Bitcoin podcasts of course. The general consensus right now is that the bonds markets are blowing up and it is TBD who is going to be left holding the bag. [Lawrence Lepard](https://twitter.com/LawrenceLepard) made the point that while he does think there is going to be some serious breakage he also thought 2008 was the end. Central Bankers have gotten quite good at kicking the can down the road. While I don't think they can do it again this time I could be wrong like many were in 2008. Those who control the money aren't just going to let go of that power willingly. Thus, I thought it was an important reminder by Lawrence to plan for the end, but to expect the unexpected. If they somehow kick the can again it seems we get QE infinity which would still lead people to Bitcoin because it would become clear fiat is a horrible store of value. Which for many is already clear but there are even more who don't see understand why dollars are losing their purchasing power so rapidly.\n\nEither way it is not a bad idea to hold some hard assets. Not financial advice of course but outside of the cash I need to pay my bills I usually keep next to nothing on me. What I'm seeing on social media is a lot of civil unrest but of course social media shows the most extreme stuff to get a reaction. Not sure what to think. I'm hopeful the Fed can pull off a landing where the \"economic plane\" doesn't get absolutely destroyed. I think Bitcoin can help them do this. I'm also grateful to be young and not stuck with a pension that would've likely been down 25–50% this year. I feel for all of these people nearing retirement who are getting screwed by a corrupt system.\n\nBeing in the airport too it seems that the quality of service is way down. So much intervention from the Government after 9/11. I understand there are safety measures for a reason but I also long for the days when people didn't have to go through TSA to get on a plane. I only flew private once in my life when I was much younger but I remember being so happy I didn't have to go through security.\n\nEven as an adult I feel a creeping since of tyranny when going through airport security. I always check my bags twice to make sure I don't have anything I'm not supposed to have but it still feels bad going through airport security. Not sure what the solution is since I don't ever want to see any more planes getting hi-jacked. I'm just saying going through TSA is always an unpleasant and stressful experience even when I've checked my bags to make sure I have nothing I'm not supposed to bring.\n\nEnough dwelling on things I have very little control over. One thing that gives me a lot of hope for humanity is children. I called my girlfriend and she showed me all the onesies she got for our daughter this past weekend. Crazy to think I'm going to be a Dad soon. I'm really excited to spend some time with my child and see what it's like raising little ones. They are going to be our future leaders and they give parents the courage to make a better world. I saw many kids playing around the airport today and one thing I appreciate is how kids can make a game out of almost anything. While most adults are busy looking at their screens, like myself as I sit here typing at an airport, kids are playing games they just make up on the spot. It's hard not to lose that childlike creativity and joy as you get older but I've heard having children helps you see the world in a new light again so I'm pretty pumped for that.\n\nI'm also pumped to teach my kid about Bitcoin. I might even try and buy some gold coins because it is unlikely the OG hard money will be appreciated by the youth unless they are taught from the older generations.\n\n10/11/22\n\nConor Jay Chepenik",
  "wordCount": 745,
  "readingTime": 2.811320754716981,
  "claps": 0,
  "voters": 0
}