{
  "id": "572c9a88d484",
  "title": "Day 308",
  "createdAt": "2023-01-24 15:26:17",
  "tags": [
    "plunder",
    "mirror-nuerons",
    "bitcoin",
    "fiat",
    "atlas-shrugged"
  ],
  "url": "https://chepenikconor.medium.com/day-308-572c9a88d484",
  "content": "# Day 308\n\nI've got the gears turning for another Bitcoin Magazine article and this time the working title is \"When Plunder Becomes Mainstream\".\n\nI'd like to tie in themes I heard from Max and Stacy's most recent orange pill podcast. Link below.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F8jJkq1-YZ_A%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D8jJkq1-YZ_A&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F8jJkq1-YZ_A%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOther themes that would tie into my article drawing from Atlas Shrugged...\n\n1. Objectivism which is based on the idea that the individual is the ultimate moral authority and that their own happiness is the ultimate goal.\n\n2. Capitalism: The novel is set in a world where the government is increasingly regulating and controlling businesses, and the main characters are all successful industrialists who believe in the power of free-market capitalism.\n\n3. Individualism: The novel emphasizes the importance of the individual and their ability to think and make decisions for themselves, rather than relying on the government or other external forces.\n\n4. Reason and rationality: The characters in the novel value reason and rationality above all else, and use their intellect to make decisions and solve problems.\n\n5. The role of the government: The novel is critical of government intervention in business and society, and depicts the government as a force that stifles innovation and progress.\n\n6. \"The question isn't who is going to let me; it's who is going to stop me.\" - Ayn Rand\n\n7. \"I swear, by my life and my love of it, that I will never live for the sake of another man, nor ask another man to live for mine.\" - Ayn Rand\n\n8. \"The man who does not value himself, cannot value anything or anyone.\" - Ayn Rand\n\n9. \"The only proper purpose of a government is to protect man's rights, which means: to protect him from physical violence. A proper government is only a policeman, acting as an agent of man's self-defense, and, as such, may resort to force only against those who start the use of force.\" - Ayn Rand\n\n10. \"The ladder of success is best climbed by stepping on the rungs of opportunity.\"\n\nWhen Plunder Becomes Mainstream\n\nI need to tie this\n\nHumans imitate other humans for a variety of reasons. One of the main reasons is [social learning](https://www.simplypsychology.org/bandura.html), which is the process by which people acquire new information and behaviors through observation and imitation of others. This type of learning is thought to be important for the development of cultural norms and traditions, as well as for the acquisition of practical skills and knowledge. It was also reenfocred by the discovery of mirror neurons\n\nImitation is also thought to play a key role in the development of language and communication, as children learn to speak by mimicking the sounds and words they hear around them. Imitation is also thought to be important in the development of social skills and emotional regulation, as people learn to navigate complex social interactions by observing and mimicking the behavior of others.\n\nAdditionally, Imitation can be a powerful tool for building relationships and forming groups, as it allows people to signal their willingness to cooperate and conform to group norms. It can also be a way to gain acceptance, establish trust and build social bonds with others.\n\nFinally, Imitation can also be used as a way to gain status or prestige. By mimicking the behavior or actions of those who are seen as successful or respected, individuals may be able to gain the same level of respect or status for themselves.\n\nWith this\n\nMirror neurons are a type of neuron found in the brain that are activated both when an individual performs a specific action and when they observe the same action being performed by another individual. These neurons are believed to play a key role in the ability of humans and other animals to understand and imitate the actions and intentions of others.\n\n[The discovery of mirror neurons in the early 1990s](https://www.apa.org/monitor/oct05/mirror#:~:text=They%20were%20first%20discovered%20in,primate%20grab%20the%20same%20object.) was a significant breakthrough in the field of neuroscience, as it provided new insights into how the brain processes social information and how we are able to understand and empathize with the actions and emotions of others.\n\nMirror neurons are found in the premotor cortex and the inferior parietal lobule of the brain, and they respond to both the visual and auditory aspects of an action, as well as the goal of the action. These neurons have been observed in a wide range of species, including humans, monkeys, and even birds.\n\nMirror neurons are thought to play a critical role in the development of language and communication, as they allow individuals to understand and interpret the actions and intentions of others. They also play a role in social cognition, allowing individuals to empathize with others and understand their perspective.\n\nOverall, mirror neurons are thought to be a key mechanism for understanding and interpreting social interactions, and for allowing us to understand and respond to the actions, intentions, and emotions of others.\n\nFinally with the idea of Max and Stacy talked about in their podcast.\n\nMax and Stacy recently discussed on their podcast, The Orange Pill Show, that while the rest of the world is experiencing entropy, El Salvador is experiencing a resurgence. The country, which was once plagued by poverty and crime, is now focused on building infrastructure, creating opportunities through education and jobs, and attracting Bitcoin enthusiasts from around the world. The reason for this change is attributed to the leadership of the President and the people of El Salvador who are following his lead. Humans often tend to imitate the actions of others, particularly those in positions of authority. In contrast, the United States is facing a similar issue, where the government is not taking any steps to address the increasing debt ceiling and instead resorting to plundering. Social media platforms like Twitter are filled with examples of crime and violence in cities like New York, Los Angeles, and San Francisco. It is important to note that social media tends to amplify negative events, as it keeps people engaged. However, it is also apparent that the actions of government officials, Hollywood celebrities, and technology executives in Silicon Valley have a ripple effect on society as a whole. If the leaders of these industries engage in plundering, it will ultimately spread throughout all levels of society.\n\nThat feels like a good start. I'm going to try and get BTCpayserver integrated into my website so that is all she wrote for today but be on the lookout for another Bitcoin Magazine article if all goes according to plan.\n\n1/24/23\n\nConor Jay Chepenik",
  "wordCount": 1076,
  "readingTime": 4.060377358490566,
  "claps": 5,
  "voters": 1
}