{
  "id": "577c5f1b6704",
  "title": "Day 1219",
  "createdAt": "2025-07-24 03:28:31",
  "tags": [
    "writing",
    "is",
    "an",
    "important",
    "art"
  ],
  "url": "https://chepenikconor.medium.com/day-1219-577c5f1b6704",
  "content": "# Day 1219\n\nBeing a writer is so funny because some days you will read something you wrote and think to yourself, God really blessed me with writing skills the likes of which the world has never seen, and other days you'll be looking at a blank canvas thinking to yourself, am I retarded? Like genuinely some days it feels like not only do I have nothing to say, but when I attempt to say something anyways it comes out so bad that I feel genuine sorrow reading what I just wrote. Guess I brought that upon myself trying to write everyday, but such is a challenge that I willingly decided to embrace. Glad I did.\n\nI do think writing with your hands is better than typing. Slower yes, but it fires neurons in your brain that are needed. It also prevents using an LLM which I am guilty of. Guilty being a weak word because I'm not ashamed of doing so. No, I just need to be careful about when I decide to use AI as a writing buddy. It is important to make sure that I do not lose sight of the reason I started writing in the first place which is because I love writing. It's a special thing to think your thoughts \"out loud\" onto the medium you are working with, which in my case is often a website called Medium.\n\nAnyways, quite the Meta post today. I'm not going to run this through an LLM to enhance my thoughts or ask for feedback. No today is completely of the cuff. A stream of consciousness from my mind, to my fingers, to my keyboard, to the internet. It's a beautiful thing really, just letting your thoughts flow.\n\nI'll conclude today by noting I finished something I set out to do yesterday, which was have an amazing date night. Always nice getting to spend some time with the person I plan on spending the rest of my life with. I thank my Father for watching Sloan which enabled me to take my wife out to dinner in the first place, but Dad I know you read these pretty often so if you do read this one, it was not cool you took Sloan to see a movie that Paige did not want her to see. Personally, I get it and I often enjoyed going to movies with you that I was not supposed to see according to Mom. But in the future please don't take Sloan to see something Paige did not want her to see. I need to abide by her wishes and even if I would've taken Sloan to see that movie myself, had Paige been okay with it, I respect Paige's decision.\n\nAlthough I have a feeling when Sloan is a teenager she will be begging you to take her to movies we told her she couldn't watch and it is hard to blame her. I was so proud of telling my friends in second grade that my Dad let me see an R rated movie. History doesn't repeat, but it sure does rhyme, as they say...\n\nOkay now to officially conclude, I wrote this because I turned that digital gold piece I wrote the other day on here into a solid op-ed and upon finally re-reading and editing a bunch of it I am impressed. It feels incredible when you write something that reads nicely. Here is to writing more like that more often!\n\n7/23/25\n\nConor Jay Chepenik",
  "wordCount": 586,
  "readingTime": 2.211320754716981,
  "claps": 0,
  "voters": 0
}