{
  "id": "57f86998da5b",
  "title": "Day 229",
  "createdAt": "2022-11-07 00:16:54",
  "tags": [
    "money",
    "9-5",
    "freedom",
    "mission",
    "value"
  ],
  "url": "https://chepenikconor.medium.com/day-229-57f86998da5b",
  "content": "# Day 229\n\nIf you want to add value deliver results as quickly as you can. When you can provide value immediately you create a more desirable product or service.\n\n![](https://miro.medium.com/1*_imXHwVkc_SajjYwVvxXHw.png)\n\nI like the idea that the things on the left are value drivers and the things on the right are value sucks. However you come up with these variables try and increase the one in the top left corner and decrease the one in the bottom right especially.\n\nNetflix beat Blockbuster because they made watching a movie 10x quicker and easier. People could watch a film with the click of a button rather than pick up a CD at the store. I'm thinking it's kind of crazy my daughter will likely not get to experience CDs. Everything is getting streamed and downloaded over the internet. Maybe I'll hold on to my PS4 as a way to show her what a CD is.\n\nPoint being, the best companies provide immense value in as short a time as possible. I stole this example from the YouTube video I watched. I don't think Alex would be mad because I was just taking his advice. I took the value derived in that video and shortened it.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F5MHQr-Z17Hc%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D5MHQr-Z17Hc&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F5MHQr-Z17Hc%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI also am starting to think through what I want to hone my energy on so I can start selling a product or service. I think I'd enjoy selling some web development packages. Come up with a cool template and help people get their own sites up and looking good. I'm planning on getting into the IT industry so I can learn on the job but while I do so I need to start a side hustle to become truly free. No debt and enough money to do whatever the hell I want. That is the goal. A 9–5 can help me learn as I work towards that goal but being the boss is what gets you to live a life as a rich, happy, and free individual.\n\nShoutout my Dad for sending me that youtube video. Boomer knows how to navigate the web I guess lol. Never underestimate your elders anon.\n\n11/6/22\n\nConor Jay Chepenik",
  "wordCount": 357,
  "readingTime": 1.5471698113207546,
  "claps": 0,
  "voters": 0
}