{
  "id": "587514868de1",
  "title": "Day 1238",
  "createdAt": "2025-08-12 02:58:41",
  "tags": [
    "fiat",
    "money",
    "is",
    "a",
    "lie"
  ],
  "url": "https://chepenikconor.medium.com/day-1238-587514868de1",
  "content": "# Day 1238\n\n**When Your Tax Dollars Fund Your Own Destruction**\n\n_A Gen Z Guide to the Ultimate Scam_\n\nSo I just finished Chapter 14 of _The Creature from Jekyll Island,_ \"The Best Enemy Money Can Buy\" and I need to sit down for a minute and lay out some thoughts about how insane some of these grifts are. Griffin basically laid out the playbook for how international financiers have been running the world's most profitable (and evil) business model for over a century.\n\n**The Business Model That Would Make Tech Bros Jealous**\n\nPicture this: You create a problem, sell the solution to both sides, then profit from the chaos. It's like if Uber created traffic jams to increase demand for rides, except instead of being late to work, entire countries get destroyed.\n\nGriffin calls it the \"Rothschild Formula\". A strategy so coldly calculated it makes corporate layoffs look warm and fuzzy. Here's how it works:\n\n1. Identify or create tension between nations\n\n2. Secretly fund both sides (diversification, baby!)\n\n3. Control the flow of money and weapons to manage the conflict's intensity\n\n4. Swoop in as the \"peacemaker\" offering reconstruction loans\n\n5. Install your people in key positions during the rebuild\n\n6. Repeat until you own everything\n\nIt's giving \"create the disease, sell the cure\" energy, but with nuclear weapons.\n\n**Plot Twist: You're the Product (And You're Paying for It)**\n\nHere's where it gets personal. Every time they pull this stunt, guess who foots the bill? Us. Through inflation, the hidden tax that makes your dollar worth less while international financiers get richer.\n\nThe Federal Reserve isn't some neutral government agency. It's a private banking cartel that literally creates money out of thin air, loans it to the government (with interest), and we get stuck with the tab. That $7 coffee is not just because of inflation. It is a by product of us paying for wars we never voted for against enemies that were created specifically to justify more spending.\n\nRemember when they \"had to\" print trillions for COVID relief, but somehow your rent still doubled? Same playbook, different decade.\n\n**The Russian Revolution: A Case Study in Manufactured Chaos**\n\nGriffin breaks down how the Russian Revolution wasn't some organic uprising of the people, it was a Wall Street production. American and European financiers literally funded the Bolsheviks to overthrow the Tsar, then \"traded\" with the new regime they just installed.\n\nThe truly sick part? After helping create Soviet Russia, these same financiers spent decades selling them technology and resources, funded by American taxpayers, that were later used against American soldiers in Korea and Vietnam.\n\nIt's like funding your ex's new relationship, then wondering why they keep causing drama in your life. Except with geopolitical consequences.\n\n**2020: The Year Most People Stopped Calling It \"Theory\"**\n\nLook, I would love to dismiss this as boomer paranoia too. But then 2020 happened. Suddenly we saw:\n\n- How quickly \"emergency powers\" could reshape society\n\n- How dissent became \"misinformation\"\n\n- How crisis conveniently led to more centralized control\n\n- How \"build back better\" and \"great reset\" went from conspiracy memes to official policy\n\nThe World Economic Forum literally published papers about using global crises to advance world government. At what point should we stop calling it conspiracy theory and start calling it conspiracy fact? Hopefully before we wake up in a world where asking these questions becomes illegal.\n\n**The Psychological Operation You're Living Through**\n\nGriffin explains how they use \"credible enemies\" to keep populations compliant. No enemy? Create one. Peace breaking out? Fund some chaos. People getting too comfortable? Time for another crisis.\n\nThe genius (and horror) is that it's almost impossible to tell what's real anymore. Was that terrorist attack organic or orchestrated? Is that pandemic natural or engineered? Is that war about freedom or profit?\n\nThey've created such \"bewildered confusion\" through controlled media and manufactured crises that most people just tune out. Which is exactly the point.\n\n**Why This Matters for Our Future**\n\nWe're inheriting a world where:\n\n- Your money loses value by design\n\n- Your government creates the problems it claims to solve\n\n- Your taxes fund both sides of every conflict\n\n- Your freedom gets eroded with every \"emergency\"\n\nBut here's what gives me hope: our generation is waking up. We're the first to grow up seeing the internet expose these schemes in real time. We watched them try to memory-hole Hunter's laptop, cover up lab leak theories, and gaslight us about inflation being \"transitory.\"\n\n**The Exit Strategy**\n\nWe don't have to play their game anymore. Every dollar you move into Bitcoin is a vote against this system. Every time you choose decentralized over centralized, local over global, you're opting out of their scam.\n\nThey need us compliant, dependent, and distracted. We can choose to be informed, independent, and focused on building something better.\n\n**The Bottom Line**\n\nGriffin wrote this decades ago, but he might as well have been describing today. The same families, the same playbook, just with better technology and more sophisticated propaganda.\n\nYour student debt, housing costs, and shrinking paycheck aren't accidents. They are features of a system designed to keep you too broke and stressed to notice you're being robbed.\n\nTime to see the game for what it is. Because once you understand the Creature from Jekyll Island, you can't unsee it. And honestly? The most valuable education you'll ever get is in the books your professors won't assign, probably because most of these universities serve as breeding grounds for, and take massive donations from, the very people those books expose.\n\n![No wonder Munger hated Bitcoin. He profited from the fiat system tremendously!](https://miro.medium.com/0*1vMg0DzIoVTF6XaQ)\n\n8/11/25\n\nConor Jay Chepenik",
  "wordCount": 918,
  "readingTime": 3.6641509433962267,
  "claps": 15,
  "voters": 1
}