{
  "id": "58a62ea4eae1",
  "title": "Day 48",
  "createdAt": "2022-05-10 01:34:03",
  "tags": [
    "conspiracy",
    "pharmaceuticals-industry",
    "pfizer",
    "jj"
  ],
  "url": "https://chepenikconor.medium.com/day-48-58a62ea4eae1",
  "content": "# Day 48\n\nThe more I listen to people talk about the BS they experienced since Covid became a thing the more I am convinced we are in a battle of good and evil right now. Like I said many times before; good will win out. It is just a matter of how long will have to endure some bullshit.\n\nListened to a [great podcast](https://open.spotify.com/episode/7J7TxAI8A3XJrs8z8h52av?si=L-Win2uPT9ebKjDt-8slnQ) from Marty Bent today who brought on a Doctor to discuss what she has seen in the past 2 years. TL;DL (too long didn't listen) incentives are everything and they have gotten messed up. I appreciated that the Doctor didn't try to predict who was behind this evil or entertain conspiracy theories (what's the difference between a conspiracy theory in the truth anyways? Well recently it's about 6 months). Instead, Dr. Mary Claire just gave the audience cold hard facts and talked about her experience as a Doctor. My Mum is a pharmacist and convinced me to get the J&J vaccine. My Mum has been pivotal to my life and an absolutely incredible mother. She is brilliant and I remember her staying up till 2 in the morning, after my parents separated, so she could study for her Ph.D. to become a pharmacist and make a better life for herself and her children. I bring all this up because I wonder if the industry she got a graduate degree to participate in has betrayed the people they are supposed to be helping.\n\n![](https://miro.medium.com/1*bmJJyyeSzvMeGvK4Fy705A.jpeg)\n\nI'm not a doctor, just a dude who tries to know his body. I remember playing basketball after getting the J&J vaccine and feeling a wave of exhaustion come over me like I've never felt before. Probably not the best idea to play basketball right after getting a vaccine, but I didn't think it would be a big deal. Everything ended up being fine, but after playing sports my whole life it was concerning to feel exhaustion like I had never felt before. T[here](https://phmpt.org/pfizers-documents/) is no one size fits all solution for a virus. It is an incredible feat of science that we were able to roll out vaccines so fast, but it is egregious they mandated it. That was my thought initially and now with the Pfizer data dump which can be found here, it seems even worse. Not only did they mandate the 💉  as a one size fits all but they also suppressed any dissenting opinions and banned medicines that seem to be damn effective. I'm also reading _The Real Anthony Fauci_ by Robert Kennedy Jr. and I will just post these pages to back up my argument because again I am not a doctor. I'm just someone who is trying to understand why the incentives of the world have become so perverse.\n\n![](https://miro.medium.com/1*Dg4XCwfwrF7VbzWx885qlw.jpeg)\n\n![](https://miro.medium.com/1*AwARkZ3JwyinFhZ7WVMPmg.jpeg)\n\nWe are living through wild times. In better news, I booked a stay at a local Inn up in New Hampshire for my girlfriend's birthday. I'm super excited to see New Hampshire in the summer and experience the town of Littleton. I used Lolli to buy on booking.com which gives me 6% back in bitcoin and I used my Gemini credit card to also earn some bitcoin. If the orange coin does what I think it will do over the coming decades it is going to be wild how much $ I will earn back. If it goes to zero... well then we are looking at a dark world where writing stuff like this is deemed illegal and disinformation. We already got a department at the DHS policing the internet. Hoping we get hypetbitcoinization and Congress banning the DHS from ever forming a board to censor speech. The alternative seems to be CBDCs and increased policing.\n\nAlso reading _The Mandibles_ by Lionel Shriver and it is great so far. Wanted to end on a high note so figured I would throw that in here. No matter how dark stuff may seem, humor provides a nice light at the end of the tunnel.\n\n5/9/22\n\nConor Jay Chepenik",
  "wordCount": 668,
  "readingTime": 3.0707547169811322,
  "claps": 0,
  "voters": 0
}