{
  "id": "58d0bcf3a0a8",
  "title": "Day 134",
  "createdAt": "2022-08-03 23:10:52",
  "tags": [
    "nuclear",
    "bitcoin",
    "work",
    "life",
    "0and1"
  ],
  "url": "https://chepenikconor.medium.com/day-134-58d0bcf3a0a8",
  "content": "# Day 134\n\nIt is interesting to learn about technology. Really amazing what humans can do to make 0 & 1s into complex applications. Lot of math required to do this, but the universal language has led to some incredible innovations. I spent some time going back through the web development course I'm taking to make my own website. I'm barely proficient at HTML & CSS but I'm making some good strides. Excited to create some decent looking buttons tonight. I was able to use the <a></a> tags to link stuff, but tonight I'd like to use buttons to make these links much cleaner. After I get a good grasp on HTML & CSS I'll start learning about Java. One thing that I've noticed about education is that it is more fun and I retain more knowledge when I can apply what I'm learning to a real world problem. Need to keep this in mind as my lil guy/gal grows up and starts to learn stuff. I'll be sure to teach them stuff that they can use in the real world. While part of me does wish I had taken the challenge and learned Comp-Sci in school another part of me appreciated that majoring in film & media gave me the opportunity to create something in the real world. Making a film was damn hard and I've got a lot more respect for directors after trying to create my own film. It is honestly an incredibly emotional process. Emotional in a good way though because you car deeply about the film you're making.\n\nMy boy Zack is back in town this week. Excited to hang with the homie and play some Fifa soon. Haven't been able to bet bitcorn on a Fifa game in a minute. I'm also pumped that I have a Bitcoin dinner in Boston this Saturday. Going to Bitcoin meetups is always such a fun experience and I can't imagine this dinner will be any different. I still laugh when I think about Breedlove joking that the only difference between being a Bitcoin celebrity vs a rockstar is that your groupies are middle aged men rather than hot girls. Hopefully more women get into Bitcoin, but it does make sense that computer geeks are the first adopters. Everyone is interested in preserving their purchasing power though and overtime I have great confidence that tons of normal men and women will opt out of fiat and use Bitcoin as their medium of exchange, store of value, and unit of account. I eventually did and while I'm trying to become more of a computer nerd it is actually Bitcoin that is in a big part driving this urge. That and the salary of a software engineer. Wow, amazing how money incentives certain actions haha. Seems inevitable at this point, but nothing is inevitable so I will keep doing my part shitposting, learning and writing about Bitcoin.\n\nSaw this statement [tweeted](https://twitter.com/DylanLeClair_/status/1554854199850156032?s=20&t=9jPz8vO-TLn6sk8xhcUvfA) out from a central banker on Twitter spaces. The head of the SF Fed had this to say about inflation, \"I don't feel the pain of inflation anymore. I see prices rising but I have enough... I sometimes balk at the price of things, but I don't find myself in a space where I have to make tradeoffs because I have enough, and many Americans have enough\". This has got to be one of the most tone death statements I've ever heard. A Federal Reserve president who gets paid over 400K from the government to run a central bank branch has the audacity to talk about how the public has enough. These people hate us and could give less of a shit about the public. They will happily stroke a massive check and continue to devalue the purchasing power of the dollar. (Not in the short term though as they try to tighten and the dollar strengthens) Opt-out anon.\n\nGot a work event tomorrow where we take out an electric boat and putz around the harbor of Boston. That should be fun. Apparently the boat doesn't go very fast but still should be a cool experience. While electric vehicles do show a promise to get us on a more green standard it only works if we build more nuclear power plants. Creating electricity with coal to charge these vehicles is no better (might even be worse) than using fossil fuels. Fossil fuels have helped make the modern world what it is and having a combustion engine is honestly awesome. Stick shifts vehicles and the visceral feeling of gunning a V8 are things I will miss if we go all electric. That said, my uncle has a Tesla plaid and when he gunned that thing it was so quick. Weird kind of quick though because it makes almost no noise lol.\n\n![](https://miro.medium.com/0*ScJDYaIT4pcIwloS)\n\nFinal thought, this [podcast](https://youtu.be/g_aSqVyJ2wE) with Lyn Alden was pretty insightful. She made the point that there are restrictions in place to prevent the Fed and Treasury from just doing \"helicopter money\" and getting freshly printed dollars into the hands of the citizens. She compared it to a nuclear missile in the sense one general can't just launch the missiles alone. There are checks and balances and that is why it takes both set of keys to launch a nuke. The same is true for the Fed and Treasury and we finally saw them turn both sets of keys in order to give stimulus checks to the American people. This has turned out to be disastrous as inflation is reaching levels not seen for a long time. I heard it in a podcast once with Greg Foss that the Fed is treating its monetary policy like a generator that it can just turn on and off when in reality its more like a nuclear reactor that has to be balanced very carefully. Funny all the comparisons to nuclear energy. Especially considering that nuclear energy seems to be the answer to most of problems. Metaphors are beautiful. Hopefully the Fed doesn't cause the American economy to overheat like a Chernobyl situation but it seems they are walking a damn tight line.\n\n8/3/22\n\nConor Jay Chepenik",
  "wordCount": 1025,
  "readingTime": 4.067924528301886,
  "claps": 0,
  "voters": 0
}