{
  "id": "5930f681879c",
  "title": "Day 440",
  "createdAt": "2023-06-05 16:44:56",
  "tags": [
    "bitcoin",
    "fiat"
  ],
  "url": "https://chepenikconor.medium.com/day-440-5930f681879c",
  "content": "# Day 440\n\nToday, I have set aside my time to craft an article for bitcoinnews.com that delves into the multifaceted interpretations of bitcoin among individuals. Inspired by a thought-provoking conversation with the website's owner, we mutually agreed that exploring this topic would be valuable. The core objective of this piece is to challenge the prevailing arguments asserting that \"insufficient bitcoin spending\" and \"hodling lacks validity as a use case.\" Drawing from my own insights, I aim to present a persuasive argument that exposes the fallacies inherent in these claims.\n\nTo truly grasp the value proposition of Bitcoin, it is crucial to highlight the fundamental distinction between Bitcoin and fiat currency. Bitcoin emerges as a money system adopted by the free market, in stark contrast to fiat currency, whose value is dictated by government decree. The term \"fiat\" itself, derived from Latin, denotes \"by decree.\" The prevalence of fiat currency today can be primarily attributed to the coercive power wielded by nation-states, enforced by their armies, and upheld through legal tender laws. This system relies on people's trust in a mere piece of paper to retain its value. It is indeed remarkable that these paper notes, or even their digital counterparts stored in banks and intermediaries like Visa and Mastercard, serve as the medium of exchange for a wide range of goods and services, including travel, sustenance, real estate, automobiles, and much more.\n\nGiven the widespread acceptance and usage of paper money and plastic cards for transactions by the global population, it is not far-fetched to consider the potential for bitcoin to gain broad acceptance as a form of currency. In fact, Bitcoin offers a more equitable system. Unlike fiat currency, bitcoin cannot be counterfeited, whether by legal or illegal means, as no central bank has the power to do so. The acquisition of bitcoin entails equal opportunity costs for everyone, whether it involves mining it through the consumption of electricity and specialized hardware, purchasing it with fiat currency, or exchanging goods and services for bitcoin. Through operating a node, individuals can personally verify the existence of their bitcoin and have the assurance that the total supply will never exceed 21 million. In contrast, central banks possess the legal authority to engage in the counterfeiting of fiat money, thereby increasing the risk of a decline in its purchasing power over time.\n\nWhile the precise timeline for the transition to a Bitcoin standard remains uncertain, it is crucial to acknowledge that a gradual shift would be preferable to one marked by wars, government-sanctioned violence, and the erosion of civil liberties as governments struggle to maintain their grip on power amidst mounting debt burdens. The 2008 financial crisis was once deemed a potential catalyst for change, but governments managed to delay the inevitable consequences and defer the underlying issues. Bitcoin, on the other hand, offers a pathway for transformation - a peaceful revolution that welcomes the voluntary participation of individuals from all walks of life. It empowers people to actively embrace change rather than being subjected to disruptive and coercive measures imposed by governing authorities.\n\nRegrettably, it is often through the experience of pain that individuals become most receptive to profound lessons. Those who have personally witnessed the devastating effects of hyperinflation, for example, require far less persuasion to appreciate the value of an alternative like bitcoin compared to the average citizen in Western nations. In fact, many people lack a comprehensive understanding of the mechanics of fractional reserve banking unless they have either been employed within the banking industry or delved down the Bitcoin rabbit hole. This knowledge gap primarily exists because schools don't teach children how fractional reserve banking works. This should not be a surprise as fractional reserve banking involves elements of deception and manipulation. As astutely noted by Thomas Jefferson:\n\n> If the American people ever allow private banks to control the issue of their currency, first by inflation, then by deflation, the banks and corporations that will grow up around them will deprive the people of all property until their children wake up homeless on the continent their Fathers conquered.... I believe that banking institutions are more dangerous to our liberties than standing armies.... The issuing power should be taken from the banks and restored to the people, to whom it properly belongs.\n\nThese prophetic words, uttered nearly two and a half centuries ago, bear a disconcerting resemblance to our present reality, where we witness bank bailouts while working-class individuals face the threat of foreclosure. It is not my intention to advocate for individuals to retain their homes without meeting their financial obligations. However, it is bewildering to fathom why banks are rescued under the pretext of being \"too big to fail,\" while ordinary individuals are left to bear the burden of hardship. Frankly, this state of affairs is deeply abhorrent and morally repugnant. The stark contrast between the treatment of financial institutions and the plight of everyday citizens calls into question the fairness and equity of the existing system.\n\nFortunately, we find ourselves at a juncture where a peaceful revolution beckons, open for anyone willing to participate. It is truly inspiring to witness the increasing number of individuals embracing Bitcoin. However, it is crucial that we remain vigilant and avoid succumbing to the same pitfalls that have plagued fiat currency. While Bitcoin may not be flawless, it undeniably presents a substantial improvement - a leap forward that surpasses our current monetary system by an order of magnitude, at least a thousand-fold. It offers a genuine alternative that challenges the status quo and presents a path towards a more equitable and robust financial landscape.\n\nA legitimate concern often raised is the limited availability of goods and services for purchase using bitcoin. However, rather than merely lamenting this situation, individuals have the power to effect change by actively offering their own goods and services in exchange for bitcoin. I have personally taken this proactive step by leveraging my web development skills to accept bitcoin as payment. [For instance, if someone wishes to have a personal website created, they can compensate me with the equivalent of 100 USD in bitcoin for my services.](https://magicwebstore.xyz/index.html?pubkey=02b1a6c208420d3eb5a625aa8c79689e1dd4ea94f82286d06e1df7a05e2c3a482f&relays=%5B%22wss://nostrue.com%22,%22wss://relayable.org%22,%22wss://nostr.oxtr.dev%22%5D) It is through such individual initiatives that the Bitcoin network gains strength and exerts a more significant influence. As more people choose to accept bitcoin as a viable form of payment for their goods and services, the network grows in size and significance. By actively participating in this manner, we contribute to the ongoing development and expansion of the Bitcoin ecosystem. These network effects grow in an exponential fashion. The phrase \"gradually then suddenly\" aptly captures this transformative process, highlighting how small individual initiatives can accumulate over time, eventually resulting in a substantial shift towards widespread adoption of Bitcoin as a viable form of currency.\n\nWhile some may raise a common argument against holding bitcoin as a valid use case, I respectfully dissent from such a viewpoint. When we compare bitcoin to fiat currency, a crucial distinction emerges. Fiat currency, subject to the whims of central banks, penalizes the act of saving through relentless money printing, gradually eroding the currency's purchasing power. In stark contrast, despite its extreme volatility, bitcoin has demonstrated remarkable appreciation over extended periods. Embracing bitcoin as a long-term savings vehicle has consistently yielded favorable outcomes within four-year time horizons. It is essential not to punish savers for their prudence; on the contrary, saving is a virtuous habit that allows individuals to accumulate capital for various purposes, including acquiring homes, cars, or initiating businesses. However, if individuals continuously lose purchasing power at a rate surpassing their capacity to save for these aspirations, their dreams may forever remain unfulfilled. The debasement of fiat currency not only obstructs individuals from achieving their savings goals but also coerces them into seeking higher-risk investments. This is a troublesome scenario as investments inherently entail uncertainty, while savings should provide stability for the future. The relentless money printing by central banks has effectively compromised the dollar's long-term store of value attributes in favor of short-term stability. Throughout history, the allure of printing money has proven irresistible to those with control over the metaphorical printing press.\n\nUltimately, money should fulfill three fundamental functions: serving as a store of value, a medium of exchange, and a unit of account. Historically, these functions are established in that specific sequence. However, with fiat currency, although it continues to be extensively used as a medium of exchange and unit of account, its capacity to function as a dependable store of value has significantly deteriorated. Governments have seized control of fiat currency, rendering it impotent as a store of wealth, and instead exploiting it as a tool of control.\n\nAs the Bitcoin network continues to gain momentum and establish itself as a monetary system, it is increasingly probable that more individuals will adopt it as a medium of exchange, ultimately supplanting the dollar as the preferred unit of account. The timeline for this transition remains uncertain. However, it is imperative to ensure that Bitcoin does not succumb to the same pitfalls of control that plague fiat currency. Safeguarding the principles of decentralization, individual sovereignty, and limited supply will be crucial to maintaining Bitcoin's integrity as a liberating force in the realm of meatspace all us humans reside.\n\nMy concern lies not in the potential of Bitcoin as a store of value, but rather in the dangers of individuals attempting to dictate how others should utilize their bitcoin. No individual possesses superior knowledge or insight into the incentives encountered by others on a daily basis. Depending on one's circumstances, it may be more practical to save bitcoin and conduct transactions using fiat currency, especially if utilizing bitcoin as a medium of exchange subjects one to capital gains taxes. Conversely, in regions where native currencies are highly volatile, individuals may naturally gravitate towards using bitcoin as their de facto medium of exchange, preferring its stability and utility to their currency. It is essential to respect individual autonomy and allow people to make decisions based on their own circumstances and preferences.\n\nRegardless of the situation, the expansion of the Bitcoin network relies on the continuous growth of its user base. If you are currently reading bitcoinnews.com, it is probable that you are already delving into the depths of the Bitcoin rabbit hole. I urge you to divert your attention away from scrutinizing how others employ their bitcoin and instead focus on how you can actively contribute to fortifying the Bitcoin ecosystem. By engaging in activities that enhance adoption, education, and development within the Bitcoin community, you play an integral role in strengthening the network and accelerating its progress towards becoming a positive transformative technology for the world.\n\n...\n\nYea that's a good start :D\n\n6/5/23\n\nConor Jay Chepenik",
  "wordCount": 1799,
  "readingTime": 6.788679245283019,
  "claps": 0,
  "voters": 0
}