{
  "id": "596f39bd9839",
  "title": "Day 336",
  "createdAt": "2023-02-21 20:32:38",
  "tags": [
    "parenting",
    "bitcoin-magazine",
    "exercise",
    "getting-outside",
    "meditation"
  ],
  "url": "https://chepenikconor.medium.com/day-336-596f39bd9839",
  "content": "# Day 336\n\nWas feeling a bit frazzled this morning. Had to go to social security today for my child so that was fun. Nothing better than visiting a Government office. Jokes aside, I don't know what exactly caused me to feel so out of whack this morning. After a 5 minute meditation and run to my local park with exercise equipment I'm feeling much better. It was a cold day today, but it was nice splitting up the run and working out in between. I had seen someone online talk about the value of going to parks and exercising outside to avoid paying for a gym membership. Valuable advice. I recommend you trying it sometime anon. If your park doesn't have gym equipment you can do body weight exercises, but it is nice to have equipment so you can do more exercises than push ups, sit ups, and sqauts.\n\nToday for some reason I remembered that in college I wanted to write a book called _Book_. It would be a collection of short stories/skits/ideas that I came up with. Trust me when I say this book is filled with a lot of ridiculous stories. Luckily, it's on my google drive and I found it with some searching. Here are two of the stories I picked out to copy and paste after a quick scroll.\n\n**The shit we peddle ourselves**\n\nRelationships are hard and difficult and amazing and everything in between. However, once a relationship goes sour, it's so hard to call it quits. Some may describe it as a feeling, not even one you can describe, you just know. You peddle yourself this bullshit to keep things going. The other person does the same. In the end, when the relationship comes to a close you ask yourself why you let it go on. All you can recall is the best memories; like fuck I want her/him back. However, having the strength to also recall the reason things went sour is what will allow you to move on. Fuck the shit we peddle ourselves to feel better. Don't drink the kool-aid: just move on.\n\n**Why?**\n\nFind your why. Ask yourself what makes you happy and do that. Don't worry about the money ... at first. Figure out what you like then become an expert in it. If you're a master of something the money will come. The American dream isn't done. It just takes a lot of hard work.\n\nDespite some grammatical mistakes and excessive use of however in the first one not bad. I might need to spend some time reading over everything I wrote. The google doc has like 16,000 + words in it so it will take me a little time but it's nice having a memento of the writing I did in college to look back on your past self and see how you were thinking.\n\nShit I still make many grammatical errors. Which is kind of sad considering we have tools like Grammarly and spell check. I guess it kind of becomes less important to some degree as people get use to slang and speaking in tongues. I need to read more about [the Tower of Babble](https://www.britannica.com/topic/Tower-of-Babel) though because if language slips too far then things can get pretty ugly for society. I'm looking forward to reading some of these mediums as I get 5, 10, 50 years out from my current age. It's going to be pretty funny, weird, and cool to see my thoughts as a 25 year old if I'm blessed to make it past 75.\n\nOn another note I found out today that my article is getting published in the print edition of Bitcoin Magazine. Feels good having some of my writing published in an actual print magazine. First time where I'll be able to read my own work in something tangible that I did not print out myself.\n\nLast thing I'll mention today is I finally called my Dad. That man is stubborn but he is my Father and I love him dearly. I hope going forward we can remain on good terms and stop fighting over bullshit. He doesn't have an iPhone so he was getting upset that my Mom had all these pictures of Sloan he didn't. It's not that I share photos with her but we have a big shared album anyone can add too so that's why she has way more photos. Thus, I sent my Father some photos of Sloan this morning. I laughed today as I finished that Blue Collar BTC podcast I posted about yesterday because the guest on the show mentioned something about how we parent poorly in a different way than our parents did. He wasn't saying everyone is a bad parent, but I know no one is perfect. I have no clue what qualms Sloan will have about the way I parent but I'm sure it's different than the qualms I have about my parents and I imagine my parents feel they did a sufficient job parenting different from the way their parents did. You can't pick your parents but you are blessed if you have them in your life. Overall, my parents were great to me and I'm glad to still have them in my life. I'm going to try and make sure I don't parent in the ways that upset me as a kid and Sloan if you ever read this and have problems with the way I'm parenting tell me. Not saying I will give in to your request per se, but I will do my best to lay out why I'm parenting the way I am so you can at least understand. Radical honesty.\n\n2/21/23\n\nConor Jay Chepenik",
  "wordCount": 952,
  "readingTime": 3.5924528301886793,
  "claps": 1,
  "voters": 1
}