{
  "id": "5b213f07343d",
  "title": "Recently read “The Subtle Art Of Not Giving A Fuck” By Mark Manson",
  "createdAt": "2020-12-15 16:33:12",
  "tags": [
    "mark-manson",
    "takeaways",
    "lovethestruggle",
    "reading",
    "insights"
  ],
  "url": "https://chepenikconor.medium.com/recently-read-the-subtle-art-of-not-giving-a-fuck-by-mark-manson-5b213f07343d",
  "content": "# Recently read \"The Subtle Art Of Not Giving A Fuck\" By Mark Manson\n\nI need to read more, I really do. I don't think I ever read a book that made me cry until I finished Mark's masterpiece this past weekend. Nothing against self-help books, but for the most part I'm genuinely a pretty happy person and usually steer clear. However, something about the title of Mark's book caught my eye and I decided to give it a read. My biggest takeaway? Mark should've named the book \"How To Give The Right Fucks\".\n\nAll jokes aside, I genuinely feel so much better after reading this book. One thing that stuck with me pretty well is the backward law which basically states the more you seek highs the lower you'll feel while the more comfortable you get being uncomfortable the happier you will be. I get why it's called the backward law, but when you really think about it the logic makes perfect sense. Chasing highs has diminishing returns. The more you seek them the less \"high\" you'll feel. On the other hand, think about the first time you ran. You were probably mad uncomfortable and ready to puke after half a mile if you are anything like me. Now think about your 100th run in the year if you stuck with it. You're probably a lot more comfortable being uncomfortable which in turn makes you feel a lot better. This is just an example, but I believe this principle can be applied to most things in life. It takes time to learn anything and if you don't spend the thousands of hours required to become good at something then you will constantly be annoyed and uncomfortable. So moral of the story get used to being uncomfortable if you want to live a happier life. :)\n\n12/15/20\n\nConor Jay Chepenik",
  "wordCount": 310,
  "readingTime": 1.169811320754717,
  "claps": 0,
  "voters": 0
}