{
  "id": "5b25eff69266",
  "title": "Day 211",
  "createdAt": "2022-10-19 23:53:20",
  "tags": [
    "lens",
    "bitcoin",
    "money",
    "value",
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-211-5b25eff69266",
  "content": "# Day 211\n\nToday I woke up to my bathroom ceiling dripping. I guess the pipe in the upstairs apartment of my building had burst and it dripped down to not just my apartment but the ones under me as well. Hahahaha not exactly what I was hoping to wake up to but it turned out okay. Called my property management company and they fixed it quite quickly. While I do aspire to own some land one day it is nice not having to pay for repairs in my apartment. Tradeoffs to everything and I'm enjoying the tradeoffs that renting is affording me at the moment.\n\nIt also allowed me to stay and WFH today which I appreciated. Took a nice walk to the food trucks at Harvard and had lunch with my girlfriend. Crushed a run after work, called my Grandpa, and listened to this Podcast from Preston. I love listening to Jeff Booth speak!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F11kTWmay9jjpoBNzCR8bRX%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F11kTWmay9jjpoBNzCR8bRX&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f6fd4a58ebd85c56794f07b9a&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nI'd like to start writing Twitter threads to grow my following online. It seems that you can create a nice life for yourself if you can build a big enough following. That said, I want to make sure I cultivate a following I appreciate and that feels like they are receiving fair value for their monetary units when I successfully find a way to monetize myself online.\n\nOne thing that stuck out to me in this podcast is that our actions are providing value for someone. Many times it is a corporation instead of the individual who is receiving this value. Maybe I can put that better. The person working for the corporation generally receives a smaller sum than the corporation does for that person's efforts.\n\nAnother idea is that our lens is often tainted by the system we preside in. For Bitcoiners this lens is tainted towards abundance and prosperity because this is what we believe Bitcoin can bring to the world. For people in the fiat system I believe they look at the world through an increasing hopeless lens. As more of their wealth is stolen via taxation and inflation they have to run faster and faster on the hamster wheel that life can feel like at times.\n\nTechnology typically benefits those farthest away from the top. Jeff gave the example of Kodak and how digital cameras have eaten into a massive amount of their revenue. As the incumbent they didn't want to change up their business model because it was working great for them. Low and behold technology took away a huge piece of their market share because they stopped innovating and smart phones made it so the value they provided for people was no longer as valuable. Technology made it so people could take high quality photos with the little computer we all keep in our pockets and things like the cloud made it so we could store these photos on someone else's server and access the photos whenever we pleased.\n\nFinally, Jeff helped remind me of the idea that blockchains must face the trilemma of choosing two between scalability, security, and decentralization. Bitcoin picked decentralization and security which means that the free market will have to compete to provide the scalability part of its blockchain. He made the point that the Zoom application him and Preston are using to record is built on top of TCP/IP but no one is thinking about the layer 1 protocol of the internet when they are using Zoom. It doesn't take much to see that stuff like the lightning network and other layer 2, 3, and 4 products can do incredible things to help Bitcoin continue to scale without sacrificing layer 1s security or decentralization.\n\nI'm so hopeful for the future because my lens is tinted by Bitcoin. We all have agendas, hopes, dreams and things we want to see play out. I agree with Jeff that the view Bitcoiners have of the world are typically much more hopeful than the lens of those who see everything through the U.S dollar. Over a long enough time horizon my hope is Bitcoin can bring abundance to all as more people can cooperate without coercion from powerful entities imposing top down control. Fix the money fix the world baby.\n\nDon't trust me though. Go and verify for yourself. Can confirm you will not be disappointed by the Bitcoin rabbit hole ;)\n\n![](https://miro.medium.com/1*U3pD5fZSfQ5mPSGQpfnqAA.jpeg)\n\n10/19/22\n\nConor Jay Chepenik\n\nP.S I did end up writing that Twitter thread because of this Medium post which can be found here.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1582901549814386688&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n:D!",
  "wordCount": 749,
  "readingTime": 3.026415094339623,
  "claps": 3,
  "voters": 1
}