{
  "id": "5b578e7ac7da",
  "title": "Day 634",
  "createdAt": "2023-12-17 03:45:27",
  "tags": [
    "beauty",
    "utility",
    "technology",
    "art",
    "candles"
  ],
  "url": "https://chepenikconor.medium.com/day-634-5b578e7ac7da",
  "content": "# Day 634\n\nIn Kevin Kelly's thought-provoking book _'What Technology Wants,'_ he draws an intriguing contrast between the evolution of technology and the nature of art. Kelly suggests that while technology often begins with a purely utilitarian purpose, over time it can transform into something valued for its aesthetic properties. This perspective resonated. It led me to reflect on the surprising parallels between technology and art, despite their fundamentally different origins.\n\nUnlike technology, art does not typically start rooted in practical utility . Art blossoms as an expression of human creativity and emotion, aimed to evoke feelings, inspire thoughts, and provide aesthetic enjoyment. Technology, on the other hand, is birthed from the soil of functionality and practical use. Yet as innovations advance and render older technologies obsolete in their original roles, these relics of the past can take on new dimensions of significance. Their aesthetic qualities emerge and gain appreciation, even as their utility fades.\n\nIt is an ironic twist that something originally designed for practical ends becomes, in a way, 'useless' in that role, yet accrues value in other realms. Take the example of the candle, as discussed in Kelly's book. Once essential for illumination, candles have become somewhat obsolete with the advent of electric lighting. Yet, they hold a unique charm, a bourgeois luxury that modern lighting can't replicate. This observation isn't isolated to candles alone. It extends to various realms of technology, such as vintage cars, classic video game consoles, and Zippo lighters. These items may have been eclipsed in functionality by newer models, but they command an aesthetic and nostalgic value that transcends their original purpose.\n\nKelly's work particularly resonated with me when considering the tactile joy of a Zippo lighter or the nostalgia evoked by retro game consoles. The click of the Zippo, the distinctive design of old cars, the memories associated with classic games - these elements create an experience that modern advancements can't always match. For instance, a Bic lighter might be more practical, and the graphics of a PS5 are certainly more advanced, but they lack the unique sensory and emotional experiences that their older counterparts provide.\n\nMoreover, Kelly's perspective helped me appreciate the appealing simplicity of older technologies. I regret selling my PS3, for instance, since it made playing multiplayer sports games with friends so straightforward. Modern consoles often require Wi-Fi connectivity just to function - a degree of complexity some may see as technologically exhausting. There is an argument to be made for the relief found in toys and tools that work independently, without tethers to the digital world.\n\nHowever, newer systems certainly offer amazingly immersive features and ways to interact online. As with most advances, the trade-offs leave some nostalgic while others eagerly adopt the cutting edge. After reading Kelly's work, I'm reminded that things most people see as obsolete still hold great significance for others. One generation's outdated tech can seem like a treasure trove of possibility and meaning to innovators who see through the surface. Just as beauty often lies in the eye of the beholder, the utility and wonder of inventions shine differently depending on the mind that encounters them. Even - or especially - once they fade from the spotlight of popular culture, their essential value persists for those still drawn to explore their distinctive aesthetic and functional merits. Do not underestimate the richness hidden within aging technologies! One man's trash could be another man's treasure.\n\n![](https://miro.medium.com/0*K6TTdLsJ73FFIjKm)\n\n12/16/23\n\nConor Jay Chepenik",
  "wordCount": 577,
  "readingTime": 2.377358490566038,
  "claps": 0,
  "voters": 0
}