{
  "id": "5b8096f4a7d0",
  "title": "Day 330",
  "createdAt": "2023-02-15 23:47:36",
  "tags": [
    "golf",
    "goals",
    "time-preference",
    "life",
    "writing"
  ],
  "url": "https://chepenikconor.medium.com/day-330-5b8096f4a7d0",
  "content": "# Day 330\n\nToday has been a real treat. I woke up early and played 18 rounds at a Golf course overlooking NYC. I didn't play great because it has been probably six months since I last stepped foot on the links, but I had some terrific shots which are the thing that keeps you coming back. Afterwards I finished up making edits to the football Bitcoin Magazine article and submitted it to Bitcoin Magazine. Maybe it will get picked up maybe not. Either way it feels good to be done with that one haha.\n\nI've also spent some time today reading through a substack called \"[The Good](https://thegoodx.substack.com/)\".\n\n> [**Jens's Newsletter | The Good | Substack**](https://thegoodx.substack.com/)\n\nI highly recommend checking out Jens's Newsletter. I'm having him on my podcast at the end of February. Very much looking forward to that conversation. He inspired me to write this tweet after learning from some of his articles.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1625964526704230413%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nHe also made me think about how a degree from a University is akin to proof of stake in Ethereum. It's a piece of paper we all pretend is super valuable in order to get a high paying job. As anyone in the work force knows it is much more applicable to actually learn in a job than to \"get an education\" that prepares you for a job. Not saying all degrees are worthless but I do think most real world jobs can teach you a lot more than a University ever could.\n\nNow that we are half way through February it will be valuable for me to assess how well I've been sticking to my resolutions for the year. I use that word lightly because I forgot what I called my resolutions but I remember writing back in late December that I was going to try and have some lifestyle changes to accomplish my goals.\n\n1. Run 40 miles every month in 2023. So far in February we are on pace to hit the goal and successfully ran over 40 in January. So that's good because February is one of the shortest months making it one of the hardest.\n\n2. Code everyday on replit.com I have been bad about this one and given up on doing python lessons everyday. That said, I should get back into it. I am doing the coding bootcamp so that is a positive in terms of learning to code. Would do me no damage to practice python on top of what I'm learning in class which is mostly javascript at this point.\n\n3. Read at least 10 pages everyday. I've missed a few days so that is not fantastic. I am however making good progress when I do read so I need to be more consistent. I know I at least always read 10 pages worth of articles online but real physical books are nice because I can't get distracted by the broader internet so easily.\n\n4. Continue writing. Been doing pretty good on this one. Have not missed any Mediums and I got some articles published in both bitcoinnews.com and bitcoinmagazine.com so + for ya boi. Writing is a great thing and you should do more of it anon.\n\nPretty happy with my progress. We can get better about some of the consistency but overall I'm happy about the running and writing goals being 100% met. The coding and the reading aren't perfect but I also seem to be making some progress on those. Another thing I wrote about early on was doing a habitchain app and I'd like to get that going. Need to make time to learn swift.\n\nWill keep getting better, will keep assessing how I've done, and will forever keep learning. Life is more fun that way anon.\n\n2/15/23\n\nConor Jay Chepenik",
  "wordCount": 638,
  "readingTime": 2.4075471698113207,
  "claps": 0,
  "voters": 0
}