{
  "id": "5bba8c0246dc",
  "title": "Day 95",
  "createdAt": "2022-06-25 18:31:58",
  "tags": [
    "stand-up",
    "podcasts",
    "bitcoin",
    "kids",
    "experts"
  ],
  "url": "https://chepenikconor.medium.com/day-95-5bba8c0246dc",
  "content": "# Day 95\n\nDid a Podcast with Nyc Burns from the Nyc & Griff show this morning which was awesome. I love podcasting. Need to keep creating and never lose sight of what an amazing medium it is for spreading truth. Haha medium. Like the site I use for my internet journal. Anyways, back to crafting this stand up bit for my dry run this coming Tuesday.\n\nI've always been a big believer in being open-minded. It's a fine line though because in today's world it's near impossible to tell who the snake oil salesmen are and who are the ones providing value. Anyone with a smart phone has all of human history at the tip of our fingers and most of us use it to watch videos of porn, people popping pimples, or get food delivered to our door. Humanity is wild but as far as I can tell this tyranny of convenience our phones provide make it difficult to remain open-minded. The key to being open-minded though is not caring what others think and luckily my father taught me this lesson at a young age. Yea my Dad constantly reminded me that pursuing your passion no matter what is the key to a happy life. For my Dad that passion was his children's sporting events. He liked living a little too vicariously through my sisters and me. At my JV football games he was on the sidelines drinking a vodka red bull yelling PICK A SPOT!!! PICK A SPOT CONOR! My Dad was adamant about pursuing his passion even if it meant getting child protective services called because he made me run 5 miles and give up water for 24 hours to make pop Warner football weigh-ins. What doesn't kill you makes you stronger though amirite? You know some people might've thought this was borderline child abuse, but they just didn't understand my Dad would have done anything for his children including unorthodox training methods to get his kids ready to compete. You know I give my Dad crap but he really did teach me a lot of important lessons like for example, make sure you put your mixie in a big gulp before entering the high school football game, that having a child is unlike anything you've ever experienced, and that asking for forgiveness is always a better idea than asking for permission. By focusing on yourself it's always easier to not worry about what others are obsessing over which in turn helps you keep an open mind. If there is one thing I do sometimes worry about though it's that I inherited my Dad's trait for being overly obsessive. Life is about having a plethora of experiences. It's not good to become completely immersed in anything which for my Dad was his children's sports and for me it's Bitcoin. Yea I'm obsessed with this magic internet money that has slashed half my purchasing power in USD terms and led my family to think I'm crazy. There's a great saying on bitcoin twitter, \"If your family doesn't think you're insane then you're not really a bitcoiner\". But yea my Bitcoin obsession is so strong that I recently found out I'm going to be a Dad and when my girlfriend told me the first thing that ran through my head was \"Thank God For Bitcoin\". As you can imagine that's not what I told her though. I said \"our kid is either growing up driving lamborghinis or hunting city cats for dinner.\" Ain't no in-between at this point. Yea I thought getting into Bitcoin would bring me a lot of money but it really only got me a Twitter addiction and my net worth in fiat terms cut in half. That's alright though my online friends assure me that by having a low-time preference and holding I will be just fine. While I'm confident in that part I do need to remember that everything I find online should be taken with a grain of salt. For example, there were people on Twitter saying that taking a 💉  could cause me to be sterile. Well low and behold I was able to debunk that theory. And I'm excited to have a kid, I am, I'm just not sure if having a kid was a legit excuse just to dunk on the anonymous twitter account @mr.clownworld who gave me the idea in the first place. Luckily, by keeping my life savings in a currency that can't have the money supply inflated I think I'll be okay. Raising a child is expensive and with the ways things are going I don't see it getting cheaper. I'm convinced bitcoin will replace the US dollar as a global reserve currency because the experts say it won't. Yea the so called \"experts\" who didn't realize inflating the money supply by trillions of dollars would cause inflation are now telling us there is no chance bitcoin takes over as the next global reserve currency. So there is hope. Doesn't take take a rocket scientist to know that printing money will cause inflation, but I guess it takes more than an economist. Plus, kids are smart as hell. Ain't no way the next generation is going to walk in a bank to ask for permission to send large amounts of money. I think they'll use bitcoin. A permissionless system that allows anyone to send and receive value without a third party over an easy-to-use app is a lot better than entering a bank and talking to old dudes in suits. Plus kids nowadays are happy to call people out. You know this past weekend I went down to New York and when I arrived at my Aunt's house the first thing my little cousin said when we walked in is \"I'm confused. First comes love, then comes marriage, then comes a baby sitting in the baby carriage\". I said Vaughn. When you lose half your fiat purchasing power in magic internet money you got to find a way to channel that anger somewhere. Thank you that's my time.\n\nStand up bit is coming along. Still got some more tweaking to do before my dry run but I can feel it coming together. Life is good. Going to go up New Hampshire for the day and hang with some friends. Enjoy the weekend anon and if it's not the weekend when you read this enjoy your day anyways because life is short!\n\n6/25/22\n\nConor Jay Chepenik",
  "wordCount": 1086,
  "readingTime": 4.09811320754717,
  "claps": 0,
  "voters": 0
}