{
  "id": "5d4cc0ca4893",
  "title": "Day 361",
  "createdAt": "2023-03-19 01:34:26",
  "tags": [
    "bitcoin",
    "cbdc"
  ],
  "url": "https://chepenikconor.medium.com/day-361-5d4cc0ca4893",
  "content": "# Day 361\n\nLast night I wrote a piece about cloudy substances. Check it out below.\n\n> [**Cloudy Like Substances**](https://open.substack.com/pub/binmucker/p/cloudy-like-substances?r=223b20&utm_campaign=post&utm_medium=web)\n\nToday I read Arthur Hayes piece about the BTFP program from the Fed. Worthwhile reading as well.\n\n> [**Kaiseki**](https://cryptohayes.medium.com/kaiseki-b15230bdd09e)\n\nMarcus does a great job in his book _Meditations_ pointing out that nothing is permanent except change. Arthur in his medium does a great job pointing out that nothing is more permanent than a temporary government program. Both seem true.\n\nOnce a government program is established, it can be difficult to eliminate it, even if it is no longer effective or even harmful. There are several reasons why this might be the case. First, government programs often have strong constituencies that benefit from them and are willing to fight to maintain their funding and support. These groups may include businesses, special interest groups, and individuals who have become dependent on the program.\n\nSecond, once a government program is established, it can be difficult to unwind because of the complex legal and bureaucratic processes involved. Government agencies may be required to follow strict procedures for changing or eliminating programs, including obtaining legislative approval and engaging in lengthy rule making processes. Political considerations may also play a role in the difficulty of changing or eliminating government programs. Politicians may be reluctant to take action that could be perceived as harming their constituents, and may be more focused on maintaining their own political power than on making significant changes to the programs they oversee.\n\nTaken together, these factors make it challenging to eliminate or significantly change government programs, even when they are no longer effective or necessary. As a result, the saying \"nothing is more permanent than a government program\" has become a common way of expressing the idea that government programs have a tendency to persist, even in the face of changing circumstances or shifting priorities.\n\nSo money printing till hyperinflation is likely here. Hope I'm wrong. Hyperinflation means things are going to get ugly. I don't want this. However, I don't see another way out of this massive hole the financial system in cahoots with the political system has dug for themselves.\n\n![](https://miro.medium.com/1*p_P4iQQCf8drF18jL6cD3w.png)\n\nWell for fiat money that is. People will continue to use money. Without money society can't function. Fiat money will end up behind the shed like Silicon Valley Bank, Signature, and Silvergate. At least I hope. CBDCs are a nightmare and other cryptos seem to be vaporware unregistered securities. Bitcoin is hope though.\n\nPrepare accordingly.\n\n3/18/23\n\nConor Jay Chepenik",
  "wordCount": 458,
  "readingTime": 1.9283018867924528,
  "claps": 5,
  "voters": 1
}