{
  "id": "5d93ef50aae1",
  "title": "Day 408",
  "createdAt": "2023-05-05 00:57:54",
  "tags": [
    "yeast",
    "nutritional"
  ],
  "url": "https://chepenikconor.medium.com/day-408-5d93ef50aae1",
  "content": "# Day 408\n\nGreat Medium today. Used this to draft an article for bitcoin mag or news depending on whichever accepts it :D\n\nThere are so many times I'll be having a thought and think I need to tweet that or note it. Notes being the thing you post to N.o.s.t.r aka notes & other stuff transmitted by relay.\n\nLike this for example.\n\n![](https://miro.medium.com/1*mQr4oaT6l1Ql-c8hG5SYww.jpeg)\n\n> [**binmucker on Iris**](https://iris.to/note1r349fwk3tprlpt6j3lgr0ekus6tcdhnasvyuzkczpvqf9vzqx78s5altsr)\n\n> [**binmucker on Iris**](https://iris.to/note13af0cmsgpcps2duq4y8xqw9d3lrv0wgqjj3flp04d27zygtzug5s06ql6u)\n\nWhen I'm not thinking random silly thoughts I've been pondering on about two things recently. 1. We are all working for Bitcoin. 2. Technology as a network mimics many things about human biology. To showcase one check out this tweet.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/BradSherman/status/1653928972026093569%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLet's start with the first thought. The rise of Bitcoin will continue to explode as technology grows exponentially faster. People are investing in it, mining it, and talking about it non-stop. But have you ever stopped to think that we are all working for it?\n\nCongressman Brad Sherman recently tweeted, \"60 years ago, the late great Robert F. Kennedy #RFK went after tax evaders as U.S. attorney general. Today, his son is slated to speak at a conference for tax evaders.\" This tweet is a perfect example of how Bitcoin has become a household name and how people are working for it, even if they don't realize it.\n\nWhen politicians assume that citizens who support \"freedom money\" like Bitcoin are tax evaders, they are showing people that they cannot be trusted. It is ludicrous to think that people who use new technology are inherently bad. New technology is not always easily understood, but at some point, when it becomes ubiquitous with everyday life, there is no more fighting it.\n\nBrad Sherman probably won't win many, if any, votes for his tweet, but he stands to lose a lot. Immediately, my thought is that this guy is a corrupt scumbag who wants to disrespect the constitution he took an oath to protect.\n\nNow, let's move on to the second thought. Technology is often compared to a network, and this network mimics many things about human biology. Kevin Kelly's book \"What Technology Wants\" goes into detail about how technology has its own set of needs, wants, and desires, just like humans do. There are three quotes that really stood out to me.\n\n> \"Technologies do not exist in isolation, but rather in networks that amplify their power and reach.\"\n\n> \"Innovation is a team sport, and the best innovations are produced by networks of people working together.\"\n\n> \"The more interconnected our technologies become, the more emergent properties they exhibit, and the harder they are to predict or control.\"\n\nTechnology is always evolving based on human needs. It starts with a small idea and then grows into something larger than anyone could have imagined. This evolution is not always linear, as new technologies often emerge from existing technologies. These networks grow exponentially faster as new technologies enables stuff we never thought possible. facetime would seem magical to someone 100 years ago in the same way a medical device that would regenerate limbs for people would seem magical to the modern day man. I'm sure that technology will come someday and with it many more innovations I could never have hoped to imagine until I saw them.\n\nJust like humans, technology has its own set of rules and laws. We have to follow these rules to make the most out of technology's potential. As we continue to use technology in our daily lives, we must be mindful of its impact on us and the world around us. Imagine if someone called a conference about TCP/IP a conference for gang members. It would seem ridiculous. Especially from a politician who should be encouraging innovation in their distract. Attacking people because they enjoy using a protocol is insane. However, if your job was devoted to keep people in legacy technology because new technology made you irrelevant. Well I guess I would not respond nicely to this new technology either.\n\n![](https://miro.medium.com/1*cSudOqPP12bbueWBsryy9w.png)\n\nIn the end, we are all part of the network of technology, whether we like it or not. We must embrace the evolution of technology, and understand its potential to shape the world for the better. The growth of Bitcoin and the evolution of technology are just the beginning, and it is up to us to harness their power and make the most out of their potential. The possibilites are endless. I don't know for a fact that Bitcoin is going well above one million, but I think it's pretty damn possible the more network effects get added both in meatspace and cyberspace.",
  "wordCount": 794,
  "readingTime": 3.3795597484276727,
  "claps": 0,
  "voters": 0
}