{
  "id": "5e093a398147",
  "title": "Day 365",
  "createdAt": "2023-03-23 02:42:31",
  "tags": [
    "365-days"
  ],
  "url": "https://chepenikconor.medium.com/day-365-5e093a398147",
  "content": "# Day 365\n\n![](https://miro.medium.com/0*pgw-Ki4ZqlARl3uR)\n\nWe did it. 365 days of not breaking my habit of posting online. You know it's funny because I thought today was for sure going to be the day that I was so ecstatic to write and create this comprehensive piece about everything I learned.\n\nWrong. Candidly I am exhausted. I spent about 10 hours coding today and staring at a screen hurts my eyes right now. I'm writing anyways though because chopping wood and carrying water is how you become great at something. That's a reference to a book my head coach in college made me read. It's about a guy who goes to archery school and the first couple years they just chop wood and carry water. At first the guy is pissed because he committed to being at this place to become a master with the bow and they aren't doing any archery. What he later comes to realize is by the time they get to shoot arrows at the school he is beyond prepared because his body is so strong from chopping wood and carrying water.\n\nCoding is pissing me off. I feel like an idiot multiple times through out the day but then I realize I was doing everything right and just had a small typo. It's always the little things. Life is long and becoming a master at anything requires 10s of thousands of hours. For me ten years (or however long the guy spent at this archery camp I forget exactly) is not what I want to spend 10k hours on. Software engineering though 👀 . This field has peaked my interest and now I'm planning on putting in the insane amount of hours required to become great. There will be plenty of moments when I want to throw away the proverbial bucket of water but I won't because I proved to myself by writing for a year that if I set up a habit and make it non-negotiable then I will do it. Thus, I need to think of what that habit will be for coding. While I'm at Launch Academy I'm not going to commit to another habit everyday because between my running and these blogs I barely have enough time for anything else. Maybe when I graduate though I'll commit to making one commit on github a day.\n\nIn the meantime, I'm torn on what to do about these Medium posts. I am weighing starting my own blog, but I also like the convenience of writing on a platform which has already been built out. With my software engineering experience maybe I will create my own Nostr blog like I saw TFTC.io do and post here but also copy and paste my blogs on to that.\n\nSo yea to end 365 days of writing I will close with this. My new goal is to keep writing until Medium goes out of business. Which is not what I want. As a matter of fact I hope they stay in business for the rest of my life so that A. my data is still here and B. I am forced (by myself) to keep writing about my life every single day for the rest of my life. Talk about the most accurate bibliography ever lol. Maybe Medium will get bought out by a Substack like company or vice versa. Maybe they will go bankrupt as AI replaces 99.9% of blogs. I don't know what the future holds, but I do know writing everyday has improved my life significantly and I'm excited to keep doing it.\n\nNow that I think about it though I should definitely get that Nostr blog spun up so my data is held in multiple places and I own it myself. I enjoyed some Five Guys today with a friend named Jack from college. We talked about the power of establishing good habits and I couldn't stop preaching about how Nostr was going to change things for the better. Well I need to s.t.f.u and actually go take some action to make that the case. Small repeatable habits will help me get there. For example, in the beginning of this blog I didn't want to write and now I'm already typing a second paragraph even though I said I was going to end this blog in last paragraph because I got into the writing flow. So yea... to officially end my 365 days of writing I will end by noting I need to get my own Nostr relay and blog set up so I can feel better about practicing what I'm preaching. I already run my own bitcoin node so I can verify for myself. Time to do the same with Nostr.\n\n3/22/23\n\nConor Jay Chepenik",
  "wordCount": 789,
  "readingTime": 3.177358490566038,
  "claps": 50,
  "voters": 1
}