{
  "id": "5e5abdb04c9b",
  "title": "Day 1091",
  "createdAt": "2025-03-18 03:29:14",
  "tags": [
    "he",
    "died",
    "for",
    "our",
    "sins"
  ],
  "url": "https://chepenikconor.medium.com/day-1091-5e5abdb04c9b",
  "content": "# Day 1091\n\n![The King of kings. God's only Son. Jesus Christ. The Holy One.](https://miro.medium.com/1*SRzCwje5VelA_Vha6a8MKA.png)\n\nI often yearn to have witnessed the world during the time of Jesus Christ's earthly ministry, and I pray that one day, by His grace, I might live to see His glorious return.\n\n**God Uses Light to Reveal the Lost.** One of the things that's made clear to me as I learn more about the Bible is that God is always looking for dark souls to bring to the light.\n\nHaving this kind of grace and love for another person is not easy. It's something I've only experienced with my children. It's a Holy thing.\n\nI think war is one of the biggest rackets on this planet and it is one of the reasons I am endlessly grateful to exist in this era. Because I think God has made Bitcoin to help stop wars. I'm literally living through Bitcoin bringing about the best money humanity has ever had. A money that can't be printed out of thin air to fund war. Bitcoin is a modern parable of divine purpose that emerged to show humanity barter beats dropping bombs. That cooperation is better than coercion.\n\nDeep in my spirit, I sense that God has ordained Bitcoin for this moment. A testament to His providence as the foundations of old institutions crumble and new ones will be born. I am living through a Fourth Turning that is just starting to unfold.\n\nWe now have a Truthful ledger that can not be manipulated by a select few. It's a protocol for peace. A ledger for living better.\n\nMy mission is to share the transformative Truth of sound money, just as I continue to seek the eternal wisdom of the Gospel and the holiness of Jesus Christ.\n\nMay my life reflect that. Jesus teaches about walking in forgiveness, embracing grace, and cultivating humility.\n\nJesus Christ, I surrender myself wholly to You. I release my fears and doubts, trusting in Your perfect plan.\n\n![](https://miro.medium.com/1*BJzrbsrzugd5DHiOuDXCIA.png)\n\nAmen\n\n3/17/25\n\nConor Jay Chepenik",
  "wordCount": 325,
  "readingTime": 1.609748427672956,
  "claps": 0,
  "voters": 0
}