{
  "id": "615ce716f53d",
  "title": "Day 879",
  "createdAt": "2024-08-17 16:02:11",
  "tags": [
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-879-615ce716f53d",
  "content": "# Day 879\n\n![](https://miro.medium.com/1*D5BhBHyjFNTmzyfz0HzFGQ.png)\n\n🍻  Last night at a bar, I was chatting with a buddy who I've been trying to convince about Bitcoin being the best store of value. He dropped this on me:\n\n> \"Why bother with Bitcoin when I can get a 'risk-free' 5% return from Treasuries?\"\n\n🤔 At first glance, it's hard to argue. Short-term Treasuries do look pretty cozy right now. And let's face it, those Keynesian kleptocrats have a knack for kicking that can down the road. But here's where it gets spicy:\n\n1️⃣ \"Risk-free\" is the biggest illusion since WeWork's $47 billion valuation. Inflation, interest rates, and opportunity costs are lurking in the shadows, ready to crash your Treasury party.\n\n2️⃣ Fast forward a few years, and that 5% might not be the safety net you think it is. If inflation rips to 20%, suddenly your \"safe\" 5% yield is actually returning -15% in real terms. If that happens one must hope they did not buy bonds with any type of serious duration. Bitcoin, meanwhile, is doing the cha-cha with potential gains that make Treasuries look like they're stuck in a slow dance. You just have to be able to keep up with the volatility of true digital scarcity being monetized for the first time.\n\n3️⃣ The real kicker: Bitcoin has ZERO counterparty risk if held in self custody. It's like being able to keep your cake in a vault that only you can access, AND eat it too.\n\n🎭  So, what's the moral of the story?\n\nLower your time preference: Think long-term, not just about next quarter's returns.\n\nQuestion the \"risk-free\" narrative: It's about as real as unicorns or fat-free donuts that taste good.\n\nConsider the power of true ownership: In a world where few people think about or understand the risk posed by counterparties, be your own bank.\n\nEveryone knows cash is a melting ice cube so if you don't want to lose your purchasing power people are forced into the grand casino of finance. Yet, sometimes the most thrilling bet is on yourself and your ability to see beyond the immediate. Bitcoin isn't just an investment; it's a paradigm shift in how people save. It's the discovery of absolute scarcity.\n\nIn the short term my friend is very likely to be correct. Bitcoin could drop 10% easily in the coming days. However, over a 4 year time horizon I'm willing to state Bitcoin will make a meager 5% return look like Tiger woods playing golf with the local varsity golf team. What's your take? Are you Team Treasury or Team Bitcoin? Or maybe you're playing both sides?\n\n8/17/24\n\nConor Jay Chepenik",
  "wordCount": 445,
  "readingTime": 1.879245283018868,
  "claps": 0,
  "voters": 0
}