{
  "id": "61686ca60fb7",
  "title": "Day 419",
  "createdAt": "2023-05-15 14:56:31",
  "tags": [
    "habit-chain"
  ],
  "url": "https://chepenikconor.medium.com/day-419-61686ca60fb7",
  "content": "# Day 419\n\nGot up this morning and did a 2 mile run. When I woke up the desire to move my legs back and forth was not high. However, seeing my socks in my shoes was a reminder to stop being a little b****. When I got back from the run I felt amazing. Seriously makes all the difference doing those little things for success.\n\nIt is fitting that I spent time thinking about ways to make my good habits easier to achieve because for the next two weeks I will (finally) be building out Habit-Chain. I'm very excited to see this app come to life and one thing I need to consider is how to make this app efficient at getting people to stack good habits. For the form in my app where people can add a habit I think it will be important to add a section for *One thing you will do to reduce the friction for this particular habit*. I want people to think about ways they can make doing a habit easier. For example, if someone is trying to eat healthier then meal prepping the week before could be an important step so they lower the barrier for achieving their habit. The running example I gave yesterday about putting my socks into my shoes the night before is also a great step. If you're trying to save money then setting up part of your paycheck to go straight into a savings account you won't touch (or if you are a Bitcoiner like myself a smash buy DCA strategy would be more optimal because fiat punishes savers by taking their purchasing power). Saving is still great either way. One of the most important habits a person can develop.\n\nThe other things I need to include on my form will include a image URL (and an option to have the default image show up which would be something like this.) A name for the habit. Finally, a question with just \"Why is this Habit important to you?\"\n\n![](https://miro.medium.com/1*PfvmYEs69HftocEyuXyesA.png)\n\nI think this is a good start. Proud of myself for taking some time to plan this morning before I start coding. Many times I just want to go straight into my app and this exercise felt very valuable. Will have to keep this in mind for future applications!\n\n5/15/23\n\nConor Jay Chepenik",
  "wordCount": 394,
  "readingTime": 1.6867924528301885,
  "claps": 0,
  "voters": 0
}