{
  "id": "618e74772af6",
  "title": "Day 810",
  "createdAt": "2024-06-10 01:51:15",
  "tags": [
    "parenting"
  ],
  "url": "https://chepenikconor.medium.com/day-810-618e74772af6",
  "content": "# Day 810\n\nThe sun is amazing, but it can certainly make you tired. I spent Sunday morning with my family at the beach and later enjoyed a walk with my daughter as we watched the sunset. Shout out to the TushBaby for being the exoskeleton that makes it easy to carry my child. It's incredible to watch her learn to talk, a little version of me beginning to master the English language.\n\n![](https://miro.medium.com/1*57TkGDQImf-ure6DcUFZhg.png)\n\n![swan.com/conorchepenik](https://miro.medium.com/1*r4GiKdwmcVXEm7ot7WjwEw.png)\n\nKnowing I have immense agency over how my child grows up is both thrilling and humbling. She is a smart cookie, and I am committed to providing her with everything she needs to live a happy, successful, and purposeful life. Indoctrination often gets a bad rap, but the reality is that everyone is indoctrinated with something. Good parents instill values and skills in their children to help them live well, and I'm confident Sloan will figure things out - she already knows how to be adorable to get her way.\n\nIt's really amusing to watch, not just as she starts to learn a language, but also in the way she interacts. It's like babies master body language before they fully grasp verbal communication. When they combine both, it's a powerful combo. 😂\n\nBeing a parent is incredibly rewarding, and I wouldn't trade it for anything. It comes with its challenges, of course, but anything worthwhile is rarely easy. That's what makes it so fulfilling. You look back on the hardships with a great sense of pride and joy. If you're considering starting a family, I can confidently say that, in my experience, it is one of the best decisions I've ever made.\n\n6/9/24\n\nConor Jay Chepenik",
  "wordCount": 278,
  "readingTime": 1.4323899371069182,
  "claps": 1,
  "voters": 1
}