{
  "id": "61923cbe9b04",
  "title": "Day 163",
  "createdAt": "2022-09-02 01:33:14",
  "tags": [
    "ww3",
    "nation-states",
    "tech",
    "clown-world",
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-163-61923cbe9b04",
  "content": "# Day 163\n\nI decided to reread the U.S constitution and the Bill of Rights. Both are pretty based documents and I highly recommend to anyone who is interested in learning more about why the United States has been such a great place to create and preserve capital for so long.\n\n> [**The Constitution of the United States: A Transcription**](https://www.archives.gov/founding-docs/constitution-transcript)\n\n> [**The Bill of Rights**](https://www.archives.gov/founding-docs/bill-of-rights)\n\nIt saddens me how far we have strayed from what was laid out in these original documents. Biden gave a speech tonight and I didn't watch it because well the dude is practically senile at this point. Like a tech obsessed techno-sapien I got the main talking points via this Twitter thread.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/w7voa/status/1565490439783960576&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFor anyone interested enough to see what \"the leader of the free world\" said feel free to give that a read. It reminded me of when a little kid goes I know you are but what am I. Except at this point it's Biden playing with Trump and the words being thrown around in the name calling are terrorist/cheater/fascist. The ethos of the United States is beautiful. The current state is encapsulated by the 🤡 emoji. Freaking crazy man. Our forefathers are probably looking down from heaven rolling their eyes. Just going to keep doing my part to try and be the best person I can be. To continue learning and growing and trying to provide value. This thread about all the ways a nation-state can target someone is well terrifying.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/lysanderboomer/status/1565417178014384129&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI don't want to be targeted by a nation-state. Well at least not more than I already am. Mr. Fed if you are reading this I'm just trying to get by and live a good life within the rights that the U.S constitution gives me. Which include freedom of speech to call out our joke of a president. The orange man also had problems. It is a shame we have to resort to the greater of two evils. I'm hopeful in the long run Bitcoin can help fix this, but this thread is also a reminder it is going to take the masses. One individual will be killed or have his wealth beaten out of him with a wrench like that Twitter thread above pointed out.\n\nSpoke with my buddy Q today who told me the ups and downs of going all in on his own thing. The thing he truly has a passion for. Life is difficult and I got a lot of respect for Q for following his passion. I'm proud of him. I also really appreciate how he gave me his two cents candidly. It's not easy going out on your own and he mentioned some really stressful things he has had to deal with. I'm torn. At the moment I feel like I should just bust my ass for these final months and enjoy the P.T.O with my baby that my current gig will afford me. I'm glad my Dad told me to wait a week before I decided to quit. No job is perfect, but I've got great coworkers and a lot of nice perks. Plus the skills I pick up as an A.E are valuable and I get to learn a lot about technology in the role. Always got to keep a glass half full perspective.\n\n![](https://miro.medium.com/0*MEQUiYmc_y7-6Szz)\n\nI'll continue to take it day by day. I do feel better about my job than I did on Tuesday. It was hard coming back to work after a long weekend. I also think that there is some sinister \"vibes\" in the air. I don't know what exactly to call it, chakra, energy, the feeling in the air. Something has felt off these past couple days and I feel like nation-states are sleep walking towards WW3 right now. Crazy shit and I know I don't want to be in the cross hairs of any nation-state. I like being a pleb🤣.\n\nHere is a video that cracked me up.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/horrorslutz/status/1565207079782158344&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGot to keep it light anon. Until tomorrow.\n\n9/1/22\n\nConor Jay Chepenik",
  "wordCount": 709,
  "readingTime": 2.875471698113208,
  "claps": 0,
  "voters": 0
}