{
  "id": "63bc548e5418",
  "title": "Day 376",
  "createdAt": "2023-04-02 16:23:24",
  "tags": [
    "predictions"
  ],
  "url": "https://chepenikconor.medium.com/day-376-63bc548e5418",
  "content": "# Day 376\n\nHumanity is perpetually fucking around and finding out. I'm sure the first person to discover fire had to learn a hard lesson when they tried to touch it.\n\n![](https://miro.medium.com/1*7_HYTZXzJBdLLt_uLnR5-Q.jpeg)\n\nIt's a good thing they did though because fire went on to become a great tool. AI is the same way. There will no doubt be problems from this technology. If you thought my Medium yesterday was exciting then I urge you to read this post from Lopp which made me consider a side I had not thought about. Smart devices are bad enough because if something is hooked up to the internet it can be hacked. AI enabled smart devices? Oooooh boy.\n\n> [**Pax GPT**](https://blog.lopp.net/pax-gpt/?ref=cypherpunk-cogitations-newsletter)\n\nOf course this is just a dystopian future prediction. No guarantee this happens, but something we should keep in mind. It's funny because yesterday I mentioned if you fed the AI the right data it could be hilarious, but this Twitter post, which the author claims was written by chatGPT, is actually hilarious.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/gfodor/status/1642551828591304706%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI was crying from laughter. I know it's not too late to start investing in the short Cramer ETF but the only thing I'm more bullish on than that is Bitcoin. Still amazing how wrong Jim has been.\n\nComedy comes from truth. While that twitter thread is hilarious it also has a good lesson. If someone is consistently wrong then there is value in fading their predictions. I just learned about Bill Kristol from this Twitter thread but a quick search shows this guy is constantly wrong. I'm too lazy to look up his take on Bitcoin but I know that Jim and Paul are bearish on it.If Cramer and Krugman are telling you not to buy Bitcoin... well you would be unwise to follow their advice.\n\n4/2/23\n\nConor Jay Chepenik",
  "wordCount": 317,
  "readingTime": 1.3962264150943395,
  "claps": 0,
  "voters": 0
}