{
  "id": "647d5a73e9d0",
  "title": "Day 805",
  "createdAt": "2024-06-05 01:05:41",
  "tags": [],
  "url": "https://chepenikconor.medium.com/day-805-647d5a73e9d0",
  "content": "# Day 805\n\n**The Impact of Lost Bitcoins on the Bitcoin Valuation**\n\nPeople often wonder about the impact of lost Bitcoins on Bitcoin valuation. To illustrate this, imagine attending a grand birthday party with thousands of guests, where a magnificent cake is the centerpiece. However, there are only 500 pieces available. As everyone eagerly awaits their slice, 100 pieces suddenly vanish. This unexpected disappearance makes the remaining slices even more valuable. This simple analogy aptly mirrors the dynamics of Bitcoin, where the loss of bitcoins enhances their value due to the fundamental principles of supply and demand.\n\nHowever, this analogy is not perfect. While most people might want a piece of cake, some might be gluten-free, others vegan, and some might simply prefer other desserts. Money, on the other hand, is something nearly everyone uses. This universality makes the scarcity of Bitcoin even more impactful.\n\nIn the early days, it was easier to lose access to Bitcoin holdings, much like misplacing a treasure chest key. Many have unfortunately lost access to their bitcoins, rendering them inaccessible forever. Estimates suggest that up to 20% of all bitcoins mined are lost forever. These lost bitcoins, trapped in forgotten wallets or rendered inaccessible due to lost keys, effectively reduce the total supply.\n\nTo grasp the impact, consider some numbers. Out of the 21 million bitcoins that will ever exist, around 19.7 million have been mined to date. If 20% of these are lost, that's approximately 3.94 million bitcoins gone forever. This leaves slightly under 16 million bitcoins in circulation at the time of this writing. Overlay this with the growing demand for Bitcoin, and the picture becomes clearer.\n\nBack to my cake analogy: when pieces suddenly vanish, those who have slices realize their increased value. Imagine the chef of this cake, Baketoshi Cakeamoto, is the best cake maker ever. Some might sell their piece when they realize how much others will pay for it, but plenty of others will savor it, knowing \"there is no second-best cake.\"\n\nAccording to Glassnode, a blockchain analysis firm, the number of active Bitcoin addresses spikes during price run-ups, indicating increased participation and trading activity. These spikes suggest that as Bitcoin's price rises denominated in dollars, more users become active, either to buy, sell, or trade, reflecting heightened market interest and adoption. This dynamic further underscores the importance of scarcity in driving Bitcoin's value.\n\n![](https://miro.medium.com/0*1X7HoGFa0ioUiaZe)\n\nBitcoin's supply cap of 21 million stands in stark contrast to fiat currencies, which can be printed endlessly. This fixed supply creates inherent scarcity. When bitcoins are lost, the effective supply shrinks, intensifying this scarcity. If supply remains constant while demand increases, prices will rise.\n\nPain is the best teacher, and Bitcoin is increasingly viewed as digital gold - a hedge against inflation and economic instability. As traditional currencies face devaluation, more individuals and institutions turn to Bitcoin as a store of value, driving up its demand and, consequently, its price.\n\nThe Bitcoin network operates on a well-designed incentive system. Miners validate transactions and secure the network, earning new bitcoins as rewards. These rewards halve approximately every four years in an event known as the \"halving,\" reducing the rate at which new bitcoins enter circulation. This decreasing supply flow is a crucial aspect of Bitcoin's deflationary nature.\n\nMoreover, Bitcoin's decentralized nature ensures no single entity can manipulate its supply, unlike fiat currencies where central banks influence monetary policy. Bitcoin's transparent and predictable protocol provides certainty in an uncertain economic landscape.\n\nAs supply decreases and demand increases, upward pressure on price is inevitable. Historical data supports this: after each halving event, Bitcoin's price typically experiences significant growth, aligning with the supply and demand dynamics at play.\n\n![Made this chart myself with Python](https://miro.medium.com/0*OMWyWbb95FjiRZYY)\n\nIt's important to remember that while these principles suggest Bitcoin's price will rise as supply decreases and demand increases, this is not guaranteed financial advice. Bitcoin is highly volatile and influenced by numerous factors beyond supply and demand.\n\nThe phenomenon of lost bitcoins exemplifies the paradox of value in the digital age. Each lost bitcoin contributes to the scarcity that enhances the value of those that remain. The Bitcoin network's incentive structure, coupled with its fixed supply and growing demand, creates a unique economic dynamic.\n\nAs the block reward continues to decrease, transaction fees will increasingly compensate miners, ensuring the network's security and functionality. This shift underscores Bitcoin's robust economic model, where scarcity drives value and transaction fees maintain network incentives.\n\nIn conclusion, the impact of lost bitcoins on the Bitcoin valuation underscores a fundamental economic principle: scarcity drives value. This, coupled with Bitcoin's robust incentive structure, suggests that the future remains bright for this pioneering digital asset.\n\n6/4/24\n\nConor Jay Chepenik",
  "wordCount": 776,
  "readingTime": 3.311635220125786,
  "claps": 0,
  "voters": 0
}