{
  "id": "64e2153fea3c",
  "title": "Day 925",
  "createdAt": "2024-10-03 01:44:31",
  "tags": [
    "kids"
  ],
  "url": "https://chepenikconor.medium.com/day-925-64e2153fea3c",
  "content": "# Day 925\n\n![I wonder what kind of shit Andy Warhol would make with AI](https://miro.medium.com/1*ycit2E6jlSUdiBrTe-6Srw.png)\n\nChildren are remarkable little imitators. Tonight, my lady was preparing milk for our little lady, Sloan. In a moment of clumsiness, she dropped the bottle and reflexively blurted out, \"f***!\" Without missing a beat, our daughter - always attentive - immediately began parroting, \"f***, f***, f***.\" I tried to contain my laughter, but honestly, it was too adorable. There's nothing quite like hearing your child's first curse word in a tiny, innocent voice.\n\nKids are funny that way - they're sponges, soaking up everything around them. But more than that, they are pure joy. Their carefree, happy-go-lucky energy is downright infectious. It's one of the greatest things about being around them. It is sad that much of corporate culture seems to frown upon this kind of happiness. There's this strong push to prioritize career advancement over starting a family, as if kids are a burden and not a source of incredible joy.\n\nI truly believe most people would be much happier with a bunch of children than climbing the corporate ladder, especially when you consider how many jobs involve staring at screens and clicking keys all day. I mean, I love my work in the Bitcoin industry, but it doesn't hold a candle to the joy of being a father.\n\nNow, imagine someone who doesn't even love their job and is just grinding to get by. Ten, twenty years down the road, they might look back and think, \"Man, I should've had kids. A mini-me would've been a lot more fulfilling than that promotion I barely remember.\" And sure, not everyone can have biological children, but adoption is always a beautiful and fulfilling option.\n\nThere's something profoundly meaningful about giving your life to another person - voluntarily, of course. It's not like being forced to die for a tyrant in some pointless war. No, this is a decision to give, to nurture, to love. And that kind of choice fills your life with purpose.\n\nSo yeah, the TL;DR here is: have more kids. They are pure joy, and I'm grateful for mine every day. In fact, I just said a prayer asking God to bless me with seven children. My wife is not on board with that number yet - she's already carried one and knows the \"heavy lifting\" part - but hey, she's a trooper, and what's six more? 😄\n\nIn all seriousness, kids are incredible, and I hope more people realize that sooner rather than later. You won't regret it anon.\n\n10/2/24\n\nConor Jay Chepenik",
  "wordCount": 422,
  "readingTime": 1.7924528301886793,
  "claps": 0,
  "voters": 0
}