{
  "id": "65699cf0135f",
  "title": "Day 832",
  "createdAt": "2024-07-02 02:50:47",
  "tags": [
    "beauty",
    "nietzsche",
    "dancing"
  ],
  "url": "https://chepenikconor.medium.com/day-832-65699cf0135f",
  "content": "# Day 832\n\nTwo Nietzsche quotes have captured my attention recently. The first, often attributed to him, goes:\n\n> \"And those who were seen dancing were thought to be insane by those who could not hear the music.\"\n\nHowever, its authenticity is debatable. [An article I read](https://jeffreynall.substack.com/p/nietzsche-didnt-say-that-but-he-wouldve) claims that The Times of London once published a similar phrase:\n\n> \"They who dance are thought mad by those who hear not the music.\"\n\nAdmittedly, the British version has a certain appeal to me. Given that Nietzsche wrote in German, it's not surprising that various translations exist. What strikes me as both humorous and profound about this quote is how it resonated with a recent personal experience.\n\nAfter my run today in the sweltering Florida heat, which felt like 100 degrees, though it was probably closer to 90, I returned to my apartment, music blasting through my headphones. Before the run I decided I would complete two miles non-stop despite the intense heat. A will to power was needed on this run because I was eager to quit and just walk many times throughout, but my music kept me going.\n\nBack home, still riding the high of endorphins and rhythm, I found myself dancing to the beat. My year-and-a-half-old daughter caught sight of me in this uninhibited state - a sight that might have appeared 'mad' to any other observer. Yet, without hesitation, she joined in, moving to a beat she couldn't hear but could clearly feel.\n\nThis moment illustrated the quote's wisdom perfectly. My daughter, unburdened by adult inhibitions, saw joy in motion and instinctively participated. It occurs to me that there's a lesson here for all of us: When we encounter others in moments of apparent madness or inexplicable joy, perhaps we should join in rather than judge. We might not hear their music, but we can choose to dance anyway.\n\nThe experience was a poignant reminder that vibes can be shared or stifled. While adults often hesitate, children - like my daughter - embrace the moment without reservation. I found myself thoroughly enjoying our impromptu dance party, grateful for her unrestrained enthusiasm.\n\n![[https://x.com/ConorChepenik/status/1807960832837386536](https://x.com/ConorChepenik/status/1807960832837386536)](https://miro.medium.com/1*Cwi7C7pRO13d6cfKhTBHwQ.png)\n\nThe other Nietzsche quote on my mind is:\n\n> \"If you crush a cockroach, you're a hero. If you crush a beautiful butterfly, you're a villain. Morals have aesthetic criteria.\"\n\nThis quote resonates with the dancing scenario in an unexpected way. Had I been dancing poorly, my daughter might have looked at me strangely rather than joining in. She sensed the positive energy radiating from me - a proud, confident, and boastful energy that was palpable.\n\nIt's tempting to claim that a cockroach and a butterfly are equal, but our instinctive reactions suggest otherwise. We respond viscerally to ugliness and beauty, to graceful movement and awkward flailing. My daughter's reaction to my dance was not just about movement, but about the quality and energy behind it.\n\nThis interplay between aesthetics and morality, between perception and judgment, adds another layer to the dancing metaphor. It suggests that while hearing the music can help us understand the dance, it's not always necessary. Sometimes, simply witnessing someone dancing with joy and positive energy can be enough to inspire us to join in. The beauty and enthusiasm of the performance can transcend the need for a shared auditory experience, inviting us to participate in the joy even if we can't hear the music.\n\nIn the end, these experiences and reflections remind us of the complex interplay between our actions, perceptions, and judgments. They challenge us to look beyond surface appearances, to seek more than just the music behind the dance, and to find beauty in unexpected places - like a father's exultant, sweat-drenched victory dance after conquering a grueling run.\n\n![](https://miro.medium.com/1*vHHs5hNUitpUCLZ35-ageg.png)\n\n7/1/24\n\nConor Jay Chepenik",
  "wordCount": 625,
  "readingTime": 2.7418238993710693,
  "claps": 1,
  "voters": 1
}