{
  "id": "6600f3fd8712",
  "title": "Day 816",
  "createdAt": "2024-06-16 03:08:22",
  "tags": [
    "bitcoin",
    "rules",
    "all-over-the-place",
    "capitalism",
    "good"
  ],
  "url": "https://chepenikconor.medium.com/day-816-6600f3fd8712",
  "content": "# Day 816\n\nI prefer systems where the rules are inherent to the protocol, eliminating the need for a referee. Bitcoin is an opt-in system that operates without requiring a securities and exchange commission. It functions seamlessly when participants adhere to the protocol rules. There's no monopoly on violence to impose further harm on any party, even if they committed a crime. Bitcoin is ruthless capitalism. Good.\n\n![[https://x.com/ErikVoorhees/status/1802005734474817624](https://x.com/ErikVoorhees/status/1802005734474817624)](https://miro.medium.com/1*ZnLNdYaP3ib8Ty9b3KvjNA.png)\n\nFines imposed by the U.S. Securities and Exchange Commission (SEC) typically go to the U.S. Treasury. When the SEC takes enforcement action against a company or individual, the fines are collected by the SEC and then transferred to the U.S. Treasury. The SEC uses the funds collected from fines to support its regulatory activities and programs. This means that the money collected from fines does not always directly benefit the victims of securities fraud or other violations.\n\nVictims may, however, receive restitution as part of an SEC enforcement action. Restitution is money paid directly to the victims of the fraud or violation to compensate them for their losses. The SEC may also require the defendant to provide restitution as a condition of settlement or as part of a court order. The Sarbanes-Oxley Act introduced the \"[Fair Funds for Investors](https://www.investopedia.com/terms/f/fairfundsforinvestors.asp#:~:text=Key%20Takeaways-,The%20Fair%20Funds%20for%20Investors%20provision%20was%20introduced%20in%202002,and%20fines%20to%20defrauded%20investors.)\" provision, which allows the SEC to distribute money collected from penalties and disgorgement to harmed investors. While the split of these funds may vary from case to case, it would be interesting to know the average distribution of these funds to understand how they benefit those affected by securities law violations.\n\nOn the one hand, I find it annoying that the state allegedly holds a monopoly on violence. However, without this monopoly, laws would not be enforceable, as there would be no deterrent to ensure compliance. Bitcoin is better because it relies on incentives to promote adherence to its rules. I prefer this carrot approach to the stick of state enforced compliance.\n\nThe integration of AI in the legal and regulatory landscape will revolutionize the way laws and regulations are created, enforced, and understood. Imagine having an AI assistant that can analyze complex legal documents, such as senate bills or lengthy financial filings, in a matter of seconds, providing users with a concise and accurate summary of the contents. This technology has the potential to increase transparency, streamline compliance, and facilitate more effective regulation. In the context of securities law, AI could help identify potential violations, enable more targeted enforcement actions, and expedite the restitution process for harmed investors. By automating tedious tasks, AI can free up human resources to focus on higher-level decision-making, ultimately leading to more just and equitable outcomes. The possibilities are vast, and the potential benefits of AI in the legal and regulatory sphere are undeniable.\n\nEspecially since AI will utilize Bitcoin, an honest, just, fair, permissionless, and cryptographically secure form of money. Not fiat cuck bucks which are created out of thin air by the Federal Reserve and Treasury through debt.\n\n![](https://miro.medium.com/1*AH4Ggc3DaKXzyfQmBQ12Yg.png)\n\nFind the silver lining in every challenge. As the saying goes, insanity is doing the same thing over and over and expecting different results. Instead, we should adjust our approach to achieve better outcomes. An optimist would call this getting better & a pessimist might say we strive for slightly less painful results, either way any improvement signifies progress, and that's a positive direction.\n\nCheers to getting better!\n\n6/15/24\n\nConor Jay Chepenik",
  "wordCount": 567,
  "readingTime": 2.5229559748427675,
  "claps": 0,
  "voters": 0
}