{
  "id": "661c7a30eaf",
  "title": "What Happened To Moderation",
  "createdAt": "2021-10-08 21:54:59",
  "tags": [
    "bitcoin",
    "freedom",
    "anti-authoritarian",
    "open-mind",
    "technology"
  ],
  "url": "https://chepenikconor.medium.com/what-happened-to-moderation-661c7a30eaf",
  "content": "# What Happened To Moderation\n\nEvery day I wake up overwhelmed because there is an abundance of data out there. Trying to sort through it all with filters such as Twitter, Medium, Google, and all the other tech companies seems like a rat race as the amount of stuff I can consume in a lifetime is posted on a daily basis by billions of people in the world. There simply is not enough time in a day for me to ever catch up with all the content constantly being put online. At this point it's hard not to think of humans as cyborgs. If you disagree think for a second what a person can do with a smartphone vs without. As we enter more into the metaverse it is an incredibly exciting time but it's also a time to be very vocal about what we will and will not tolerate from our governments.\n\nI see Central Banks talking about developing CBDC's and I just cringe. Why doesn't the government understand that we don't want more oversight into our finances. I'm getting taxed a ridiculous amount already living in Massachusetts and I make under 100K a year currently. Inflation is a hidden tax on top of this. The government decided to print around 40% of the overall money supply when Covid hit and that led to my 2019 Jeep Cherookee appreciating $4,000 dollars despite me putting 20K miles on it. I'll admit supply change issues also had an impact on this, but it's still crazy to think that my used car was the best investment I made in 2020. (Should've bought way more Bitcoin rather than just hold onto the tiny amount I had from 2017 but hindsight is 20–20)\n\nAnyways, I'm far from having all the answers. I just know the more I learn about Bitcoin and other cryptocurrencies it seems like a no brainer for the US to embrace. Why should we trust Politicians and Bankers with our money when we know for a fact software is going to do as it's programmed. I like to think that if given power I wouldn't let it corrupt me, but I'm probably wrong. I don't think the higher ups in the U.S government set out to screw the American people, but that's exactly what they did when they printed money and devalued their citizens purchasing power. Bitcoin is hard money you can't fuck with. It's a currency no person can increase the amount of and a system that allows you to keep your privacy, but has an open ledger. Imagine the outrage if the public could have the same transparency into the 1%'s wealth as we do on the Bitcoin ledger. I know the Pandora Papers that recently leaked are giving the general public a glimpse into some of the things going on, but my guess is that's probably just the tip of the iceberg.\n\nWe live in such an exciting time with so many opportunities and things to consume, collect and create on Web 3. That being said, we must fight vigorously to make sure authoratian regimes don't hinder the development of Web 3 and try and use the internet to polarize and control the masses like we saw with many web 2 applications. Give the data back to the user and watch as a new, better world is created IRL and online. Transperancy and privacy will set us free. With governments you get neither. With Bitcoin you get the best of both.\n\nP.S I like all kinds of cryptos, but I think Bitcoin is the best shot we have at a truly decentralized currency since Satoshi remains anonymous and the fact it's Market Cap has surpassed 1 trillion. I've even started the process trying to run my own Bitcoin node because A. I want to make the Bitcoin Network stronger and B. I firmly believe in the Ethos of Indivudual rights and privacy that is so abundant amongst orange pilled people. I'm always willing to change my mind if new data presents itself but from everything I've learned about it Bitcoin seems like the best bet to give individuals back their rights and prevent governments from corrupting the money.\n\nP.S.S There is nothing wrong or bad about making money. I think it's a shame we are seeing people demonized for doing so when it's actually a great thing and one we should commend others for doing. What I think is wrong is having an incompetent third party get to decide when and how money gets to be created and spent. Most governments around the world did this when Covid put everyone on lockdown and I think the results speak for themselves so far.\n\n10/8/21\n\nConor Chepenik",
  "wordCount": 786,
  "readingTime": 2.9660377358490564,
  "claps": 0,
  "voters": 0
}