{
  "id": "6647ab263203",
  "title": "Learning To Love Suffering",
  "createdAt": "2021-04-02 12:38:48",
  "tags": [
    "suffering",
    "running",
    "cryptocurrency",
    "thoughts",
    "gratitude"
  ],
  "url": "https://chepenikconor.medium.com/learning-to-love-suffering-6647ab263203",
  "content": "# Learning To Love Suffering\n\nI told myself this month I will run 100 kilometers. No April fools either that is my plan. 3.64 miles yesterday and I'm already sore as hell haha. It's a good start though and if I run about 3 miles every day 3x30 = 90 miles which are way more than 100 kilometers or 62 miles roughly. My point being consistency is key.\n\nI need to start writing on here more often. Even if my thoughts are jumbled and incoherent at times I'm sure I will still get a kick out of reading this later. I know it's unorthodox to put a \"journal\" online, but A. I've accepted the fact I'm not special, and B. I need to get comfortable not caring what others think. I remember when I first started my sales job I dreaded the office because the only thought running through my head was I'm about to have a day of getting yelled at over the phone. The truth is when someone is mean to you over the phone it's a reflection of themselves, not the cold caller 99.9% of the time. I'll prove it: yesterday I flipped out on a car warranty salesperson because I was in a shit mood. I felt bad about it later because I know how hard cold calling can be, but this poor woman caught me at a terrible time and I took my anger out on her. I wish I hadn't been such an ass, but at the time I was in a terrible mood and it felt good to take my anger out on someone. That's when it clicked what do I give a shit about the asshole prospects in the world who I cold call and they blow up. There are over 300 million people in the United States and if someone is an ass on to the next dial. The better I've gotten at understanding this the better I feel in general. Sales are hard, but you can make it much easier on yourself if you focus on the controllables and constantly remind yourself when someone is a dickhead that it's them, not you who is having a bad day.\n\nI use to hate running, but without sports in my life (besides the occasional golf and pickup basketball) running keeps me sane. It's therapeutic and feels so good for my body. I need to be better about proper hydration and food intake, but I can tell what a positive impact it's having on my mental and physical health. When I feel the wind against my back, the sun on my face, and my feet almost floating one after the other it feels like pure euphoria. Don't get me wrong there are times when I'm running and thinking this is hard, but then I remind myself to smile I can feel the dopamine and serotonin getting released in my brain. Running is not the only exercise that can give us a sense of euphoria, but I've found it's what works for me and I'm proud of it.\n\nIn conclusion, this piece was all over the place, but I'll be damned if it doesn't feel good to just write my thoughts out. If anyone took the time to read this thank you. I hope you find whatever gives you joy and makes your life that much better. All humans in the world suffer. Even the ultra-rich have their own set of problems despite having food and shelter for the rest of their lives. Human minds are damn complex and if you don't find the thing that calms you down, grounds you, and makes you feel like you are floating then keep looking.\n\nAlso, do yourself a favor and buy some bitcoin. (Not financial advice always do your own research)\n\nConor Chepenik\n\n4/2/2021",
  "wordCount": 638,
  "readingTime": 2.4075471698113207,
  "claps": 0,
  "voters": 0
}