{
  "id": "66b1d2a07ff",
  "title": "We All Have A Story To Tell",
  "createdAt": "2022-01-26 04:31:11",
  "tags": [
    "inspiration",
    "tech",
    "living",
    "anon",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/we-all-have-a-story-to-tell-66b1d2a07ff",
  "content": "# We All Have A Story To Tell\n\nAlgorithms are getting better by the day at filtering us all content that keeps us scrolling. Social media feeds are full of stuff that makes the end-user feel excited, angry, hungry, horny, and a bunch of other intense emotions. What social media feeds typically don't feed the end-user is inspiring content. There are exceptions to this for people who have taken the time to curate their feeds with specific topics and people so they can increase their productivity in this information age. However, the majority of feeds don't enable people to tell their unique stories. It's easy to lose sight of how incredible our own lives are when social media is filled with the most extreme outcomes in society.\n\nAs an adult, it is both liberating and terrifying to realize no one has it all figured out. Even most world leaders, or should I say especially most word leaders after these past two years, don't have a clue what the correct choice is. We can look back on history to try and learn from our ancestors, but in most cases, people do not do this. Instead they forge ahead based on their gut feeling. Luckily, our gut has a cat's brain worth of neurons and can guide us to make the right choice. I imagine some of the toughest decisions ever made were based on a gut feeling. (Sometimes I imagine Satoshi getting a gut feel it's time to let this Bitcoin run its course. In hindsight this decision has been great but at the time was probably frightening)\n\nSo when in doubt listen to your body. Do things that you know are good and that excite you. No one ever regretted chasing their passions, if they chased after what they were truly passionate about. This is the other tough part about being an adult. It's hard to figure out who we really are and where our passions lie. Constantly being bombarded with society's burdens makes finding yourself difficult. Sex, drugs, alcohol, and social media are one thing in moderation, but a whole other thing when they're being used to fill a void. Don't be afraid to disconnect anon. Don't be afraid to take everything with a grain of salt. Don't be afraid to change your passion. Most importantly don't be afraid to keep an open mind for the rest of your life. The only constant in life is change (also death and taxes seemingly🥲). Closing your mind only serves to ruin life, not remind you how special it is.\n\nI guess what I'm trying to say is never stop trying to figure out life. Never stop searching for meaning. Figuring out our mission in life often comes from understanding ourselves. By taking everything with a grain of salt it's easier to see who is being manipulative and who really believes in what they're saying. There is so much to live for and if we get caught up in other people's narratives we lose sight of our own. Never stop exploring anon. You are destined for greatness, even if greatness for you is reading a random blog from someone who likes shit posting and learning about Bitcoin a little too much.",
  "wordCount": 540,
  "readingTime": 2.0377358490566038,
  "claps": 0,
  "voters": 0
}