{
  "id": "66d1acf68496",
  "title": "Day 114",
  "createdAt": "2022-07-14 20:29:14",
  "tags": [
    "fiat",
    "bitcoin",
    "incentives",
    "time-preference",
    "plebs"
  ],
  "url": "https://chepenikconor.medium.com/day-114-66d1acf68496",
  "content": "# Day 114\n\nToday I am thinking about incentives. They are the bedrock of human action. Crushed a nice run today because I am incentivized to get in better shape for a variety of reasons. It helps me feel better, it makes my partner more attracted to me, I get to boast in my group chat titled \"proof of work\" to my buddies, and it means I will live longer which will allow me to cherish the fruits of my labor with those I love. Usually, I'll just put on my shoes and head out the door because running has become a habit when I'm working from home, but after thinking through what causes me to actually run I realized there are multiple incentives that encourage me to exercise. There are so many actions that people take without thinking through the incentives or reasoning for doing so. This is perfectly fine and reasonable since our time on earth is finite, but I do think there is a lot of value in thinking through why we do the things we do. The more I learn the more I become convinced our current system is fucking up incentives. There is no time in a high-time preference society to think through the incentives of all your actions. Listened to an incredible podcast while I was running and it really opened my mind to how much time it takes to produce stuff. A good example that was discussed on the podcast is trees, something I always take for granted. It's the trees that provide me with both oxygen and much-needed shade during the summer. These trees took years to grow and become the massive plants they are today, yet I've always ignored their importance. I know it might sound silly or granola to be like \"OH MY GOD THANK YOU SO MUCH TREE\" but honestly plants are crucial to life on this planet and most days I'm more concerned about the central bankers interest rate hikes. I don't even like the central bank I just want to see what they do so I can better understand how Bitcoin is reacting. For most people, you could replace \"central bankers interest rate hikes\" with whatever fad is popular on social media at the time. Here is the podcast that really helped change my perspective for the better.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F0lwdkJXOSYfO7O6iND62bv%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F0lwdkJXOSYfO7O6iND62bv&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f52a174933e989328cee61508&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nI know I recommend a lot of podcasts on these medium journal posts but this one was an absolute banger. Fresh off the high of the Boston Bitcoin meetup I find it amazing how interconnected the Bitcoin community is. The guy who hosted the Bitcoin meetup in Boston was talking about how many famous Bitcoiners had come to that very meetup. I was lowkey fanboying at the potential to meet some famous Bitcoiners, but it is pods like this one that remind me it is often the plebs who have some of the most interesting perspectives. Makes me want to go to even more Bitcoin meetups so I can meet more plebs and if I meet a famous Bitcoiner, sweet that's just the cherry on top of this decentralized cake. This guy hodlrev was invited on a pretty famous podcast because he let another Bitcoiner stay with him who is riding across the country on a motorcycle going to Bitcoin meetups. It's truly wild how the more Bitcoiners I listen to the more convinced I become this new system is inevitable. Hodlrev talked about all the ways he utilizes the land he lives on to be more sustainable, and how as a result he has a much greater appreciation for nature. The dude mentioned he used to live in big cities and how much he took for granted the convenience of everything. It is very humbling to think through how reliant I am on a system that seems to be breaking. As a Bitcoiner, I am incentivized to become more self-sovereign because I see these cracks in the fiat system and want to be able to provide for my family and loved ones. I know I have a long way to go as I'm still living in the city now. I also think many are just plain unaware of how flawed our current society has become due to fiat and are content to just stare at their phones all day. Shit, I still stare at screens way too much. While I hope more people break out of the digital chains social media is putting people in the silver lining seems to be that this will make the demise of fiat much slower. I do think this demise is inevitable, but it will take the masses waking up and demanding change. Unfortunately and fortunately pain is the best teacher and the masses will mobilize if the clown show doesn't stop with their heinous fiat decrees. Thus, I'm glad to have my meat freezer in case I'm wrong and this thing comes crashing down quickly. However, I'd like to see a gradual transition to a Bitcoin standard so I can have some time to make my own \"homeship\" and learn a thing or two before society shits the bed.\n\nWho knows how this all goes down. Society is such a complex system with trillions of variables. It gives me a lot of hope to see there are Bitcoiners, famous ones and plebs, who are thinking through what a better world could look like. These incredible people remind me that a more efficient world where people lower their time preference is possible. Don't ever underestimate the power of humbly stacking sats so we can start to create a world we would be proud to pass on to our grandchildren anon.\n\nFinal thought: GDP is a bullshit metric to base the economy on. Growth at all costs is unsustainable when we have finite resources. I'm so happy that I can save my wealth in something that will allow for deflation to occur so my grandchildren can spend more time doing stuff they want rather than \"pretending to look busy\" at work so their boss is happy. Keep your head up a Bitcoin standard is coming sooner or later :)\n\n7/14/22\n\nConor Jay Chepenik",
  "wordCount": 1032,
  "readingTime": 3.8943396226415095,
  "claps": 0,
  "voters": 0
}