{
  "id": "6a2df8e61a92",
  "title": "Day 652",
  "createdAt": "2024-01-04 02:46:33",
  "tags": [
    "swan",
    "bitcoin",
    "bitcoins-birthday",
    "new-job",
    "blessed"
  ],
  "url": "https://chepenikconor.medium.com/day-652-6a2df8e61a92",
  "content": "# Day 652\n\nToday is the birthday of Bitcoin. Which makes the Bitcoin network officially 15 years old today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/Crypto_Mags/status/1742707165834489911%3Fs%3D2&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nCould not be a better day to announce that I got some big news! I have joined [Swan](https://www.swanbitcoin.com/conorchepenik) as a Bitcoin Adoption Specialist. Which meant today I had to resign from Fidelity. Before delving further into the details of my new position it's important to note that Fidelity is an incredible organization. The people there are an absolute class act. My manager was understanding and while my intention was not to work for Fidelity for less than a month, when your dream job arises you need to go for it.\n\nSo if you are into traditional finance and looking for a job or brokerage account I want to note that Fidelity is a top tier choice. Seriously, they treat their employees well and that seems to be a rare thing in trad-fi. With that said, I can not wait to help orange pill more of the world. Swan is growing quickly and I'm thrilled to contribute to the mission of advocating for what's best for Bitcoin and Bitcoiners.\n\nGod is good. My Dad prayed for this and so did I. Hard to put into words what it feels like being hired for a position that resonates so deeply with my own beliefs. Also pumped because now I don't have to write under a pen name for articles with Bitcoin Magazine, Bitcoinnews, The Common Sense Movement and any other platform which is nice enough to to share my work on their platform.\n\nI'm going to bust my ass in this new position. I feel beyond grateful that Swan selected me for this job. It was a position that I have been gunning for, for over six months now. To see it finally come true and the ability to leave a trad-fi position for a Bitcoin one on the 15th year of Bitcoin being a functioning network is truly amazing. Sometimes things just work out perfectly: shout out to God & Fate & The Universe & Myself!\n\n![](https://miro.medium.com/0*CsdqiNfe-m5d9iS5)\n\n1/3/24\n\nConor Jay Chepenik",
  "wordCount": 349,
  "readingTime": 1.5169811320754716,
  "claps": 1,
  "voters": 1
}