{
  "id": "6a61c4b1c89a",
  "title": "Day 356",
  "createdAt": "2023-03-14 02:09:37",
  "tags": [
    "bitcoin",
    "home-births"
  ],
  "url": "https://chepenikconor.medium.com/day-356-6a61c4b1c89a",
  "content": "# Day 356\n\nWhen my partner initially mentioned a home birth for our first child, I didn't give it much thought. As a man, I had limited knowledge of what childbirth entails. However, upon discovering that in 2021, [cesarean deliveries accounted for 32.1% of live births in the United States](https://www.marchofdimes.org/peristats/data?reg=99&top=8&stop=355&lev=1&slev=1&obj=1), I was taken aback. I also learned inducing women early is common practice in the hospital. One [study](https://journals.lww.com/greenjournal/Fulltext/2019/05000/Prediction_of_Success_in_External_Cephalic_Version.3.aspx) published in the Obstetrics and Gynecology journal shows that routine induction at 41 weeks of gestation did not reduce the risk of adverse birth outcomes compared to letting women give birth beyond their due date. Furthermore, epidurals containing fentanyl have been known to cause difficulties in babies latching on to their mothers' breasts. These statistics made me realize the importance of trusting our bodies, which have evolved over hundreds of thousands of years to do what they are designed to do. At first, a home birth seemed like a neat idea. After learning about these statistics from my partner, it became clear a home birth was our best option.\n\nNow, you might be wondering why an essay on Bitcoin Magazine is discussing childbirth. The answer is simple: Bitcoin, like home birth, is rooted in the idea of trusting oneself and one's own abilities. Bitcoin is a decentralized digital currency that enables secure and private transactions without intermediaries such as banks or governments. Investing in Bitcoin is a way of trusting in your own ability to manage your financial assets. Both decisions require critical thinking, informed decision-making, and a willingness to take control of one's own life. It's important to make informed decisions that align with your values and preferences, as not everyone is suited for home birth or Bitcoin.\n\n![](https://miro.medium.com/0*dB7cyIJGwTZst-x-)\n\nWhile it's crucial to appreciate healthcare professionals who ensure proper childbirth care, it's equally important to recognize that trusting one's body is a valid and often beneficial approach. Fear-based decision-making should be avoided, and critical thinking is necessary when making childbirth decisions. Home birthing can be scary and so can keeping a large part of your wealth in Bitcoin. Empowering individuals, rather than fear mongering them, will help people make decisions that are in their best interest.\n\nJust because someone in a position of authority recommends a particular course of action, it doesn't necessarily mean that it's the right choice for you. For example, some doctors may recommend a hospital birth or some bankers may recommend keeping your money in a bank due to the perceived safety and security of those institutions. Don't accept this without verifying for yourself. Always do your own research and weigh the potential benefits and drawbacks of each option. For instance, while hospital births may offer access to advanced medical equipment and professionals, they also carry a higher risk of medical intervention and complications. Similarly, while banks may offer convenience and the perception of safety, they also carry the risk of loss due to inflation or bank failures. As we've seen with the collapse of Silvergate, SVB, and Signature bank it doesn't take much for a bank run to happen in our digital world. Sure the Fed, Treasury, and FDIC [just announced](https://www.federalreserve.gov/newsevents/pressreleases/monetary20230312b.htm),\n\n> After receiving a recommendation from the boards of the FDIC and the Federal Reserve, and consulting with the President, Secretary Yellen approved actions enabling the FDIC to complete its resolution of Silicon Valley Bank, Santa Clara, California, in a manner that fully protects all depositors. Depositors will have access to all of their money starting Monday, March 13. No losses associated with the resolution of Silicon Valley Bank will be borne by the taxpayer.\n\nWhat they are not letting on is this means inflation is going to rip again as they print money to make these depositors whole again. By taking the time to educate yourself and make informed decisions, you can maintain your autonomy and make choices that align with your values and goals.\n\nOne reason people argue that you should keep your money in a bank instead of bitcoin is because with bitcoin you have no recourse to recoup your funds if you miss something up. This is correct. You are responsible for your UTXOs full stop. If you fat finger a Bitcoin transaction there is no bank to call and tell them to freeze that transaction. This is the trade off you face when holding your private keys. With more freedom comes more responsibility. Bitcoin and home birthing are not for the weak and dependent. I'm proud of my partner for choosing a home birth, and our healthy, happy, and well-behaved baby is a testament to the benefits of trusting one's body. While there are undoubtedly instances where doctors and banks have saved lives and money, respectively, both rely on trusting a third party. Being sovereign means taking independent action and minimizing outside interference.\n\nOf course there are trade offs with everything. I have lost bitcoin due to stupidity. I'm sure there are horror stories out there of people losing their child due to lack of medical care. I can only speak from anecdotal evidence but I think there is immense value in being as sovereign as possible. It's unfortunate watching banks fail and mothers get hurt because of the current system we have. I don't think most of the people in these systems are evil. They are just inside a corrupt system. If you are willing, able and sovereign I believe there is immense value in holding your own bitcoin and giving birth at home. If you are really sovereign maybe even consider free birthing. Which means giving birth without any medical help. My partner had a midwife and that was amazing. I'm so glad we had someone to guide us for our first child. I think of it like someone who takes self custody of their bitcoin but relies on someone else's node. If you can you should run your own node and be fully sovereign. That said if you can't run a node you can still use a wallet to hold your private keys rather than keep all your bitcoin on an exchange. Whether it's giving birth at home or holding your own bitcoin, being sovereign means taking charge of your own life and trusting yourself to make the right decisions, not someone else.\n\nPersonally, I'm grateful for the increased sovereignty I've gained from going down the Bitcoin rabbit hole, and I'm equally appreciative that my partner did the same thing going down the home birthing rabbit hole. As a Bitcoiner, I believe there are valuable lessons we can learn from the home birthing community and vice versa.\n\nBoth communities prioritize sovereignty as a top priority. Bitcoiners understand the importance of being in control of their financial assets and not relying on third parties, while home birthers prioritize taking ownership of their childbirth experience and trusting in their bodies' natural abilities.\n\nAs we continue to navigate through life, it's important to recognize that there are no easy answers. Every decision we make will have tradeoffs, and it's up to us to consider all of those tradeoffs and make the best decision for ourselves. The ideas of Bitcoiners and home birthers may seem worlds apart but they both share a common thread - the desire to make sure future generations succeed. This is a positive sign for the future, as these children will one day be the leaders and decision-makers of our society. Whatever their parents' beliefs or values may be, these children will inherit a world that is constantly changing and evolving, and they will have the opportunity to shape it in ways that we cannot yet imagine. So, whether you are a Bitcoiner, a home birther, or both continue being a positive force for change and contributing to a better future for all.\n\n![](https://miro.medium.com/0*czBtKKhXfmUd3aam)\n\n...\n\nFirst draft of an essay I thought to write after chatting with my partner in a Boonton Coffee shop today. Going to let her read it once, make some more edits tomorrow and then send it over.\n\n3/13/23\n\nConor Jay Chepenik",
  "wordCount": 1340,
  "readingTime": 5.439937106918239,
  "claps": 0,
  "voters": 0
}