{
  "id": "6b110021df72",
  "title": "Day 295",
  "createdAt": "2023-01-11 22:39:58",
  "tags": [
    "dad-blog"
  ],
  "url": "https://chepenikconor.medium.com/day-295-6b110021df72",
  "content": "# Day 295\n\nUsed chatGPT to make a rough draft for my binmucker.com blog and wow. This tool is so clutch. Made it so easy to spin up a solid blog website just by typing out what I want. I'm excited to keep using this tool to both improve my computer science skills and help me learn computer science as I continue improving my Dad blogging website. I need to build out my Nostr account more in order to promote my Dad blog. Twitter will probably be helpful for this as well.\n\nTonight I'm going to a Bitcoin dinner with some \"niche Bitcoin celebrities\" in the space. Should be a good time. Grateful I have family in the area to help my partner watch our newborn so I don't just leave my partner hanging. There will be some delicious steak at the dinner tonight; my mouth is watering just thinking about it. Mass Adoption is putting together something special and I'm excited to be a part of this group helping orange pill those in New England. I made some solid progress improving that website as well. Going to try and give it a movie theme mixed with pleb life vibes soon. Will see what I can create 🫡.\n\nSaw this video today and it gave me some hope that the deep state has its days numbered. If the people who fund these organizations can reel them into respecting the Constitution I think the American people would be much better off.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/repdanbishop/status/1612890497844117507&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt doesn't make sense that American institutions funded by taxpayers don't answer to the taxpayers! Will see if there is any repercussions for these three letter agencies but this seems to be a good start.\n\nOutside of that not much to report. Fatherhood has been great so far. Still feels surreal looking down at my Daughter thinking I created this with my partner. Momma is holding up well but I need to remember that she has so many hormones going through her body. Thus, it's important I help make time for her to do stuff outside of just watching our baby. Especially when she is feeling better and doesn't have any issues being active. Understandably she needs some time to just lounge around the apartment and recover from child birth.\n\nSome things I would like to discuss for my blog post #1 on binmucker.com\n\n- Children are a gateway to see the world again. A reminder that while our preconceived notions are important for navigating the world they also make it difficult to enjoy the little things.\n\n- The human body is truly amazing. If we just listen to it you would be suprised how much it can heal itself. For example, breast pumps can be helpful for filling up a bottle but nothing will ever be able to compete with a baby actually breastfeeding. My partner believes because she had a homebirth and wasn't given pitocin or an epidural that she was able to bond with the baby much easier.\n\n- Babies are messy. Expect stuff to get bodily fluid on it and be okay with the fact that it takes a whole family to keep things clean. It will be a long time before our apartment is spotless on a consistent basis so accepting this and doing the best you can to keep it clean when possible is okay. Not saying you should want to live like a slob, but realizing that stuff is going to get messy is important. Not a bad idea to use cheaper sheets in the beginning unless you want to ruin your super expensive cotton ones.\n\n- Be there for your baby. Skin to skin contact is so important. Babies need to feel loved. For 9 months they are in a placenta wrapped in a comfortable water sack. It takes some getting used to being out in the open air. Don't be afraid to hold your baby tight and let them sleep on you. Mine is sleeping great on top of Daddy.\n\n- Accept that your life is forever changed and it will be a grind. Anything great takes hard work.\n\n![](https://miro.medium.com/1*rBw8DCT-6PSq3grXQxA3Zg.jpeg)\n\nSee you tomorrow anon :)\n\n1/11/23\n\nConor Jay Chepenik",
  "wordCount": 691,
  "readingTime": 2.807547169811321,
  "claps": 0,
  "voters": 0
}