{
  "id": "6bd8c5962da1",
  "title": "Day 1119",
  "createdAt": "2025-04-15 02:03:44",
  "tags": [
    "food",
    "for",
    "thought",
    "old",
    "cars"
  ],
  "url": "https://chepenikconor.medium.com/day-1119-6bd8c5962da1",
  "content": "# Day 1119\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F3_Sqn98Z7Ao%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D3_Sqn98Z7Ao&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F3_Sqn98Z7Ao%2Fhqdefault.jpg&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"640\"></iframe>\n\nI went to write and this song popped in my head. Such a bop. Then I got stuck scrolling Craigslist. I'm hunting for a piece of crap beater while contemplating selling my Jeep Cherokee. I actually really love my car, so maybe that's not the move. But damn, I still want that beater. Desires, man...\n\nDo I need a beater? Probably more headache than anything. Yet there's something alluring about a car stripped of all the tech bloat. Something I could actually work on myself with my own hands. Though I guess I'd need a garage first, wouldn't I?\n\nFuture generations will never know the satisfaction of changing their own oil, hands slick with black gold, tightening that drain plug with just the right torque. Hell, most people who are genuinely into cars probably look at electric vehicle enthusiasts and shake their heads thinking these folks will never understand what it really means to fix your own vehicle.\n\nThere's a visceral connection being lost between driver and machine, a relationship built through bloody knuckles and cursing at stubborn bolts, now replaced by sterile computer diagnostics and hermetically sealed components that require specialized tools just to access. It is annoying that most modern cars require us to take them to the dealership.\n\nThe modern car is becoming less machine and more appliance. Maybe that's why I'm drawn to these old beaters . They're the last vestige of an era when your vehicle wasn't just transportation, but a relationship. There is something amazing about vintage technology.\n\n4/14/25\n\nConor Jay Chepenik",
  "wordCount": 260,
  "readingTime": 0.9811320754716981,
  "claps": 0,
  "voters": 0
}