{
  "id": "6be0f4f2fdff",
  "title": "Day 1246",
  "createdAt": "2025-08-20 03:14:09",
  "tags": [
    "god",
    "bless",
    "the",
    "real",
    "world"
  ],
  "url": "https://chepenikconor.medium.com/day-1246-6be0f4f2fdff",
  "content": "# Day 1246\n\nToday I walked into an AI meetup by myself. That simple choice turned into something special. Being alone pushed me to start conversations with strangers, which isn't always easy but is always worth it.\n\nAfter some light networking, the event kicked off with a strong presentation on synthetic physical data. The speaker explained how you can tweak motion (M × N) and environment variables to generate massive datasets that real-world experiments could never match. Instead of waiting years to gather physical data, you can spin up endless variations in hours. It reminded me how different physical robot/AI training is from scraping text off the internet to train LLMs. It is hard to comprehend how quickly this field is evolving.\n\nThe presenter also touched on the progress of running LLMs locally, which made me think again about picking up a Multiplex subscription. The reason being is there's a guide on it about training your own local personal AI that I've been meaning to read: [The Multiplex Article In Question](https://readmultiplex.com/2025/08/17/create-your-own-personal-local-ai-expert-using-your-x-data-a-complete-beginners-guide/)\n\nOne of the people I chatted with before the presentation kicked off was another dev, a professional, unlike myself, who is more of a hobbyist. He gave me great advice: treat coding with LLMs like managing a professional project. Start broad, plan carefully, and only then get really specific with the AI after laying out the macro framework. That way, the model digs into exactly what you want to build and can help break it into small steps to actually complete it.\n\nAnother cool convo I had was with a guy who used to work at nuclear power plants. He told me about the redundancy required to keep those systems safe and how part of Chernobyl's failure was that they did not have that redundancy to fix the systems. He even shared a cool story about the time he worked with the Navy to help with their technology. I'll keep the story to myself, but I enjoyed hearing about it. A reminder of how many everyday technologies - like Tor, GPS, the freaking internet - all spun out of military projects. It was the kind of conversation you can't script, the kind you only get by putting yourself out there.\n\nAll in all, I walked away feeling genuinely proud of myself for showing up. It's one of those small acts of courage that feels bigger in retrospect. The kind of thing where you realize that the anticipation was actually harder than the reality.\n\nI'm making a promise to myself to attend more of these meetups. Yes, it takes energy to put yourself out there like that. Yes, it's easier to stay in your comfort zone with familiar podcasts and routines. But the payoff, new perspectives, unexpected connections, knowledge you can't get without networking with new people, makes it all worthwhile.\n\nSometimes the best investment you can make is in your own willingness to be a little uncomfortable.\n\nAI will be no silver bullet to all your problems. But with human centric design and humility we can build amazing things.\n\n![[https://x.com/iamgingertrash/status/1857979498945302704](https://x.com/iamgingertrash/status/1857979498945302704)](https://miro.medium.com/1*xLYNnvUjNeN2zlGJNh7m3A.png)\n\n8/19/25\n\nConor Jay Chepenik",
  "wordCount": 514,
  "readingTime": 2.139622641509434,
  "claps": 0,
  "voters": 0
}