{
  "id": "6c27ffd4bd76",
  "title": "Day 1051",
  "createdAt": "2025-02-06 01:43:57",
  "tags": [
    "neutronpay"
  ],
  "url": "https://chepenikconor.medium.com/day-1051-6c27ffd4bd76",
  "content": "# Day 1051\n\nToday is the last day of my fast and I'm ready to go to sleep so I can eat tomorrow. Thus this is an unfinished article that will get finished and published on Bitcoin news in the coming weeks. Cheers anon:\n\n**Neutronpay: The Lightning-Powered Payment Revolution in Southeast Asia**\n\nFor most people, the journey into Bitcoin doesn't start with a Silk Road test transaction, launching one of the world's first Bitcoin ATMs for buys and sells, or a mining operation that could've made them millions. However for Neutronpay's founder, that's exactly what happened. Albert Buu's Bitcoin journey began in 2010, long before most people had even heard of it. Working at a fintech company in Alberta, a coworker handed him the Bitcoin white paper, excited about the possibilities. But at the time, Albert was skeptical.\n\n\"I don't know how this is going to work,\" he recalled. \"The first thing that came to my mind was Mario coins right? Like just coins coming out of thin air and I said I don't think this is going to work.\"\n\nHe dismissed it, but a few years later, he found the paper again, reread it, and had the classic 'aha' moment. \"I totally messed up,\" he admitted. By then, he dove in deep, spending eight months straight reading everything he could about Bitcoin. At the start of 2013, he decided to go all-in, taking money out of his retirement account and buying Bitcoin at around $18 CAD per coin. Like many early adopters, he had moments of regret about missed opportunities, but pain is often the best teacher and these lessons help his conviction in Bitcoin only grow stronger.\n\nAlbert's journey took him through several Bitcoin ventures. In 2014, he set up one of the world's first two-way Bitcoin ATMs. \"We were the second in the world after a company in Vancouver. They had a lineup around the block for two days and did over a million dollars in Bitcoin sales,\" he said. While his machines gained traction, the market wasn't ready. \"After two years, I sold them. People just didn't understand Bitcoin yet.\"\n\nHe then pivoted to mining in 2016, running ASIC miners for Bitcoin and GPUs for Ethereum. \"I tried to get an investor to back me with $2 million, but no one bit. If they had, we would have made $7 million easily.\"\n\nBy 2017, Albert saw the potential of the Lightning Network. \"I was on the alpha version when guys like Adam Back, Jameson Lopp, and Andreas Antonopoulos were testing it out,\" he said. \"Everyone was losing money - like 10, 20 bucks here and there, sometimes 100 - but it felt like the early days of Bitcoin all over again.\"\n\n**Founding Neutronpay**\n\nIn 2019, Albert founded Neutronpay, a company focused on bringing Bitcoin payments to businesses, particularly in Southeast Asia. \"We're a Lightning-first company,\" he explained. \"We focus on B2B - businesses that want to integrate Lightning into their apps or services. If a company has anywhere from one million to ten million users, we can help them offer Bitcoin payments seamlessly.\"\n\nOne of Neutronpay's most compelling features is its fiat bridge. \"We offer a wallet where users can receive Lightning payments but choose whether to hold Bitcoin or instantly convert it into local currency,\" Albert said. \"So if someone sends you Bitcoin via Lightning, you can get it as Vietnamese dong, Singapore dollars, or other supported currencies instantly. No exposure to volatility unless you want it.\"\n\nAlbert sees Neutronpay as a way to help businesses retain users. \"Some platforms don't want their users leaving for Coinbase or River just to buy Bitcoin. With our integration, they can keep them on their platform while offering Bitcoin services.\"\n\n**The Challenge of Adoption**\n\nDespite the clear benefits, selling Bitcoin payment solutions to businesses isn't always easy. \"We mainly work with payment service providers (PSPs) because they see Lightning as an extra revenue stream,\" he explained. \"But when I talk to big companies, their upper management often doesn't get it. They need to see an immediate return within a quarter. If they don't see an instant path to profit, they hesitate.\"\n\nExecutives in legacy finance are particularly resistant. \"They think Bitcoin is going to ruin their business model,\" Albert said. \"But if they don't innovate, it won't matter - they're going to get their lunch eaten anyway.\"\n\nLightning's biggest challenge, in his view, isn't the technology - it's liquidity. \"People say Bitcoin should only be a store of value, so they don't want to put it in a hot wallet. They don't realize there's a difference between a hot wallet and a multisig wallet for Lightning liquidity. But managing channels and liquidity is complex, and most people don't want to deal with it.\"\n\n**The Future of Lightning and DLCs**\n\nWhen asked about the biggest innovation on the horizon, Albert pointed to Discreet Log Contracts (DLCs). While Lightning has already unlocked new ways to transact, DLCs add another layer of functionality, enabling smart contracts for betting, options trading, and other financial instruments - all without compromising Bitcoin's decentralization.\n\nThat's the key to why Lightning is poised to remain the dominant Layer 2 solution. Unlike other networks that require trust in a federation, Lightning allows users to unilaterally exit back to Bitcoin's base layer. As Albert put it, \"If something goes wrong, I can just close my channel and take my Bitcoin back. That's not the case with other L2s.\"\n\nFor Albert, building Neutronpay isn't just about payments - it's about expanding financial freedom. \"In the West, people don't get why Bitcoin is necessary,\" he said. \"They have banks that work, even if they suck. But in places like Vietnam, where people don't trust the banks or the government, Bitcoin is an alternative that actually makes sense.\"\n\nAs Lightning adoption grows, Albert believes it will reshape global finance. \"Right now, people laugh at the idea of using Lightning for payments. But so did people who first heard about Bitcoin in 2010. We'll see who's laughing in ten years.\"\n\n2/5/25\n\nConor Jay Chepenik",
  "wordCount": 1015,
  "readingTime": 3.830188679245283,
  "claps": 0,
  "voters": 0
}