{
  "id": "6cbaab9ca7ad",
  "title": "Day 730",
  "createdAt": "2024-03-22 04:27:19",
  "tags": [
    "god",
    "bless",
    "america",
    "and",
    "freedom"
  ],
  "url": "https://chepenikconor.medium.com/day-730-6cbaab9ca7ad",
  "content": "# Day 730\n\nToday I drove to north Georgia to be with my family. Long road trips hold a special allure for me, as they provide an opportunity to immerse myself in captivating podcasts. It's truly remarkable to contemplate the wealth of knowledge and perspectives that are freely accessible (minus the annoying ads). In an era where even the wealthiest monarchs of the past lacked such luxuries, we now have the privilege of accessing a vast repository of information on virtually any topic of interest through our smartphones and platforms like YouTube. This democratization of knowledge is a testament to the remarkable progress we've made as a society. Sure there is a bunch of problems with the World, but when you take a step back and realize how far we've come it's hard not to be bullish on humanity.\n\n> [**Spring Break Crackdown, Squatters Run NYC, Stephen A Smith's Advice to Dems | PBD Podcast | Ep. 383**](https://www.youtube.com/live/ZA3lLk8osbo?si=5car28fjDIuHH47e)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F0JfG4wnx5YQ%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D0JfG4wnx5YQ&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F0JfG4wnx5YQ%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FwDpz5zJzQKI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DwDpz5zJzQKI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FwDpz5zJzQKI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIt was also great today because I stopped at Cookout and it's amazing how cheap the food is while still being quality. The hamburger, nuggets, and milkshake reminded me of what McDonalds was probably like when they cooked their stuff in beef tallow. Now McDonalds is overpriced garbage. I'm hopeful one day Cookout will expand from South Carolina and Georgia down into North Florida.\n\nAnyways, it's late and I need to sleep. Grateful to be alive at a time where information is flowing freer than it ever has, where Bitcoin is monetizing itself for the first time, and where I can do my small part to remind people the narrative about World War 3 can be defeated by simply doing your small part to show others there is a better way. Stay hopeful, stay grateful, stay filled with courage. \"They\" want you to be fearful so fuck them. Be courageous and pray to God for that strength. He will provide!\n\n3/21/24\n\nConor Jay Chepenik",
  "wordCount": 337,
  "readingTime": 1.271698113207547,
  "claps": 1,
  "voters": 1
}