{
  "id": "6d13578b3a0d",
  "title": "Day 332",
  "createdAt": "2023-02-18 04:59:40",
  "tags": [
    "reading",
    "sovereignty"
  ],
  "url": "https://chepenikconor.medium.com/day-332-6d13578b3a0d",
  "content": "# Day 332\n\nToday I will be crushing The Good's substacks which can be found here.\n\n> [**The Good | Substack**](https://substack.com/profile/98120747-the-good?utm_source=author-byline-face)\n\nI went for a run before starting to read and ironically enough the first post I read is about how your body is the ultimate proof of work. Anyone can tell just by looking at you how much you respect yourself. This post is a good reminder that there are two types of people. Those who will rule and those who will be ruled. Which do you want to be anon?\n\n> [**The Human Form, The Ultimate Proof of Work**](https://thegoodx.substack.com/p/the-human-form-the-ultimate-proof)\n\nFamily is the ultimate way to rebel. Raise a strong family and don't give them up to a state that hates you. I love how he twists the JFK quote at the end.\n\n> \"Ask not what your country can do for you, but what you can do for your country\" I will twist this into something far better \"_Ask not what you can do for your country, but what you can do for your family.\"_\n\n> [**Weak Families, Strong Government**](https://thegoodx.substack.com/p/weak-families-strong-government)\n\nWinter is what you make of it. I'm still enjoying a runners high from a 5k I hit before sitting down to type this. It's around 40 degrees and windy up here in Boston which made the run that much sweeter. Yes... sweeter because the cold feels good when my body heats up. I especially appreciated the metaphor Jens made between making money in a recession and bettering yourself during the harsh winter months.\n\n> [**Winter, the great reckoning.**](https://thegoodx.substack.com/p/winter-the-great-reckoning)\n\nHave the balls to trust yourself. Start taking full accountability for your actions. Don't self-censor. Have principles and realize that no one cares as much about you as well... you. Again, don't self-censor. Something I need to remind myself when I'm thinking about what to tweet, write, or even say.\n\n> [**From Slave to Sovereign**](https://thegoodx.substack.com/p/from-slave-to-sovereign)\n\nIt's tough to read this because we all know it to be true but very few are willing to take the advice.\n\n> **Stop the social media, video games, and mindless forms of entertainment**\n\n> You have to remove the quick dopamine hit activities in your life, and turn them into longer dopamine hits. The biggest difference between cheap, quick dopamine, and longer more meaningful pursuits is this: \"_Cheap dopamine is consumption, Good dopamine is creation.\"_ This one goes deep. Consume the porn, or create a baby. Level up your character in a video game, or level yourself up in real life. Watch the tiktok, or read a book. Make love to your hand, or to a woman. Consume fast food, or create a healthy meal. Steal wealth, or create wealth. Consumption is a necessary part of life. But it is the case that the more you consume the worse off you are, the more you create, the better off. Get dopamine from building an empire, not from tearing one down. Once you allow yourself the opportunity to engage in more low time preference behavior by removing high time preference behavior, meaning and purpose will not be hard to come by.\n\nTo be perfectly candid, I had a girlfriend break up with me in college because I couldn't give up porn for a summer. Kind of an awkward thing to type out on my personal blog. I'm taking my advice though: STOP SELF CENSORING. I was so weak minded at the time I legit told her that it's I watch porn okay because everyone does it. Fellas if your argument for something is well everyone does it then your argument is shit. Trust me; this is a lesson I learned the hard way lol.\n\n![](https://miro.medium.com/0*gdJeMYnwYPjJTPvf.jpg)\n\nIt all worked out. As far as breakups go there was no ill-will between us and I'm glad I was able to have a kid with my current Partner. Today I legit cried for 10 minutes just looking at my child because she is so beautiful. I feel a love unlike anything I've ever felt before when I look at my baby. I can't claim it did not suck being dumped because of my lack of will power but it was a great lesson and since then I love the way my life has worked out. Everything happens for a reason. I'm not sure I would be the father I am today had I not learned the importance of self-respect. I'm still not perfect but now if I watch porn I find myself feeling guilty. My current Partner does not feel the same way my last one did in terms of it being \"cheating\" which I appreciate because the change has to come from within. Being told to do something will never be as effective as doing something by your own free will. That said, reading stuff like this is a great reminder that fucking my hand to pixels is pretty lame when I could be saving it for an intimate time with my Partner in the future. This might all be a bit too much information but whatever, this example is literally one of the best metaphors to showcase cheap dopamine vs good dopamine. People outside of \"you\" can help you see the light but like inception the thought (or will) to do something must come from your own mind.\n\n> [**The Purpose Crisis, And How to Find Direction**](https://thegoodx.substack.com/p/the-purpose-crisis-and-how-to-find)\n\nI need to think more about the positives and negatives of renting vs owning. When I rent something I care less about it. A rental car is much more expendable to me than my own whip. In the same way I have always treated someone I'm in a relationship better than someone who I didn't commit to. There are times when renting makes sense, like going to a hotel, but in most cases taking ownership seems to be the low-time prefernece way to go about something. Owning something makes you care more.\n\n> [**You will own nothing, and you will not be happy**](https://thegoodx.substack.com/p/you-will-own-nothing-and-you-will)\n\nMoney is the yardstick which the free market uses to allow trade to flourish. It is being constantly corrupted by central planners. If people were doing science experiments with a ruler that changed everytime it was used the experiment would be wildly misleading. Kind of like a monkey .jpeg file selling for millions of dollars. Not even against NFTs. I think they will have some sort of use case (maybe on bitcoin, maybe not). Point being millions for an ugly monkey is insane. Something that only happens when the ruler being used to measure things is constantly in flux like we have today with Central Bankers.\n\n> [**Money, The Sun, and The Good**](https://thegoodx.substack.com/p/money-the-sun-and-the-good)\n\nGood relationships work because you can opt out. Democracies at this point are a complete sham. I remember not voting in the 2016 election because both Hilary and Trump were not legimate options in my opinion. The last vote that matters is our money so it best make sense to learn about bitcoin and gold. I think bitcoin > gold in the future but gold has a much longer track record of being money so probably wouldn't hurt to have some of that either.\n\n> [**Manifest Destiny, Secession, and Tyranny**](https://thegoodx.substack.com/p/manifest-destiny-secession-and-tyranny)\n\nIncentives are everything. Kind of goes back to the point about owning vs renting. If you are going to hire a developer to build something for you it makes sense to find one with a vested interest because otherwise you will end up with the cheapest thing they can build for what you are paying them. Incentives are everything.\n\n> [**Lip Fillers, Proof of work, The Death of Beauty and Dystopian Hellscapes.**](https://thegoodx.substack.com/p/lip-fillers-proof-of-work-the-death)\n\nSociety is so ass backwards that the rebels are the ones going to the gym, reading the bible, making money through value creation (not rent seeking) and having children. Ironic, yes. Surprising? Not really when you consider that most people would rather accept a hand out from the Government than actually work for themselves.\n\n> [**Black Holes, Bitcoin, And The Orthodox Church**](https://thegoodx.substack.com/p/black-holes-bitcoin-and-the-orthodox)\n\nSay what you want about Monarchy but this quote did such a good job articulating the differnce between renting and owning something.\n\n> Bad monarchs are extremely rare and are beheaded and replaced by a better one\n\n> Bad democratic officials are extremely prevalent and are replaced every 4 years by worse ones.\n\nI can not stress the importance of incentives enough. I doubt we see any Monachies in the future any time soon. That said, I do think we will end up with a new form of governace sooner rather than later. My hope is that we outsource the governace to decentralized open-source code like Bitcoin. Best way to protect your private property without having to worry about a Government to protect it for you at a cost that you can't really negotiate for.\n\n> [**Monarchies, Time Preference, And The Lie of Democracy.**](https://thegoodx.substack.com/p/monarchies-time-preference-and-the)\n\nIn conclusion, this was an unorthodox post but I got a real kick out of learing from Jens. I'm having him on my podcast at the end of February and I can't wait to accept him about a lot of this stuff.\n\nSee you tomorrow anon :)\n\n2/17/23\n\nConor Jay Chepenik",
  "wordCount": 1740,
  "readingTime": 6.766037735849057,
  "claps": 0,
  "voters": 0
}