{
  "id": "6d35a5638d5c",
  "title": "Day 72",
  "createdAt": "2022-06-02 23:34:07",
  "tags": [
    "love",
    "conspiracy-theories",
    "small-town-america",
    "emotions",
    "truth"
  ],
  "url": "https://chepenikconor.medium.com/day-72-6d35a5638d5c",
  "content": "# Day 72\n\nPlanning on going up to Littleton NH tomorrow with my girlfriend. Excited to take a trip up to New Hampshire and stay in a small town. One of the things that make America so unique is the charm in our small towns. I am reminded of Acworth, Georgia where my grandfather, Tommy, is the mayor. What he has done for that town is so incredible. I've seen it grow from a small city north of Atlanta to a flourishing community. Tommy takes great pride in what he does there and it is awesome to see how far the town has come since I was a little kid.\n\nNot sure what to expect in Littleton New Hampshire but I'm excited. I also plan to check out Bretton Woods. Pretty crazy to think they tied all fiat currencies to the U.S dollar and the U.S dollar to gold after World War II. Obviously, we went off this standard in 1971 and it has been a pretty wild ride since. Life is incredibly dynamic and we will never be able to account for all the variables that influence the decision of every person. In my humble opinion, it seems like people have never had it so good and so bad at the same time. For example, we can click a couple of buttons on our phones to have someone deliver us food or give us a ride. We also keep setting records in obesity, and mental health problems. Another issue is inflation is wreaking havoc on the lives of those who aren't incredibly wealthy. Property ownership for twenty-year-olds seems like a pipe dream unless you come from wealth or make over 100,000 thousand USD a year and are smart with your money.\n\n![](https://miro.medium.com/1*573CU7yYPBuRrJAbaZkprg.jpeg)\n\nAll this to say I feel like Neo in the matrix. Hahahahaha I'm sure anyone who has gone down the Bitcoin rabbit hole also feels the same way. So many conversations I have with people my age just sound like talking points from the mainstream media. I've been guilty of doing the same and many times I am parroting the talking points of others I find on Bitcoin twitter. I try to think critically and be unique but it's hard. It seems the incentives of our current system are quite faulty and I don't blame others for repeating what the mainstream media says. One of the reasons MSM is so effective at getting the masses to resonate is because all their talking points stem from emotion. No longer are they trying to tell their audience the truth. It's a bunch of half-truths being spat in order to further a political agenda. Bitcoin Twitter is full of flawed people. The one thing I appreciate is most seem to be seeking truth. Sure there are people who criticize and attack those who disagree, but for the most part it seems people are taking the time to think critically and look at stuff objectively rather than through emotion-filled lenses.\n\n![](https://miro.medium.com/1*yZgkWAFWSej7fqV6WYBr5Q.jpeg)\n\nYesterday, I was arguing with my girlfriend about gun control. She thought that it was ridiculous that 18-year-olds could buy AR-15s. I thought it was ridiculous we have politicians trying to enforce gun control. We both agree that it's horrible and tragic all these shootings that take place and both want to see them stopped. We just disagreed about the best way to prevent them from happening. From her perspective making AR-15s more difficult to get would help with this while I thought that the more guns in the hands of law-abiding citizens the less likely a bad actor would be willing to commit such a heinous crime. I did let my emotion get the best of me in the argument because of the frustration I've had with the blatant human rights violations of the past two years and thought that any more infringement on the 2A would just lead to more tyranny. What's important to remember is we can never know who is right because there is no way to test these things when you can't factor in the infinite number of variables life has. Testing these theories out would cost real human lives. It is unfortunate to see politicians appealing to emotions rather than having logical conversations about the best way to prevent mass shootings. No answer is 100% correct. The best policy is probably somewhere in the middle. I do know when emotion gets involved in stuff like this usually no one wins. Unfortunately, it is nearly impossible to keep emotion out of a conversation like this.\n\nGod bless the souls of those who lost their lives to a truly evil spirit. I pray for these shootings to stop and that we as a country can work towards a future where people don't feel so miserable they seek validation through heinous acts of terror. I want to see the U.S.A return to a place where we are the land of opportunity not the land of obesity, mental health issues, and horrific crime. I know I'm just one small cork in a massive system, but I'm going to keep looking inwards and doing what I can on a day-to-day basis to improve bit by bit (or better yet block by block since I'm a Bitcoin Maxi). If I can put more love into the world because I'm happy with myself I can do a lot to make it a better place.\n\n6/2/22\n\nConor Jay Chepenik",
  "wordCount": 915,
  "readingTime": 3.8361635220125785,
  "claps": 0,
  "voters": 0
}