{
  "id": "6e014481732b",
  "title": "Day 180",
  "createdAt": "2022-09-18 21:28:12",
  "tags": [
    "bitcoin",
    "farmers",
    "driving",
    "new-england",
    "clown-world"
  ],
  "url": "https://chepenikconor.medium.com/day-180-6e014481732b",
  "content": "# Day 180\n\nDrove back from Bridgeton Maine to Boston and it was a lovely drive. Stopped right outside the Kittery outlets at a little farm stand and got some blueberries, corn, potatoes, and sweet onions. Feels good to support a farmer instead of a corporation. Also stopped in Portsmouth at the Bar & Book place downtown. Big fan of being able to order food and browse a bookstore. Bought my girlfriend a book called Fatter, Poorer, Sicker or something like that. The book talks about chemicals and all the crap in modern day food. I read a book (but did not purchase) called slow money. Their organization can be found here [https://slowmoney.org/](https://slowmoney.org/)\n\nIt is cool to see what they do. One stat from the prologue that stood out to me is that when the planet had 1 billion people the economy had around 2 trillion in value and when the planet had 6.6 billion people the economy had around 66 trillion dollars in value. That is crazy. The book went on to talk about all the artificial \"wealth\" in the system. For the ratios mentioned above to be even the economy of 6.6 billion people should equate to 13.2 trillion of value not 60+ trillion. The book gave a great analogy of our modern day economy to fertilizer. Everyone uses modern day nitrogen fertilizers to yield bigger growth today without considering the fact it poisons the soil, kills biodiversity, and ruins future production. The author joked we should treat our modern day economy with more \"manure based fertilizer\" instead of artificial growth. The yield might be less in the short term but much greater in the long term. Brilliant comparison. Many times people will optimize for \"today\" without realizing how detrimental it will be in the long run. Something has got to give in our modern day economy and with everything going on around the world I do believe that day is coming soon. I hope the Slow Money project is successful in getting more people to stray away from nitrogen based fertilizer and take the low-time preference/ manure based approach . Maybe one day I will look into getting a loan from them if I ever start my own farm. 👀 🤔\n\nI also listened to this podcast from the _What Is Money Show_ on the drive home. Fantastic episode and I hope Bruce runs for senate again at some point. The man has got a damn good plan. I was cracking up when he was talking about how no one would opt into a system where 12 people hold meetings and make a big deal out of what money is going to cost. Furthermore they leak their plans to the media beforehand and act important because they meet in nice buildings. It is a clown world system and we are living in it. Happy for \"geek money\" to take over sooner rather than later. With the egotistical knit-wit politicians in office I'm bullish they will screw things up sooner rather than later and pave way for HYPERBITCOINIZATION!!!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F0bFYllo6STD92RblnrkPVq%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F0bFYllo6STD92RblnrkPVq&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fb85e18f77fbf2b9f88846212&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nAnyways, go support a farmer anon. Vote with your feet and your wallet. Speaking of I need to make moves to get up to New Hampshire. I love it up there.\n\n9/18/22\n\nConor Jay Chepenik",
  "wordCount": 545,
  "readingTime": 2.056603773584906,
  "claps": 1,
  "voters": 1
}