{
  "id": "6e53cb5120e3",
  "title": "Day 1230",
  "createdAt": "2025-08-04 02:10:11",
  "tags": [
    "a",
    "simple",
    "sunday",
    "journal",
    "entry"
  ],
  "url": "https://chepenikconor.medium.com/day-1230-6e53cb5120e3",
  "content": "# Day 1230\n\nWe did a thing!\n\n![My Book Has Been Submitted To Amazon For Review](https://miro.medium.com/1*Ya59zjpDwzvUiLBefR1DTg.png)\n\nI also found out how to publish this book without having to make it 72 pages. God bless. I am very happy about that, even though I do think it would've been good to write some more Bitcoin content. The problem is making this Bitcoin coloring book a three-part thing would felt a bit all over the place. To write one book for 3 different audiences makes it complicated to market, confusing to the end reader, and is likely just not the way to go for creating a successful book. Thus, I am grateful that I figured out how to go with the shorter version and release my Bitcoin coloring book that is focused on the 2–10 year old demographic since focus is a super-power. (Shout out Saylor for giving me that insight).\n\nAmazon still needs to approve ze book, but once I get that approval the next step will be completing the website which I've already started working on via Replit.\n\nOtherwise it was a great Sunday. Went to church and then to my Grandparents for breakfast. Got back home and crushed a 5k tonight. Also, bought some goodies on Amazon like the [full Twin Peaks series on DVD](https://amzn.to/3IZGC5t), sexy blue light blockers, and a test copy of my coloring book to make sure it turns out okay. I'm very excited to watch Twin Peaks with Paige, I think she will get hooked XD\n\nAll in all it was a great Sunday. Looking forward to getting back into the flow of work tomorrow morning. Thank you God for everything. I don't take it for granted that I have the strength to exercise, the brain to understand Bitcoin, and the tenacity to have kids at such a young age. You have blessed me in more ways than I can count and one of the greatest blessings you ever gave me was allowing me to realize how important family is. So many distractions & forces in this world urging people to not prioritize their family or be close to them and I'm glad I didn't stay in Boston. As much as I loved that city and being up there, being back where I grew up, surrounded by my loving family is worth more all the gold in the world. The older I get the more I realize there are a lot of things money can't buy.\n\nOf course there is also a lot of things money can buy that make life better (see the Twin Peaks full collection I just purchased lol) but I know on my death bed I won't be clutching for my Twin Peaks DVD. I will be clutching for my loved ones hands.\n\nMy 2 sats.\n\n8/3/25\n\nConor Jay Chepenik",
  "wordCount": 461,
  "readingTime": 1.939622641509434,
  "claps": 0,
  "voters": 0
}