{
  "id": "6f3dba4d5dbc",
  "title": "Day 601",
  "createdAt": "2023-11-14 01:57:41",
  "tags": [
    "indoctrination",
    "education",
    "ride-with-the-devil",
    "tweets",
    "be-the-change"
  ],
  "url": "https://chepenikconor.medium.com/day-601-6f3dba4d5dbc",
  "content": "# Day 601\n\nToday I want to discuss indoctrination. At first it seems like a negative word. Yet, I don't think it is. It's not the act of indoctrination itself that's inherently problematic, but what we choose to instill in the next generation. I came across this [tweet](https://x.com/grayzoneintel/status/1724160321248460810?s=20) and it really resonated with me \"This quote perfectly describes why the left will win..\n\n> You ever been to Lawrence, Kansas young man?\n\n> Before this war began, my business took me there often. As I saw those northerners build that town, I witnessed the seeds of our destruction being sown.\n\n> I'm not speakin' of numbers, nor even abolitionist trouble makin'. It was the schoolhouse. Before they built their church, even, they built that schoolhouse. And they let in every tailor's son... and every farmer's daughter in that country.\n\n> But my point is merely that they rounded every pup up into that schoolhouse because they fancied that everyone should think and talk the same free-thinkin' way they do with no regard to station, custom, propriety. And that is why they will win. Because they believe everyone should live and think just like them. And we shall lose because we don't care one way or another how they live. We just worry about ourselves.\"\n\n![](https://miro.medium.com/0*mtNAVCPegs8Qf_PC)\n\nNeed to watch this movie, it seems like quite the based film. This historical reflection sheds light not just on the indoctrination of ideas, but also on the power of education in molding young minds.\n\nGrowing up, I was indoctrinated with the belief that the United States had never lost a war. Unlearning this and confronting the realities of Vietnam, Afghanistan, and the ongoing complexities in Ukraine was a journey from accepting a simplistic national narrative to understanding the multifaceted nature of historical truth. This journey underscored the value of questioning and critical thinking over blind acceptance.\n\nThe goal, as I see it, isn't to craft minds that unconditionally follow a preordained path, be it from the left or the right side of politics. Instead, it's about nurturing inquisitive, innovative spirits who question the status quo and strive for a better world. These minds will not be content with a 'vanilla' life of conformity but will seek to forge new paths and solutions.\n\nI diverge from the notion that the victory of a particular ideology, like the left in the tweet, is inevitable or even desirable. The true victory lies in raising children to be better, smarter, and wiser individuals - thinkers who can navigate the complexities of the world with insight and a desire for innovation. This transcends political binaries and delves into the core of what education should aspire to achieve.\n\nIt is up to us to make this difference. The crux of our educational endeavors should be to empower the next generation with the tools of critical thinking and innovation. Only by doing so can we hope to usher in a future where progress is not defined by adherence to traditional paths, but by the courageous pursuit of wisdom and meaningful change.\n\nI'm bullish on humanity and I will do my part to make sure my kid(s) don't \"think and talk the same free-thinkin' way they do with no regard to station, custom, propriety\"\n\n11/13/23\n\nConor Jay Chepenik",
  "wordCount": 546,
  "readingTime": 2.260377358490566,
  "claps": 0,
  "voters": 0
}