{
  "id": "7128797852d2",
  "title": "Day 1234",
  "createdAt": "2025-08-08 03:59:30",
  "tags": [
    "stay",
    "safe",
    "lady",
    "liquor",
    "leverage"
  ],
  "url": "https://chepenikconor.medium.com/day-1234-7128797852d2",
  "content": "# Day 1234\n\nKind of funny typing out one, two, three, four. Many years from now I will be typing Day 12345. Pretty cool to have made it this far. Writing is a special thing. The ability to hone your craft, synthesize your thoughts, get better daily at something so it compounds over your lifetime.\n\nDo not underestimate those things. I read something tonight which blew my mind. Which reminded me why I am so passionate about Bitcoin and what it means for the rest of the world.\n\n> PROFITING FROM DISASTER All of this is aimed at surviving the storm and preparing ourselves to offer leadership in troubled times ahead. That is a rather negative view. There is a more positive outlook for those who are looking for good news, as Adlai Stevenson said. It is the exciting prospect that we can turn this calamity to our advantage. We can actually profit from the coming collapse. That thought has spawned hundreds of books and newsletters offering advice on how to get rich while others are being destroyed. There is even one that gives advice on how to cash in on the environmental-industry boom. The pitch is how to make a fortune on the downfall of America. There is no doubt that opportunities exist to profit from investment decisions based on a realistic appraisal of current trends. Most of those opportunities, however, depend on making market-timing decisions. One must know precisely when to buy, when to sell, and at what price. To know all that, the investor must become expert on the nature of the industries involved and must monitor the daily shifts in market forces. He must attempt to complete his analysis and reach his conclusions in advance of the crowd. And, of course, he must be right. Most investors are not prepared to do that, so they must depend on the services of professionals, usually the same experts who are encouraging them to invest in these kinds of enterprises. If the investment is profit- A REALISTIC SCENARIO 585 able, the analyst receives an income. If the investment turns sour, the analyst still receives an income. That relationship is not unique to the \"profit-from-crash\" group, however. It is to be found at every level of the investment business as well as within the legal and medical professions. The customer pays for the advice regardless of its quality. What is disturbing about this investment concept is that it actually may help to make matters worse. By focusing on finding clever ways to avoid the effects of inflation or of making a profit from it, we are doing nothing to stop it and, thereby, encouraging its continuation. Those who are gaining from inflation are not likely to offer serious resistance to it. As they watch their profits pile up, they may become its most ardent supporters - even though they know deep in their hearts that it will destroy them in the end. There is nothing wrong with trying to preserve one's capital on the way down, but the only real solution is to use one's capital to stop the present trends. In the long run, there is no way to profit from a destroyed America. There is no refuge from a collapse. There is no way to protect your assets, your home, your job, your family, your freedom. As Henry Hazlitt phrased it, \"There is no safe hedge against inflation except to stop it.\" - G. Edward Griffin in The Creature From Jekyll Island\n\nDisaster profiteering can turn even the well-intentioned into passive enablers of the very collapse they claim to fear. I know this is true for myself and reading the above hit me like a brick. It made me ask \"Am I using my capital to better the World?\"\n\nThere is no denying that fiat rewards those who game the decay instead of fixing it. I see it in my own temptation to play with leverage. Directionally going long BTC and short fiat over a long time duration is an amazing bet and not rocket science. But many forms of leverage are honey traps. It dangles quick gains while quietly putting you in the same fragile position as the system you're betting against.\n\nSo be careful anon. In the end, the best way to \"profit\" from collapse is not to surf its waves. It is to starve the beast. Holding your Bitcoin, unleveraged, in self-custody. Use multi-sig, distrubute the risk, diversify any single points of failure.\n\nI genuinely believe that doing so will create a better world for not only ourselves, but for our children's children's grandchildren. It's not easy, but it's powerful to actively withdraw support from the very machine that's trying to rob you of your value.\n\nNot financial advice, just my 2 satoshis.\n\n8/7/25\n\nConor Jay Chepenik",
  "wordCount": 807,
  "readingTime": 3.0452830188679245,
  "claps": 0,
  "voters": 0
}