{
  "id": "714b4ff377ff",
  "title": "Day 854",
  "createdAt": "2024-07-24 02:06:33",
  "tags": [
    "kyc",
    "aml",
    "finance",
    "banking",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-854-714b4ff377ff",
  "content": "# Day 854\n\n**The Dark Side of KYC: Harming Privacy and Undermining Common Sense**\n\n![Generated with DALLE](https://miro.medium.com/1*e1kYHkqB4133yLUv3_msCg.png)\n\nCommon sense implies that private citizens should enjoy the cloak of privacy while the state's every move should be laid bare for all to see, given that they are, after all, public servants. However, Know Your Customer (KYC) and Anti-Money Laundering (AML) regulations present a disturbing reversal of power dynamics. These measures, often justified as necessary evils by bureaucrats, do more to erode individual rights than to combat financial crime. The return on investment (ROI) for KYC is so abysmal, it makes one question whether the true aim is security or control.\n\nAs [Olivier Roland aptly noted](https://disruptive-horizons.com/p/kyc-aml-destroying-world#footnote-28-133915966),\n\n> \"A simple extrapolation suggests **global compliance costs of the order of $304 billion**, or 0.38% of global GDP, while the authorities **manage to seize around $3 billion a year** in criminal funds worldwide!\"\n\n![](https://miro.medium.com/1*LYAGzvotkGuTt4HvqfVxug.png)\n\nThis alarming disparity highlights that for every ~$100 invested in KYC and AML compliance, a mere $1 is recovered. The staggering 100:1 ratio raises serious concerns about the fiscal prudence and efficacy of these measures. More importantly, it begs the question: who truly benefits from this massive invasion of privacy?\n\nThe latest example of insane KYC/AML regulations are [proposed by the European Union](https://www-focus-de.translate.goog/experts/vermoegensregister-geplant-eu-will-umfassende-datenbank-zum-vermoegen-aller-buerger-aufbauen-was-dahinter-steckt_id_260158959.html?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en-US), which seeks to create a comprehensive database of citizens' assets. While purportedly aimed at increasing transparency and preventing financial crimes, this initiative represents an unprecedented intrusion into the private lives of sovereign individuals.\n\n![[https://x.com/bitnorbert/status/1815785088057045426](https://x.com/bitnorbert/status/1815785088057045426)](https://miro.medium.com/1*hfIk86lZWo8s2ILImHX3Gw.png)\n\nThe proposed EU Asset Register would necessitate an extensive collection and storage of personal data by financial institutions, encompassing sensitive information on real estate, bank accounts, securities, vehicles, and even precious metals. This vast repository of data would be shared among member states, effectively stripping citizens of their right to privacy. The private lives of individuals would be laid bare for government scrutiny, with little to no protection against potential abuses of power.\n\nIt's crucial to remember that in a truly free society, it is the government that should be transparent to its citizens, not the other way around. One of the founding principles that made America so great is that our liberty demands that we, the people, have the right to scrutinize our governments' actions while maintaining our own privacy.\n\n[As noted by Sebastian Hell](https://www-focus-de.translate.goog/experts/vermoegensregister-geplant-eu-will-umfassende-datenbank-zum-vermoegen-aller-buerger-aufbauen-was-dahinter-steckt_id_260158959.html?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en-US) there is historical precedent to demonstrate how asset registers can be exploited for state intervention during times of crisis. This raises grave concerns about the erosion of citizens' rights and the potential for governments to manipulate such databases during periods of political or economic instability. The Orwellian scenario of a government auctioning off a family heirlooms to settle its debts is a chilling prospect that underscores the need to resist these invasive policies.\n\nEven if we naively assume that governments won't misuse this data, the risk of a data breach remains. The consequences of such a breach would be catastrophic, exposing the personal information of innocent citizens to malicious actors. This would not only harm individuals who have done nothing wrong but also undermine the very purpose of KYC: to protect the financial system from illicit activities.\n\nSadly, these problems aren't limited to Europeans. The [Inflation Reduction Act](https://www.congress.gov/bill/117th-congress/house-bill/5376/text), which which paved the way for the hiring of 87,000 new IRS agents, is returning just $1 for every $60 spent. While this is 40% better than the ROI of worldwide KYC/AML measures, it's still far from impressive.\n\n![[https://twitter.com/YALiberty/status/1813925965422084107/](https://twitter.com/YALiberty/status/1813925965422084107/)](https://miro.medium.com/1*ZNSdwBsmaLhEBpZuLCeFgA.png)\n\nKYC measures have become increasingly invasive and cumbersome, requiring verification through multiple channels, including government-issued IDs, biometric data, and even social media profiles in some cases. The irony is stark: measures put in place to safeguard citizens are, in fact, rendering them more vulnerable to fraud and privacy breaches. This unintended consequence underscores the need for a critical reassessment of current KYC protocols.\n\nMoreover, the absurdity of the situation reaches new heights when bank account holders find themselves compelled to justify withdrawals from their own checking accounts. This infringement on financial autonomy raises serious questions about the balance between security measures and individual rights.\n\n![[https://x.com/DavidWolfe/status/1697025495911579777](https://x.com/DavidWolfe/status/1697025495911579777)](https://miro.medium.com/1*vnSMf_DCDNn9AUdDa_2D4w.png)\n\nThere is a reason why so many people around the globe are unbanked. The burden of KYC compliance falls disproportionately on marginalized communities, exacerbating existing socioeconomic disparities. Individuals lacking access to standard documentation or digital resources often face insurmountable barriers when attempting to access financial services. Paradoxically, KYC measures intended to protect the financial system are instead becoming instruments of financial exclusion, pushing vulnerable populations further into the economic periphery.\n\nThis systemic issue calls for a fundamental rethinking of our approach to combating financial crimes. Rather than subjecting every citizen to extensive scrutiny, law enforcement agencies should adopt more targeted strategies focused on identifying and prosecuting individuals involved in illicit activities. By shifting towards intelligence-led investigations and leveraging advanced analytics to detect suspicious patterns, authorities can more effectively address money laundering and terrorist financing without compromising individual privacy and autonomy.\n\n![[https://x.com/ConorChepenik/status/1770554561561833947](https://x.com/ConorChepenik/status/1770554561561833947)](https://miro.medium.com/1*j1mzp-PsHX7aklvM8TcSRA.png)\n\nIt's time for citizens to reassert their sovereignty and demand a comprehensive reevaluation of KYC practices. We should champion a world where government actions are transparent, while citizens retain their privacy - a right that should only be compromised for those in public service.\n\nLuckily, the rise of decentralized technologies is reshaping the landscape of global finance. Bitcoin, for instance, offers a paradigm shift in how we perceive and conduct financial transactions. Its public ledger provides unprecedented transparency without compromising individual privacy. Transactions, while pseudonymous, are verifiable when users choose to prove ownership through their private keys. [El Salvador's decision to make their national Bitcoin holdings public](https://bitcoin.gob.sv/) demonstrates how this technology can also enhance governmental financial transparency.\n\nThese innovations present a unique opportunity to combat financial crime while preserving individual rights and limiting government overreach. It's important to remember that the preservation of privacy isn't merely a personal preference; it's a fundamental right underpinning a free society. By resisting invasive KYC measures and demanding increased scrutiny of government actions, we can forge a path where individual liberty and effective governance coexist harmoniously.\n\nIt's high time we make privacy great again and ensure the government remains answerable. After all, a government that respects its citizens' privacy is one that truly serves the people - and that's the plot twist we should all be rooting for. It's a far better twist than say, I don't know, the sitting President of the United States using X (formerly Twitter) to announce their decision not to seek re-election. Now, wouldn't that be a plot twist for the ages? Especially if we lack a reliable method to verify who actually posted that tweet.\n\n![[https://x.com/ConorChepenik/status/1815368540284670200](https://x.com/ConorChepenik/status/1815368540284670200)](https://miro.medium.com/1*uKDe_X4mU6MPbJwWnhn_yQ.png)\n\n7/23/24\n\nConor Jay Chepenik",
  "wordCount": 1090,
  "readingTime": 5.163207547169812,
  "claps": 0,
  "voters": 0
}