{
  "id": "72cf942c61c2",
  "title": "Day 16",
  "createdAt": "2022-04-08 00:39:14",
  "tags": [
    "norfolk",
    "shiba-inu",
    "grateful",
    "bitcoin",
    "strike"
  ],
  "url": "https://chepenikconor.medium.com/day-16-72cf942c61c2",
  "content": "# Day 16\n\n![Norfolk, Virginia](https://miro.medium.com/1*kE2MXy7rPYoC9bbiplfytA.jpeg)\n\n![](https://miro.medium.com/1*Na7d5qpxw42Jsb7DI4iATw.jpeg)\n\n![Cool monument near my sister's apartment](https://miro.medium.com/1*BVimtISgaw5owk1wHLZY5Q.jpeg)\n\nVisiting my Sister in Norfolk, Virginia and so far I love it here. I feel fortunate to be able to travel and it was great watching the Bitcoin conference 2022 as I flew from Boston. Had the chance to walk around downtown Norfolk and it's incredible the military ships here. Being next to a Navy Ship is both humbling and a great remainder freedom is not free. It takes a lot of kinetic energy to protect this incredible country. From the NASDAQ's [website](https://www.nasdaq.com/articles/jack-mallers-strike-integrating-with-worlds-largest-pos-providers-to-enable-sovereign) \"Strike CEO Jack Mallers announced at Bitcoin 2022 that the company has partnered with three of the world's largest payments providers, Shopify, NCR and Blackhawk Network to enable bitcoin payments at stores throughout the country.\" This will bring the bitcoin payment rails to almost all retailers in the United States. Happy to see the world moving to a Bitcoin standard so we can have fewer Navy warships in real life and more in cyberspace (in the form of ASICS) protecting our wealth from censorship and inflation.\n\nOutside that life is good. Not much to report just feeling grateful. My sister's dog Sooki is adorable and makes me want a dog. Also, trying to think of a name for what I could call a newsletter. Want to do the Medium posts for a year straight, but after that maybe I'll start a newsletter called _Chep & Anon_. Pretend to have a discussion with whoever might be the audience. Probably feds but maybe some other bitcoiners seeking truth🤣\n\nConor Jay Chepenik\n\n4/7/22",
  "wordCount": 255,
  "readingTime": 1.5122641509433963,
  "claps": 0,
  "voters": 0
}