{
  "id": "751638f7e187",
  "title": "Day 301",
  "createdAt": "2023-01-18 03:33:03",
  "tags": [
    "icy",
    "debt",
    "kids",
    "meaning",
    "purpose"
  ],
  "url": "https://chepenikconor.medium.com/day-301-751638f7e187",
  "content": "# Day 301\n\nHad an interesting conversation with my stepdad about memes today. A quick google search will likely show you that \"Dawkins needed a noun to describe this concept of the transmission of an idea. He initially toyed with the Greek word _mimeme_, meaning imitation, but he wanted something shorter that gestured to the English _gene_. He landed on _meme.\"_\n\n> [**The Origin Of The Word 'Meme'**](https://www.sciencefriday.com/articles/the-origin-of-the-word-meme/)\n\nPretty interesting to see how much memes have caught on. If an idea can be conveyed easily it will spread like wild fire. Memes are pretty much modern day hieroglyphics. I'm confident that part of Bitcoin's success will come from the fact that Bitcoiners are incredible memers. You know who sucks at memeing? Most politicians hahahahahaha.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F3d7MMVkryPPYUuUCgp4UIz%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F3d7MMVkryPPYUuUCgp4UIz&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fae7e45a4050899a2378f4e75&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nListened to this podcast on my run today and it was pretty insightful. I've listened to Mr. Booth on countless podcasts but sometimes it is nice to have his ideas be reenforced over and over again. Like for example, the idea that we are measuring a new system from the old system and it's bound to be a bumpy ride (think BTC/USD price) Also the idea that we literally have to print money because the debt has gotten so big that to ever pay back is infeasible unless we print money so the current financial system will not collapse. However, I don't think this money printing can go on forever.\n\nKind of hard truths to face, but truths we should be facing nonetheless. I was joking with my stepdad today about how taxpayers owe a cool quarter million dollars in debt. Here is the receipt.\n\n![](https://miro.medium.com/1*Gcy4h7i3L90ovJ9CbdQxEQ.png)\n\n$94,211 debt per citizen and $246,867 debt per taxpayer. YEEESSHHHHHH. I looked my 10 day old daughter in the eye and said sorry Sloan hope you don't mind that the U.S Government ran up a quarter million in debt for you to pay back. At least when you become a taxpayer anyways. Truth be told though that number is likely to be much higher in the future. That money is going to be paid back with deflated dollars of course. Dollars printed out of thin air. This is why I'm saving in bitcoin for my family: the idea my newborn should have to pay debts because of kleptocrats doesn't work for me. Plain and simple as that.\n\nYou know my daughter was being fussy so I gave her a bath. It is the simple things that make me tear up. Looking at this child appreciate warm water seemed so profound. It was like looking at pure innocence. A little ball I can mold and teach and watch grow up. I'm the luckiest man in the world. Thank you God for blessing me with that perfect little girl. My life is forever changed for the better.\n\nAfter the bath she started crying immediately because she must've been cold. I dried her off and put her in a comfy onesie with bear ears. I'm glad my partner did the shopping because I would've have no idea what to get and this outfit was actually so icy❄️. She fussed for a little bit but I just kept padding her back and let her rest on my chest. From what my partner tells me skin to skin contact is super important and sure enough Sloan fell asleep.\n\nFeels good man. Having a kid is hard work but it gives me deep purpose in life. Bitcoin also gives me a solid mission to go after, but it is very different. It still blows my mind to look down and think damn she is half of my DNA. Also half of my partner's DNA. An amazing little mix.\n\nI'm watching the Atlash Shrugged movie so that's all for today. I must admit the book was better and this acting is subpar, but damn am I enjoying this movie.\n\n1/17/23\n\nConor Jay Chepenik",
  "wordCount": 662,
  "readingTime": 2.69811320754717,
  "claps": 0,
  "voters": 0
}