{
  "id": "759860f6ba07",
  "title": "Day 378",
  "createdAt": "2023-04-05 01:11:07",
  "tags": [
    "nostr",
    "bitcoin",
    "gigi",
    "writing",
    "v4v"
  ],
  "url": "https://chepenikconor.medium.com/day-378-759860f6ba07",
  "content": "# Day 378\n\nI found it. The Medium/Substack crossover for Nostr. Shoutout Gigi for showing me the way in his recent article. It's called [blogstack](https://blogstack.io/). Original naming? Clearly not. Badass? Absolutely.\n\n> [**Purple Text, Orange Highlights - How nostr can benefit readers and writers. | dergigi.com**](https://dergigi.com/2023/04/04/purple-text-orange-highlights/)\n\nThus, I will be copying and pasting all my Mediums over there as well because like Satoshi said \"information is easy to spread and hard to stifle.\"\n\nI'm going to summarize what I got out of Gigi's article. Might even turn it into an article for bitcoinnews.com because it's been awhile since I had my writing shared there and they practice V4V.\n\nNostr is a decentralized protocol for social media. It allows users to create and share content without the need for a central authority. The protocol is based on the idea of a distributed ledger, which is a database that is shared and maintained by a network of computers. This makes it difficult for anyone to censor or control the content that is shared on Nostr.\n\nThe Nostr protocol is made up of two main components: clients and relays. Clients are the software that users use to interact with the protocol. The Damus app made by [JB55](https://twitter.com/jb55?s=20) is a great example of a client for iOS. Relays are the computers that store and process the data that is shared on Nostr. If you have the desire you can even spin up a relay using [Umbrel](https://umbrel.com/) and a raspberry pi. Here is a [video](https://youtu.be/KahRH_u2UMA) on how to do so. When a user creates a post on Nostr, it is signed with their private key. This ensures that the post cannot be tampered with. The post is then broadcast to the network of relays. The relays verify the signature and then store the post. The post is then available for other users to view.\n\nNostr is a censorship-resistant protocol. This means that it is difficult for anyone to remove or censor content that is shared on Nostr. This is because the data is stored on a distributed ledger and is not controlled by any one entity. There are no username and passwords. Just public and private key pairs. You can view anyone's feed with their public key, but if you want to see private data, like messages, you will need a private key.\n\nNostr is still in its early stages of development, but it has the potential to revolutionize the way we interact with social media. Devs are pushing code quickly and responding to user feedback. JB55 even spun up a chatGPT bot on the platform so you don't have to go to openAI's website to proompt anymore.\n\n![](https://miro.medium.com/1*4spDXJjY2Jm5ajILVJHbFw.png)\n\nWhile the anti-censorship part of Nostr is cool that is only the beginning. Nostr's platform provides a value-for-value model, which allows writers to earn money from their work via zaps. On the Nostr protocol sending satoshis (the smallest unit of a bitcoin) just takes a few clicks. This eliminates the need for advertisers and algorithms to show users emotion provoking content in an attempt to keep their attention. Nostr has reduced the friction of value transfer and provided a seamless way for writers and readers to engage with each other in positive ways.\n\nAs the internet continues to grow, the amount of information available is increasing exponentially. With Nostr's platform, information is more accessible, and the value-for-value model encourages the creation of high-quality content. This creates a more level playing field for writers, who might not have been able to monetize their work through traditional publishing methods.\n\nWhile the idea of free information might be daunting to some, the reality is there is no one qualified to be the disinformation police. Propaganda is everywhere. People need to read as much as possible and weigh the bias for themselves. Nostr's model of providing value for value, rather than relying on advertising revenue, creates a more sustainable system for the production and dissemination of quality content. This incentivizes writers to create content that is valuable to readers, rather than clickbait.\n\nDespite being in its early stages, Nostr has already shown its potential to revolutionize the way we consume and share information. The platform provides a unique opportunity for writers to connect with readers while earning money from their work. The value-for-value model is more in line with the principles of a free and open internet, and it offers a refreshing alternative to the traditional platforms that rely on advertising revenue.\n\nIn conclusion, Nostr's platform offers a promising future for every single user of the protocol. We are just at the beginning. If you had told someone in 2011 that one day people would be earning Bitcoin by using their credit or debt card, they would have laughed at you. But today, it is a reality. And one day, I am going to tell my grandkids that I was getting paid 1000s of satoshis for shitposting. And they will laugh at me. But not because they think it's ridiculous. They will laugh because they will be amazed at how much money I was able to make for doing something that they enjoy. Also, earning a 1000 satoshis in 50 years is going to be a whole lot harder than it is today. Having both Nostr & Bitcoin empowers both creators and consumers of content like never before. We are creating a more sustainable and equitable model for the dissemination of information. You don't even have to part with your fiat to stack sats anymore. Just provide valuable content on Nostr and people will zap you.\n\n4/4/23\n\nConor Jay Chepenik",
  "wordCount": 960,
  "readingTime": 3.8226415094339625,
  "claps": 0,
  "voters": 0
}