{
  "id": "76a736282209",
  "title": "Day 1077",
  "createdAt": "2025-03-04 01:28:24",
  "tags": [
    "flag-football",
    "coaching"
  ],
  "url": "https://chepenikconor.medium.com/day-1077-76a736282209",
  "content": "# Day 1077\n\nToday was a special day. It was my first season as a head coach, leading a Youth Flag Football team. It was the JV tournament (3rd and 4th graders), and what a ride it turned out to be. We dominated the first two games, winning by solid margins, but the championship game? That was a different story. We started off rough, falling behind 13–0. Then, just as we were mounting a comeback, the ref made one of the wildest calls I've ever seen. My player had broken free, with nothing but open field ahead for a touchdown, and the ref blew the play dead by mistake. He shrugged and said \"my bad\" twice noting that he mistakenly thought the first down was the end-zone and that's why he blew the play dead. Like that fixed anything!\n\nThe team trudged back to me, heads down, some kids crying, and everyone looking super defeated and ready to give up. I pulled them together and said, \"We're getting it back, guys.\" Next play, by the grace of God, we scored a touchdown. Halftime hit shortly after, and since it was the third game of the day and getting late, we skipped the break and jumped right back in. We marched down the field and punched in another score to tie it up, 13–13.\n\nThe other team got the ball back and drove downfield, but we stuffed them 10 yards short of the goal line. I looked at my team and said, \"We're going down this field, and we're winning this game.\" Sure enough, a speed option play worked like a charm, and a slant route I'd drawn up for three receivers to the right hit perfectly - we scored the go-ahead touchdown. Up 20–13, our defense locked it down and sealed the victory.\n\nThat was hands-down one of the craziest flag football games I've ever been part of. I'm so proud of those young men (and one young woman) who gave everything, overcame adversity, and brought home a championship. Talking to them after the game, I nearly teared up. I congratulated them on an incredible season, told them how proud I was, and handed out 3D-printed trophies they'd earned. It was a beautiful moment.\n\nI've got to thank God for carrying us through the bad calls, the missed opportunities, and for showing us a way to win. That was a hard-fought victory and my heart was pounding faster when we threw that game-winning touchdown than it ever did during my playing days. Coaching was an absolute blast, and God willing, I'd love to do it again next season.\n\nNow, the varsity tournament is tomorrow. I'm hoping we can string together three more wins and bring home some hardware for them too. I got faith the varsity can find a way to win just like the JV did.\n\n![](https://miro.medium.com/1*8A4tJnyrOs1yEwlVXh6Umw.png)\n\n3/3/25\n\nConor Jay Chepenik",
  "wordCount": 486,
  "readingTime": 2.0339622641509436,
  "claps": 0,
  "voters": 0
}