{
  "id": "788028d779ca",
  "title": "Day 751",
  "createdAt": "2024-04-12 01:54:52",
  "tags": [
    "ai"
  ],
  "url": "https://chepenikconor.medium.com/day-751-788028d779ca",
  "content": "# Day 751\n\nMan humanity is really entering a period where we are only going to know what is real and what is fake based on some public/private key cryptography. Check out this AI enhanced video where they turned a rapper's coming out track into SBF doing it. The results are not only entertaining but astonishingly realistic.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/betafuzz/status/1778490724423483843&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAs AI capabilities continue to grow exponentially, online experiences could become unreliable, necessitating a greater reliance on public-key cryptography for verification. Although seemingly far-fetched, the potential for such a technological singularity seems increasingly plausible.\n\nIn this hypothetical future of advanced AI, in-person connections may become more valuable than ever, as they would offer a genuine experience unmatched by any digital simulation. The ability to interact face-to-face with others could become a cherished luxury, a respite from the ambiguity of the online world.\n\nWhile the trajectory of technological progress is uncertain, we are undoubtedly living through a pivotal moment in human history. How we navigate the challenges and opportunities presented by these rapidly evolving capabilities will shape our collective future.\n\nI'm bullish because creativity will soon be the main ingredient for creating incredible things. For the younger generations growing up with this technology, I believe their technological aptitude will make them masters of the world to come.\n\n4/11/24\n\nConor Jay Chepenik",
  "wordCount": 221,
  "readingTime": 0.8339622641509434,
  "claps": 0,
  "voters": 0
}