{
  "id": "78d886841356",
  "title": "Day 35",
  "createdAt": "2022-04-27 01:20:45",
  "tags": [
    "green-energy",
    "military",
    "bitcoin",
    "the-big-short",
    "bbs"
  ],
  "url": "https://chepenikconor.medium.com/day-35-78d886841356",
  "content": "# Day 35\n\nBeing a human is hard since our emotions can so easily get the best of us. No wonder politics is such an absolute shit show. If everyone made decisions based on first principle thinking we would not have the President talking about making every vehicle in the military [\"environmentally friendly\"](https://twitter.com/AlexEpstein/status/1517700400161320960?s=20&t=dMNzcuSOR6vQ7Kc1NpHSsg) (skip to the one-minute mark if you have a short attention span). While I do want to see the world spend more time addressing how to combat climate change I don't think making a military green is the answer. Our military is supposed to be protecting the United States and its citizens. How the hell are we supposed to do that with electric vehicles? I've yet to see an electric tank or fighter jet. Are we going to stop in the middle of the battle to charge these vehicles? Climate hysterics are very good at pulling on people's emotional strings but my god. I do not want the United States to become the laughing stock of the world because we thought making our military green would fix our climate issues.\n\nI do however support more hydro and nuclear plants being built. Green energy is great if we use green sources to get it. What good does having all-electric vehicles do if we're using coal to produce electricity? Outside of flexing to woke friends the fact you have an electric vehicle I'd argue it does no good. Unless we build reliable ways to produce electricity that are not harmful to the environment there is no way we make the switch to electric everything. Solar and wind seem great in theory but as I understand it they don't provide reliable energy sources (and require massive amounts of carbon to get set up in the first place). I'd like to note I'm not an expert but I like to think of myself as a critical thinker and I have the internet to help me learn.\n\nOn another note, [Anthony Pompliano](None)'s [Best Business Show](https://youtu.be/awRi0qQSCf0) today got me GASSED UP. This was the pump up speech I needed today that I didn't know I needed. Do recommend giving it a watch. For those not willing to take the time the TL;DR is those who provide value in the world get rich and those who don't bitch, complain, and tell others what they should do with their money. 🎯  Luckily, the United States is a capitalist society and I'm very happy to see the pendulum swinging back to the side of sanity. It's absolutely baffling some of the takes I've seen on Twitter about Elon buying Twitter. I'm sure the guy is far from perfect but where was everyone when Bezos bought WaPo? This [Tweet](https://twitter.com/elonmusk/status/1519020176884305920?s=20&t=iEnI5JRDbvXtjQFZ-wFzMQ) from Elon summed it up perfectly, \"The extreme antibody reaction from those who fear free speech says it all\". Preech brother. I'm reminded of a Preston Pysh quote when he said, \"There are plenty of problem identifiers out there but not that many problem solvers\". *Paraphrasing might've messed up the quote a little but you get the gist*\n\nSpeaking of identifying problems here is a great tweet my boy screenshotted before the 🐐🐻  (The Greatest all time Bear) deleted it. I might disagree with Michael about Bitcoin, but the dude is pretty damn smart when it comes to the legacy system. T_he Big Short i_s an excellent movie for those not convinced the system is fraudulent. I do not know Michael Burry nor have I ever had any contact with the dude. This take is based solely off what I saw in a film where an actor played him. My guess is Michael is so good at analyzing stonks that it actually hurts some of his picks. If we were in a free market he would've made even more of a killing than he already has. In this 🤡 🌎  T.A can only go so far. Again, this take might be wildly misinformed but if I had to guess that would be my guess XD.\n\n![](https://miro.medium.com/1*T5ZDdq2V0e-jMreEZa6RnA.jpeg)\n\nI sent this to my buddy in finance and he cracked me up by writing back,\"The guy made one right call and has been a permanent bear since hahaha\". Bears are the pessimists while bulls are the optimists. I guess this might partially explain why Burry hates crypto so much. Who knows? Not me because again I've never met or had any contact with the guy. I am a fan though, Michael is definitely my favorite pessimist.\n\nAnyways, until tomorrow anon.\n\n4/26/22\n\nConor Jay Chepenik",
  "wordCount": 753,
  "readingTime": 3.0415094339622644,
  "claps": 0,
  "voters": 0
}