{
  "id": "7b90ff71862",
  "title": "Day 270",
  "createdAt": "2022-12-17 23:15:39",
  "tags": [
    "coffee-shop",
    "soviet-union",
    "berlin-wall",
    "ukraine",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-270-7b90ff71862",
  "content": "# Day 270\n\nPut aside what you might think of Tucker and Fox news when you watch this video. Wild that the kleptocracy is still withholding documents about J.F.K's assassination. I don't consider myself a republican or a democrat. Don't think I ever will. I am a Bitcoiner who thinks liberty is the most important thing. I don't believe left or right offers what I'm looking for but I do have a great deal of respect for Tucker doing this kind of journalism which I imagine he will face extreme pressure for. This is not an easy thing to do in today's climate! Tucker can be a bit dramatic, but to be successful as a news anchor you have to be.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FPAiRmhXvJHs%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DPAiRmhXvJHs&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FPAiRmhXvJHs%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThree letter agencies in the U.S.A seem to have no problem trampling over the constitution and the citizens of this amazing country. I think democracy has its problems but overall has a lot of benefits. When citizens see stuff like this and what the Twitter files revealed about the F.B.I targeting users on Twitter (and presumably other big tech platforms) it erodes democracy. It makes it so less people have trust and faith in the current system. This is not a good thing. Social unrest is not something I'd like to see. Every time it becomes evident that the intelligence agency put their hands on the scale of democracy citizens get upset and rightfully so.\n\nI was listening to Micheal Malice on Lex Fridman's podcast this morning and they talked about the horrors of the Soviet Union. The Government in Russia created an environment where people were telling on their neighbors and constantly living in fear. They also told stories of starving people in Ukraine which led to some parents eating their children. I can't even imagine the hunger you must be feeling to consider eating your child. That is utterly insane. What gives me hope though is when Micheal talked about how it seemed improbable that the Soviet Union could fail. Apparently there were some who wanted to send in the tanks and crush any protestors during the fall of the Berlin wall. Military leaders rejected killing civilians and sure enough the wall fell despite many thinking this was impossible. I do recommend listening to the podcast because Micheal tells these stories much better than myself, but those ideas are so powerful.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F0PfXM8oja4kA6yTDwCGxBF%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F0PfXM8oja4kA6yTDwCGxBF&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f563ebb538d297875b10114b7&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nWhile I think the F.B.I, C.I.A, and many other three letter agencies are corrupt in their core I also believe there are good people in these organizations. People who want to see the United States to thrive and bring abundance to the world. I hope when the day comes those good people will overpower the will of the small evil minority and not attack the citizens of this country who just want our freedoms protected. God bless the forefathers of this country who put together the constitution which despite all the countless attacks on it has remained one of the most powerful pieces of paper ever written. Kind of crazy to think a piece of paper instilled the rights of over 300 hundred million citizens. Obviously this involved people fighting to protect these freedoms, but I don't know if those veterans would've fought if we didn't have the constitution we do.\n\nTo reflect on some positives today I ran 5 miles which felt good. Followed this up by going to Concord, MA with my girl to get some breakfast. They have a super nice downtown and we got a delicious meal at a place called Main Street Market & Cafe. I do recommend their mocha latte and breakfast bowl. After the meal we walked around and stopped at a local bookstore, a British store, and a wine & cheese shop. We got these delicious crunchie type candy bars from the British place. I didn't see any bitcoin books at the local bookstore so I didn't cop anything. I did laugh when I saw Ben Bernanke had his book featured though. I'm not saying that running the Fed is any easy job. What I am saying is that it is a corrupt job. You can't feel good about stealing from the American people via quantitive easing. The fact this dude has a book deal and a Nobel prize shows what a ðŸ¤¡ ðŸŒ  we are living in. I'm so happy my generation has bitcoin to store our wealth in. A new system that is the equivalent to a digital constitution. One that people can attack, but as far as I can tell should hold up even longer than the U.S constitution has. It's pretty amazing that this paper has held up so well since 1789.\n\n> Written in **1787**, ratified in 1788, and in operation since 1789, the United States Constitution is the world's longest surviving written charter of government. Its first three words - \"We The People\" - affirm that the government of the United States exists to serve its citizens.\n\nNow Bitcoin offers a digital ledger that we can include our history on. The genesis block is so legendary. Obviously, the primary use of bitcoin is to transfer value without an intermediary, but it can also serve as a ledger to write truths in on the extra space that each block contains. For those who don't understand what I'm talking about here is a picture of the first Bitcoin block ever mind. Still gives me chills to look at the genesis block. ðŸ˜Ž\n\n![](https://miro.medium.com/0*cegobOutSfKP6Iy0)\n\nFinally, my girl and I hit the local wine and cheese store. Feels good supporting small business in my area. Concord has some dope shops and while this little store was expensive they got some cheese and wine that is super delicious. I'm about to go drink some Mexican wine I sampled and ended up buying. I'm also about to eat the raw milk cheese I bought. I read somewhere that cheese makes the hangover less brutal and I can confirm it has helped me in the past. At least it did at Boston bitdevs earlier this week. Which I must say was such a cool event. Felt super American sitting in a coffee shop in downtown Boston talking about the freedom Bitcoin instills while also talking crap about the bill Senator Warren is trying to pass. Micheal Malice made the point that American's don't appreciate how good we have it. The mere fact we can criticize our President's and meet up to discuss things that the Government might not approve of with our fellow citizens is incredible. There are countries that would ruthlessly kill their citizens for doing either of these. America has its problems, but it also has a bright future. Don't let the kleptocrats tell you otherwise anonðŸ«¡\n\n12/17/22\n\nConor Jay Chepenik",
  "wordCount": 1121,
  "readingTime": 4.430188679245283,
  "claps": 3,
  "voters": 1
}