{
  "id": "7bd1b8b78f83",
  "title": "Day 1036",
  "createdAt": "2025-01-22 03:00:27",
  "tags": [
    "that",
    "man",
    "is",
    "free",
    "lets-go"
  ],
  "url": "https://chepenikconor.medium.com/day-1036-7bd1b8b78f83",
  "content": "# Day 1036\n\nToday Ross is a free man. You love to see it!\n\n![[https://x.com/ConorChepenik/status/1881878674200486079](https://x.com/ConorChepenik/status/1881878674200486079)](https://miro.medium.com/1*7n-ziIi3cMw-BImQV6G7Fw.png)\n\nI ended up buying this dope hoodie where the proceeds after expenses will go to Ross.\n\n![](https://miro.medium.com/1*Ox8APKX9HWHecnLUmMVS6w.png)\n\n![[https://x.com/Strike/status/1881859448156876892](https://x.com/Strike/status/1881859448156876892)](https://miro.medium.com/1*YCi9d0qruo2LuoYqYsWv1w.png)\n\nI also got in a great workout with my Dad. I'm going to end the day by doing a first draft for my article about Aqua wallet and Jan3.\n\n**Getting Over Your Bear Market Trauma With Aqua Wallet**\n\nJanuary 3rd holds special significance in the Bitcoin world. It marks the anniversary of the Genesis block, the very first block mined, and in 2024, [JAN3 chose this day to launch AQUA Wallet](https://jan3.com/blog/aqua-wallet-now-open-source-software/). Now in 2025 AQUA wallet has plans to grow aggressively and deliver one of the best wallet experiences out there for Bitcoiners.\n\nDesigned to make Bitcoin transactions seamless, AQUA supports on-chain Bitcoin, Lightning Network, and Liquid assets like USDT, offering non-custodial control with a focus on usability. The wallet aims to bridge the gap between Bitcoin enthusiasts and those in regions with unstable local currencies, and with a recent $5 million raise, JAN3 is pushing AQUA to the next level.\n\n\"The raise is really to go towards AQUA development and to push us to the next phase,\" said [Samson Mow, CEO of JAN3](https://x.com/Excellion). \"So far, everything we've achieved has been through organic growth, but now it's time to ramp up local integrations and marketing.\"\n\nThis expansion comes at a critical moment in Bitcoin's evolution, though Mow acknowledges that some remain hesitant after recent market cycles. \"There's a lot of market trauma still, and people get very upset,\" explains Samson from JAN3, fresh off their successful $5 million raise. \"But you have to look at all the different factors together, the tailwinds on Bitcoin and headwinds on fiat, to understand where we're going.\"\n\nThe recent funding will accelerate AQUA's development beyond its organic growth phase, with plans for local integrations and boots-on-the-ground marketing campaigns. But what sets AQUA apart isn't flashy features: it is the wallets practical utility.\n\n\"Most Bitcoin wallets are just focused on serving bitcoiners and making cool features for bitcoiners,\" Samson notes. \"The next opportunity is local on and off ramps - paying bills, remittances, things that ordinary people care about.\"\n\nPrivacy sits at the core of AQUA's design through its integration with Liquid. While users on Ethereum or Tron expose their entire transaction history and balances, Liquid offers confidential transactions by default. \"As Bitcoin gets more valuable, it's going to become a far more pertinent issue,\" Samson explains. The stakes are particularly high in volatile markets where financial privacy can be crucial for security.\n\nAQUA's modular framework extends beyond individual users to potential nation-state adoption. The wallet can be customized and white-labeled for government use, with flexible swap mechanisms that could accommodate local currencies. This adaptability proves especially relevant as countries race to embrace Bitcoin infrastructure.\n\n\"If some country says we need a wallet to facilitate Bitcoin in the economy, we can say, 'Hey, we got this thing,' and make it your own,\" Samson says. This flexibility already caught attention in Thailand, where officials are exploring sandbox opportunities.\n\nThe timing of AQUA's launch coincides with what Samson sees as a fundamental shift in the monetary landscape. \"Monetary changes in monies don't happen gradually - they happen very rapidly,\" he explains. Using a powerful analogy from his recent presentation in Vietnam, he adds: \"Bitcoin is just a ruler, and if you think of that, you need to switch over to this new standard of measurement. It's not about whether you like it or not, it's just a standard for measurement.\"\n\nThe wallet's practical approach extends to features like gasless transactions, allowing users to pay for Liquid USDT transactions with USDT itself through atomic swaps. This means someone in Argentina could receive $100 in Liquid USDT and immediately use it for transactions without needing to acquire Liquid Bitcoin first.\n\nTo strengthen their research and development capabilities, JAN3 recently brought on Nick Szabo, known for his pioneering work in cryptocurrency and digital contracts. His expertise in monetary history, cryptography, and law will help shape AQUA's evolution, particularly in facilitating international trade settlement.\n\nLooking ahead, JAN3 plans to integrate Bitcoin-backed loans through third-party providers, potentially without extensive KYC requirements. \"We're just a tech provider working on open-source software,\" Samson explains. \"Every service is integration, and we string them together and make them work holistically.\"\n\nAQUA Wallet has bold plans to become an elite Bitcoin wallet used by millions. It represents a bridge between the current financial system and what Samson sees as an inevitable transition to a Bitcoin standard. For those still haunted by bear market memories, AQUA offers a practical path forward, focusing not just on cool cypherpunks features, which to be fair Bitcoiners rightly love, but on genuine utility and accessibility.\n\n\"Everything will eventually be priced in sats,\" Mow concluded. \"It's not about whether you like Bitcoin or not; it's about recognizing that it's the best measurement tool for value.\"\n\nFor those still hesitant after recent market cycles, AQUA Wallet offers something more valuable than price predictions: a practical tool that makes Bitcoin useful in everyday life. By focusing on real utility rather than market speculation, AQUA is helping users move beyond market trauma and embrace Bitcoin's fundamental role in the future of money.\n\nYou can learn more about [Aqua Wallet](https://aqua.net/) and [Jan3](https://jan3.com/) on their websites and find their X accounts here: [https://x.com/AquaBitcoin](https://x.com/AquaBitcoin) & [https://x.com/JAN3com](https://x.com/JAN3com)\n\n— - - - - -\n\nOne more thought about Ross walking free:\n\n![[https://x.com/ConorChepenik/status/1881898344123187319](https://x.com/ConorChepenik/status/1881898344123187319)](https://miro.medium.com/1*OWMCef6dPR0qMrZu0ISt1Q.png)\n\n1/21/25\n\nConor Jay Chepenik",
  "wordCount": 923,
  "readingTime": 4.183018867924528,
  "claps": 0,
  "voters": 0
}