{
  "id": "7cf3cd98462b",
  "title": "Day 90",
  "createdAt": "2022-06-20 22:04:37",
  "tags": [
    "perspective",
    "child",
    "life",
    "parenting",
    "job"
  ],
  "url": "https://chepenikconor.medium.com/day-90-7cf3cd98462b",
  "content": "# Day 90\n\nLooking forward to raising a child that thinks critically. I went to the doctor today with my girlfriend to get a check up and got to hear my baby's heartbeat. I can feel a tingling in my own heart just writing this. Absolutely wild I'm going to have a kid, but I'm excited. I can only hope this will be them one day.\n\n![](https://miro.medium.com/1*agnH2cL4XGCrNcfPnuVLKA.jpeg)\n\nUltimately, I just want a healthy child who is happy. No one knows exactly what makes a good parent, but I'm going to do my best to be one. Exciting times ahead.\n\nGoing to see Top Gun with a buddy tonight. My Dad told me it was one of the best movies he has seen in a long time. I'm excited to celebrate America even if things might look dark. Optimists will win out no doubt about it.\n\nListened to an episode of the Tim Dillon show as I drove back to Boston from Jersey and he is hilarious. Interesting how funny people constantly lie and makeup half-truths, but I do think it's important to listen to stuff like that to A. get a grasp on the fact most stuff you see on the internet is fabricated and B. laugh at all the bullshit. So much bad news in the media, but I'm determined to remain optimistic about the future.\n\nNeed to be better about cutting out the seed oils. Ate like crap this weekend, but did have some delicious food. Going to have some popcorn and coke tonight but after that, I'm back on my meat diet come Tuesday. Shout out K&C cattle in Austin for the 100 pounds of grass-fed cattle I bought and got shipped up to Cambridge.\n\nFinally, reminder to myself: the more you accept failure and care less about your job the better you will do. Plenty of people I cold call are going to tell me to piss off. It's part of the gig but the sooner I accept it the better off I will be. Continue to radiate happiness and learn to love failure. If I can do those things I will be an incredible salesman and with the fire sale on bitcorn I might even have a full coin one day. So much to be hopeful for in the future and so much I can enjoy today in the present. Breath in... breath out... smile big anon. Life is a blessing and it's too short to waste it worrying about others who are preoccupied with their own bullshit. By not being preoccupied with all the things outside of our control we can finally learn to appreciate all the amazing things life has to offer.\n\n6/20/22\n\nConor Jay Chepenik",
  "wordCount": 453,
  "readingTime": 1.909433962264151,
  "claps": 0,
  "voters": 0
}