{
  "id": "7db5973b69aa",
  "title": "Day 298",
  "createdAt": "2023-01-15 04:27:36",
  "tags": [
    "binmucker",
    "dad-blogging"
  ],
  "url": "https://chepenikconor.medium.com/day-298-7db5973b69aa",
  "content": "# Day 298\n\nGoing to use today to finish up my week 1 blog for binmucker.com which I'm making some progress on. I spent a lot of today coding a part of the website that will be \"for the kids\" so I've been short on time to write this.\n\nBeing a father is a journey filled with surprises, both good and bad, mostly good though. One of the unexpected challenges is dealing with the umbilical cord as it starts to smell and wrinkle up. Although it's supposed to fall off naturally, it can be tough to wait for that to happen. My girl has been pretty adamant about waiting so I have but man do I hope it falls off soon! The smell is a mix of rotten eggs and sweaty wrestling matts. My Mom said we should put alcohol on it, but apparently that is no longer recommended because it kills all the bacteria, good and bad🤔\n\nThe other night, my baby cried a lot, possibly due to my partner eating curry. Although the internet says spicy foods doesn't affect breastmilk, I'm not so sure. Being woken up by a crying baby is not fun but it is part of the journey of being a father. I wouldn't have it any other way. My partner sent me this so it is possible that it was not the curry, but who knows. We were a bit stressed the other night.\n\n![](https://miro.medium.com/0*HpN7re-OKS-TrTc4.jpeg)\n\nOne of the most amazing surprises of fatherhood is the amount of love and devotion that you feel for your child. The bond between parent and child is unbreakable and unconditional. Being a father has also made me want to be a better person and to work towards creating a world filled with love, kindness, and understanding for my child's future. I believe that a world on a Bitcoin standard, free from central banks that steal citizens' money, is the best way to achieve this. People take unnecessary risks when they are playing a rigged game. When the game is fair everyone benefits together. Fair games create more win-win situations while rigged games often create lose-lose ones.\n\nBeing a parent also comes with a lot of responsibility. It can be overwhelming at times, but it puts things into perspective and makes me realize that it is my job to ensure my child's well-being. When you are spending the majority of the day making sure the kid is okay other things slip by the waste side. I am starting to get used to the messiness that comes with having a child. We try to keep my space clean but naturally there is bodily fluids and messes everywhere. It has become apparent it takes a team effort to keep things clean. Instead of striving for a spotless home, it is important to accept that it is not always possible and to do the best we can to keep things clean when we can. Naturally some days will be much better than others.\n\nIn conclusion, being a father is an amazing journey filled with love, laughter, and challenges. I would not trade the challenges for anything. It's a reminder to enjoy the little things in life and to be grateful for the amazing human body that is capable of healing itself. Watching my girl recover from this pregnancy has been incredible. Can't wait to find joy in the little surprises the world is full of. Things that I miss because of my preconceived notions, something a child does not have yet. The future is bright. God blessed me by giving me a child to grow and develop with each day.\n\n1/14/23\n\nConor Jay Chepenik",
  "wordCount": 613,
  "readingTime": 2.5132075471698117,
  "claps": 0,
  "voters": 0
}