{
  "id": "7e0e05a35bf2",
  "title": "Day 850",
  "createdAt": "2024-07-19 20:33:23",
  "tags": [
    "cernovich",
    "tucker-carlson",
    "jesus-christ"
  ],
  "url": "https://chepenikconor.medium.com/day-850-7e0e05a35bf2",
  "content": "# Day 850\n\n![[https://x.com/ConorChepenik/status/1814389169164283966](https://x.com/ConorChepenik/status/1814389169164283966)](https://miro.medium.com/1*0at52Iquy2ncAVKuge2rlA.png)\n\n\"I never believed in God, but you guys showed me the devil is real\" - Mike Cernovich. What an amazing quote. Watching [people get blown up with drones](https://x.com/GoldingBF/status/1804876521422942219) in the Russia/Ukraine war is something that makes me think yeah the devil is definitely real. Seeing such horrors unfold on a phone screen, safely distant from the battlefield, one is struck by the stark reality of human cruelty. What is even crazier is that amidst all the noise distracting us on social media, we're exposed to demonic acts like these and casually move on to the next video as if nothing out of the ordinary is happening!\n\nThis overwhelming presence of darkness demands a profound reevaluation of our beliefs: if such unfathomable evil exists, then surely its opposite - God and the light - must also be real. \"You can't have light without dark.\" Cernovich's brutally honest words have compelled me to confront the fundamental dualities of good and evil in our world, urging me to seek the light amidst the encroaching shadows. I know I'm a sinner and that I will never achieve the perfection of Jesus Christ, but striving to be more like Christ is a noble pursuit.\n\nWithin us lies a profound dichotomy: the duality of thinking with our hearts versus our minds. Logic is great for navigating practical matters, but it will stifle our spiritual growth if we rely too heavily on its rationality. The heart, on the other hand, whispers intuitive truths that can guide us through life's murky waters. People instinctively know that satisfying experiences nourish the soul, while unsatisfying ones leave a lingering emptiness. Yet, we often dismiss this inner wisdom by letting logic dictate our decisions. To tap into our gut instincts and access our inner wisdom, we must cultivate the ability to listen to our hearts; a skill too often neglected in today's fast-paced world.\n\nThe quote that resonated most deeply during the interview was this arrow/quiver prayer: \"Jesus Christ, son of God, have mercy on me, a sinner.\" This profound expression of humility and vulnerability is a powerful reminder of what Jesus sacrificed so we could join him and the Alpha & Omega in heaven. We are all redeemable because of him.\n\nA personal favorite bible story of mine is when a bunch of people want to stone someone accused of adultery and Jesus said \"Let any one of you who is without sin be the first to throw a stone at her.\" (John 8:7) Jesus' had an unwavering compassion and understanding for others. A truly special ability to recognize that we are all imperfect, and only through Christ's sacrifice are we able to find redemption. May we strive to listen to our hearts, embrace our vulnerability, and seek redemption through the love of Jesus Christ. Amen.\n\n![Listen To Your Heart!](https://miro.medium.com/1*9Fek7v9IoxTAicd2C2kEcQ.png)\n\n7/19/24\n\nConor Jay Chepenik",
  "wordCount": 473,
  "readingTime": 2.168238993710692,
  "claps": 0,
  "voters": 0
}