{
  "id": "7fa3a8346567",
  "title": "Day 560",
  "createdAt": "2023-10-04 03:52:17",
  "tags": [
    "nyc",
    "bitcoin",
    "meetups",
    "renewable-energy",
    "fiat"
  ],
  "url": "https://chepenikconor.medium.com/day-560-7fa3a8346567",
  "content": "# Day 560\n\n> [**Americans Just Don't Understand The Importance Of Bitcoin**](https://bitcoinmagazine.com/culture/americans-just-dont-understand-bitcoin)\n\nLessons from a Bitcoin Meetup in NYC\n\nI recently attended a Bitcoin meetup in New York City, hosted by the author of the article above who originally told me the story about the Russian oligarch transporting $7 million out of the country. It was an insightful evening learning more about how Bitcoin can improve energy markets.\n\nOne topic that came up was negative pricing in electricity spot markets. This occurs during periods of oversupply, when producers need to pay buyers to take excess power off the grid. It poses challenges, but Bitcoin mining can act as a constant buyer of last resort, absorbing extra production 24/7/365.\n\nI spoke with an older gentleman at the meetup who was impressed by this use case. He noted that for a currency with no intrinsic value, having a perpetual global market to sell in is essential. I believe bitcoin derives value from the energy required to mine it, but this perspective is not intuitive to those with a traditional economic viewpoint.\n\nBitcoin's value stems from its utility, ingrained scarcity, and the computational power securing the network. It does not require government backing or physical materials. Bitcoin is not a company, it provides global banking infrastructure and has unique advantages as a censorship-resistant store of value and means of exchange.\n\nThe meetup tonight offered mw great networking and conversations while taking in the NYC skyline. The goody bag even included a cookie and NYC-themed magnets. While visiting the city can be overwhelming, you can find inspiration in its relentless energy. Just like Bitcoin, NYC is a beast that never sleeps.\n\n![The Magnet in my goodie bag](https://miro.medium.com/1*FlECdkVknCzzlcyQMfKtkg.png)\n\nI highly recommend attending more Bitcoin meetups, my anonymous friend. Tonight's event reinforced Bitcoin's immense potential in my eyes, both as a disruptive financial technology and a solution for improving energy infrastructure.\n\nDiscussing real-world use cases with enthusiastic experts provided invaluable insight into this groundbreaking digital asset. It drove home the ways Bitcoin could address the systemic problems and risks created by our current fractional reserve banking system.\n\n10/3/23\n\nConor Jay Chepenik",
  "wordCount": 369,
  "readingTime": 1.5924528301886791,
  "claps": 0,
  "voters": 0
}