{
  "id": "7fb72a37ee1",
  "title": "Day 509",
  "createdAt": "2023-08-14 01:35:33",
  "tags": [
    "johnny-manziel",
    "social-circles",
    "children",
    "meaning",
    "winners"
  ],
  "url": "https://chepenikconor.medium.com/day-509-7fb72a37ee1",
  "content": "# Day 509\n\nYour social circle has a large impact on your success. I need to focus on making sure I spend time with winners. Humans are like chameleons in the sense we start to mirror those we hang around. This analogy makes sense to me. If everyone you hang out with thinks that things are doomed then it is almost guaranteed that you will think things are doomed. If everyone around you sees opportunities to improve the world then you will see opportunities to improve the world.\n\n![a chameleon generated on nightcafe.studio](https://miro.medium.com/0*HHB7YCz1sHtvhbo2)\n\nToday I watched the Untold documentary about Johnny Manziel on Netflix. Super enjoyable documentary. The biggest takeaway is that money, fame, and career success are not truly fulfilling. Which is not what we are all taught by society.\n\n![Johnny Manziel](https://miro.medium.com/0*haY1meadwf2MNVjj)\n\nTruly eye opening to see someone, who from the outside seemed like they had it all, admit they never felt emptier after all the success. Johnny got to be an NFL quarterback, party with the most famous people in the world, and acquire millions of dollars in the process and he said while he was at Cleveland he felt empty. None of the things people expect to make you happy made Johnny happy.\n\nWhen I became a Father this year I felt something I have never felt before. Unconditional love. I'm a flawed being like everyone else but man does having a kid grow your heart in a way words just can not explain.\n\nI'm grateful I got to be a part of the reason life was brought into this world. For all the mistakes I made, having a kid is not one of them. Sure I still get sad, frustrated, angry, annoyed, and every other emotion that is not typically associated with positive connotations. However, seeing my child smile, laugh, and just be in this world fixes that instantly. Kids have such an incredible way of just living in the moment.\n\nToday I enjoyed sitting in the grass and grounding with my daughter. She was laughing so hard. Before I know it she is going to be an adult. At some point I won't be able to see this innocent baby appreciate things for the first time because she will have become a fully sovereign adult. I'm confident she will go on to do great things in this world and I'm also confident I will feel a great sense of nostalgia when she is no longer my little nugget.\n\nI hope I'm a good enough parent to teach her what really matters in this world. Love, family, relationships. Success and money are fantastic and they can alleviate a lot of problems. They clearly can't fill that void in your heart though.\n\nSloan Marie if you ever read this just know you and your Mom are the best thing that ever happened to me. Having you provided my life with meaning I never thought possible. I pray that I get to have more kids because it's hard to feel empty when you have little ones depending on you.\n\n8/13/23\n\nConor Jay Chepenik",
  "wordCount": 507,
  "readingTime": 2.296540880503145,
  "claps": 0,
  "voters": 0
}