{
  "id": "7fdb086a5c1d",
  "title": "Day 1076",
  "createdAt": "2025-03-03 03:41:18",
  "tags": [
    "writing",
    "stuff",
    "both",
    "on-medium",
    "and-in-person"
  ],
  "url": "https://chepenikconor.medium.com/day-1076-7fdb086a5c1d",
  "content": "# Day 1076\n\n![[https://quotestoansweryourquestions.replit.app/](https://quotestoansweryourquestions.replit.app/)](https://miro.medium.com/0*XqfhTD4WzLybSd3o.jpg)\n\nLet's check in on that list I made last week:\n\nSo for this 5 (really 7) part list I made yesterday here was the progress:\n\n1. **Complete three Bitcoin news articles.** (3/3 completed see final completed one below LETS GO)\n\n2. **Deploy a breathing app online.** (Done check out [breathbetter.io](https://breathbetter.io/))\n\n3. **Go on a date night with my wife.** (It was amazing. I love you Paige)\n\n4. **Practice breathing exercises every day this week.** (Yes, I did a good job being more mindful of my breath and used my breathing app with Sloan. She loves it and seems to be mindful of her own breath)\n\n5. **Clear the back porch of all bricks and stones to prepare for pouring a new concrete pad with my father-in-law's help.** (check)\n\n6. **Improve my Binmucker.com website with a fun game users can play while clicking around.** (Yes click the game on [binmucker.com](https://binmucker.com/))\n\n7. Make 7 memes I post on X.com (nope this one was an L)\n\n6/7 but when I first wrote this I titled it 5 things and then wrote 7. So a 6 of 7 will do.\n\nWriting stuff down makes you more likely to do it. So here is that final Bitcoin News Article I need to write :)\n\n**From NASA to Bitcoin: How KULR Technology Is Betting on the Future**\n\nMichael Mo, CEO of KULR Technology Group, has orchestrated a fascinating pivot in corporate America. From thermal management for NASA spacecraft to pioneering Bitcoin treasury adoption. A company that once focused exclusively on keeping spacecraft from overheating is now simultaneously protecting its financial future with sound money.\n\nKULR Technology Group, known for its NASA-backed thermal management solutions, has made a bold leap into the digital assets space, adopting a Bitcoin treasury strategy on December 4, 2024, [committing up to 90%](https://www.sec.gov/Archives/edgar/data/1662684/000110465925001101/tm251998d1_ex99-1.htm) of its surplus cash to Bitcoin acquisitions. Following this announcement, the company's stock price surged, reaching an all-time high of $4.80 on December 26, 2024, validating Mo's vision at the intersection of space technology and digital currency.\n\n![[https://www.google.com/search?q=%24kulr&sca_esv=6eb41dc8fa89dafa&sxsrf=AHTn8zqhGAYKhszQ8Y1ptwDKdCrEULmfmg%3A1740971615126&ei=Xx7FZ4iqB9-1wN4P6I-euA8&ved=0ahUKEwjI1bvV-OyLAxXfGtAFHeiHB_cQ4dUDCBA&uact=5&oq=%24kulr&gs_lp=Egxnd3Mtd2l6LXNlcnAiBSRrdWxyMgQQIxgnMgUQABiABDIFEAAYgAQyBRAAGIAEMgUQABiABDIEEAAYHjIEEAAYHjIEEAAYHjIEEAAYHjIEEAAYHki9CVAAWKQIcAB4AZABAJgBbaAB5gOqAQMzLjK4AQPIAQD4AQGYAgWgAv8DwgIEEAAYA8ICCBAAGIAEGLEDwgILEAAYgAQYsQMYgwHCAg4QABiABBixAxiDARiKBcICCBAuGIAEGLEDwgIKEAAYgAQYFBiHApgDAJIHAzIuM6AHiSE&sclient=gws-wiz-serp](https://www.google.com/search?q=%24kulr&sca_esv=6eb41dc8fa89dafa&sxsrf=AHTn8zqhGAYKhszQ8Y1ptwDKdCrEULmfmg%3A1740971615126&ei=Xx7FZ4iqB9-1wN4P6I-euA8&ved=0ahUKEwjI1bvV-OyLAxXfGtAFHeiHB_cQ4dUDCBA&uact=5&oq=%24kulr&gs_lp=Egxnd3Mtd2l6LXNlcnAiBSRrdWxyMgQQIxgnMgUQABiABDIFEAAYgAQyBRAAGIAEMgUQABiABDIEEAAYHjIEEAAYHjIEEAAYHjIEEAAYHjIEEAAYHki9CVAAWKQIcAB4AZABAJgBbaAB5gOqAQMzLjK4AQPIAQD4AQGYAgWgAv8DwgIEEAAYA8ICCBAAGIAEGLEDwgILEAAYgAQYsQMYgwHCAg4QABiABBixAxiDARiKBcICCBAuGIAEGLEDwgIKEAAYgAQYFBiHApgDAJIHAzIuM6AHiSE&sclient=gws-wiz-serp)](https://miro.medium.com/1*_2TI6jHwgC0BW46UwKZkMQ.png)\n\n![[https://www.google.com/search?q=%24kulr+price&oq=%24kulr&gs_lcrp=EgZjaHJvbWUqCAgAEEUYJxg7MggIABBFGCcYOzIOCAEQRRgUGDkYhwIYgAQyDAgCEAAYFBiHAhiABDIHCAMQABiABDIHCAQQABiABDIGCAUQABgeMgYIBhAAGB4yBggHEAAYHjIGCAgQABgeMgYICRAuGEDSAQgxMDA0ajBqMagCALACAA&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=%24kulr+price&oq=%24kulr&gs_lcrp=EgZjaHJvbWUqCAgAEEUYJxg7MggIABBFGCcYOzIOCAEQRRgUGDkYhwIYgAQyDAgCEAAYFBiHAhiABDIHCAMQABiABDIHCAQQABiABDIGCAUQABgeMgYIBhAAGB4yBggHEAAYHjIGCAgQABgeMgYICRAuGEDSAQgxMDA0ajBqMagCALACAA&sourceid=chrome&ie=UTF-8)](https://miro.medium.com/1*8pfoSRwSTSuXazu9-HTK-w.png)\n\nBitcoinnews spoke with KULR's co-founder and CEO, Michael Mo, about the company's evolution, its Bitcoin play, and how space technology, AI, and energy management all intersect with the world's hardest money.\n\n**Space-Proven Tech Meets Bitcoin Strategy**\n\n\"We started KULR in 2013,\" Mo explained. \"We're an energy management platform company, and we do a lot of thermal management, energy management, and lithium-ion battery safety work.\"\n\nKULR's technology is no joke their solutions are used on the Mars Rover and the International Space Station, keeping electronics cool and batteries safe in the most extreme environments. The company's goal is to bring this space-proven tech into commercial industries like energy storage, AI, robotics, and e-mobility.\n\nBut the biggest headline-grabber? KULR's decision to make Bitcoin its primary treasury asset. The company now holds over 610 BTC and has a target of 1,000 BTC to become what Mo calls a \"Bitcoin standard company.\"\n\n**The Orange Pill Moment**\n\nLike many who go deep into Bitcoin, Mo remembers the exact moment it all clicked for him.\n\n\"I was convinced about the strategy after I listened to MicroStrategy's Q3 2024 earnings call,\" he said. \"Michael Saylor's thoughts were so clear to me, and it really clicked.\"\n\nBefore diving in, Mo ran a survey on X (formerly Twitter) to gauge stakeholder sentiment. \"We got two-thirds of people saying yes, one-third saying no,\" Mo recalled. \"Out of the third who said no, about one-third were just not into Bitcoin at all, and the rest were concerned about financial stability or whether it was a distraction for the company.\"\n\n![[https://x.com/michaelmokulr/status/1863568878065828067](https://x.com/michaelmokulr/status/1863568878065828067)](https://miro.medium.com/1*ddmizn7Sbm8vduwcmm130Q.png)\n\nSince then, Mo believes the results speak for themselves. \"We've proven to people that we can chew gum and walk at the same time.\"\n\n**The Bitcoin-Space-AI Connection**\n\nKULR isn't just making waves in Bitcoin. The company sits at the crossroads of several major technological trends.\n\n\"We're at the cross-section of energy storage, AI, robotics, and Bitcoin,\" Mo said. \"We pretty much cover four of the five themes that Cathie Wood talked about as big ideas for 2025.\" (The missing fifth? \"Human genomics, which I don't think we'll be getting into - at least not in 2025!\")\n\nThis convergence has brought unexpected benefits. Bitcoiners, it turns out, love space tech and AI.\n\n\"One of my tweets about how many Bitcoins we bought got a quarter million views in two days,\" Mo noted. \"That's helped us on the operating side, too. It's become a great recruiting tool. I post job openings, and before you know it, we have hundreds of applicants.\"\n\n![[https://x.com/michaelmokulr/status/1889306630883332097](https://x.com/michaelmokulr/status/1889306630883332097)](https://miro.medium.com/1*DCo7gsgK8JFSI_QkMjgLeA.png)\n\n**Learning from Saylor**\n\nMo's Bitcoin journey took an interesting turn when Michael Saylor himself noticed KULR's move.\n\n\"Michael commented on my post, I commented back, and he invited me to his house,\" Mo recalled. \"I went to his New Year's Eve party, which was absolutely amazing. We spent an hour the day before talking about KULR, our strategy, and capital markets.\"\n\nSaylor's guidance confirmed that KULR was on the right track. \"He made me feel like how we were thinking about it was consistent with how he thought about it in 2020.\"\n\n**The AI Factor**\n\nMo sees artificial intelligence as another major force reshaping business.\n\n\"AI is like the modern-day calculator,\" he explained. \"When the calculator was invented, there were people who thought they could outsmart it. But it doesn't matter how high your IQ is - nobody has ever outrun a calculator.\"\n\nAI is rapidly changing corporate strategy. \"Nobody should be surprised that by the end of 2025 their AI bot will be the number one coder in the world,\" Mo predicted. \"And this is not just one coder in the world - that means that you can have a million number one coders in the world working for your organization at any point in time and coding 24 hours a day, 7 days a week. Why would you not be a software and AI company when you have that intelligence available?\"\n\nFor KULR, AI at the edge is the real game-changer. \"We're thinking about AI in energy storage, in automation, in robotics - how it all connects to the broader future.\"\n\n**The Future: AI, Bitcoin, and Automation**\n\nLooking ahead, Mo sees AI, Bitcoin, and automation converging in ways few companies are prepared for.\n\nSince AI can't open traditional bank accounts, they won't be settling in dollars or physical gold bars. Instead, they'll likely be operating through microtransactions and smart contract platforms, with Bitcoin serving as the foundation layer.\n\nFor companies that aren't paying attention, Mo had a blunt warning: \"If you don't think about this, somebody else will - and they'll kick your a**.\"\n\n**Final Thoughts**\n\nWhen asked what he'd ask Bitcoin's mysterious creator, Satoshi Nakamoto, if given the chance, Mo didn't hesitate.\n\n\"Why the he** did you do it? What were you thinking?\" he said, laughing. \"I'd love to know the moment it all clicked for him - the philosophy, the journey to get there.\"\n\nAs our conversation wrapped up, Mo reflected on KULR's approach to Bitcoin and why it's not just a balance sheet decision - it's a strategic shift.\n\n\"Some people think Bitcoin is a means to an end. Others think Bitcoin is the end. The truth is somewhere in between,\" he said. \"As a business, if you integrate Bitcoin with your operating philosophy and think about it alongside AI, the future of money, and automation, it becomes a fascinating multi-dimensional chess game.\"\n\nFor companies that have already adopted Bitcoin, the game is just getting started and they're already several moves ahead of their competitors.\n\n```graphql\n#Feels good to get 3/3 articles written. LETS GO!\n```\n\n3/2/25\n\nConor Jay Chepenik",
  "wordCount": 1282,
  "readingTime": 5.671069182389937,
  "claps": 0,
  "voters": 0
}