{
  "id": "8020dab588cf",
  "title": "Day 1043",
  "createdAt": "2025-01-29 02:06:01",
  "tags": [
    "flash",
    "pay-with-flash",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-1043-8020dab588cf",
  "content": "# Day 1043\n\n**Flash: Building the Future of Self-Custodial Bitcoin Payments**\n\nIn a world where convenience often trumps security, [Flash](https://paywithflash.com/) is charting a different course. This Bitcoin payment company is proving that seamless payments and self-custody aren't mutually exclusive: they're essential partners in pushing Bitcoin adoption forward.\n\n![**Set up in under a minute, enjoy instant transactions, and pay minimal fees.**](https://miro.medium.com/0*Wi2jg8JVg9uH-yGK)\n\n\"Are we pushing Bitcoin forward, or are we just creating a Bitcoin use case for ourselves?\" This question helps drive every decision at Flash, according to their founder [Pierre](https://x.com/CierrePorbin), who spoke with Bitcoin News about the company's mission to revolutionize digital payments while staying true to Bitcoin's core principles.\n\nPierre's journey into Bitcoin began like many others during the 2017 crypto boom, but it was during the subsequent bear market that he discovered Bitcoin's deeper value proposition. \"Everyone I started following and everything I was reading about crypto transitioned to talk about Bitcoin,\" Pierre recalls. \"I listened to a bunch of podcasts from Saifedean, that got me started. I bought The Bitcoin Standard and just kept going down the rabbit hole.\"\n\nHis passion for Bitcoin led him to quit his corporate job without a clear plan. Though he had programming skills, he initially felt there wasn't space for him as a builder in Bitcoin, a belief he now calls \"complete bulls***.\" During a sabbatical, he created what would become one of the most-viewed Bitcoin documentaries and went on to organize the Bitcoin Film Festival in Warsaw, Poland.\n\n![**You can watch the documentary here on Youtube for free: [The Great Reset And The Rise of Bitcoin | Bitcoin Movie | Documentary | Central Banks](https://www.youtube.com/watch?v=e0plyXEc1Ak)**](https://miro.medium.com/0*rWwQAtPL7Eu5HXC4)\n\nThe genesis of Flash came when Pierre's friend and future co-founder approached him about exploring opportunities in AI. Pierre agreed with one condition: \"If I do something, it's got to be in Bitcoin.\" Their initial project, \"Talk to Satoshi,\" was an AI chatbot based on Bitcoin books and Pierre's documentary. While implementing Lightning tips for the chatbot, they encountered liquidity issues that would later inform Flash's development.\n\nThrough building various Bitcoin projects, they discovered the power of Nostr Wallet Connect, created by the team at [Alby](https://getalby.com/). \"The moment we have this tech, how are we not going to use it?\" Pierre asks. \"Direct debit into self-custody is the future of payments.\" This open-source protocol solves a crucial problem in Bitcoin payments. It lets Bitcoin wallets talk directly to websites and apps, similar to how you might connect your credit card to Spotify or Netflix for automatic payments, but with one key difference: you keep full control of your Bitcoin. Instead of trusting a company to hold and manage your funds, Nostr Wallet Connect lets Flash build payment systems where users maintain complete ownership of their Bitcoin while still enjoying the convenience of modern payment features. It's like having the security of a personal safe combined with the ease of use of a credit card.\n\nFlash's implementation of Nostr Wallet Connect creates a seamless payment flow. \"When you generate an invoice from the Flash checkout in your WooCommerce store, this lightning invoice is generated from your self-custodial mobile wallet,\" Pierre explains. The system then handles two peer-to-peer transactions: one from the customer to the merchant, and a second automatic transaction from the merchant's wallet to Flash for their 1.5% fee.\n\nThe company is tackling ambitious challenges, including developing their own self-custodial wallet with advanced notification capabilities. A key innovation is their subscription service, which automatically triggers payments while maintaining user custody of funds. \"We're the only ones to do subscriptions because Nostr Wallet Connect allows us to automate the payments,\" Pierre notes.\n\nThe challenges of building truly self-custodial solutions became clear when Pierre helped a family friend set up a Bitcoin wallet. Concerned about bank account freezes, she wanted to explore Bitcoin as an alternative. However, when Pierre explained the responsibility of key management, \"her face just went scared,\" he recalls. \"But what were you expecting? If it's not a bank that's responsible for your money, it has to fall back onto you.\"\n\nThis interaction highlights a crucial challenge in Bitcoin adoption: helping users embrace the responsibility of true ownership. While managing your own keys can seem daunting at first, it's this very responsibility that gives Bitcoin its power. When you hold your own keys, no bank can freeze your account, no government can seize your funds, and no company can decide how you spend your money. It's the difference between parking your car in someone else's garage versus your own. Sure, the valet parking might seem more convenient, but you're trusting someone else with your keys.\n\nFlash is working to bridge this gap by making self-custodial payments as seamless as traditional financial services, without compromising on the sovereignty that makes Bitcoin revolutionary. As Pierre explains, \"Somehow I have multiple bank accounts, but most people have one bank account and you don't really need more than one, you can interact with almost anyone and any kind of platform with just this one account. It should work the same way with Bitcoin.\"\n\nBy developing tools that maintain Bitcoin's core principles while improving user experience, Flash is helping shape a future where self-custody doesn't mean sacrificing all the modern conveniences that come when using a third-party. Their approach demonstrates how businesses can process payments and generate revenue without creating the massive data honeypots that come with traditional KYC requirements.\n\n\"We're at the point now where we can focus on building use cases and user experience,\" Pierre reflects, noting how improved development tools have simplified many technical challenges. \"The code I write, it's not nice... I'm not a good developer, I'm just a developer that can build stuff. But all of these complex elements of Bitcoin have now been simplified to the point where with just a few basic libraries, you can create something meaningful.\"\n\nSpeaking with their team it's clear the end goal is to make selling stuff online for Bitcoin as natural as checking your phone. Flash is helping build a world where holding your own keys isn't just an option for the tech-savvy, but the obvious choice for everyone. To learn more about Flash and join the conversation about self-custody, follow them on Twitter at [@paywithflash](https://x.com/paywflash)\n\n1/28/25\n\nConor Jay Chepenik",
  "wordCount": 1018,
  "readingTime": 4.2248427672955975,
  "claps": 0,
  "voters": 0
}