{
  "id": "8041b0c406f5",
  "title": "Day 71",
  "createdAt": "2022-06-02 01:11:34",
  "tags": [
    "random",
    "sadness",
    "humanity",
    "work"
  ],
  "url": "https://chepenikconor.medium.com/day-71-8041b0c406f5",
  "content": "# Day 71\n\nToday is just one of those days where I do not feel happy. Listened to some great podcasts, had a nice lunch time walk, and had some good stuff happen but I just feel miserable. Part of being human. Life is finite and even just typing that out gave me a little smile. It is okay to feel bad. Recognizing that life is full of pain seems to be the only way to accept it. Some days are just better than others and I feel comfort in typing that out. It is days like today I am reminded of the importance of the little things. Being able to hug my girlfriend and feel her hold me; that is some goodshit I just take for granted.\n\nThis is the [podcast](https://youtu.be/mRUKgiSbnRw) I listened to this morning and it hit home. Our system will fall and a new one will rise. A better system that doesn't screw the little guy. Been on a Breedlove kick recently and I must say his content has been fantastic. It is crazy the video has a context warning on it that reads, \"The Great Reset is the name of the 50th annual meeting of the World Economic Forum, held in June 2020. The meeting soon become the focus of various conspiracy theories.\" Screw The Great Reset and what the clowns at the WEF want to do. It won't happen though. I have the utmost faith in truth winning out. I did click the context link for shits and giggles which led to me clicking on Klaus Schwab's wiki page and today I learned that \"He has acted as the WEC's chairman since founding the organisation in 1971.\" Thought it was the WEF but maybe it was just a typo on Wikipedia? It is pretty funny that 1971 is also the same year America went off the gold standard. Doubtful they are related but what a nice twist of irony. Argueably one of the most evil organizations in the world was created the same year Nixon let the U.S essentially default on its debt by going off the gold standard. I'm already feeling better laughing at this fact.\n\n![](https://miro.medium.com/0*Vn3REBVwYa-n3QKH)\n\nAlso got some feedback on my bitcoin magazine piece. Needs a lot of work but it actually means a lot the editors over there took the time to help me become a better writer. That is what the Bitcoin community is all about. Giving up your time to give back to others. Helping others provide value in the real world. I think what had me down today was just feeling like my sales gig is so stupid, pointless, and useless. Which is not true. Any job is what I make of it. The people at my work seem to be good people and I think I'm focusing too much on how others might feel that a salesperson is reaching out to them. I'm putting too much of my worth in what others think of me which is causing me to think less of my sales gig. Idea for tomorrow: Focus Inwards! Learn to love yourself no matter how many times someone tells me to kick rocks. Good advice to myself. Glad I put some words on a screen tonight. I feel much better.\n\n6/1/22\n\nConor Jay Chepenik",
  "wordCount": 549,
  "readingTime": 2.2716981132075476,
  "claps": 50,
  "voters": 1
}