{
  "id": "80f3455a327",
  "title": "Day 373",
  "createdAt": "2023-03-31 01:27:33",
  "tags": [
    "hope",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-373-80f3455a327",
  "content": "# Day 373\n\nIt is kind of hilarious that prompt engineering is become such a sought after job. The good part of this article with the solid prompts is pay walled, but even the beginning is fantastic.\n\n> [**What Are AI SuperPrompts And Why They Are Important.**](https://readmultiplex.com/2023/03/30/what-are-ai-superprompts-and-why-they-are-important/)\n\nHuman language only makes sense if you understand the language being spoken. This might seem obvious on the face of it, but it is something this article made me think more about. Kind of want to learn more languages. Even learning javascript helps me think logically in a way I had not thought about beforehand. I'm sure there are plenty of advantages to speaking multiple languages including being able to think differently about things. One of the reasons it is so hard to rebel in North Korea is because their language is so restrictive.\n\nOn another note I got to see a sneak peak at the new [Bravado](https://bravado.co/?mrk=263289ccf0) feature being built. They are going to use AI to build a better search bar. It's actually a pretty badass feature. The person I met with told me other platforms like Quora, Reddit, and plenty of others are doing this. I liked how in the Bravado platform they had sources showing where the data got pulled from but also the app wrote a whole new sentence to answer the prompt question. Most of the data on the Bravado platform is sales related since obviously it's a sales platform, but I could see platforms with more broad data really giving Google a run for it's money. ChatGPT seems to be doing so already.\n\nDid some grounding today in the Boston Commons. Maybe it is placebo or maybe it actually works. Either way worth trying for yourself.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1641474880825597952%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAlso listened to this Bitcoin podcast while grounding. It was a great rip.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F2OfJkMYPNPkJZdmM5jZtdr%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F2OfJkMYPNPkJZdmM5jZtdr&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fbe968465db140cb72d96873e&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nDon't think you are superior to other people. We all have our strengths and weaknesses. Being able to ask God for help is a strength. It shows you are willing to respect the natural law. Money printing is a disgrace because it completely ignores natural law and makes it seem like you can have something for nothing. This is wrong. Don't be afraid to pray for a better future. Bitcoin is here to help us win this battle.\n\n![](https://miro.medium.com/0*KNZ2u588bBSwguSQ)\n\n3/30/23\n\nConor Jay Chepenik",
  "wordCount": 403,
  "readingTime": 1.7207547169811321,
  "claps": 0,
  "voters": 0
}