{
  "id": "81df3ddd22a5",
  "title": "Day 555",
  "createdAt": "2023-09-28 22:44:36",
  "tags": [
    "apple",
    "bitcoin",
    "nostr",
    "apple-pay",
    "zapple-pay"
  ],
  "url": "https://chepenikconor.medium.com/day-555-81df3ddd22a5",
  "content": "# Day 555\n\n**An Open Letter To Apple**\n\nApple, you gained the world's largest market capitalization because you dared think different. So when you decided to [shut down zaps on Damus](https://bitcoinmagazine.com/business/damus-set-to-be-removed-from-apples-app-store) it came as a shock to someone who always appreciated Apple's rebel spirit. Removing zaps from the iOS store does not stop me from zapping. It just makes me zap in a web browser instead. Reconsider what zaps can do for your business so you don't miss the forrest for the trees.\n\n![[https://primal.net/e/note1m99khmn94j5rnwftzcjn2lvzsz3nw0payvptnnykx37uc3mh9uhst547g3](https://primal.net/e/note1m99khmn94j5rnwftzcjn2lvzsz3nw0payvptnnykx37uc3mh9uhst547g3)](https://miro.medium.com/0*ulIc6yHZp_MddjTH.png)\n\nBitcoin's underlying technology cannot be uninvented. It is a revolutionary concept destined to endure as long as society requires money and individuals are driven by self-interest. Bitcoin's invention has birthed a decentralized network poised to redefine the very fabric of human organization, ushering in transformations previously unimaginable. Many people could never have imagined giving up their phone for an iPhone, until they saw an iPhone. In many ways Bitcoin is similar for money. What Satoshi created was absolute scarcity that anyone can verify for themselves. In Satoshi and Steve we find visionaries who transformed the unattainable into reality, rewriting the narrative of human achievement.\n\nBitcoin transcends mere currency creation. If it becomes widely adopted as a foundational layer of global finance, Bitcoin could fundamentally transform the role and function of governments, similar to how the internet disrupted and transformed businesses. As Jobs said, \"A lot of times, people don't know what they want until you show it to them.\" Great thinkers reject the status quo. If Satoshi Nakamoto believed in traditional fiat edicts and \"too big to fail\" institutions Bitcoin would not exist.\n\nLike cash and digital payments, Bitcoin has its own set of trade-offs. Cash offers superior privacy and allows for peer-to-peer payments, but it cannot be sent over the internet. Credit cards and bank accounts enable convenient online payments, but they require users to give up personal information. Both are fiat currencies which means they are subject to inflation risks. Bitcoin offers the promise of secure online money transfers without the need for banks or intermediaries, but it requires users to understand its unique features and take responsibility for their finances. If you don't run a node, you introduce counter-party risk, which is the very thing Bitcoin was designed to solve. The delicate balance between convenience and control is a personal choice. Nonetheless, I firmly believe that the cross-disciplinary design principles that propelled Apple to greatness could contribute significantly to resolving this tension between user-friendliness and autonomy within the realm of Bitcoin. Apple stands to gain substantially by offering well-crafted Bitcoin services and elevating the overall user experience.\n\nSteve Jobs and Satoshi Nakamoto both embraced a first principles approach to innovation. Nakamoto's pioneering work led to the creation of a decentralized system that blended elements of computer science, cryptography, and economics. It's almost poetic that such a brilliant open system finds a home on Apple's sleek machines. Jobs had a unique vision for Apple, one where control over both hardware and software was paramount to ensure the highest quality and user experience. While this approach sometimes frustrated others, it undeniably played a crucial role in propelling Apple to its current status in the world. However, innovation is an ever-evolving landscape, and there are moments when adopting groundbreaking technology becomes inevitable. Jobs' commitment to control was unwavering, but even he acknowledged the need to embrace superior technology when it emerged. Steve Wozniak, Apple's other co-founder, has aptly labeled Bitcoin a \"mathematical miracle\" and I see no reason why the other Steve would not have agreed. While Apple stands as a formidable force, Bitcoin operates as a straightforward protocol. Apple unquestionably stands to benefit from integrating Bitcoin into its ecosystem, but Bitcoin remains independent and resilient, free from reliance on any single entity, even an industry giant like Apple. There's no doubt that Apple's immediate survival doesn't hinge on embracing Bitcoin. However, complacency fosters stagnation, and over time, the company may face growing challenges if it neglects to harness the potential of Bitcoin.\n\nWhile I appreciate Steve Jobs' brilliance and his commitment to his vision, I believe that Satoshi Nakamoto's community-centric approach was better suited for what he was creating. Bitcoin evolves through decentralized governance, where decisions about its development are made collectively by its global user base. This ensures that the digital currency remains adaptable and responsive to the needs and preferences of its users. It also makes it difficult for people to \"move fast and break things,\" which can be disruptive and harmful in a financial system people all over the world are using as a store of value.\n\nGreat thinkers are characterized by their willingness to embrace risks and embrace lessons from failure. A notable instance of this trait is exemplified by Satoshi Nakamoto, who even stepped away from the Bitcoin project out of concern regarding WikiLeaks using Bitcoin for donations. The enduring enigma surrounding Satoshi's identity serves as a profound testament to their humility and unwavering commitment to bettering the world.\n\nThe strength and adaptability of Bitcoin owe a considerable debt to the absence of a solitary central figure. It wasn't merely the brainchild of a lone individual; in fact, Satoshi cited the work of eight others in the original white paper. Bitcoin then had to navigate the tumultuous waters of a free-market environment, so far emerging as the most victorious digital cash system to date.\n\nWhat made Steve Jobs so succesful is how he seamlessly combined art, music, and creativity into products that people emotionally connected with. Steve was excellent at evoking people's emotion.\n\n![](https://miro.medium.com/0*45sCcfJXqE6kznFc)\n\nInnovation thrives at the crossroads of diverse disciplines. In the context of Bitcoin's immense potential, I'd like to propose a vision of how Apple could harness this interdisciplinary approach to not only honor its legacy but also embrace the future.\n\n1. User-Friendly Bitcoin Integration: Apple's knack for seamlessly blending technology with user experience is legendary. Collaborations between computer scientists, UX designers, and educators could yield exceptional tools and resources to demystify Bitcoin for the masses. Imagine integrating lightning payments into Apple Pay, simplifying Bitcoin transactions and potentially eliminating the need to share revenue with banks and credit card providers. The user-friendly experience could redefine digital payments.\n\n2. Regulatory Collaboration: In navigating the complex regulatory landscape, Apple could work alongside legal experts and economists to develop clear frameworks. By demonstrating a commitment to balancing innovation with consumer protection, Apple can win the trust of regulators and lawmakers. This proactive stance could pave the way for Bitcoin's wider acceptance and lessen the need for protracted litigation battles.\n\n3. Financial Services Revolution: Collaborating with fintech experts and developers, Apple could design financial products and services that harness Bitcoin's power while ensuring security and compliance. A notable challenge is the absence of chargeback mechanisms in Bitcoin. Here, Apple could innovate by exploring solutions that preserve Bitcoin's core tenets of trustlessness and immutability while offering users optional chargeback mechanisms through trusted third parties.\n\nWhile some purists may resist the idea of chargebacks, the goal is to strike a balance and let Bitcoiners decide on the tradeoffs they are willing to make. By fostering innovation in this area, Apple can help Bitcoin accommodate a wider range of users and use cases.\n\n4. Societal Impact: It's my belief that Bitcoin can be a force for societal betterment, promoting financial inclusion, economic development, and individual sovereignty. Instead of dismantling existing systems, Bitcoin offers a way to improve them. It's disheartening to see Apple, once known for its rebellious spirit, shy away from such an opportunity.\n\nImagine a world where people can send micropayments over social media to directly support each other's creativity and content. Technologies like Bitcoin's Lightning Network and the decentralized Nostr protocol are making this possible.\n\nRather than viewing this as a threat to centralized app store fees and control, Apple could embrace and accelerate such innovation. Seamless Bitcoin/Lightning and Nostr integration on Apple devices may unlock new economic and creative opportunities globally.\n\nThe spirit of decentralized innovation aligns with ideals of freedom and empowerment. Enabling people to directly exchange value may seed groundbreaking ideas. As Apple knows well, creativity and innovation thrive when restrictions are removed.\n\nIf Apple taps into the promise of Bitcoin's lightning-fast micropayments and decentralized platforms like Nostr, they could propagate far-reaching economic and creative empowerment worldwide. The future will belong to those who don't just optimize existing models but reimagine technology's relationship with freedom and humanity.\n\n... Ok we are getting this thing almost ready to ship.\n\nLFG 9/28/23\n\nConor Jay Chepenik",
  "wordCount": 1428,
  "readingTime": 5.772012578616352,
  "claps": 2,
  "voters": 1
}