{
  "id": "82dddae52f61",
  "title": "Day 973",
  "createdAt": "2024-11-20 01:56:57",
  "tags": [
    "war",
    "is",
    "bad",
    "for",
    "everyone"
  ],
  "url": "https://chepenikconor.medium.com/day-973-82dddae52f61",
  "content": "# Day 973\n\nLet the record show I wrote my post yesterday and swear I hit publish, but for some reason it was stuck in my drafts. So I clicked publish again and now my post from yesterday is live, but if it looks like it was released on 11/19 know it was written *and meant to be shared* on 11/18. So the streak continues and we are closing in on less than a month to 1,000 days.\n\nSo what happened today 11/19? Well a new Bitcoin all time high was breached.\n\n![[https://x.com/ConorChepenik/status/1858954808595562928](https://x.com/ConorChepenik/status/1858954808595562928)](https://miro.medium.com/1*D3D1brvOc63FqHivYugT7A.png)\n\nI also see Biden and the regime that holds up said puppet are looking to start World War III with Russia before the orange man gets back in office. I mean what the hell. Not that I can do much other than crack jokes about it and pray for peace. I did both. Hopeful Russia does not nuke Ukraine. So crazy to type that sentence. Also nuts NATO is playing chicken with a nuclear super power.\n\n![[https://x.com/ConorChepenik/status/1859037563878863152](https://x.com/ConorChepenik/status/1859037563878863152)](https://miro.medium.com/1*rTbUC-mEY9reHmsSiAGT-Q.png)\n\nIt will work out. Humanity seems to find a way. I have faith that cooler heads can prevail in the end especially because Putin has children. So does Biden, but it feels like \"the deep state\" is running the show right now in America and while I know next to nothing about Russian politics it does seem like Putin is the one in charge.\n\nOne last thing, and this is a note to myself, focus. Writing, coding, reading, running, and so many other things I enjoy. However, focus more on the things that make me better and less on the things that don't: like scrolling social media.\n\nWe got this anon. Let us be great.\n\n11/19/24\n\nConor Jay Chepenik",
  "wordCount": 286,
  "readingTime": 1.4625786163522012,
  "claps": 0,
  "voters": 0
}