{
  "id": "832c6ed04c6c",
  "title": "Day 29",
  "createdAt": "2022-04-20 22:55:15",
  "tags": [
    "bitcoin",
    "software",
    "eat-ze-bugs",
    "chaos",
    "order"
  ],
  "url": "https://chepenikconor.medium.com/day-29-832c6ed04c6c",
  "content": "# Day 29\n\nI keep waking up at 7 AM. This is nice in the sense I can get my day started but I love sleeping in. No one tells you as an adult your body will naturally wake itself up via sunlight. Need to get me some better blinds. Since I was up early anyway I hit the gym and I must say it always feels good walking into work knowing you crushed a workout beforehand. Having the gym in the same building as my work has also been huge. Really no excuse for me to not work out since the gym is so easy to access. If you want to develop a habit: make it easy.\n\nSeems like the world is on the brink of something crazy happening soon. No clue what it will be but some of the headlines I'm seeing on Twitter are wild. People are so polarized and I don't know if it is just the social media algorithm doing its job to keep me engaged or if we are about to see a wild 20s in the 21st century. Only time will tell. Listened to a great [Podcast](https://open.spotify.com/episode/1lwREueDnWsOzEpM4umrLx?si=3aFF7ZadQr2POEmAqTwwiA) from John Vallis and Preston Pysh this morning. I've said it before on my Twitter but there is nothing like the hopium a good bitcoin podcast can provide. Preston mentioned that when you see what bitcoin will do you want to shake everyone you know and let them know you have found the answer. Obviously, this does not always go as planned. I've told my family many times after a big run-up how great this thing is and they get upset after the inevitable drop afterward. Learned a hard lesson from this and now I tell people to get educated and only take small positions until they feel comfortable with the volatility. For most, dollar cost averaging is the way (including myself I've gotten rekkted trading enough times to learn from my mistakes).\n\nAte some chicken hearts last night and I must say it was pretty good. Cut the hearts open and marinated them in teriyaki before cooking which helped. I tried to tell my girlfriend it was chicken (which is technically true) but she knew immediately when she saw the food that it wasn't normal chicken. I didn't finish my plate but I did eat most of it and felt very full. Eating food full of nutrients requires a lot fewer calories since it's packed full of quality ingredients. Amazing how you can eat a whole bag of chips and still be hungry since the food is full of empty calories. I'm going to keep trying different parts of the animal. Heart and liver are so cheap and full of more nutrients than most cuts. Takes a little getting used to but the cheap cost and health benefits seem like it is worth considering. It was amazing how many blood clots I found inside the hearts when slicing them open. Blood clots are lowkey terrifying. The heart is crucial to survival and I can only imagine what an unhealthy human heart looks like. Preparing the food I eat has been a rewarding experience. Few people in modern-day society take the time to cook for themselves. Cooking has been incredibly therapeutic. I saw this meme today and thought it was so powerful. We can try and rearrange nature to our preferences but as the saying goes \"Everyone has a plan until they get punched in the face\".\n\n![](https://miro.medium.com/1*jDheXxbXUaEHXzyUdgoaMw.jpeg)\n\nThis explains the modern world so well. Vile people want to organize software to control every aspect of our life. While software has the ability to make people more productive and provide a better life no one spends enough time accounting for the variable outside of the script which is humans. We are crazy, passionate, neurotic, fascinating, egregious, unique creatures. I don't care how well put together your code is: humans will act in ways that engineers never expected. I'm all for using software to make people's lives better. I'm against using software to control the masses. It will just lead to chaos. Yes, this Chaos might seem aesthetically pleasing but at what cost? In the picture above the plant and its usefulness have been destroyed. If you treat humans like cattle not only will Chaos ensue but people will die.\n\nBitcoin changed this for me. It has given me hope. I know I sound like a broken record in some of these posts but I can't stress it enough. Without bitcoin, I don't know what I would do with myself. [Greg Foss](https://twitter.com/FossGregfoss), a 30-year bond trader, and incredible bitcoin maxi, opened up at bitcoin 2022 about his mental health issues and struggling with depression after seeing how bad of a situation the legacy financial system is in. He mentioned Bitcoin is what gives him hope and that it helped him overcome his mental challenges. I feel like I'm in the same boat. Anytime I've struggled to try to understand how the public could be so misled I just had to pay attention to the incentive structure of the world. No nation-state wants to give up its control of fiat money because that is what gives them a monopoly on violence. They can pass all the laws they want but without money to pay the enforcers, those laws aren't getting obeyed. While the U.S.A has been the greatest country in the past 100 years for wealth generation our system has rotted from the inside out. If there wasn't a truly scarce, permissionless, decentralized protocol that anyone could opt into I would be freaking out right now. Most people I meet or see online in the bitcoin community want a better world. These people aren't afraid to call out the ridiculous things taking place and I'm so hopeful that ultimately what will fix these problems is a bitcoin standard. Free markets are great until they lead to massive monopolies that will prioritize profits over people. I'm sure there will be some pain as the current debt-based system implodes but I'm hopeful that bitcoin maxis will do everything in their power to help those who they care about and know to be good people. The masses have the power and we can restore order. We just need more bitcoin maxis preaching the good word so people can be a part of this once-in-a-lifetime wealth transfer before the \"big players\" start flooding into the market. Like Foss says \"It's just math\" and there will come a time when people realize holding debt that doesn't even yield enough to keep up with inflation isn't a great idea.\n\nFinal note-[Seeing](https://twitter.com/adam3us/status/1516894678859268097?s=20&t=sDYBRsNpHF_3hBQTBLfITg) Zuby get roasted on Twitter today for shilling NFTs is kinda hilarious.\n\n4/20/22\n\nConor Jay Chepenik",
  "wordCount": 1130,
  "readingTime": 4.464150943396227,
  "claps": 1,
  "voters": 1
}