{
  "id": "83b1e3c438aa",
  "title": "Day 1106",
  "createdAt": "2025-04-02 01:11:09",
  "tags": [
    "foundation",
    "hardware-wallet",
    "btc"
  ],
  "url": "https://chepenikconor.medium.com/day-1106-83b1e3c438aa",
  "content": "# Day 1106\n\n**Passport to Privacy: Zach Herbert's Journey to Digital Sovereignty**\n\nFoundation Devices is quietly revolutionizing Bitcoin security, privacy, and self-custody one sleek product at a time. Founder and CEO Zach Herbert is the driving force behind this mission, and his journey into Bitcoin is as intriguing as the devices he's creating.\n\nZach's Bitcoin story began in 2013 when a college friend pitched the idea in a dining hall, leading Zach to promptly buy his first Bitcoin for $20 on Coinbase. \"I knew nothing about the philosophy,\" Zach admits. He viewed Bitcoin simply as a promising technology and investment. Yet, the rabbit hole soon changed him profoundly, shifting his views toward personal freedom, sovereignty, and privacy. Reflecting on his initial experience, Zach stated, \"I don't think I was particularly libertarian in any way. I didn't really think about it in terms of freedom or sovereignty or privacy.\"\n\nIn 2015, Zach's fascination with hardware wallets took root when he opened a small shop, \"HODL Hardware,\" selling wallets like Ledger and Trezor on the decentralized marketplace OpenBazaar. It was an early step into hardware wallets long before seed phrases were mainstream. Zach recalls vividly, \"I started selling hardware wallets on there and providing basic customer support. So I've been into hardware wallets for a long time, since at least 2015.\"\n\nThe irony Zach notes today is that hardware wallet technology hasn't fundamentally changed much over the last decade. \"It's very similar in terms of the devices and the interfaces. Can you imagine if the first iPhone was essentially the same as the iPhone 8?\" he asks rhetorically, highlighting a huge opportunity in the hardware wallet industry for providers to create new sleek products.\n\nAfter serving as COO of Obelisk, where he designed and shipped ASIC miners, Zach's entrepreneurial itch led him to found Foundation Devices five years ago. His goal was straightforward yet ambitious: build hardware wallets accessible enough for beginners but secure and reliable enough for hardcore Bitcoiners. \"We could make something that has some of the functionality but is much more simple and well-designed and streamlined,\" Zach elaborates. \"Something where hardcore people could recommend it to their friends and family that might not be as hardcore, but it still meets their values.\"\n\nTheir flagship product, the Passport wallet, distinguishes itself through intuitive QR-code air-gapped technology designed with mobile users in mind. Experienced Bitcoiners know the struggle of explaining complex concepts like PSBT files, SD cards, and adapters to newcomers, which can often create unnecessary barriers to adoption. Passport elegantly addresses these challenges with a streamlined approach that makes digital asset security accessible even to complete beginners in the Bitcoin ecosystem.\n\nFoundation Devices recently unveiled Passport Prime, a significant upgrade. With Bluetooth connectivity and an intuitive touchscreen, it's designed not just for Bitcoin but to secure one's entire digital life from two-factor authentication to encrypted storage. Zach proudly describes Passport Prime as \"your passport to a Bitcoin-powered decentralized internet.\" He adds, \"The idea is that in the future, everything will be based on public-private key pairs, moving away from usernames and passwords.\"\n\n![Shop Passport Prime here: [https://foundation.xyz/buy-passport-prime/](https://foundation.xyz/buy-passport-prime/)](https://miro.medium.com/0*1pkQ7QoLzrY1YDoy)\n\nOne innovative security feature Zach is particularly excited about is \"Airlock,\" where only specific files are accessible when connecting Passport Prime to a computer. He explains it vividly, \"If you're in a situation where you're afraid you might be using an untrusted computer and you don't want all your files to be visible, Airlock ensures only specific files you've designated can be seen by that computer, keeping everything else securely isolated.\".\n\nZach's vision extends beyond just Bitcoin. Foundation Devices aims to simplify digital sovereignty, making security effortless and less intimidating. He candidly shares how newcomers often buy hardware wallets based on recommendations, only to leave them untouched. \"You have no idea how many people come up to us at conferences and whisper that they have a hardware wallet that's in the plastic in their drawer. The last thing we want is people intimidated by our products,\" he emphasizes.\n\nReflecting humorously on his first job at an Apple store, Zach admits this experience significantly shaped his approach to ease-of-use and customer onboarding. Foundation Devices offers concierge onboarding inspired by Apple's personalized services, ensuring users aren't overwhelmed during the setup process.\n\nSecurity isn't just digital for Zach; it's physical as well. After the[ kidnapping of Ledger's founder](https://www.reuters.com/world/europe/kidnapped-co-founder-french-crypto-firm-ledger-had-his-hand-mutilated-2025-01-24/), Zach openly discussed the importance of physical security, particularly emphasizing the value Americans receive from the Second Amendment. \"I personally have a concealed carry license,\" Zach shares openly, underscoring his belief in personal responsibility for safeguarding oneself. \"If you're in the Bitcoin space, you could definitely be a target, and I care a lot about that.\"\n\n![[https://x.com/zachherbert/status/1871595985115521078](https://x.com/zachherbert/status/1871595985115521078)](https://miro.medium.com/0*Urjj-eJE5v7d3G55)\n\nLooking ahead, Zach envisions Passport Prime leading the way in protecting private keys and expanding beyond Bitcoin into broader digital security. With third-party apps coming soon, developers can tailor functionalities directly onto Passport Prime, making digital lives simpler and more secure.\n\nAs for Zach's one question to Satoshi Nakamoto? With characteristic wit and curiosity, Zach admits he simply wants to know if Satoshi is alive: \"I can't understand how a human would have the self-control to stay quiet this long.\"\n\nWith Foundation Devices, Zach Herbert and his team are not just building hardware wallets; they are architecting a future where digital sovereignty becomes accessible to everyone, transforming Bitcoin security from a specialist's burden into an intuitive tool for the common man.\n\n4/1/25\n\nConor Jay Chepenik",
  "wordCount": 908,
  "readingTime": 3.809748427672956,
  "claps": 0,
  "voters": 0
}