{
  "id": "87177ef43af3",
  "title": "Day 1199",
  "createdAt": "2025-07-04 03:49:35",
  "tags": [
    "emotional-intelligence"
  ],
  "url": "https://chepenikconor.medium.com/day-1199-87177ef43af3",
  "content": "# Day 1199\n\nI made this image after reading a fantastic X post today:\n\n> After spending 10 years thinking about Money & Bitcoin, here's the simplest explanation I can come up with: Money is a technology to move Value across Space, Time, and Scale. Value is the utility humans derive from Goods & Services. Value is highly subjective, and it changes across Time and Space. Unbeknownst to them, Economists have defined these functions as: - Store of Value (Time) - Medium of Exchange (Space) - Unit of Account (Scale) Throughout History, no monetary system has managed to satisfy all 3 functions of Money at once. This is where the idea of Backing Money and the necessity of separating Money and Currency come from. This trade-off can be described as a Money Trilemma: you can optimize for 2, but not all 3. Gold is great at Time & Scale, but not Space. Fiat is great at Space & Scale, but not Time. Until the invention of Bitcoin. Bitcoin is the first form of Money that successfully excels at all 3 functions simultaneously. It achieves that by perfecting all the properties of Money, with no extra space for improvement: Bitcoin is: - Infinitely Divisible - Instantly Portable - Forever Durable - Mathematically Finite (what is mistakenly called Scarcity) - Perfectly Fungible Bitcoin is the final Evolution of Money. The World just hasn't figured it out yet.\n\n![[https://x.com/ConorChepenik/status/1940904295077236931](https://x.com/ConorChepenik/status/1940904295077236931)](https://miro.medium.com/0*pjtJSISLm4dFDDtp)\n\nIt's a bright orange future anon. So excited for what's in store.\n\n![Lost the link to the OP but a great read nevertheless](https://miro.medium.com/1*bT8D8LJCEuX2Ix0SLUWpyQ.png)\n\nDigest your emotions, then act.\n\n7/3/25\n\nConor Jay Chepenik",
  "wordCount": 255,
  "readingTime": 1.3455974842767295,
  "claps": 0,
  "voters": 0
}