{
  "id": "87fd3b2c3f74",
  "title": "Day 1013",
  "createdAt": "2024-12-30 02:18:30",
  "tags": [
    "unbank",
    "bitcoin",
    "cash",
    "privacy",
    "i-enjoyed-meeting-emilio"
  ],
  "url": "https://chepenikconor.medium.com/day-1013-87fd3b2c3f74",
  "content": "# Day 1013\n\n**Unbank: Bridging the Gap For Bitcoiners Who Want To Use Cash**\n\nWhen most people think about buying or selling Bitcoin, they picture connecting their bank accounts to an online crypto exchange and navigating a cumbersome verification process. Yet for many people around the world, and even some within the U.S.A, traditional banking relationships are either limited, inconvenient, or simply not an option. That's where Unbank comes in.\n\n![Some of the best technologies out there are the ones that bridge the physical with the digital](https://miro.medium.com/1*0RwxYdJ2iIjB8rWtTTTqPg.png)\n\nFounded over a decade ago, Unbank has carved out a niche by prioritizing cash transactions. The company distinguishes itself from other major crypto exchanges by making it possible to buy and sell Bitcoin with minimal KYC. You need only a name and phone number for transactions under $900. This is a breath of fresh air for those without traditional banking access, or to those who simply prefer using physical cash, improving the way many access Bitcoin in a world that's becoming more and more hostile to privacy.\n\n\"We first launched our Bitcoin ATM in Albany, New York, which was really interesting. It wasn't the first Bitcoin ATM to be released, but it was right up there,\" explains Emilio, Co-Founder of Unbank.\n\nUnbank's story began with a few Bitcoin ATMs in New York. Almost eleven years later, they have expanded to 45 different states while encountering and overcoming major hurdles along the way. One such hurdle is maintaining relationships with financial institutions, as many banks remain uncomfortable with large cash deposits related to crypto.\n\n\"Personally, I can't bank at around 16 different major financial institutions here in the US... Most of these banks have blacklisted me just because when I initially started the business, they saw cash going into all these accounts,\" Emilio reveals. \"I can't have major credit cards or get mortgages through Chase, Bank of America, PNC, Wells Fargo, TD Bank... they closed these accounts and blacklisted my company as well as my personal ability to establish an account or line of credit with them.\"\n\nThis struggle with \"debanking\" is embedded in the company's ethos and name. Today, they operate primarily with small financial institutions willing to work with their cash-based model. As Emilio notes, \"We're primarily a cash specialist. Banks aren't super comfortable with the amount of cash that we bring in...We partnered with Green Dot Bank so you can bring cash to the register, they scan a barcode that's located on your (unbanked) app, and then you give them the cash,\" explains Emilio. \"It knows when you do that and then it allows you to convert the cash that you handed the cashier to Bitcoin.\"\n\nThe process works at participating retailers like CVS, Walgreens, Rite Aid, and more. The app even allows you to check nearby retailers based on your location. The purchased Bitcoin is then sent directly to your self-custodial wallet and not stuck on an exchange. While Unbank supports alternative cryptocurrencies such as Ethereum, Litecoin, and Tether (USDT), Emilio notes that \"98% of our volume is Bitcoin.\"\n\nUnbank's biggest selling point might be the ease of selling Bitcoin for physical cash. After choosing how much Bitcoin you'd like to sell, the Unbank app gives you a wallet address to send your BTC. As Emilio describes: \"It generates a cash code that you can use to redeem at a retailer\" Most importantly, there are no fees on the sell side, just spot price based on bitstamp.\n\nEmilio and his team recognized that while many people hold bank accounts, many don't. In a few cases this might be by choice, but for most it is due to lack of access. Even for those with bank accounts, privacy concerns and bank-wire frustrations can deter them from making frequent crypto trades. That's a big reason why cash still matters in an increasingly digital world. Cash allows for much grater privacy and privacy is a right every human deserves.\n\n\"Our mission is just to provide people a way to not have a bank account but get access to Bitcoin,\" says Emilio. \"That's our specialty, that's our bread and butter, that's what differentiates ourselves from the other exchanges, all of these other companies don't really specialize in cash.\"\n\nWhile cash is Unbank's bread and butter this is not too say they have not had to deal with their own set of challenges. Like most companies operating in the Bitcoin ATM business, Unbank occasionally grapples with unique challenges. States like Connecticut and Minnesota have consumer protection laws that can complicate Bitcoin ATM transactions, allowing chargebacks within 72 hours for certain scam scenarios.\n\n\"We've had machines seized regarding scams. Police departments claim the cash is evidence,\" Emilio reveals. \"People target the machines to steal them too. We've had around six maybe seven machines stolen, most of them are in California.\" However, these challenges are not exclusive to Unbank. Fraud prevention is often the most difficult aspect for many exchanges, as the fiat system allows for reversible transactions, whereas Bitcoin does not offer reversibility.\n\nWhile fraud is not a fun thing to deal with one of the positive aspects of Unbanked can be the marketing aspect. For store owners who want to host an Unbank Bitcoin ATM, the arrangement can bring in significant foot traffic and extra revenue. As Emilio explains:\n\n\"It makes it a destination point... People will go out of their way to visit your business as opposed to someone that has a similar business but doesn't have a Bitcoin ATM. We have business owners making up to $4,000 a month off of these transactions.\"\n\nLooking forward, with roughly $70 million in annual cash volume, Unbank continues to innovate in the cash-to-crypto space. While this might seem small compared to major exchanges, Emilio notes that \"70 million in cash a year is actually logistically very complex whereas 70 million with a credit card or debit card is logistically a little bit more of a simple process to manage.\"\n\nBy championing accessibility, self-custody, and the freedom of cash, Unbank is helping create the future Bitcoin was built to help bring about. Whether banked or unbanked everyone should be able to get access to Bitcoin. The Unbanked network includes hundreds of physical Bitcoin ATMs across 45 states and over 40,000 partner locations supporting buy/sell cash services, making Bitcoin accessible to everyone, even those who've never had a bank account. If you can buy peer-to-peer from buddies that's amazing, but not everyone has a friend looking to sell their bitcoin for cash.\n\nFor those looking to use cash to buy or sell digital assets, or for store owners wanting to attract new customers , Unbank provides a fast, secure, and user-friendly off-ramp and on-ramp for Bitcoin. With zero fees on the sell side and minimal KYC under $900 a day, Unbank lives up to its name, providing a bridge between the physical and digital worlds of money.\n\n![Learn More At [https://unbank.com/](https://unbank.com/)](https://miro.medium.com/1*MgySPX_FwDXLpKbZlDs9yw.png)\n\n12/29/24\n\nConor Jay Chepenik",
  "wordCount": 1147,
  "readingTime": 4.711635220125786,
  "claps": 0,
  "voters": 0
}