{
  "id": "8b8badcfbcd1",
  "title": "Day 1242",
  "createdAt": "2025-08-16 03:47:35",
  "tags": [
    "learned",
    "something",
    "from",
    "the",
    "man-in-yellow"
  ],
  "url": "https://chepenikconor.medium.com/day-1242-8b8badcfbcd1",
  "content": "# Day 1242\n\n![[https://x.com/ConorChepenik/status/1956557670615228867](https://x.com/ConorChepenik/status/1956557670615228867)](https://miro.medium.com/1*4DYlY46z8GanN-3peiDaww.png)\n\nIn the long term, if your prioritize your own vision, the rest will fall into place. It seems that the greatest challenge many of us face is having the patience to get there. Sure there is the consistency, the daily grind, the distractions we all face. Yet, if you have a plan and you stick to it I think you will end up pretty well off.\n\nI love the above video because this guy is not willing to compromise on his vision. He could easily sell out and make more money **(in the short term)** but instead he chooses to do what he wants. In both business and life that's such a powerful thing. When you bring others in, it becomes so easy to get distracted by other people's priorities. Thus, you lose sight of your own goals.\n\nThat's why patience is so key. Doesn't mean you shouldn't work with others. As the cliche saying goes 'If you want to go fast go alone, if you want to go far go together' but make sure you bring the right people along. Don't add someone to your circle who has different priorities than yourself. Unless of course you want to be frustrated, annoyed, and upset with the end result.\n\nMy plan over the next 5 years is quite simple really. Continue to stack sats. Raise and homeschool my children to be great people. Continue to grow closer to God. Be an amazing husband to Paige, the Mother of my Children. Keep upskilling myself to advance in my career. If I prioritize those things in the long term I know the rest will fall into place.\n\nTL;DR - Stay true to your own version. Don't sell out early for someone else's.\n\n8/15/25\n\nConor Jay Chepenik",
  "wordCount": 295,
  "readingTime": 1.3132075471698113,
  "claps": 0,
  "voters": 0
}