{
  "id": "8d7ee37beccb",
  "title": "Day 97",
  "createdAt": "2022-06-28 00:24:34",
  "tags": [
    "pride",
    "doing-the-right-thing",
    "language",
    "platform",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-97-8d7ee37beccb",
  "content": "# Day 97\n\nGod Bless Robert Malone. The man has been deplatformed on both Twitter and LinkedIn for speaking the truth and questioning narratives that frankly didn't make sense. It takes a lot to stand up for the right thing and Robert has consistently called out those who were acting in bad faith. I subscribe to his substack and the one he published today titled _Rogue Agencies and the COVID Truth seekers_ was an incredibly eye opening article. It is absolutely wild how big and powerful the \"security state\" has become. In his post today Malone details how many of the 3 letter organizations in this country are spying on its citizens and going around our constitutional rights. I'm not going to do a deep dive into what these organizations are doing, but I will mention I genuinely worry about privacy in the future. I have no desire to rent everything, own nothing, and have my basic right to privacy stripped away because megalithic nations and their agencies claim We NeEd To MaKe SuRe YoU aReN't A tErRoRisT. The constitution was put in place for a reason and it saddens me to see it being eroded away. Privacy should be a basic human right and it is not being respected partly due to the government and also partly due to the internet. It's incredible all the services we have, but everything has a trade-off. As these companies grow their online presence they also have engineers optimizing algorithms to better sell stuff. I'm not hating; I work in sales and have pissed off plenty of people calling their cells. I try not to be a pain, but some people just really hate cold calls which is my job at ze moment. My point is that being on the sales side has helped me realize how much our data is valued by companies and if people don't take the time to protect themselves they will have their data sold to the highest bidder who will use it to optimize the ads shown. This can be nice in some cases and intrusive in others. Zoominfo (which I use all the time in my sales gig) is literally a company that sells a database of users' info and it gets this info by scrapping emails. Be careful out there anon and take some time to learn about the privacy tools out there like Tor, Brave browser, and many others.\n\nI am hopeful to see there are still those out there in our government, on social media, and friends in my day-to-day life who value their privacy and are willing to speak up about it. So weird to think how fast the world is changing, how quickly the way businesses operate is changing, and how different the world will look in ten years. Bitcoin gives me a lot of hope we can get this ship corrected. Just need to keep spreading the good word and remaining relentlessly optimistic. It's also important we call things what they are. This article by Gigi was both insightful and fascinating. Highly recommend reading it.\n\n> [**The Words We Use In Bitcoin - Words, Language, Terminology, and Linguistic Attacks | dergigi.com**](https://dergigi.com/2022/06/27/the-words-we-use-in-bitcoin/)\n\nI had not spent much time thinking about how important the words we use in Bitcoin are to its adoption. Language often falls short, but it is still one of the best tools we have for describing our ideas. Using it effectively will help make Bitcoin more effective at reeling in some of the clown world aspects we are seeing today. If people stop caring about taking custody of their bitcoin, in the same way many have stopped worrying about privacy online, then we end up back in a corrupt system where we need permission to spend our money. Everything has trade-offs but at least taking the time to think through what these trade-offs are will do wonders so we don't have to use a third party to send and receive value which is literally the whole use case of Bitcoin. I mean there are others like the hard supply of 21 million which makes it a saving technology, but the idea that got this puppy off the ground into the big dog it is today is that with Bitcoin you don't need to trust a third party because you can trust the incentives of this beautiful network. Remain curious anon. It will do wonders in terms of the tradeoffs you choose for yourself and creating a life you are happy with.\n\nAlso, one more day until my first full show dry run. So going to keep tweaking this 5 minute set on here until I've performed live.\n\nI've always been a big believer in being open-minded. It's a fine line though because in today's world it's near impossible to tell who the snake oil salesmen are and who are the ones providing value. Anyone with a smart phone has all of human history at the tip of our fingers and most of us use it to watch videos of porn, people popping pimples, or get food delivered to our door. Humanity is wild but as far as I can tell this tyranny of convenience our phones provide make it difficult to remain open-minded. The key to being open-minded though is not caring what others think and luckily my father taught me this lesson at a young age. Yea my Dad constantly reminded me that pursuing your passion no matter what is the key to a happy life. For my Dad that passion was his children's sporting events. He liked living a little too vicariously through my sisters and me. For example, at my JV football games he was on the sidelines drinking a vodka red bull yelling PICK A SPOT!!! PICK A SPOT CONOR! My Dad was adamant about pursuing his passion even if it meant getting child protective services called because he made me run 5 miles and give up water for 24 hours just so I could make pop Warner football weigh-ins. I did end up playing d3 football so I guess what doesn't kill you makes you stronger, right? You know some people might've thought this was borderline child abuse, but they just didn't understand my Dad would have done anything for his children including unorthodox training methods to get his kids ready to compete. I give my Dad crap but he really did teach me a lot of important lessons like for example, make sure you put your mixie in a big gulp before entering the high school football game, that having a child is unlike anything you have ever experienced, and that asking for forgiveness is always a better idea than asking for permission. By focusing on yourself it's always easier to not worry about what others are obsessing over which in turn helps you keep an open mind. If there is one thing I do sometimes worry about though it's that I inherited my Dad's trait of being overly obsessive. Life is about having a plethora of experiences. It's not good to become completely immersed in anything which for my Dad was his children's sports and for me it's Bitcoin. Yea I'm obsessed with this magic internet money that has led my family to think I'm crazy. There's a great saying on bitcoin twitter, \"If your family doesn't think you're insane then you're not really a bitcoiner\". But yea my Bitcoin obsession is so strong that I recently found out I'm going to be a Dad and when my girlfriend told me the first thing that ran through my head was \"Thank God For Bitcoin\". As you can imagine that's not what I told her though. I said \"Our kid is either growing up driving Lamborghinis or hunting city cats for dinner.\" Ain't no in-between at this point baby. Yea I thought getting into Bitcoin would bring me a lot of money but it really only got me a Twitter addiction and lost me half the dollar value of what I invested. That's alright though my online friends assure me that by having a low-time preference and holding I will be just fine. While I'm confident in that part I do need to remember that everything I find online should be taken with a grain of salt. For example, there were people on Twitter saying that taking a 💉  could cause me to be sterile. Well low and behold I was able to debunk that theory. And I'm excited to have a kid, I am, I'm just not sure if having a kid was a legit excuse just to dunk on the anonymous Twitter account @mr.clownworld who gave me the idea in the first place. Luckily, by keeping my life savings in a currency that can't have the money supply inflated I think I'll be okay. Raising a child is expensive and with the ways things are going, I don't see food, housing, and other necessities getting cheaper. I'm convinced bitcoin will replace the US dollar as a global reserve currency because the experts say it won't. Yea the so-called \"experts\" who didn't realize inflating the money supply by trillions of dollars would cause inflation are now telling us there is no chance bitcoin takes over as the next global reserve currency. So there is hope. Doesn't take a rocket scientist to know that printing money will cause inflation, but I guess it takes more than an economist. Plus, kids are smart as hell. Ain't no way the next generation is going to walk in a bank to ask for permission to send large amounts of money. I think they'll use bitcoin. A permissionless system that allows anyone to send and receive value without a third party is a lot better than entering a bank and talking to old dudes in suits. Plus kids nowadays are happy to call people out. You know this past weekend I went down to New York and when I arrived at my Aunt's house the first thing my little cousin said when my girlfriend and I walked in is \"Conor I'm confused. How are you having a baby with Paige? I thought first comes love, then comes marriage, then comes a baby sitting in the baby carriage\". I said Vaughn, \"when you lose half your dollars in magic internet money you got to find a way to channel that extra energy somewhere.\" Thank you that's my time.\n\nReminder anon some of this story is fabricated and some of it is true. ;)\n\n6/27/22\n\nConor Jay Chepenik",
  "wordCount": 1788,
  "readingTime": 6.747169811320755,
  "claps": 0,
  "voters": 0
}