{
  "id": "8e186ae11e5e",
  "title": "Day 859",
  "createdAt": "2024-07-29 00:37:34",
  "tags": [
    "running"
  ],
  "url": "https://chepenikconor.medium.com/day-859-8e186ae11e5e",
  "content": "# Day 859\n\nToday was a wonderful Sunday spent with four generations of my family at the beach. I was grateful to share the day with my grandparents, two of my sisters, my child, and my fiancé. It's always special to see my child interact with her great-grandparents - the bond between them is truly heartwarming.\n\nAfter a fun-filled day at the beach, my fiancé, child, and I headed to Fernandina Beach to explore the charming downtown area. The quaint streets and shops were a delight to stroll through. When I got home I put on my favorite free runs and went for a 5-mile run. To be exact - I ran a mile, walked a mile, repeated the pattern, and finished strong with a final mile of running. It was recorded on Nike Run Club and shared via my proof of work group chat so count it. I have found that regular exercise is a key component to my happiness, and today's run was a great reminder of that.\n\n![The Gym in this meme = all forms of exercise F.Y.I](https://miro.medium.com/1*VskE5sYSWLRN5h5zy_xzng.png)\n\nOn another note I want to try and build out an AI Saas platform. Thinking about calling it MultiModal (name subject to change)\n\nI had AI spin up a simple front end display for me and made sure to include light and dark mode because that always seem to be a huge feature request:\n\n![](https://miro.medium.com/1*AQXsd-TIc_j_7nCbgYKjZg.png)\n\n![](https://miro.medium.com/1*EZxkohLZFyyOBv1ofwdUpg.png)\n\nWhat would make my model special? I'd have chatGPT, Claude, Meta's AI, and others in the back end so users could have one interface to choose between them. Keep it super simple. Also make it like Auto-GPT so it can repeat tasks? I'm just spitballing but this is what I have so far and building the project will teach me a lot about coding.\n\nAnyhow I ran into my Dad on the run and I got a early morning workout so that's all I'm writing for today. Peace & love anon! Until tomorrow :)\n\n7/28/24\n\nConor Jay Chepenik",
  "wordCount": 325,
  "readingTime": 1.7764150943396226,
  "claps": 7,
  "voters": 2
}