{
  "id": "905b7b96e9ca",
  "title": "Day 130",
  "createdAt": "2022-07-30 16:33:19",
  "tags": [
    "chakra",
    "energy",
    "karma",
    "mindset",
    "mindfulness"
  ],
  "url": "https://chepenikconor.medium.com/day-130-905b7b96e9ca",
  "content": "# Day 130\n\nWhat you put out into the world is what you get back from it. Karma, energy, chakra, whatever word you use to describe one's input & output is a good indicator for what that person's outlook on the world is. I'd like to be more thoughtful about how doing certain activities make me feel. For example, sitting outside in nature makes me feel at peace. Scrolling Twitter gives me a headache and makes me feel anxious, excited, angry, irritable and nervous. I do like that Twitter helps me be up to date and have conversations about pop culture. However, too much Twitter causes many negative emotions. I think societies time preference has gotten so high that it's hard to be mindful of how activities make us feel. It might sound a little silly at first but when you want everything in real time it seems that you don't make time to check in with yourself. When I really try and reflect on how an activity makes me feel I realize that I've been paying little attention to my own body. Scrolling the timeline has my mind racing about one thousand things that have nothing to do with my inner feelings. No wonder so many people are up in arms about what others are doing. So few of us actually stop to consider how we are feeling. I truly believe most people are good inside and a massive problem is that many aren't able to harness this good because they are busy worrying about those they deem bad. Learning and trying to better yourself for the world is a good thing. Social justice warriors screaming at those they disagree with only serves to make the world a shittier place.\n\nSome things I'd like to do that I know will benefit both me and the world\n\n- Start my own website\n\n- Continue learning how to code\n\n- Do more to help my local bitcoin meetups\n\n- Be more mindful\n\n- Run at least 30 miles the remaining months (including this July, I'm at 28 miles currently)\n\n- Save more money, eat out less, plan for my future\n\n- Continue solid habits like writing everyday\n\n- Forgive others who might not agree with me or see eye to eye on things\n\n- Call family more\n\n- Do more podcasts\n\nSolid list to get started. Excited to keep building and growing as a person. The world is what you make of it anon. Make it a better place :)\n\n7/30/22\n\nConor Jay Chepenik",
  "wordCount": 412,
  "readingTime": 1.5547169811320756,
  "claps": 0,
  "voters": 0
}