{
  "id": "9235a01f67c3",
  "title": "Day 465",
  "createdAt": "2023-06-30 19:18:25",
  "tags": [
    "common-sense",
    "france"
  ],
  "url": "https://chepenikconor.medium.com/day-465-9235a01f67c3",
  "content": "# Day 465\n\nMy blog about Common Sense was published. You can read here.\n\n> [**Common Sense in The Modern Financial World - Common Sense Movement**](https://www.thecommonsensemovement.com/posts/7nfl8eldmzdwnpe2o9perbbzt1g71r)\n\nI'm happy to see them share these articles about Bitcoin with an audience who is more focused on liberty and sovereignty than Bitcoin per se. Always good to try and show no-coiners the power of scarce money. Everything in the world / 21 million is a hard idea to wrap your head around.\n\nIn other news it seems France has been having some serious riots. Not sure what's going to happen from it but I hope governments don't use this an excuse to bring in some dystopian measures. Governments have a bad habit of never letting a good crisis go to waste.\n\nI've tried to add tweets to this Medium to show but it's not adding because now Twitter is requiring a user be logged into to see tweets. A ridiculous policy in my opinion given that Twitter is a major news source for many. Curious if they will reverse this. It's mainly chapping my ass because I find it valuable to post tweets on Medium that are relevant to what I'm discussing on here. Guess I'll just have to start screenshoting tweets if things don't change.\n\n![](https://miro.medium.com/1*RMCJUtOD8cnGi0qdJH6Dng.jpeg)\n\nAlso found a cool LLM that analyzes Twitter profiles. Amazing to see what people are building with this technology.\n\n> [**Twitter Summary**](https://twittergpt.com/)\n\nAnyways, I'll end today with a screenshot. Good will win in the end as it always does but I'm pretty confident we are in the weak men create hard times phase of that cliche.\n\n![[https://twitter.com/ArthurM40330824/status/1674557474265784320?s=20](https://twitter.com/ArthurM40330824/status/1674557474265784320?s=20)](https://miro.medium.com/1*tfJLynydThBSGUmBrwDf9w.png)\n\n6/30/23\n\nConor Jay Chepenik",
  "wordCount": 308,
  "readingTime": 1.5455974842767295,
  "claps": 0,
  "voters": 0
}