{
  "id": "9237fcd424f6",
  "title": "Day 469",
  "createdAt": "2023-07-05 03:11:50",
  "tags": [
    "america",
    "constitution",
    "founding-fathers",
    "july-4th",
    "god"
  ],
  "url": "https://chepenikconor.medium.com/day-469-9237fcd424f6",
  "content": "# Day 469\n\nHappy Independence Day!\n\n![](https://miro.medium.com/1*ssOflBQRkYeRPVagk7wrag.png)\n\nHere are five badass quotes from true American patriots.\n\n> \"We hold these truths to be self-evident: that all men are created equal; that they are endowed by their Creator with certain unalienable rights; that among these are life, liberty, and the pursuit of happiness.\" - Thomas Jefferson\n\nThis quote is taken from the Declaration of Independence, drafted by Thomas Jefferson in 1776. It articulates the belief in inherent human equality and natural rights that cannot be taken away by any government. This idea became a cornerstone of American democracy and has influenced the country's commitment to individual liberties and equal treatment under the law.\n\n> \"The Constitution is the guide which I never will abandon.\" - George Washington\n\nThe first President of the United States, recognized the importance of the Constitution as the framework for the nation's governance. This quote signifies Washington's unwavering commitment to upholding and abiding by the principles and provisions outlined in the U.S. Constitution. It emphasizes the significance of the Constitution in maintaining a stable and just society.\n\n> \"The best way to predict your future is to create it.\" - Peter Drucker (often attributed to Benjamin Franklin)\n\nThough often attributed to Benjamin Franklin, this quote is from management consultant Peter Drucker. Nevertheless, the sentiment expressed aligns with the spirit of American exceptionalism and individual agency. It suggests that individuals have the power to shape their own destinies and that proactive action and personal responsibility are crucial for achieving success and progress.\n\n> \"Those who would give up essential Liberty, to purchase a little temporary Safety, deserve neither Liberty nor Safety.\" - Benjamin Franklin\n\nThis quote by Benjamin Franklin underscores the importance of preserving personal freedom and civil liberties. Franklin recognized that sacrificing essential rights for the sake of temporary security would ultimately result in losing both. It highlights the value placed on individual freedoms and the idea that a balance between security and liberty must be maintained in a just society. This quote has taken on added relevance in recent times, particularly since 2020, when the COVID-19 pandemic led to debates surrounding the scope of government power and individual rights. Violations of the Nuremberg conventions took place when our President issued an executive order to levy coercive measures to encourage vaccination. Franklin's words compel us to critically examine the decisions made during such periods and to ensure that any actions taken to safeguard public safety are not detrimental to our fundamental liberties.\n\n> \"A well-regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\" - James Madison (Second Amendment to the United States Constitution)\n\nThis quote is the text of the Second Amendment to the United States Constitution. It emphasizes the belief that a well-regulated militia is essential for maintaining the security of a free state. It also affirms the right of the people to keep and bear arms, asserting the importance of individual gun ownership as a means of self-defense and protection against tyranny.\n\nTonight at dinner, I engaged in a passionate discussion with my family regarding the frustrations that have weighed on me over the past couple of years. The issues of censorship, tyranny, and the manipulation of public perception have deeply troubled me. However, I am determined not to succumb to bitterness or deem America a lost cause, for that is far from the truth. We possess a remarkable constitution, one that stands as a testament to our values and aspirations.\n\nWhile acknowledging our nation's imperfections, I choose to focus on the extraordinary achievements that have propelled us to greatness throughout history. Despite our flaws, we have endured and succeeded as a nation for an exceptionally long time. I firmly believe that goodness will prevail, for the forces of good align with the divine. It is crucial to remain humble, to persist in prayer, and to continually push ourselves to reach greater heights.\n\nMay God bestow blessings upon this great nation and all its citizens. My love for America is unwavering, and I eagerly anticipate a future guided by God's will. Together, let us strive to overcome challenges, build a better tomorrow, and secure a prosperous and just future for the children of this nation.\n\n7/4/23\n\nConor Jay Chepenik",
  "wordCount": 718,
  "readingTime": 2.909433962264151,
  "claps": 0,
  "voters": 0
}