{
  "id": "9251685be905",
  "title": "Day 869",
  "createdAt": "2024-08-07 19:47:13",
  "tags": [
    "god-is-good",
    "job",
    "swan",
    "work",
    "blessed"
  ],
  "url": "https://chepenikconor.medium.com/day-869-9251685be905",
  "content": "# Day 869\n\nGod is good. I have been stressing since getting laid off from Swan in late July and have been praying for guidance in finding my next role. Today, my prayers were answered.\n\nI received a call from Swan inviting me to return to my previous position, and I gladly accepted. These past two weeks have been nerve-wracking. Although I had secured a job as a water technician/general laborer at Roto-Rooter, I am thrilled to be returning full-time to the Bitcoin industry.\n\nThis entire experience taught me some valuable lessons:\n\n1. **Diversify Your Income Streams**: My side writing gigs didn't cover all my living expenses, but they provided enough cash flow to help me get by.\n\n2. **Appreciate Your Job**: Never take your role for granted. Always look for ways to add as much value as possible. If you can disrupt your own job, do it! This might seem counterintuitive, but there's immense value in being so good at what you do that you make your old position obsolete and create a new, more impactful role for yourself in the process.\n\n3. **Practice Financial Prudence**: Even with a good income, avoid overspending or living beyond your means. Cut costs where possible.\n\n4. **Stay Resilient and Adaptable**: Life can throw unexpected challenges your way. Maintaining a resilient mindset and being adaptable to new circumstances can help you navigate through tough times and find new opportunities. Prayer also helps tremendously. I know for a fact God played a role in returning this opportunity to me.\n\n5. **Network and Build Relationships**: Cultivate and maintain strong professional relationships. Networking can open doors to new opportunities and provide support when you need it most. Engaging with your industry and community can also keep you informed and connected should an unfortunate situation arise.\n\nFeels great to have the weight of job hunting lifted from my shoulders. It is tough out there and while the ego inside of me wants to say Swan realized their mistake in letting me go, I know the bigger reason was God answering my prayers. Thank you to the Alpha and Omega. Sincerely from the bottom of my heart. Without the Lord none of this is possible.\n\n![Jesus Christ, Son of God, have mercy on Me, a Sinner](https://miro.medium.com/1*eMfNhLZ1fDmLOvkGrUz07A.png)\n\n8/7/24\n\nConor Jay Chepenik",
  "wordCount": 368,
  "readingTime": 1.5886792452830187,
  "claps": 0,
  "voters": 0
}