{
  "id": "937ac0ea8d58",
  "title": "Day 759",
  "createdAt": "2024-04-20 01:48:17",
  "tags": [
    "f",
    "the",
    "legacy",
    "system",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-759-937ac0ea8d58",
  "content": "# Day 759\n\nThe Bitcoin network made history tonight! I feel so lucky to be alive during this time.\n\n![[https://www.linkedin.com/posts/conorchepenik_history-was-made-this-evening-grateful-to-activity-7187253915317358592-FUaw](https://www.linkedin.com/posts/conorchepenik_history-was-made-this-evening-grateful-to-activity-7187253915317358592-FUaw?utm_source=share&utm_medium=member_desktop)](https://miro.medium.com/1*A1u9bUkMPhQSUl6IpK7_yg.png)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1781475513996837297&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt's fascinating to ponder what the bitcoin halving celebration might look like in 2140 when miners will rely solely on transaction fees for support. This time, the celebration wasn't necessarily solitary but shared with online friends. Paige was tending to Sloan, who had a meltdown after being out in the sun all day at the beach. Just as the halving occurred, Paige emerged and asked me to put Sloan to sleep. She was a bit upset that I was ecstatic about the halving event, but after getting Sloan to sleep, she felt better. I tried to help, but I was giddy with excitement and was not much help getting Sloan to be. Nonetheless, history was made, and I'm overjoyed to have witnessed this halving event firsthand. Although I've known about Bitcoin since 2017, this was the first halving I truly comprehended and observed with rapt attention. Feels good.\n\nI'll conclude tonight with a random thought I had:\n\n![](https://miro.medium.com/1*TeG5HJBBINbjOK8YkBqnIQ.png)\n\nDo you hear that anon? It's the sound of freedom and sucking as the base layer of value continues to pull in mind share and fiat as it obsoletes this cucked legacy system trying to control humanity. :)\n\n4/19/24\n\nConor Jay Chepenik",
  "wordCount": 217,
  "readingTime": 1.2022012578616352,
  "claps": 0,
  "voters": 0
}