{
  "id": "94aa2bb55dc3",
  "title": "Day 84",
  "createdAt": "2022-06-14 20:40:44",
  "tags": [
    "mindset",
    "podcasting",
    "labels",
    "bitcoin",
    "psychedelics"
  ],
  "url": "https://chepenikconor.medium.com/day-84-94aa2bb55dc3",
  "content": "# Day 84\n\nYesterday I joked about fiat normies vs Bitcoiners and while it is always funny poking fun at no coiners I do think it's bad to group people into labels. No coiners can easily become Bitcoiners if they put in the work. As a matter of fact, we need more normies looking into bitcoin. Can't change the system if the masses don't stand up. I thought this meme was so relevant in regards to modern times.\n\n![](https://miro.medium.com/1*INpSg3Ie-YDrrRknC33KQQ.jpeg)\n\nLabeling just results in people getting defensive. We need to be breaking down barriers and helping others understand that the Federal Reserve is robbing all of us via inflation. Telling people they don't get it and to have fun staying poor will not solve many of the challenges our world is plagued with. Bitcoiners do kill me with the memes they post and it is fun seeing them joke around on Twitter. That said, I'm going to make it a point to be kinder to no coiners, especially if they just don't understand Bitcoin and have never locked into it. Luckily, we got podcasters to spread the good word.\n\n![](https://miro.medium.com/1*N562yxwnOsxlHFIErG3U6g.jpeg)\n\nPodcasting do be like that sometimes. I'll say I never used to listen to podcasts but since covid hit I've been absolutely crushing them. Some are dumb as hell and good for a cheap laugh others are incredibly insightful. It's amazing how we've never had it so good as humans and yet it's also incredibly difficult to not be stressed. I feel bad when I wake up full of dread to go to work knowing my job is so easy compared to so many other tasks, but at the same time I think it might be time to find something else. I saw a posting for junior technicians so I might look into that. I've always liked cars.\n\nAnyways, I'm grateful to be alive, writing blog posts, and living through some wild times. Life is hard but it's also incredible. I'm reminded every time I write that I have it pretty damn good and I won't forgot that because my sales gig can be stressful. Mindset is everything.\n\n6/14/22\n\nConor Jay Chepenik",
  "wordCount": 358,
  "readingTime": 1.7342767295597483,
  "claps": 0,
  "voters": 0
}