{
  "id": "95d073fabcbb",
  "title": "Day 517",
  "createdAt": "2023-08-22 03:19:11",
  "tags": [
    "banking",
    "finance",
    "esg",
    "bitcoin",
    "pep"
  ],
  "url": "https://chepenikconor.medium.com/day-517-95d073fabcbb",
  "content": "# Day 517\n\nI have not de-banked...yet. Hopefully that does not change anytime soon.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FjIfBYTcoWok%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DjIfBYTcoWok&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FjIfBYTcoWok%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nBanking is a basic human right. You know who solved the problem? It was not the state. It was an anon on the internet 😂  an anon who goes by Satoshi Nakamoto.\n\nSeriously though, if you have had a bank shutdown or just think what is going on in the financial industry is wrong, Nigel recommended this website. I signed up to sign a petition. Honestly, I feel very privileged that I have not had a bank account shutdown. I'm also grateful that I understand Bitcoin in case my bank gets shut down for wrong think.\n\n> [**AccountClosed.org | Debanked**](https://www.accountclosed.org/)\n\nI knew central bank digital currencies (CBDCs) were something governments have been planning, but Nigel pointed out they are coming fast. I'm glad to see there are efforts to make having a bank account a non-political thing. It is a basic human right, just like the right to privacy. We the people shall keep demanding that our personal affairs remain private, while government activities should be public. Governments must not forget this is the way the system works best.\n\nThe individual is the smallest minority. Elon Musk was tweeting that his platform X will be humanity's collective consciousness. I think he is wrong. Here is what I think:\n\n[gang gang](https://primal.net/e/note1luu4qq8rwyeuwpd85r33pcdu7487cckuxlwugc03j6ml9x98cm4qwxnrz0)\n\n![](https://miro.medium.com/0*KtILVzYt4O2uo63n.png)\n\n[21](https://primal.net/e/note1luu4qq8rwyeuwpd85r33pcdu7487cckuxlwugc03j6ml9x98cm4qwxnrz0)\n\nI'm so freaking bullish on Nostr, Bitcoin, and every other app that will be built out on top of these protocols. Value 4 value is the way.\n\n8/21/23\n\nConor Jay Chepenik",
  "wordCount": 273,
  "readingTime": 1.230188679245283,
  "claps": 1,
  "voters": 1
}