{
  "id": "96d3470c2f4",
  "title": "Day 343",
  "createdAt": "2023-03-01 03:23:52",
  "tags": [
    "me",
    "he",
    "is",
    "him",
    "beast"
  ],
  "url": "https://chepenikconor.medium.com/day-343-96d3470c2f4",
  "content": "# Day 343\n\nWell I will be damned. Remember when the lab leak was a conspiracy theory?\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/FBI/status/1630733743777300483%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nHahahahaha I for one am old enough to remember. Wild times to be living my friends. Good to see the FBI saying they are for the people and the constitution. Don't know how this all ends but I do hope the FBI practices what they preach. If they can avoid being weaponized by either political party I do believe they can regain a lot of trust. Over a long time horizon anyways. Trust isn't built in a day!\n\nWent to the Boston Bitdevs meeting tonight which was dope. Turns out the guy who created the lightning network was there. I had no idea until my boy Lerrr pointed it out to me. Pretty cool living in Boston being near such brilliant people. If you are in Boston I highly recommend coming to the Bitdevs meetup. If you aren't in Boston then I recommend checking if your city has a Bitdevs. If it doesn't then start one. If you aren't technical enough then it might be worth starting a normal Bitcoin meetup. Long winded way of pointing out Bitcoin meetups are dope and you never know who you will run into at a meetup!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F4O6nj2RxbjqkQskItVyppS%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F4O6nj2RxbjqkQskItVyppS&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1ff5b3dc3781d4ea57447fd53e&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nReleased this podcast with my friend Jens. Enjoyed this conversation very much. Excited to watch it in the coming years and see how our predictions about nation-state governance turned out. Hopefully we are correct in the sense that states end up with more power.\n\nAnyways, this was more of a personal blog than a worthy post. \"Worthy post\" lol. Sometimes I type shit and think to myself wtf does that even mean. All my posts are worthy to me.\n\nI guess what I meant by that is anyone who isn't me might not get too much signal from this post, but that's alright. I wrote today and I'm proud of myself for that. Felt kind of all over the place tonight so it feels good to just sit down and wrap up the day with some random thoughts.\n\nNot much else to report. I'll be back tomorrow!\n\n2/28/23\n\nConor Jay Chepenik",
  "wordCount": 361,
  "readingTime": 1.3622641509433961,
  "claps": 0,
  "voters": 0
}