{
  "id": "96e1b5362d63",
  "title": "Day 731",
  "createdAt": "2024-03-23 03:02:09",
  "tags": [
    "north-korea"
  ],
  "url": "https://chepenikconor.medium.com/day-731-96e1b5362d63",
  "content": "# Day 731\n\nStarted watching a documentary on North Korea today. This was one of the Youtube comments \"so sad how you can be born somewhere and end up having so little control of your life...\"\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FhhYJcOIuVGA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DhhYJcOIuVGA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FhhYJcOIuVGA%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nWhat an insigtful Youtube comment. While the United States undoubtedly has its fair share of challenges, the situation pales in comparison to the harsh realities faced by North Koreans. The Government in North Korea forcibly export its citizens' labor and holds their families hostage to prevent defection. Watching this documentary serves as a sobering reminder of how fortunate I am to live in a country where individual liberties are, at the very least, acknowledged and upheld to some degree.\n\nHowever, it's crucial to acknowledge that the West, including the United States, bears some responsibility for North Korea's struggles. The extensive sanctions imposed on the country have undoubtedly exacerbated their economic hardships, driving them to resort to desperate measures like hacking and cryptocurrency theft to circumvent these restrictions. The image of a North Korean driving a wood-burning coal car, as inefficient as it may seem, is a stark reminder of the lengths they must go to due to their inability to purchase fuel in bulk because of the sanctions.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FpqP7FxiFIHE%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DpqP7FxiFIHE&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FpqP7FxiFIHE%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nNothing is truly black and white in this complex situation we all call life. While I recognize the immense advantages I possess by growing up in the West, it's evident that our flawed leadership has contributed to the struggles of nations like North Korea. I hold hope that decentralized technologies like Bitcoin can play a role in empowering individuals and reducing their reliance on government control, offering a means to transact and demand accountability from leaders who have failed many around the world.\n\n![](https://miro.medium.com/0*Zix4ahTqnuoKDb0o)\n\nI want to see humanity prosper, and I'm confident that freedom technologies will play a massive role in that prospering. Humans have an incredible ability to find a way, even in the face of adversity. Regardless of what one may think about North Korea, their people have demonstrated remarkable resourcefulness and self-sufficiency in the face of immense hardships. Their resilience and determination to survive are truly admirable. So if a North Korean ever reads this, respect to you for facing such hardship (at least what I can perceive as an outsider) and finding a way to keep on going. Truly inspiring!\n\n3/22/24\n\nConor Jay Chepenik",
  "wordCount": 393,
  "readingTime": 1.6830188679245282,
  "claps": 0,
  "voters": 0
}