{
  "id": "9721c320979c",
  "title": "Day 338",
  "createdAt": "2023-02-24 04:28:57",
  "tags": [
    "coinbase"
  ],
  "url": "https://chepenikconor.medium.com/day-338-9721c320979c",
  "content": "# Day 338\n\nThe Podcast with Shane was awesome. I'm frustrated that my voice has a bad echo, but Shane absolutely crushed it. Such a joy speaking with people who seek truth, prioritize liberty, and have hope for a better future. You can find the episode here if you want to give it a listen.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fanchor.fm%2Fconorchepenik%2Fembed%2Fepisodes%2FIndependence-is-a-Verb-Episode-11-with-Shane-Hazel-e1ve1t4&display_name=Anchor+FM+Inc.&url=https%3A%2F%2Fanchor.fm%2Fconorchepenik%2Fepisodes%2FIndependence-is-a-Verb-Episode-11-with-Shane-Hazel-e1ve1t4&image=https%3A%2F%2Fd3t3ozftmdmh3i.cloudfront.net%2Fproduction%2Fpodcast_uploaded_episode400%2F4990479%2F4990479-1677179308212-d03e6d8e72036.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=anchor\" title=\"\" height=\"102\" width=\"400\"></iframe>\n\nAlso got to go on [https://www.thebtcsource.com/](https://www.thebtcsource.com/) podcast today which was pretty cool. Getting to speak with others because of magic internet money is dope.\n\nSome other good news is that the football piece I've worked on multiple times via this Medium is set to be published on 3/1 for Bitcoin Magazine. All these things are possible because I started going down the bitcoin rabbit hole and seeking out others via meetups. Find your rabbit hole anon and spend as much time as possible there. Finding something you are passionate can be a bit of a grind but it's worth it.\n\nMy new pants tore the other day and this saddened me because I had grown to love these pants during the first week I had them. So I got some materials to stitch them up and did a fairly not horrible job. Will have to ask my partner to touch it up but felt good using my hands. Sewing and knitting are underrated skills.\n\nOutside of that not much too report. The days are flying by and coding camp is going well. I can't believe Feb is almost over. 10 more months of 2023 after that.\n\nWent to Twitter real quick for some writing inspiration and stole this photo.\n\n![](https://miro.medium.com/0*ZgMiJq7YeMl-A4UQ)\n\nGood stuff. Important you know the difference people.\n\nLast thing I'll mention today is that Joe Rogan Eric Weinstein podcast was insane. I finished up the rest of it today but the first part I heard yesterday was so good I made two posts in one day. Not sure if I've ever done that on Medium before. I've written blogs and published stuff elsewhere while making sure to get my day's writing in but to post back to back on Medium in the same day is a rare occasion. The reason I did it? Well I just felt inspired. It's time to stand up and demand peace. To let Kleptocrats around the world know their games are not okay. We the people deserve to live life without worrying about nuclear war. Don't stop demanding better. It is not too late for peace.\n\nEnd of rant. Go outside, get some exercise, get some sun, kiss your loved ones. Life is too precious to spend all your energy focused on bullshit. Everything in moderation. You need the crazy to have the major breakthroughs but you also need rationale to do anything significant with those breakthroughs.\n\n2/23/23\n\nConor Jay Chepenik",
  "wordCount": 460,
  "readingTime": 1.9358490566037736,
  "claps": 0,
  "voters": 0
}