{
  "id": "9906e1b8c039",
  "title": "Day 146",
  "createdAt": "2022-08-15 22:53:41",
  "tags": [
    "thoughts",
    "art",
    "bitcoin",
    "incentives",
    "history"
  ],
  "url": "https://chepenikconor.medium.com/day-146-9906e1b8c039",
  "content": "# Day 146\n\nHo boy. Me girlfriend is with her father in Florida so I got the crib to myself. I already miss her. Hahahahaha a good sign. I'm fine being alone it's not an issue, but I don't think I realize how much I appreciate my partner until she is not at our apartment when I get home. If you love someone you have to let them go visit their father for a few days in Florida so you can appreciate them more🤣\n\nWork was good today. Went by pretty fast honestly and I got to go for two nice walks. Getting out for walks is always the key to a productive day. Outside of that I don't have much to write about. Called both my grandparents today on my father's side which was nice. Pretty wild to think they will be great grandparents soon. God is good and he blessed up my family. Writing about how fortunate I am to be having a baby girl is a good reminder that what matters in life is not my job, or status, or the amount of bitcoin I can acquire before fiat collapses. It is the people I care about who matter. I'm grateful to be a part of such a loving family.\n\nI went back and did one more edit on that Bitcoin Magazine piece I posted yesterday. It's getting released on the 28th last I heard. Excited for that one to be out soon for any plebs to read. I'm really grateful what they do to give a voice to plebs like myself. Bitcoin is a special thing for a lot of reasons, and one of those overlooked reasons is because it bonds people. Bitcoiners make great friends. Trust me I make an amazing friend bro. No doubt bro. I have a freezer full of beef bro! Bitcoin did that. (The freezer full of beef, not my annoying typing of bro)\n\nLife is art. Saw this meme going through my camera roll and it killed me like it did the first time I saw it.\n\n![23 year old artist](https://miro.medium.com/1*RN8wRrETILJee4dNznu4Cw.jpeg)\n\nDon't ever take yourself too seriously or think you are better than other people. Life is more fun when you can keep an open mind and learn something from everyone. Anyways, this piece is all over the place. I don't have much to comment on. Grateful to be living in one of the most prosperous times humanity has ever experienced and will be here on Medium talking about how Bitcoin fixes this as nation-states become tyrannical when they start losing their ability to decree (to fiat if you will hahaha). Hopefully, it is a smooth transition but history seems to reflect otherwise :D. Luckily, we are entering times where history doesn't hold all the answers because new technology is rapidly changing the incentive structure of everything.\n\n8/15/22\n\nConor Jay Chepenik",
  "wordCount": 477,
  "readingTime": 2,
  "claps": 0,
  "voters": 0
}