{
  "id": "9921469fa828",
  "title": "Day 304",
  "createdAt": "2023-01-21 00:29:02",
  "tags": [
    "ray-dalio",
    "ai",
    "china",
    "top-down",
    "bottom-up"
  ],
  "url": "https://chepenikconor.medium.com/day-304-9921469fa828",
  "content": "# Day 304\n\nAs I read up on history, especially history that relates to monetary policy, it becomes quite clear that when there is a fiscal emergency the nation-state will issue debt to solve the problem, and then print money to pay said debt causing inflation, or even hyperinflation in some cases. I'm reading Ray Dalio's The Changing World Order today and China seemed to have this problem happen over and over again. Now they have a central bank digital currency in place and I'm genuinely curious what it would look like if that currency collapsed due to lack of faith from the people. I'm sure a CBDC gives Government much more power to manipulate the money like never before. Hard to imagine something like that taking hold in the U.S where Uncle Sam could just shut off my bank account because I did not tweet kindly about ze Feds😂 . I joke but it's also terrifying. God bless Bitcoin and God bless the Constitution. The idea of the state being able to program what I can spend my money on, when I can spend my money, and how I can spend my money will not fly.\n\nWhile I don't agree with the thesis that China will be the next world super power the book is still a great read. Thought this quote from Dalio was quite apt.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1616555340467785738&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe problem is how do you position yourself today when the debt-to-GDP of most developing countries looks like this. (Shoutout visualcapitalist.com for the image)\n\n![](https://miro.medium.com/0*BXL2QkA54fqkwP2A.jpeg)\n\nMaybe it's time we move away from Government issued currency. Got Bitcoin? It will take time to build people's trust, but necessity is a great teacher. As more and more Governments repeat the process I just described above I'm confident more people will look to store their wealth in somethings besides government issued fiat currency. It was interesting to read up on how Dalio described the US vs China in terms of our idealogy. His thinking is that the United States is more of a bottom up system where the individual is the most important part while China has a top-down system where the family's needs are above the individual. The Chinese word that has both \"family\" and \"state\" in it is \"家国\" (jiā guó), which literally means \"home country.\" It is often used to refer to one's family and country as being closely connected and intertwined.\n\nI mean I love America and what our constitution stands for, but this country is not above my family. I guess I'm lucky to be able to say that. If I had grown up in China maybe my thinking would be completely different on this subject. I do think China has some dope history and amazing looking architecture. Check out this AI generated image which I prompted to generate me a beautiful Chinese building. I'm just glad America does things from the bottom up. That right there is why we should embrace Bitcoin and all the more fitting why China banned it. Bitcoin is a bottom up solution that will likely not fly in a top-down system.\n\n![](https://miro.medium.com/1*o5WwhmhnLPT-bkx_yncnRw.jpeg)\n\nAnyways, I will wrap up with this hilarious fact. Imagine paying to learn how to be a tyrant.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1616581302622515200&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLearned this fact from the All-in Podcast. Pretty insane to think people pay that. When you look at the WEF as a bunch of grifters things start to make a lot more sense. Grifters think they can control what other people should do, but as they say \"Fuck around and find out\" :D Until tomorrow!\n\n1/20/23\n\nConor Jay Chepenik",
  "wordCount": 597,
  "readingTime": 2.6361635220125788,
  "claps": 0,
  "voters": 0
}