{
  "id": "997ef884e3ef",
  "title": "Day 944",
  "createdAt": "2024-10-22 01:37:14",
  "tags": [
    "3d-printing"
  ],
  "url": "https://chepenikconor.medium.com/day-944-997ef884e3ef",
  "content": "# Day 944\n\nMan, it feels good to be back home after a long trip. It was a busy Monday, crushing tickets and moving out of my old apartment. It feels great to be almost fully settled in the new place. After work, I set up my 3D printer, and while it was printing, I went to the park to play with my daughter. We enjoyed the swings, the play-set, and even explored the butterfly garden.\n\n![](https://miro.medium.com/1*fEzo1ioMRjkbnramGi1dxg.png)\n\nIn the butterfly garden we saw two young girls, probably between 5 and 10 years old, doing TikTok dances. It kind of saddened me - partly because I know I'm guilty of being on my phone too much, but also because they were so engrossed in their own screens, trying to get the other to look, but each was too busy with her own device. Not sure why girls that young have full fledged smart phones. To each parent their own, but man it just felt wrong watching kids at the age already addicted to TikTok. It was a phenomenal reminder I need to be mindful about my own daughter's tech use. I'm far from perfect when it comes to using technology in a moderate way and kids will just follow their parents. After the playground, we watched the sunset together.\n\n![](https://miro.medium.com/1*YDnWznnT6ETVmL4tu0_oqw.png)\n\nAll in all an incredible Monday. I am so excited about my 3D printer. It's so cool to watch that thing work. I think I'll print some coasters next so we don't ruin our living room table when drinks are on it :)\n\n![[https://x.com/ConorChepenik/status/1848479648965136399](https://x.com/ConorChepenik/status/1848479648965136399)](https://miro.medium.com/1*Db4eit1qlj4cWTwfnB1DhQ.png)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/ConorChepenik/status/1848510330155958377&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n10/21/24\n\nConor Jay Chepenik",
  "wordCount": 264,
  "readingTime": 1.5462264150943397,
  "claps": 24,
  "voters": 2
}