{
  "id": "9a59f4d0f647",
  "title": "Day 671",
  "createdAt": "2024-01-23 04:30:13",
  "tags": [
    "texas",
    "supreme-court",
    "federal-government",
    "united-states-of-america",
    "the-border"
  ],
  "url": "https://chepenikconor.medium.com/day-671-9a59f4d0f647",
  "content": "# Day 671\n\nIn a decision that might leave some scratching their heads or furiously tapping on their keyboards, the U.S. Supreme Court recently sided 5–4 with the Biden administration in a case concerning federal authority over border management. This ruling allows the removal of razor-wire fencing along the Rio Grande. Why would our supreme court rule in favor of weaking our border? I do not know but thinking about it does not exactly make me confident in our Government. Which if you know me is probably a given already, but somehow the Feds found a way to make my trust in the system even less.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/LeadingReport/status/1749594138092216321%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIn the American narrative, legal battles have always been a frontline defense against perceived government overreach. The courts, from local to the Supreme Court, have seen their fair share of disputes challenging the balance of power. This tradition stretches back to the founding of the nation, embodying the principle of seeking justice through legal means first. The ongoing legal skirmishes between states like Texas and the federal government are contemporary iterations of this age-old American practice. They remind us that the courtroom can be as potent a battleground for rights and liberties as any other.\n\nHowever, America's history is also steeped in the spirit of defiance, where legal avenues, while crucial, are not the only paths to justice. There comes a point where states, backed by their people, must assert their rights, drawing a line in the sand. This sentiment echoes the spirit of the American Revolution, where colonists, frustrated by British taxes and laws, eventually said, \"enough is enough.\" The Boston Tea Party wasn't just about tea; it was a symbolic act of rebellion, a statement that there are limits to what a people will endure.\n\n![](https://miro.medium.com/0*D2GsWDwi-cZmH_u7)\n\nToday, as we face complex issues like federal authority over borders, we're reminded of these lessons from history. Yes, we must pursue every legal avenue, respect the role of the courts, and engage in the democratic process. But history also teaches us the value of standing firm on principles, especially when it feels like fundamental rights and state sovereignties are at stake. It's a delicate balance, one that requires both a respect for the rule of law and a willingness to stand up when it's necessary.\n\nJust as the colonists reached a tipping point over tea, modern Americans, too, have their thresholds. It's in the DNA of the nation to question, to challenge, and, when necessary, to say \"enough.\" This isn't a call for rash action but a recognition of the role that a collective stand, grounded in principles, has played throughout American history. It's a reminder that while we engage in legal battles and policy debates, we also hold onto the right to stand up against what we perceive as tyranny, in the same unyielding spirit that founded the nation.\n\n1/22/24\n\nConor Jay Chepenik",
  "wordCount": 479,
  "readingTime": 2.0075471698113208,
  "claps": 1,
  "voters": 1
}