{
  "id": "9ae18370f282",
  "title": "Day 432",
  "createdAt": "2023-05-28 22:51:36",
  "tags": [
    "ghost",
    "writing"
  ],
  "url": "https://chepenikconor.medium.com/day-432-9ae18370f282",
  "content": "# Day 432\n\nToday was a great Sunday. I got to check out the space where we are hosting the MassAdoption Freedom Festival. After that I did a podcast with Super Testnet. Feeling pretty accomplished for a Sunday :)\n\nI also spent some time leveraging the bird app to figure out what the person who hired me to build a website wants and saw this meme.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/lopp/status/1662608811251597313%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt is truly fascinating how much insight can be gleaned from data analysis. However, it is important to acknowledge that some data can be misleading. Nevertheless, this does not diminish the value of using data as a tool for learning. It is crucial to recognize that there are always more variables at play than we initially realize. Thus, measuring things in percentages holds significant importance.\n\nInterestingly, today I was approached with an intriguing proposition to become a ghostwriter for someone. I find this proposal captivating, and I am genuinely excited to embark on this new endeavor. Considering I already engage in writing on a daily basis, crafting a book feels like a natural progression. Out of respect for their anonymity, I will refrain from revealing the identity of the individual I am writing for. Nonetheless, I am honored that such an accomplished individual, who has run marathons, initiated and successfully sold businesses from the ground up, and is an exceptional person overall, has entrusted me with the task of writing their bibliography.\n\nThe theme we have collectively chosen for the book is hope. The intention behind this choice is to explore the profound significance of what truly matters in life. We aspire to uncover the notion that much of what we learn from conventional models is designed to advance particular agendas. We hold hope that future generations will possess the discernment to see beyond contrived narratives, enabling them to discover truth, peace, and harmony in our intricately complex world.\n\n![](https://miro.medium.com/0*pSUDFEKeOMgB7IzP)\n\nNo one has all the answers. Yet many adults posses wisdom well beyond what a young'n knows. Good advice can take you far in life. At least if you are willing to listen and discern signal from noise.\n\n5/28/23\n\nConor Jay Chepenik",
  "wordCount": 356,
  "readingTime": 1.5433962264150942,
  "claps": 0,
  "voters": 0
}