{
  "id": "9bdbf13e2cda",
  "title": "Day 864",
  "createdAt": "2024-08-02 17:24:44",
  "tags": [
    "consumer",
    "creator",
    "ai",
    "coding",
    "replit"
  ],
  "url": "https://chepenikconor.medium.com/day-864-9bdbf13e2cda",
  "content": "# Day 864\n\n![[https://x.com/ConorChepenik/status/1819410975604322815](https://x.com/ConorChepenik/status/1819410975604322815)](https://miro.medium.com/1*FAUvUaLcwBSwvEPztOecWQ.png)\n\nAs if I did not already have enough things to do at least once a day I figured I would add another. This one is only 100 days though, so not as long as say writing for the rest of my life.\n\nWhat inspired this is the CEO of Replit on Tucker's podcast:\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FcNqTu_58sZ8%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcNqTu_58sZ8&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FcNqTu_58sZ8%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThis conversation between Tucker Carlson and Replit's CEO, Amjad Masad, made me reflect on how I use the computer. They touched on the idea that our relationship with technology has changed, and it got me thinking about the implications of this shift. For example, the iPad's release in 2010 marked a seismic shift in personal computing. This is a generalization, but in the beginning computers were tools for the tech-savvy, used for productivity and creation. They were an extension of the user, a means to enhance their work and creative output. With the iPad a new paradigm emerged. Computers became instruments of consumption, gateways to a world of information, entertainment, and social media. Anybody can use an iPad without instructions.\n\nThis shift has had far-reaching implications. On one hand, it has democratized access to technology, enabling people who were previously intimidated by computers to join the digital age. On the other hand, it has led to a decline in the number of users who are proficient in using the command line, a fundamental aspect of computing that was once a rite of passage for tech enthusiasts.\n\nThe contrast between the pre-iPad era and the post-iPad era is striking. In the past, computers were associated with hackers, programmers, and other tech-savvy individuals who used them to create, experiment, and push the boundaries of what was possible. Today, computers are ubiquitous, and their use is often reduced to mundane tasks such as browsing the internet, checking social media, and streaming videos.\n\nThis transformation raises important questions about the role of technology in our lives. As computers become increasingly user-friendly, are we sacrificing some of the creative potential and technical expertise that defined the early days of personal computing? Or are we simply evolving towards a more inclusive and accessible model of technology use?\n\nI see a similar dynamic playing out even more so with Large Language Models (LLMs). These AI-powered tools can enhance our writing, coding, and research abilities, but they also risk reducing our role from producer to consumer. I use LLMs to refine my ideas, polish my grammar, and make my writing more engaging. But in doing so, I'm forced to confront the same questions: am I sacrificing some of my own creative potential and technical expertise by relying on these tools? Or am I simply leveraging technology to amplify my abilities?\n\nAs I ponder these questions, I'm reminded of the importance of learning to code. In a world where technology is increasingly opaque, understanding the basics of compute and computers is more valuable than ever. Most things in life, we just expect to work without knowing why or how they work. Yet, there is immense joy in learning those things, and it can be incredibly beneficial. By learning to code, we can build apps and products that just work, and we can gain a deeper appreciation for the technology that underpins our lives. It's a skill that can empower us to create, experiment, and push the boundaries of what's possible - just like the tech enthusiasts of the early internet. Here is to becoming more of a creator, rather than a mindless consumer.\n\n![](https://miro.medium.com/0*j5CxLswRVCMAwB63)\n\n8/2/24\n\nConor Jay Chepenik",
  "wordCount": 590,
  "readingTime": 2.609748427672956,
  "claps": 0,
  "voters": 0
}