{
  "id": "9c4f79640695",
  "title": "Day 271",
  "createdAt": "2022-12-18 18:54:27",
  "tags": [
    "money",
    "fed",
    "quantitative-easing",
    "bitcoin",
    "ai"
  ],
  "url": "https://chepenikconor.medium.com/day-271-9c4f79640695",
  "content": "# Day 271\n\nStarted my morning with some light Bitcoin reading from my friend Jackson. I do recommend this substack especially if you are skeptical on why Bitcoin will be the next reserve currency of the world.\n\n> [**MacroJack | Substack**](https://substack.com/profile/97053873-macrojack?utm_source=substack&utm_medium=email)\n\nMy biggest takeaway is that another debt default is coming! History doesn't repeat but boy does it rhyme. The U.S had a bank run which led to gold being outlawed by F.D.R. A quick google search will turn up this.\n\n> Roosevelt \"**forbidding the hoarding of gold coin, gold bullion, and gold certificates within the continental United States**.\" The executive order was made under the authority of the Trading with the Enemy Act of 1917, as amended by the Emergency Banking Act in March 1933.\n\nIn 1971 Nixon took the U.S off the gold standard which was a default on those who were owed gold by the U.S treasury. Now in 2022 it appears the Fed will have no plausible way to pay off its debt unless it initiates QE infinity. Printing money out of thin air to pay off debt will lead to a soft default where people are paid back, but with dollars that are worth much less than they should be.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1604513608159092736&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGot bitcoin? Doesn't hurt to store a little of your wealth in a truly scarce digital bearer asset. Not financial advice, but what is advice from me is to learn about it. I imagine the Fed and Treasury will spin up some sort of universal basic income to get people to accept the fact they are devaluing everyone's wealth. \"Oh we have to print this money so we can end inequality\" and other B.S propaganda is likely going to be told to the American public.\n\nLuckily, there is a better option. Some might argue the Fed will let a natural deleveraging occur and I don't believe it. These people aren't going to let the system that enriches them implode. If they let all the debt go bad it would be too much for the system. Everything would blow up and the U.S would lose much of the power it now has with its dollar hegemony.\n\nAnother interesting post I read today was about AI chatbots and how they will start to replace search. The author created a chatbot for the Huberman Lab podcast and the results are pretty amazing. Rather than listen to old episodes for an answer you can just ask the chatbot and it will provide you an answer. The author just fed transcripts of this specific podcast to the A.I but imagine when chatbots can search the entire internet. I mean wow. The implications are stunning and exciting. I do recommend giving this a read.\n\n> [**I Built an AI Chatbot Based On My Favorite Podcast**](https://every.to/superorganizers/i-trained-a-gpt-3-chatbot-on-every-episode-of-my-favorite-podcast)\n\nThese bots have their limits and querying the whole internet with current hardware will be... slow I'd imagine hahahahha. However, say you want to find an answer from a certain set of content so you just feed the chatbot that certain content. Well you should get you answer much faster than if you just tried to listen through various podcasts at 3x speed. AI is going to increase human productivity to crazy levels and I believe for this productivity to be enriching for everyone humanity needs hard money. Not money that can be manipulated to enrich those at the top.\n\nFinally, I got around to updating my [Umbrel](https://umbrel.com/) and the new user interface is SLEEK!. Props to that team. I need to go ahead and get my Raspberry Pi a heat sync but I'm considering keeping some funds on Umbrel. I was thinking about pulling all of them because I've heard problems about channels getting closed, but they seem to really be upping their game. Will report back in the future if things are running smoothly after I find a way to make sure my Ras Pi is not overheating lol. Speaking of AI and Raspberry Pis I asked an AI to generate me a Pi from the future. Not bad!\n\n![[https://creator.nightcafe.studio/](https://creator.nightcafe.studio/)](https://miro.medium.com/0*FFXpXAec47AZbBFY)\n\n12/18/22\n\nConor Jay Chepenik",
  "wordCount": 717,
  "readingTime": 2.905660377358491,
  "claps": 28,
  "voters": 1
}