{
  "id": "9d36e43b0eb7",
  "title": "Day 100",
  "createdAt": "2022-07-01 00:58:03",
  "tags": [
    "work",
    "4th-of-july",
    "100-days",
    "writing",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-100-9d36e43b0eb7",
  "content": "# Day 100\n\nWell look at that. 100 days of writing: you love to see it. I'm glad that I committed to writing for 365 days and I'm happy to hit the milestone of 100 days. A lot of days when I really did not want to write but did it anyway. I've got a long way to go to becoming a top-tier writer but practice makes perfect. It's also been insightful in terms of processing the stuff I'm learning from consuming various podcasts. While I've mostly been listening to financial/bitcoin podcasts I've found these topics relate to everything (since money is one of the most fundamental tools society has). Society is going to change in ways none of us can imagine. I'm sure 20 years from now we will be able to do things that we never thought possible (like separating money & government 😉 ). We also need to stand up for our rights as a society and make sure that come 20 years we actually own stuff and that everything is not \"as a service\". I don't want to be paying a subscription fee for toilet paper, bed sheets, and my furniture.\n\nLife is funny man. If you had told me in elementary school I would be cold calling and emailing strangers to sell them software I would have told you wrong, I'm going to be an NFL quarterback. That one ended up not happening but the more I think about my gig the more I realize how fortunate I am to have this gig. Great perks, a laptop that allows me to learn a variety of topics on ze interwebs, and a sweet office. While one day I'm going to end up just talking, thinking, breathing, eating, and sleeping Bitcoin. (Maybe not the breathing and eating part since it's virtual) I need to practice what I've learned. Setting a low-time preference and realizing I'm in full control of my destiny is the key to creating a life I will be proud to look back on. Shit changes often and life doesn't always end up working out how we planned, but that doesn't mean we shouldn't have a general plan. I'm looking forward to a long weekend and celebrating America's independence from the United Kingdom. A little R&R so I can get back and sell the crap out of my company's cloud monitoring tool when I return.\n\nHad some tendons at a Chinese restaurant in the Chinatown district of Boston today. Should've just stuck with the udon noodles. The tendons were chewy and the sauce they were in was so spicy it made me cry. It was a delicious sauce but so hot. It was oddly an enjoyable kind of crying.\n\nThat's all for today anon. Going to clip some of my podcast and put it on the social media. Got to do what I can to spread the good word of Bitcoin. Peace and love😎\n\n6/30/22\n\nConor Jay Chepenik",
  "wordCount": 493,
  "readingTime": 1.860377358490566,
  "claps": 0,
  "voters": 0
}