{
  "id": "9d3a720ce237",
  "title": "Day 89",
  "createdAt": "2022-06-20 01:19:02",
  "tags": [
    "memes",
    "bitcoin",
    "fathers-day",
    "golf",
    "humor"
  ],
  "url": "https://chepenikconor.medium.com/day-89-9d3a720ce237",
  "content": "# Day 89\n\nPlayed 9 this morning bright and early. My golf game needs a lot of work and today was not a good showing. After a great drive to start the day it was downhill, but it was beautiful weather. Being on a golf course is always nice so I can't complain. I've been opting to walk when I play. Very nice getting the exercise and taking time to enjoy the scenery between shots. Got to be some good stand-up jokes I can write about golf. Nothing is more enjoyable and stressful than playing a round. Only sport you can drink beer and still perform top-notch in. Maybe that's not true for functioning alcoholics, but sometimes I think when I'm drinking and not overthinking my swing I play better. Always thought new clubs would improve my swings, but it just shows you can't polish a turd. Something along those lines maybe. Speaking of jokes, here is one that actually cracks me up. Memes are good for the soul.\n\n![](https://miro.medium.com/1*oZiy9VlG1CVNjx8i85LjOQ.jpeg)\n\nIf you haven't seen _The Matrix_ please stop reading this post and go watch. Both father's day and June 19th are today. Glad that black people got their independence even though they shouldn't have ever had it taken away to begin with. History is complex though and sometimes I do wonder if it was more wealthy vs the poor than a race thing. History is written by the victors so I probably will never get a clear answer. In terms of history I've lived through it was unfortunate to see the BLM movement of 2020, which seemed like it had the right idea at heart, be used to enrich a select few. As a white cis male in the U.S.A, I am happy to admit I have faced a lot of advantages in life and that I don't know what it is like to be truly discriminated against. I'd love to live in a world that didn't have racism, but human nature is a funny thing. All you can do is be the best version of yourself and treat others with respect. If they abuse you then it's alright to stand your ground, but assuming you're better than someone is a recipe for disaster. Sometimes you got to just laugh at the pain. Reverse racism is also not the answer. If you are truly for a better world then you don't want revenge for the horrible acts that someone's ancestors committed. I do think the world has seen some shit go down since the unfortunate death of George Floyd. Grateful that humor can help make a sad situation better.\n\nDrove to Philly today to see my Dad for father's day. He said I looked stressed which I think is partly true, but also he can stress me out lol. He was very nice and offered me a chance to come live with him at his crib in South Carolina. While part of me wants to cut loose and figure out what I truly want to do for work another part is not sure if moving back in with my Dad is the answer. I do not what the answer is to my problems. Focusing on the now is a start. Can only take things day by day. Stressing about the future is futile. When I got back to Jersey I went and laid in the grass. Feeling sunlight and touching the earth is quite based. People need to do it more. My girlfriend was also kind enough to rub my back for a second which helped.\n\nGoing to dinner with my girl's family tonight and I'm reminded how blessed I am. Life is so futile and while things are going to change in the future 99.999999% of it is out of my control so I'm better off just focusing on myself. The best way to help others is to be the happiest version of you.\n\nMy laptop died as I was writing this so I'm finishing up this post after dinner, which was delicious and enjoyable. I left my phone which was actually awesome. Easy to feel like you lost a limb at this point not having a phone in your pocket since most people are addicted to their device, but it was freeing. Only part that made me wish I had my phone was when I was heard the table next to me talking about Bitcoin. The older people at the table were joking about how it lost so much value recently while the kids at the table were excited to buy some. I think the grandparents had given the grandchildren money and were joking they could now buy more Bitcoin with it. Honestly, this made me so happy. It took everything in me not to butt in the conversation, but I'm not sure these adults wanted to hear from a Bitcoin maxi on father's day 😂 🤣🤣🤣. It is hopeful for the future that children are ditching fiat for this new form of money.\n\nAnways, life is good. Got told happy father's day by a bunch of family members which is kind of funny. Not sure if it qualifies since my kid is in my girlfriend's belly, but I'll take it. Happy to have such loving people in my life. Was feeling a little stressed earlier, but just going to keep learning to love myself so I can emit good chakra to the world. Be the best you anon❤ It will make the world a much better place than you realize.\n\n6/19/22\n\nConor Jay Chepenik",
  "wordCount": 926,
  "readingTime": 3.6943396226415097,
  "claps": 0,
  "voters": 0
}