{
  "id": "9da398d3c135",
  "title": "Day 262",
  "createdAt": "2022-12-10 01:05:24",
  "tags": [
    "tyranny",
    "government"
  ],
  "url": "https://chepenikconor.medium.com/day-262-9da398d3c135",
  "content": "# Day 262\n\nI'd like to preface this by saying do not watch this video unless you are prepared to feel gutted. Not exaggerating this is some of the worst tyranny I have ever seen happen.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/hodgetwins/status/1601220455561822208&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI mean truly evil stuff happening. For those who might argue oh this isn't real or the parents were refusing surgery for the baby you are wrong. Read this article and just look at the headline.\n\n> [**New Zealand court takes custody of sick baby from anti-vax parents**](https://www.abc.net.au/news/2022-12-07/nz-takes-custody-of-baby-from-anti-vax-parents/101746236)\n\nThere is no excuse for something like this. Absolute cruelty and tyranny from a corrupt and broken government. It's important to focus on the positive in the world but I had to share this video after watching. I was seeing red immediately after. I'm still hopeful, I'm still an optimist, and I still know that we the people can create the society we want to live. I pray the parents in this case can get their baby back and that the child is not injured from this blood transfusion.\n\nCan't express how grateful I am to live in the United States of America. God bless our founding fathers who had the foresight to create the 2nd amendment because this shit wouldn't fly in the States. I don't even want to think about this situation happening to my unborn daughter. I would die to protect her from tyrants like this. I hope police officers asked to commit crimes like this have a hard look in the mirror and reconsider what side of history they want to be on.\n\nAnyways, tomorrow I vow to focus on building and creating the world I want to see. This David Coggins episode the J.R.E had me riled up this morning.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F69QtiFgM7HP4mK2yZPKiut%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F69QtiFgM7HP4mK2yZPKiut&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f64257e0d97c0c44264d9295a&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nRan and walked over 10 miles today because of it. I bring it up because I had heard good things about this guy but never actually taken the time to listen to him. Dude is absolutely nuts. In the best way possible. Made me feel like a little bitch for complaining about my life. Which is what I needed. No one is going to give you shit. Go out and get it for yourself.\n\n[https://www.instagram.com/p/CFc0Ekkjpg2/?utm_source=ig_web_copy_link](https://www.instagram.com/p/CFc0Ekkjpg2/?utm_source=ig_web_copy_link)\n\nYou can just tell the guy means what he says. No bullshit with David. Finally, no need to wait for tomorrow to spread joy. This photo gave me a smile.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/dergigi/status/1601122316943257600&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nChallenge accepted. Once upon a time the state thought it could coerce and control people. Then a shadowy anon said I'm going to separate money and state. The shadowy anon disappeared after doing so and the people were able to peacefully opt out of tyranny. The end.\n\n12/9/22\n\nConor Jay Chepenik",
  "wordCount": 465,
  "readingTime": 1.7547169811320755,
  "claps": 0,
  "voters": 0
}