{
  "id": "9da8989474d8",
  "title": "Day 577",
  "createdAt": "2023-10-21 02:22:02",
  "tags": [
    "blue-angels",
    "jets",
    "usa",
    "peace",
    "hope"
  ],
  "url": "https://chepenikconor.medium.com/day-577-9da8989474d8",
  "content": "# Day 577\n\nWent to Jacksonville Beach today to have dinner with my Grandparents and enjoy the ocean. It just so happened to be the day where the Blue Angels were training for a show this weekend. The sheer power and agility of those jets are truly a marvel to witness firsthand. Their deafening roars and blistering speed are both exhilarating and awe-inspiring. It's a visceral experience that's hard to articulate unless you've been there to feel the reverberations and watch those sleek machines defy gravity.\n\n> \"At the opening of the twentieth century there were five great Western empires - the British, French, Russian, German, and Austro-Hungarian - and two emerging great powers: Japan and the United States. By century's end, all the empires had disappeared. How did they perish? By war - all of them.\n\n> \"America survives as the sole superpower because it stayed out of the slaughter pens until the other great powers had fought themselves near to death and avoided a cataclysmic clash with a nuclear-armed Soviet Russia.\n\n> \"Yet, today, America's leaders are reenacting every folly that brought these great powers to ruin - from arrogance and hubris, to assertions of global hegemony, to imperial overstretch, to trumpeting new \"crusades,\" to handing out war guarantees to regions and countries where Americans have never fought before. We are piling up the kind of commitments that produced the greatest disasters of the twentieth century.\"\n\n> - Patrick J. Buchanan, \"A Republic, Not an Empire\" (1999)\n\nWitnessing the might of the Blue Angels, I was starkly reminded of the unparalleled strength of the U.S. military. But in the grand scheme of things the wisdom of the ancient strategist, Sun Tzu, resonates profoundly: the most triumphant strategy in warfare is to abstain from battle altogether. I pray that those in power heed Sun Tzu's advice. Just because we have a strong military does not mean we should use it aggressively. Defense is one thing, but using offense around the world to mask our own internal challenges is not wise.\n\nMay God bless the U.S.A, guiding those in power to understand that war should be the final option and minimized when unavoidable. The thought of the jets I saw being used for bombings is haunting, and my prayers go out to those who live with that fear daily.\n\n![Prompt: Vector artwork of Blue Angels flying in a dramatic formation above Jacksonville Beach, casting shadows on the beachgoers below.](https://miro.medium.com/0*WHRsvhsKjVuNTSCW)\n\nThe U.S.A has the potential to do so much good in the world. It does urk me those in power are running up our debt like someone running up their credit card before getting ready to declare bankruptcy. However, I'm hopeful we will figure it out and correct course. We can all make a difference. Stand up, speak your mind, and fight for a better world. \"They\" don't want you to have hope so have hope!\n\n10/20/23\n\nConor Jay Chepenik",
  "wordCount": 467,
  "readingTime": 1.9622641509433962,
  "claps": 0,
  "voters": 0
}