{
  "id": "9e9a857cee23",
  "title": "Day 594",
  "createdAt": "2023-11-07 02:55:35",
  "tags": [
    "the-sun",
    "exponential-technology",
    "openai",
    "ai",
    "chatgpt"
  ],
  "url": "https://chepenikconor.medium.com/day-594-9e9a857cee23",
  "content": "# Day 594\n\nDuring dinner with my father today, I posed an intriguing question: \"How many times must one fold a piece of paper for it to reach the Sun?\" He ventured a guess in the billions, then trillions. With a chuckle, I corrected him: \"Just 51 times.\" His disbelief was palpable. After several fervent Google searches, he acknowledged the staggering truth. The notion is indeed mind-boggling - assuming one could surpass the typical seven-fold limit, the paper's exponential growth would span the 93-million-mile gap to the Sun.\n\nI don't say this to bash on my Dad. He is a smart man. It was funny though because I brought up this example to showcase how much humans do not understand the power of exponential functions.\n\nIt's a classic illustration of the surprising nature of exponential growth! The concept that folding a piece of paper could theoretically reach the Sun is based on the idea of geometric progression, where each fold doubles the thickness of the paper, and it doesn't take many doublings to reach astronomical figures.\n\nTo break this down further, each time you fold a piece of paper, its thickness doubles. If you start with a standard sheet of paper, about 0.1 millimeters thick:\n\n1. After one fold, it's 0.2 millimeters.\n\n2. Two folds bring it to 0.4 millimeters.\n\n3. This process continues, and by the time you reach the 51st fold, the thickness is so great it spans the distance from the Earth to the Sun, over 93 million miles.\n\n![](https://miro.medium.com/0*6HVNKu68Og4WEWqD)\n\nHowever, in practice, folding a piece of paper more than seven or eight times is nearly impossible due to the physical limitations of paper and the exponential increase in the difficulty of folding as layers accumulate.\n\nThis example also serves as a metaphor for understanding the potential of technologies and processes that improve at an exponential rate, like computing power & AI, which can quickly exceed our linear intuitions.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/nickfloats/status/1721607017901572543%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThis video has completely captivated me. The imminent arrival of ChatGPT's GPT Store heralds a transformative era where creating personalized AI assistants is within everyone's grasp. Imagine crafting bespoke applications that seamlessly integrate into our daily routines, enhancing productivity and personal growth - all without the prerequisite of technical know-how.\n\nEnvision a specialized writing assistant GPT fine-tuned to your literary style, or a culinary GPT designed to guide you through new gastronomic adventures. Picture a companionate GPT that offers insights into nurturing your romantic relationships, or an exercise GPT that crafts your optimal fitness regimen. For the financial enthusiasts, a Bitcoin Maximalist GPT could be your steadfast reminder of Bitcoin's preeminence in your investment strategy, reinforcing its value over other assets unless I need USD to pay fiat bills because we are still so early in Bitcoin's adoption phase.\n\nWhile the financial incentives are also appealing, I'm most enthusiastic about how this will let all sorts of people access the benefits of AI. With some creativity, we could design GPTs that make a genuine difference. If you are reading this and are already thinking of a cool GPT let me know in the comments what kinds of helpful assistants you want to build!\n\nAnd now, let's link this to the concept of exponential growth. As these technologies evolve, we're stepping into an era of accelerated innovation. The future is brimming with potential, poised to introduce careers we've yet to conceive.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1721716054559268935%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI'm curious to check out the results of this poll. Very possible that many people will go ahead and cheat by looking up the answer but I'm still curious to see if some click the two massive numbers.\n\nAnyways, I will leave you with one more tweet and some perspective.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/BrianRoemmele/status/1721715156546371615%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe horizons of our capabilities are boundless. Let's keep this spirit of possibility at the forefront of our endeavors.\n\n11/6/23\n\nConor Jay Chepenik",
  "wordCount": 636,
  "readingTime": 2.6,
  "claps": 2,
  "voters": 0
}