{
  "id": "9eb9daf05b44",
  "title": "Day 276",
  "createdAt": "2022-12-23 18:36:10",
  "tags": [
    "nuance",
    "cernovich",
    "malice",
    "propaganda",
    "bitcoin-meetup"
  ],
  "url": "https://chepenikconor.medium.com/day-276-9eb9daf05b44",
  "content": "# Day 276\n\nNuance is always lost in propaganda. Take the war in Ukraine. You either support DeMoCrAcY or are a Putin apologist if you want to have a conversation about this topic in America. It is wrong and there should be way more thoughtful discussions about this topic, but that is missed when you got 5 minutes on the news to get your point across. The news isn't meant to make you smarter, it's meant to program the masses to support the current thing. I thought this Podcast with Malice and Cernovich was excellent.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fx1JauJvhAZA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dx1JauJvhAZA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fx1JauJvhAZA%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI'm so bullish on podcasts and the whole value for value model Bitcoin is enabling. These long-form conversations can get into the nitty gritty in ways that have not been available in media before. The stuff that never gets brought up on the mainstream media is partly because it's mostly propaganda and partly because the clips are short. News anchors don't have 3 hours to delve into the history of Russia and Ukraine. They just spout what the regime decrees is important so the public's hive mind is cool with whatever spending bill they need to ram through congress. Neither of these dudes above claims to think they are 100% right or have all the answers. However, they did state their opinions and bias which helped me feel more educated on the topic of war in Ukraine. After listening to some nuanced opinions it allowed me to continuously update my own mental models. Another way of saying: think for myself! I'm reaffirmed that my point yesterday is true. This war is truly awful for the citizens and people fighting while incredibly lucrative for the politicians and military-industrial complex. Hopefully we can get some peace talks but will see how it all plays out. The war is still going strong 9 months after this podcast was released with 100 billion USD printed and given to Ukraine at this point. (If the omnibus passes which I believe it did.)\n\n> [**Senate Reaches Breakthrough and Passes $1.7T Omnibus Funding Bill**](https://www.govexec.com/management/2022/12/senate-reaches-breakthrough-passes-17t-omnibus-funding-bill/381245/)\n\nLooks like it is headed for the House of Representatives after getting through the senate so I'm praying the House strikes this bad boy down but I am not hopeful. Either way though the U.S has been funding a proxy war which I don't think is helping the citizens of Ukraine. I appreciate Roy Chip for speaking up and thought this clip from him speaking in the House Of Representatives was powerful. It upsets me that representatives are lying about covid so they can vote by proxy on a 1.7 trillion dollar bill.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/repchiproy/status/1606328003494977547&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLuckily, while there is all this doom and gloom in the traditional fiat/ government-decreed world I am so bullish and excited about Bitcoin. Last night's Bitcoin meetup was truly incredible and I have some exciting stuff to write about. Here is a quick draft of my ideas for the substack I'm planning on writing for [Mass Adoption](https://massadoption.substack.com/). There is important nuance to be considered in conversations about energy that are missed in mainstream talking points. These nuances are completely ignored when the media is spreading F.U.D about Bitcoin and it is why in person Bitcoin meetups are so important. When you speak with other Bitcoiners in real life it's hard not to be bullish. I've learned a ton about various topics that I had no clue about because of my local Bitcoin meetup. It's crazy to feel the energy in the room as people talk about creating a new system based on math & open source software instead of violence & coercion. I want to make an analogy about how Bitcoin mining is a lot like water pump systems that store energy. I'd also like to tie in this fun fact I learned yesterday about parmesan cheese, my favorite cheese.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1606118206384484352&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI was cracking up when I learned this. A good defense against CBDCs and a cashless society. People will find a way to trade and barter regardless of wether or not cash is a thing. Our energy is finite. There is a lot of stuff in this world to piss you off, make you feel hopeless, and convince you none of it matter. Spend some time in a space you love with people you love and you'll quickly realize how much hope we should have. Humanity is entering another renaissance and if we focus on the right things the possibilities are truly endless.\n\n12/23/22\n\nConor Jay Chepenik",
  "wordCount": 765,
  "readingTime": 2.8867924528301887,
  "claps": 0,
  "voters": 0
}