{
  "id": "9f4da7912b29",
  "title": "Day 1151",
  "createdAt": "2025-05-17 03:35:32",
  "tags": [
    "taking",
    "the",
    "bus",
    "an",
    "experience"
  ],
  "url": "https://chepenikconor.medium.com/day-1151-9f4da7912b29",
  "content": "Day 1151\n\n![](https://miro.medium.com/1*RbZntFBVsQpcRITd_AoNBQ.png)\n\nTook a bus from Boston to Newark, New Jersey today. On the plus side, it was about 2.5 times cheaper than the train. On the downside... I'm starting to wonder if the train might've been worth the extra cost.\n\nBoarding was a bit of a mess but we made it on. Once moving, I was reminded how surreal it is that we all now carry supercomputers in our pockets. The ability to stream, to read, or to hear just about anything you want, all while hurtling down the highway in a massive steel box, it really does help a long ride pass more easily.\n\nBut wow, there was some pent-up aggression on that bus.\n\nBefore we even boarded the bus one guy went off on the driver for \"not giving clear enough directions.\" Later on during the ride the driver started yelling at another passenger who was loudly complaining about something else. I was halfway through a podcast and couldn't hear the details, just the driver shouting, _\"I can't drive under these conditions!\"_ Not exactly what you want to hear from the person responsible for a multi-ton vehicle doing 60 mph on the interstate. 😭\n\nStill, we got to our destination safely, so it worked out. But man... major respect to bus drivers. That job is no joke. You're part therapist, part wrangler, part pilot of chaos. Getting into the Newark bus station was also insane. So much traffic and honking. I thought we were about to hit someone, if I had been driving we definitely would have.\n\nSilver lining is it's kind of wild how easy it is to cross state lines on a bus. You could probably sneak on to one if you really wanted to. It is way more lax than flying. But planes are faster by miles, even if the TSA makes you feel like you're being processed for prison intake.\n\nOne surprisingly cool moment: the guy who argued with the driver early on was watching an anime series I didn't recognize, but I did enjoy. Even my daughter was enjoying watching it from behind. He had headphones on, so we just watched silently over his shoulder. Honestly, I think I liked it more without the audio. It was strangely soothing. My daughter, Sloan, kept pointing at his phone memorized. It turned into a kind of unspoken shared experience. That was a highlight.\n\nOverall, I'm grateful for the whole thing. It reminded me how lucky I am to have a car... to even be in a position to take a trip at all.\n\nEarlier in the day, before our 5:15 PM bus, we had to check out of the Airbnb early. To kill time, I met up with my buddy Zak for his birthday while Paige linked up with her friend Ana. I had to haul my luggage pretty far to get to Zak's but once there I had a great morning with him before linking back up with Paige and Sloan. Long day. Good day.\n\nNow, as I write this from a rolling bus on a glowing piece of glass the size of my palm, I can't help but feel a weird awe. Yeah, the modern world has its flaws. But it also has magic if you're looking.\n\nDon't lose sight of that. Keep some wonder. Raise the energy when you can. Be the calm in the noise.\n\nThe world gets better when you elevate the vibes 😎\n\n5/16/25\n\nConor Jay Chepenik",
  "wordCount": 581,
  "readingTime": 2.3924528301886796,
  "claps": 0,
  "voters": 0
}