{
  "id": "9f9eeb67777f",
  "title": "Day 323",
  "createdAt": "2023-02-09 03:46:46",
  "tags": [
    "north-korea",
    "jre",
    "quality",
    "state-of-the-world",
    "karma"
  ],
  "url": "https://chepenikconor.medium.com/day-323-9f9eeb67777f",
  "content": "# Day 323\n\nListened to the first part of this podcast today as my partner and I drove home from South Florida. Gut wrenching stuff.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F0G5o6GYjWgbSvKG3W2W2xO%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F0G5o6GYjWgbSvKG3W2W2xO&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fa6b62a68d8eb4c8f4283084f&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nThis podcast made George Orwell's 1984 sound like a decent place because at least those people had food. Don't get me wrong, 1984 is a complete dystopia but no one is eating bugs and being forced to give the Government a ton of their poop every year. Yes according to this podcast the North Korean Government depends citizens meet a poop quota so they can have fertilizer for their crops. There are so few resources and no way to get reliable fertilizers so citizens must preserve their fecal matter and turn it over to the Government every year. Poop actually gets stolen if not guarded because the Government will punish you for not meeting its quota.\n\nThere was one point on the podcast where Joe Rogan mentioned it is so strange as an American hearing of these horror stories because we have the opposite problem in the States. While people are starving in North Korea we are over eating. At the time of this pod Jamie, Rogan's podcast producer, found that 43% of Americans were obese. I've had ups and downs in life like anyone but hearing Yeonmi's story makes me so grateful to be a U.S citizen. Our country is a far cry from perfect but at least people have opportunity, a right to defend themself, and food on the table. Not to mention the language in North Korea is as oppressive as Newspeak in 1984. Yeonmi even referenced 1984 when she was pointing out how powerful a tool language is for oppressing populations.\n\nThe more perspectives people can hear from the more understanding we become. Empathy > xenophobia. Another pod I listened to earlier in the week was this rip from TFTC.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F5oExJK7tqlo3sBOIgKJzgj%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F5oExJK7tqlo3sBOIgKJzgj&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1ff0510397f3f151eec2daed0a&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nOne of the points made by Svetski is that quality is much more important than quantity. In a world full of noise this is an important point. There are so many shit foods, books, tv shows, drinks, and other vices people have access to 24/7/365. In a way we are fortunate to live in such a time of abundance. I'll be the first to admit I've gotten a lot of joy out of many shit television shows and foods. Once in a blue moon these things are fine. Gorging yourself on them is a recipe for disaster.\n\nI've found that when I fast the meals I eat afterwards are some of the most delicious. Taking time away from something makes it that much better in the future, at least in most cases. This is not the case with something like exercise lol. Life is about building good habits and learning to limit the noise. Not easy, but super useful. It makes me think about these blog posts. I'm very proud to have written for 323 days consecutively but I also recognize some of these posts have been absolute shit. I appreciate all of you anons who have read any of these and I hope to get better with each day. Of course there will be more shit posts in the future, but I'm going to make a cognizant effort to make these about quality instead of quantity. To write less, but articulate my thoughts better.\n\nOne of the things that stood out to me from Yeonmi's story is when she got a call from her friend in New York who was complaining about a boy not calling them back. Yeonmi felt zero pity because this is not a legitimate problem to her. Being heart broken or rejected sucks for sure. However, comparing heart break to what people in North Korea have to go through is like comparing missing a meal with starvation. It doesn't calculate.\n\nI learned about the Holocaust in school and was happy to be told students are taught about this so we can make sure it never happens again. Yet it is happening again. This podcast made clear genocide is going on in North Korea and most people can't question it because of the economic interests involved. China is powerful and keeps North Korea propped up because they don't want it falling under Western Ideology. The West lets these atrocities go on because we are getting paid. Heartbreaking stuff. I won't stop writing about this and I will remember to reflect more on all the amazing things I have. I'm still convinced Bitcoin can help solve a lot of these issues. I'm not delusional about Bitcoin fixing all the world's problems. I just think it will mean no one has the ability to print money arbitrarily and use it to force people to do their bidding. Sure there are a plethora of issues we need to improve in the United States but man... Words can't describe the fortune it is to be a citizen in a country that doesn't starve people to death, take away their humanity, and pretend that its leader is the second coming of Christ. Good will win in the end and those who are evil will pay for their crimes. I need to remember this when my heart fills with sadness about the current state of things.\n\n2/8/23\n\nConor Jay Chepenik",
  "wordCount": 876,
  "readingTime": 3.3056603773584907,
  "claps": 0,
  "voters": 0
}