{
  "id": "a25a6f36b46e",
  "title": "Day 65",
  "createdAt": "2022-05-27 01:32:55",
  "tags": [
    "bitcoin",
    "beers",
    "opting-out",
    "work-events",
    "childhood"
  ],
  "url": "https://chepenikconor.medium.com/day-65-a25a6f36b46e",
  "content": "# Day 65\n\nWow. I mean I'm just feeling so happy. Like a little kid filled with glee because he knows something none of the other children in his class know. Watched this [episode](https://youtu.be/KxxVQL2KydU) of Swan Signal with Greg Foss and Max Keiser which has resulted in me being even more bullish, which I didn't think was possible. So many good points made plus I was cracking up the entire time. It is absolutely wild how much shit the world is in right now because central banks keep kicking the can down the road. It is also wild how few understand that Bitcoin is not a risk on asset. It is one of the few quality assets in the world that has no counter party risk. Well if you take your coins off an exchange that is. Keeping bitcoin on an exchange opens one up the counter party risk of said exchange defaulting.\n\nI know many think that there is risk involved in taking your coins off an exchange. If you don't take the time to properly secure your seed phrase and secure your coin this is absolutely true. Also probably worth taking some time to educate yourself on how Bitcoin works so you understand what it means to take your coins off an exchange. The problem is the counterparty risk is way higher if you don't take your coins off the exchange. No one thinks Coinbase, Gemini, FTX, and the likes will ever go under. The same could be said for Bear Stearns and Lehman Brothers back in 2008. I like Coinbase and Gemini and don't want to see either go under. I use them both for various services, but I always pull my coins off the exchange once they become substantial amounts. Not worth the counter party risk that keeping your coins on an exchange brings. With stuff like Muun wallet nowadays securing your corn has never been easier.\n\nToday I had an after work event and got to orange pill some fellow coworkers. I always underestimate how early I am until I actually get to talk with people who have never heard of it. One of my colleagues Kelly seemed to understand how much BS we are experiencing due to fiat, but she had no idea there was a solution like Bitcoin. Obviously, I did what I could to orange pill her and she seemed interested but the rabbit hole runs so deep. Luckily, many of my coworkers are curious and I will continue my orange pilling. We the people have power and many are starting to wake up. Remember to start with education because it is a lot easier to hold 🌽  when people become convinced that this is the best store of value ever. Planning on bringing _The Bitcoin Standard_ into work and lending it out because that book is a fantastic 🍊  💊 .\n\nAnyways, the work event was fun and it is always nice getting to talk with coworkers when people loosen up after a few drinks. Including myself hahaha. Usually, I'm pretty good about not talking about bitcoin, but when I get a few beers in me I can't help. The world desperately needs hard money and Bitcoin is getting ready to gain world reserve currency status. Keep the faith anon. Many people are waking up and don't even realize there is a way to opt out. Bitcoin is hope. Bitcoin is love. Bitcoin is mf truth!\n\n5/26/22\n\nConor Jay Chepenik",
  "wordCount": 577,
  "readingTime": 2.177358490566038,
  "claps": 0,
  "voters": 0
}