{
  "id": "a3376d35c87f",
  "title": "Day 261",
  "createdAt": "2022-12-09 01:55:42",
  "tags": [
    "coding",
    "serverless-databases",
    "imf",
    "world-bank",
    "debt-slavery"
  ],
  "url": "https://chepenikconor.medium.com/day-261-a3376d35c87f",
  "content": "# Day 261\n\nPlayed some Fortnite with an old Tufts football friend and a friend from my Reveener days. Always cool to mix worlds and we got a trios dub which felt amazing. I don't want to live in a world where people spend 90% of their time in the metaverse but I do think video games are awesome. Fine line trying to manage that balance. If you can have enough restraint to not go over board video games are an incredible use of time for catching up with friends.\n\nSpent some time watching Saylor rip today. My girlfriend thinks he is monotone but personally I could listen to Saylor explain why Bitcoin is engineering perfection all day.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FkTFuaaFZL8k&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DkTFuaaFZL8k&image=http%3A%2F%2Fi.ytimg.com%2Fvi%2FkTFuaaFZL8k%2Fhqdefault.jpg&key=d04bfffea46d4aeda930ec88cc64b87c&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nAnother interesting tidbit I saw online today is that the ECB staff is considering going on strike if they don't get a raise that is on par with inflation. The ECB is the European Central Bank for those who don't know. You literally could not ask for a more ironic 🤡 🌎 . Central bankers cause inflation with their quantitative easing and fancy financial terms yet they demand a raise for the problems they created?\n\n> [**ECB staff in pay dispute to hold talks about potential strike**](https://www.ft.com/content/0fab7af9-e950-43f1-b1aa-f2deeb21b34d)\n\nIt is important to note that the people working at these institutions probably don't realize they are reeking havoc on the world acting as lenders of last resort who have the ability to print money out of thin air. I'm sure many of these workers are good people and want to help the world. That said, I wish more of these workers would look in the mirror and really question why they need to threaten a strike when the mission of the ECB according to a quick google search is \"to keep prices stable, thereby supporting economic growth and job creation.\" Central banks have done a horrible job of this. I'd imagine there are plenty of bad actors in Central Banks around the world as well. The optimist in me just hopes the good ones can wake up and join the bright orange side!\n\nI think this interview from Preston is fitting here because this podcast explains so well how those at the IMF and World Bank probably don't see themselves as evil but are instead just following the incentives structures placed in front of them without actually verifying why their actions are causing the death of millions and pollution of various environments.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FffXLdjCdzDs%3Flist%3DPLY2iemXCSz6FcGkvjkDlIi93W-yrM22ZA&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DffXLdjCdzDs&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FffXLdjCdzDs%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nOf course there is not much history written on this stuff. You have to really look for it like Alex explained in this video. The IMF and World Bank's biggest concern seems to be making sure less developed countries don't default on the debt they gave them. I can imagine you are not thinking about screwing over the local population when you are more concerned with making sure said country doesn't default. You are just focused on engineering a way to make sure they can keep paying you money so they don't lose money on their balance sheet. Thus, these organizations employ people to issue more debt and justify it as more capital to help build out a less developed countries infrastructure. The reality is this just creates more problems over the long term. Now it has gotten so bad ....well I think this tweet by Dylan really says it all.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/dylanleclair_/status/1601012291226722304&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nOf course people shouldn't be penalized for saving and to see a pension go bust would be devastating for many. However, there is no free lunch. Quantitive easing has side effects like say INFLATION! THE SAME DAMN THING PEOPLE AT THE ECB ARE POTENTIALLY GOING ON STRIKE FOR. Having a system based in debt is bad for the less developed countries and the savers. I'm fortunate to be in the country that can print the reserve currency but still. It's unfortunate how much damage fiat can reek on the world.\n\nI don't know anon. The world needs more first principle thinkers. It's hard though when you feel like you are in a rat race. Just took a big breath. I encourage you to do the same. Good, truth, liberty, etc will win in the end. It will take some time but God designed things this way for a reason. No pain no gain. Winning is amazing because of the work you have to put in to experience a win. Winning without any works is lame. I'd like to preface this by saying I'd love to win the lottery, but I do think it is telling that many lottery winners go broke a few years after winning the lottery. If you didn't bust your behind to earn it then you won't appreciate said money.\n\nSome good news is I heard back from Bitcoin Magazine and it looks like my article should be published soon. I also watched this video from fireship and I'm excited about serverless databases.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F1v_TEnpqHXE%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D1v_TEnpqHXE&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F1v_TEnpqHXE%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nLooking forward to watching the deep dive into serverless databases when fireship puts it out. It is important to not rely on too many third parties. As a matter of fact the less third parties the better. However, running a Bitcoin node is much different than hosting a website with a bunch of other Bitcoiners that promotes mass adoption of Bitcoin. (referring to massadoption.net if that wasn't clear)\n\nAnyways, will see what we decide to do. I'm open to running my own server, but if the website usage grows we might need to go to a cloud model. Tradeoffs to everying. Time will tell. :D\n\n12/8/22\n\nConor Jay Chepenik",
  "wordCount": 939,
  "readingTime": 3.543396226415094,
  "claps": 0,
  "voters": 0
}