{
  "id": "a39efe791150",
  "title": "Day 91",
  "createdAt": "2022-06-21 20:48:51",
  "tags": [
    "bitcoin",
    "published",
    "top-gun",
    "merica",
    "fuck-yea"
  ],
  "url": "https://chepenikconor.medium.com/day-91-a39efe791150",
  "content": "# Day 91\n\nWatched the new _Top Gun_ with my buddy Cody last night and that movie was incredible. My Dad was not kidding when he said that was one of the best films he has seen in a long time. Recently, I've been so caught up in the doom and gloom that I forgot how it felt to be proud of America. We have our problems, but as a born and raised American, I can confirm the film just felt good to watch. Makes sense why so many people wanted to celebrate our country by watching Tom Cruise fly jets. It is actually insane what a pilot has to do to fly a jet. Like a roller coaster, but on steroids, and if you mess up you die.\n\nI don't ever think war is the answer, but it is incredible what pilots do to fly those jets. In other news today I was published in Bitcoin Magazine. Very excited to be sharing the good word of Bitcoin. Also, Saifedean gave me a [shoutout](https://twitter.com/saifedean/status/1539237055422779398?s=20&t=7Bg1Of1Hhtdd21zXUc_HNA) on Twitter which felt incredible. His books have been incredibly impactful in regard to my understanding of Bitcoin. The article can be found here.\n\n> [**Choose Your White Paper Wisely - Bitcoin Versus Credit**](https://bitcoinmagazine.com/markets/bitcoin-versus-credit-white-paper)\n\nI still feel a bit tense because of my sales gig. Not sure why exactly, but I either feel very stressed doing the work or just a lack of desire to do anything. Been using memes in my outreach which has helped since I feel better about sending sales memes over wordy emails. I was reading _The Power Of Now_ this morning and it was a great reminder that all we have is the present. Worrying about past and future is futile, but we do it so often. Anyways, I am going to keep reminding myself that I can only focus on the here and now. It is simple advice, but incredibly powerful nonetheless. Sometimes the problems seem so complex but the answers are actually so simple.\n\nGot a lot to be grateful for, like my stand up comedy class tonight! Getting closer to the big show. Going to get touch some grass and write some comedy now. Love you anon.\n\n6/21/22\n\nConor Jay Chepenik",
  "wordCount": 388,
  "readingTime": 1.4641509433962263,
  "claps": 0,
  "voters": 0
}