{
  "id": "a3b55c8d3dd0",
  "title": "Day 153",
  "createdAt": "2022-08-23 00:05:14",
  "tags": [
    "life",
    "podcasts",
    "abyss",
    "challenges",
    "mundane-things"
  ],
  "url": "https://chepenikconor.medium.com/day-153-a3b55c8d3dd0",
  "content": "# Day 153\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F4TK5BQit7uWxkqGtcCq92P%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F4TK5BQit7uWxkqGtcCq92P&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f563ebb538d297875b10114b7&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"207\" width=\"368\"></iframe>\n\nFinished the Lex Fridman Podcast with Jordan Peterson this morning. Highly recommend for anyone trying to better themselves and find meaning in this shit we call \"life\". One thing that resonated with me as I walked and rode the train on my daily commute was fixing the mundane stuff in my life. The example Jordan gave was cleaning up his sock drawer. It sounds silly when you first hear it, but Jordan pointed out that you will open that drawer hundreds if not thousands of times over the years as you go through your life. Doing the little things like organizing that drawer, making your bed, arranging your room in a way that makes you happy are very important. Making the mundane meaningful will put you in the right mindset to accomplish great stuff. Both Jordan and Lex were dressed in nice suits for the interview. I became emotional many times listening to the podcast. Not to the point where I was balling on the train, but it just made me emotional being reminded how important the little things are. How much the important stuff gets overlooked because we are busy dealing with bullshit. Life is what you make of it and it made me emotional being reminded that I need to take control of my destiny and not take a victim mentality when something goes wrong. One silly example is this morning I missed the train by a second. Thus, I had to wait another 10 minutes for the next train to arrive. This is obviously a trivial thing, but instead of getting upset that the universe was against me I blamed myself for not hustling down the steps faster. I thought I heard the train when I was approaching the the T stop, but wasn't sure so I leisurely walked down. When I realized the train had just arrived I started booking it, but had I been walking with a sense of urgency I would've made it no problem. In the big scope of things it didn't matter, I still got a solid workout in despite being 10 minutes later than I would've been had I caught that first train. I also got to practice accepting an annoying situation for what it is. I didn't take the victim mentality and blame the T operator for not opening the door for me as I ran up to the T. I like how Jordan pointed out that staring into the abyss is what helps you grow. However, being forced to stare into the abyss is what causes trauma. Not sure exactly what the abyss is but for the sake of the argument I'm making here and as I understood it when I was listening to the podcast the abyss is dealing with adversity. This is a broad example but it makes sense to me. When you are forced to do challenging stuff by someone else's decree you can be traumatized. When you willingly do challenging stuff you learn and grow. It also matters deeply if the adversity you are facing is a good stressor or a bad stressor. For example, running is a good stressor. It can be a stressful activity, but afterwards your body uses that stress to come back better. A bad stressor would be getting yelled at by a boss who doesn't actually care about your well being, but is just pissed because his bottom line is being effected. More broad examples, but I think taking the time to optimize your life for good stressors that you want to do is key. It is nearly impossible to avoid all bad stressors, but we do have choice and we can think through what things am I doing because I'm being a scared, lazy, person who is taking the victim mentality and what things do I do that add good stressors to my life. Looking at this in my own life I feel a tad bit hypocritical. I want to do good and I know that sales is teaching me many valuable skills. I also feel like I'm just doing the job because it pays well and without hard skills there is not another job that would pay me this amount. I also know that my company provides incredibly generous PTO for new parents and I'd like to receive that so I can spend the first 3 months of my child's life hanging out with them. Thus, I'm honestly not sure if doing my job is a good stressor or bad stressor. Writing about it helps clarify things because it is not so easy to lie to anon on this medium compared with how it is to life to myself when I'm just doing a little thinking. The reasons I think it's a good stressor is because I know that sales skills are valuable. Not sure many people love cold calling but it's an incredible skill. I've also gotten to see how a big company operates which is valuable. Finally, I think it looks good being able to work at a place for a year and committing to an organization. Overall, everyone has been very kind and the company culture is solid. The reasons I think it can be a bad stressor is because I'm so incredibly passionate about bitcoin. I feel like I'm spending a large part of my time focused on something that does not give me a sense of urgency and drive to conquer everyday with reckless abandon. I've been telling myself that working here can teach me a lot about technology which is true, but I also know deep down I want to work on Bitcoin. I will keep taking it day by day and continue learning. If I can keep learning and growing I know I'll end up in the Bitcoin industry soon enough.\n\n8/22/22\n\nConor Jay Chepenik",
  "wordCount": 976,
  "readingTime": 3.6830188679245284,
  "claps": 0,
  "voters": 0
}