{
  "id": "a3dc4a17ccb4",
  "title": "Day 905",
  "createdAt": "2024-09-13 02:12:53",
  "tags": [
    "0",
    "1"
  ],
  "url": "https://chepenikconor.medium.com/day-905-a3dc4a17ccb4",
  "content": "# Day 905\n\n*I'm not done with this piece, but when I am I'll submit it to thecommonsensemovement.com I need to let my subconscious cook so I'll mark this up with notes.*\n\nBefore a child is born, there exists a state of zero, a void where that unique life has yet to begin. With birth, we transition to one - a new life, a new signal in the universe's vast array of data. This binary shift from 0 to 1 mirrors Claude Shannon's revelation in information theory: the world's complexity can be distilled into simple, binary choices, reducing noise to signal, chaos to order.\n\nShannon's work on information theory wasn't just about communication; it was about understanding the essence of information. Similarly, the birth of a child isn't merely a biological event but a moment where life's complexities are distilled into the purest form of existence: the presence or absence of life. This binary event brings parents closer to the divine, echoing the profound empathy of a God who chose to experience human life through Jesus Christ. Here, in the cries and laughter of a child, one might find a sacred connection, a divine signal amidst life's noise.\n\n![[https://x.com/martyrmade/status/1833172763118653767](https://x.com/martyrmade/status/1833172763118653767)](https://miro.medium.com/0*iVXSV8HjXMVp4Our)\n\nThe divine's decision to partake in human frailty, to live and die as one of us, suggests an ultimate act of empathy. But this brings us to a paradox: if God is omnipotent, why the presence of evil? Perhaps, like Shannon's bits, where the value lies in the distinction between 0 and 1, the universe operates on a principle of necessary opposites. Without evil, good loses its meaning; without darkness, light has no contrast. This duality might not be a limitation of divine power but rather an expression of its depth, where even God navigates the binary of existence. Note to self - _*Might be a good place to also discuss why an omnipotent God has to experience humanity through Jesus*_\n\nIn embracing parenthood, we partake in this divine binary. Each decision, each moment of care or neglect, reflects the binary choices that define our lives. Through our children, we experience the world anew, seeing through their eyes the wonders and the woes, the 1s and 0s of human experience.\n\nTrying to wrap one's head around the idea that everything can be reduced to 1 and 0 is a tall order. Before Claude Shannon made many of these breakthroughs in his seminal work \"[The Mathematical Theory of Communication](https://amzn.to/3zgUAeJ),\" no one predicted that you could represent just about anything with 0s and 1s. The only things we can't represent are one's soul and true love: the kind of love you feel for your child.\n\nThus, the act of having a child, of adding another '1' to the world, isn't just propagation; it's participation in the grand code of existence, where each new life offers a chance to refine our understanding, to filter out the noise, and to connect with something greater than ourselves. In this binary dance of life and information, we find not just the essence of technology or theology but the core of what it means to be human.\n\nWhat's astounding to consider is that as our information technology has advanced at unprecedented rates, we've lost something in our analog world. We've stopped innovating in many areas because we're preoccupied with the 0s and 1s flashing on our screens. It's easy to forget how amazing human interaction is when we're fixated on that next dopamine hit from social media, video games, television, and other digital distractions. In allowing information to be stripped of all noise so it can be transmitted quickly and reliably, we have ironically increased the amount of noise in the world tremendously. Thus, making major breakthroughs in physics nowhere near as common as it is in computer science.\n\nAs a result, people are having fewer children, less face-to-face interaction, and fewer positive affirmations. The internet is rife with both bots and individuals who say things online they would never dare say in person, hiding behind screens. This does not mean we should increase censorship online. Quite the contrary! We should teach people how to better handle it, how to debate in the open marketplace of ideas.\n\n![[https://x.com/BrianRoemmele/status/1833173966070198661](https://x.com/BrianRoemmele/status/1833173966070198661)](https://miro.medium.com/0*yqsCLnoeShN8X1-e)\n\nI heard a [stat today on the PBD podcast that blew my mind](https://www.youtube.com/live/B2IPoJwJzmU?si=7EPO2Y42HyYztFCU&t=1011). From ages 0–18, children in lower-class families heard 600,000 more negative affirmations than positive ones. Middle-class children heard 100,000 more negative affirmations. Upper-class children heard 100,000 more positive affirmations. While many of our words are redundant, they matter deeply. Your children's success depends on it.\n\nSo go out and do the thing. Start the business, have more children, chase your dream. Stop listening to the naysayers. The world is full of people who will give you an endless list of reasons why you can't do something. Ignore them. Note to self - _*We are all our own unique set of 0s and 1s. That's being a little trite but that's what DNA is essentially - instructions. Might be worth mentioning this at the end.*_\n\n![](https://miro.medium.com/0*ufbNXeFOFqEXWUvm)\n\n9/12/24\n\nConor Jay Chepenik",
  "wordCount": 843,
  "readingTime": 3.731132075471698,
  "claps": 0,
  "voters": 0
}