{
  "id": "a4331f9d929c",
  "title": "Day 56",
  "createdAt": "2022-05-17 21:43:31",
  "tags": [
    "comedy",
    "living-in-the-now",
    "politics",
    "value",
    "favors"
  ],
  "url": "https://chepenikconor.medium.com/day-56-a4331f9d929c",
  "content": "# Day 56\n\nTonight I have my first stand-up comedy class which I'm pretty pumped about. Comedy is the best recipe for showcasing the truth. Hard to get upset when someone says something that makes everyone else laugh even if it might be considered \"taboo\". At the end of this class, I will be asked to do a 5-minute stand-up set in front of a live audience which I am very excited about. I'm sure I'll be nervous but public speaking is an important skill and one I need to get better at doing.\n\n![](https://miro.medium.com/0*_ZnpW_12ELpStvSH.jpg)\n\nWhile I've done my fair share of clown world disrespect on here my girlfriend mentioned to me that I'm getting too political. Since I've always prided myself on never picking red or blue this one hurt to hear. Maybe she is right though, I've recently been getting red-pilled via too much time on Twitter. It's not even that I support the elephants I just find the donkey's to be the epitome of what a jackass is as they stifle free speech and screech at those who don't agree with them. My girl mentioned I need to focus on being at peace and not letting it get to me. She is right. I do myself no good by constantly obsessing over politics. I don't want to be political when I've already found my people: the orange people. No, I'm not talking about Donald Trump. I'm talking about Bitcoiners. People who understand our current system is dying and from the ashes will rise a new one based on providing value instead of favors. I'm lucky to be alive during Bitcoin's monetization and even luckier to have a based girlfriend that reminds me obsessing over politics is a fool's game. Life is short and I need to direct my efforts to focus on things I enjoy. No one can predict the future and obsess over it is a recipe for disaster. It's no easy task but I'm going to make a big push to live in the now. Try it anon. Will both be better off if we are successful! XD\n\n5/17/22\n\nConor Jay Chepenik",
  "wordCount": 359,
  "readingTime": 1.5547169811320753,
  "claps": 0,
  "voters": 0
}