{
  "id": "a51c496ac106",
  "title": "Day 195",
  "createdAt": "2022-10-04 00:13:51",
  "tags": [
    "bitcoin",
    "happiness",
    "exercise",
    "walking",
    "old-friends"
  ],
  "url": "https://chepenikconor.medium.com/day-195-a51c496ac106",
  "content": "# Day 195\n\nToday I have been thinking about how exercise, relationships, and meaningful work are the key to a good life. The first two I feel like I'm doing a good job with and the latter one I'm getting much closer to achieving. Today I decided to walk home from work because I was on the phone with my friend and didn't want to get on the T while talking to someone. The reception is not great in a subway plus I didn't want to be that guy using the phone loudly on public transportation. Ended up being the right decision because I got in some exercise and it was awesome catching up with an old friend. I'm very grateful to have played sports since I was a small child because over the course of my athletic career I've made so many great friends. I need to call up old buddies more often to check in and see what they are up to in life.\n\nI was also pleasantly surprised to see my girl rearranged the bedroom in our apartment. It looks nice. While the change doesn't bring about any meaningful difference there is something cool about switching up your place. It is refreshing in a lot of ways.\n\nRead this piece from Gigi today and it was an excellent essay. It is funny to think how money comes about naturally in an \"ecosystem\" and finally the \"ecosystem\" that is our global economy has an amazing form of money that no one can debase or manipulate. They can manipulate the people who hold bitcoin but they can not manipulate the Bitcoin network itself.\n\n> [**Bitcoin Is Digital Scarcity | dergigi.com**](https://dergigi.com/2022/10/02/bitcoin-is-digital-scarcity/)\n\nGigi bangs out some truly incredible stuff in this piece. Can not recommend enough.\n\nPretty tired from that walk home honestly but I got to enjoy a nice dinner with my girlfriend so life is good. Made hamburgers in our cast iron skillet which were delicious.\n\nGoing to wrap today's piece with some ideas for the next Podcast with my boy Carroll who I spoke to on the phone today. Topics for the pod I would like to cover include Bitcoin, life after college, entrepreneurship, finding meaning outside of work, sales, the key to happiness, why travel is so important, current events like the 2022 midterms, doom porn all over social media, and how far the U.S has strayed from the ethos of our great constitution.\n\nOh and I'd also like to remind myself that the stock market was up today despite all the doom and gloom porn over the weekend about how Monday was going to be a blood bath. I have no idea how the coming months play out but it is important to remember so many people thought it was over in 2008. They found a way to pull through and create an everything bubble. Maybe it pops or maybe they start up QE infinity. I don't know what is on the horizon but obsessing over the doom porn does me no good. What does do me good is prepping my mind and body. Forming good relationships with those I love. Stacking bitcoin, bullets, and beef. Becoming a better person, treating everyone as kindly as I possibly while also not being naïve to think everyone I come across wants to help me.\n\nJust some thoughts. I don't know what the future will look like but I know that doing the things mentioned above will likely help me embrace and navigate the future to the best of my ability.\n\n10/3/22\n\nConor Jay Chepenik",
  "wordCount": 611,
  "readingTime": 2.3056603773584907,
  "claps": 0,
  "voters": 0
}