{
  "id": "a53bf3cd45ce",
  "title": "Day 476",
  "createdAt": "2023-07-12 02:19:55",
  "tags": [
    "fasting",
    "exports",
    "food"
  ],
  "url": "https://chepenikconor.medium.com/day-476-a53bf3cd45ce",
  "content": "# Day 476\n\nDay 3/7 on my fast and I'm feeling good. Released a podcast with Texas Slim today which can be found here.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F1Sbufl4pFTF8k1B29Zqljm%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F1Sbufl4pFTF8k1B29Zqljm&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fb031f7edaed5e0b451b46929&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nBeen trying to read more as well. Currently crushing Kevin Kelly's _What Technology Wants_ and I came across this fascinating chart today as I read.\n\n![](https://miro.medium.com/1*uqPcM3opSwdPSK8_o1vFpw.jpeg)\n\nI tried to find some charts of this exact thing for more recent dates up to 2023 but had no luck finding a replica. My guess would be that the U.S has continued to increase the amount of services it exports while goods has increased but not as much. Would love to find some better data.\n\nToday I cooked a filet mignon for my partner and watched her eat it while I drink water. Man did that steak look delicious but I'm proud of myself for not craving. Feels good to make progress on this fast and tomorrow I will wake up and I'll be around half way done.\n\nOne of the things my partner mentioned is she feels like I'm fighting her about baby proofing our apartment. I need to be better about this. She is an incredible mother and I don't want her to feel like I'm ignoring her advice. She knows that baby better than me. So I'm writing this as a reminder to myself to not fight her on the baby proofing stuff. I can move my computers around as need be.\n\nAnyways, that's all the typing I got in me tonight anon. Be careful with your words. Understand they are powerful and carry great weight. I told myself I would do a seven day fast and because I've been blasting this all over social media & Youtube you can rest assured I will do this seven day fast.\n\n7/11/23\n\nConor Jay Chepenik\n\nP.S - a shame I missed my free ICEE today at 7/11 but that's alright. I've got greatness to achieve and that greatness does not involve free ICEEs😎 🤣💯",
  "wordCount": 322,
  "readingTime": 1.4150943396226414,
  "claps": 1,
  "voters": 1
}