{
  "id": "a665e61d4571",
  "title": "Day 37",
  "createdAt": "2022-04-28 23:58:44",
  "tags": [
    "fiat",
    "federal-reserve",
    "bitcoin",
    "orange-coin",
    "unpaid-shill"
  ],
  "url": "https://chepenikconor.medium.com/day-37-a665e61d4571",
  "content": "# Day 37\n\nWell had a good cold call today at work so I feel much better about my job. Need to work on being less emotionally tied to the outcome of my sales calls because that is a recipe for disaster. Takes a lot of NOs to find that yes. The product I sell seems like it could genuinely help DevOps engineers so I need to keep that in mind when I'm doing cold calls. It was also just a good day in the office. Felt like everyone was keeping it light and cracking jokes. Plus my boss's boss came and sat with me at lunch because I was sitting alone and I got to start orange pilling him. Very smart guy as far as I can tell and it was nice seeing his gears turn as I shilled him the hardest money in existence. He also was not the only coworker I tried orange pilling today. Outside of that, I had some crazy news in my personal life. Very excited about it despite the fact I should be nervous. Almost as if once you've found hard money the rest of your worries just start to fade away😂 .\n\n![](https://miro.medium.com/1*va-UaLJgRQm2sjrtLrtodw.jpeg)\n\nStole this from Fidelity and it's spot on. The orange coin is damn good anon! Do you know what seems like it isn't so good anymore? 🤣\n\n![](https://miro.medium.com/1*Lp-dyd_rS78qf0V8JeaPYw.jpeg)\n\nI love the ethos of the U.S.A and what the founding fathers envisioned. People should be able to generate wealth and prosperity for themselves and their loved ones. What I despise is human rights violations and policy that enriches the few at the expense of everyone else. I did not think the above photo was true (and maybe the #s are slightly off since we didn't have laptops and computers to take accurate measurements at this time) but after a quick internet search, it appears this photo is real. Here is an [interesting article](https://allthatsinteresting.com/buffalo-slaughter) on the topic. Did not realize bison tongue was an elegant meal, but so are bull testicles in some cultures so I shouldn't be surprised. Seems animals have eaten animals since our inception so honestly it's probably weirder that people in the United States have normalized shoving chemicals down our throats in the form of fast food. The reason I bring all this up is because when you are orange pilling people it is better to state the problem before shilling bitcoin. Same thing goes in sales. You need to show the pain before you point out the solution. Luckily, I've become an expert at disrecpeting fiat and the Fed. Pays to study anon.\n\nUntil tomorrow.\n\n4/28/22\n\nConor Jay Chepenik",
  "wordCount": 439,
  "readingTime": 2.0399371069182393,
  "claps": 0,
  "voters": 0
}