{
  "id": "a68d9d1cb6f",
  "title": "Day 6",
  "createdAt": "2022-03-28 20:50:46",
  "tags": [
    "bitcoin",
    "anons",
    "memes",
    "pepe",
    "figuring-it-out"
  ],
  "url": "https://chepenikconor.medium.com/day-6-a68d9d1cb6f",
  "content": "# Day 6\n\nConvincing people to learn why they should hold bitcoin rather than speculate on it is the same as teaching someone how to fish compared with giving them a fish. Sure the speculator and recipient of a gifted fish might be better off in the short term, but tomorrow is a new day. Having a high-time preference can have consequences.\n\n![](https://miro.medium.com/1*nFdAsw-4Ceg4WCIDk0sHCg.jpeg)\n\nI'm glad knowledge is being democratized in this information technology age. It has never been easier to look something up and get a bunch of information via the internet. The problem is too much information can be equally overwhelming. Corrupt incentives give clickbait articles much more screen time due to algorithms than \"nutritional\" content. Luckily, the people have memes to help the truth spread. A good meme gives me a gut reaction that opens my mind and helps me see through the nonsense. Humor is so easily conveyed throughout the hieroglyphic medium that is internet memes. Some days it feels like 🤡 🌍  has gone completely crazy, but memes help the critical thinkers keep their sanity.\n\n![](https://miro.medium.com/1*Nr8BDOled2NiQ-rmwzyr3Q.jpeg)\n\nMy advice anon is to focus on five things you can do every day that will bring joy. This list is prone to change, but I recommend making one. It helps, especially on the days when you want to slump on the couch, consume something you know you shouldn't, and sulk about why life sucks. My list includes creating memes, writing, exercising, reading a book, and reminding myself to enjoy the present. I've never stayed in a bad mood after doing all five things on this list. The second that changes I will tweak my list and reassess what brings me joy. I know reminding myself to enjoy the present might seem like a weird thing to put on the list. However, I've found focusing your attention on one thing is underrated. The placebo effect is real. Do what works best for you. To find that out you have to experiment and try different things. It's the beauty of this thing we call living. No one has figured out how to do it perfectly😂 . Until tomorrow kings, queens, and anons.\n\n3/28/22\n\nConor Jay Chepenik",
  "wordCount": 362,
  "readingTime": 1.7493710691823898,
  "claps": 0,
  "voters": 0
}