{
  "id": "a8769dc25b2c",
  "title": "Day 699",
  "createdAt": "2024-02-20 00:59:27",
  "tags": [
    "elon-musk",
    "delaware",
    "winner-states",
    "loser-state",
    "common-sense"
  ],
  "url": "https://chepenikconor.medium.com/day-699-a8769dc25b2c",
  "content": "# Day 699\n\nA first draft of something \"light\"\n\n**Equality Under Law: The Foundation of Order**\n\nIf people know they are in a place where the law won't be enforced they are more likely to break said law. This might be hard for the governor of California to understand yet it is evidently clear to everyday citizens, such as a Target cashier.\n\n![](https://miro.medium.com/0*Pt6mPTFOMQ491dOp)\n\n[https://x.com/ggreschler/status/1752759720363065387](https://x.com/ggreschler/status/1752759720363065387?s=46)\n\nPromoting criminal behavior stands as a profound misstep for any government. Manipulating legal frameworks to exempt genuine offenders from prosecution, coupled with proclaiming ideals of equality while concurrently advocating for preferential legal treatment based on political affiliations is an insanely flawed approach for a country's judiciary. Such actions not only undermine the foundational principles of justice but also erode public trust in the rule of law. No one with common sense wants to foster a climate where lawfulness is diminished and societal division is exacerbated.\n\n![](https://miro.medium.com/0*ugxq2XC5HF4a55EN)\n\n[https://x.com/kevinolearytv/status/1759658499733151993](https://x.com/kevinolearytv/status/1759658499733151993?s=46)\n\nRegardless of what you think about Donald Trump, seeing him get fined 100s of millions of dollars for a victimless crime is an atrocity. It's as anti American as Elon not getting the compensation package that shareholders thought was impossible but ended up being achieved.\n\n![](https://miro.medium.com/0*ulAehAhFqYAA77HN)\n\n[https://x.com/andrewrsorkin/status/1752872326536831064](https://x.com/andrewrsorkin/status/1752872326536831064?s=20)\n\nElon is not even a republican but because he believes in freedom of speech, like the US constitution grants, he is under attack. Luckily, there is hope. Kevin O'Leary correctly pointed out that there are winner states and loser states. Elon seems ready to move his businesses incorporations from a loser state to one that actually treats people equally under the law\n\n![](https://miro.medium.com/0*PvUxfY80zFdN32IX)\n\n[https://x.com/elonmusk/status/1752922071229722990](https://x.com/elonmusk/status/1752922071229722990?s=46)\n\nMoving is no easy feat so one must commend Elon for doing so with his public listed company. If judges are going to ignore common sense for blatant corruption they will find out how stupid this decision is in the long term. The American experiment is a bold endeavor in democratic governance. It has thrived, albeit imperfectly, by dispersing power and instituting checks and balances to thwart those who would seek to undermine the republic's foundations. The fact we have states that enforce the rule of law while others corrupt it is becoming more and more glaring by the day.\n\n**Learning From Those That Helped Create America**\n\nThere is a lot we can learn from the seminal works that guided the inception of the American republic. The Federalist Papers and Thomas Paine's \"Common Sense\" are two great examples. These documents, born from the revolutionary zeal for freedom, champion a system of governance that not only amplifies a multitude of voices but also enshrines the safeguarding against the tyranny of unchecked power. They advocate for a vision of democracy as a vibrant theater of competing ideas, where governance is an ongoing dialogue aimed at the common good, fundamentally anchored in the consent of the governed.\n\nCentral to this vision is the recognition that the smallest minority is the individual. The American experiment's success lay in its foundational commitment to protect individual rights, thereby ensuring that the collective thrives. This individual-centric approach fostered a society where personal liberty and responsibility were paramount, creating a fertile ground for innovation, ambition, and progress.\n\nToday's political climate, with its careerism and judicial corruption, strays from this founding vision, emphasizing the urgency to revisit these foundational texts. They remind us that democracy relies on governing with the people's consent and underscore our duty to uphold the principled governance that marked America's beginnings.\n\n**Common Sense Will Win**\n\nVote with your money. Move to states that respect private property. Call out insanity when you see it in person or on social media. Evil people want others to think it's all pointless but that is the farthest thing from the truth. America's essence was forged bya rugged group of men who valued liberty more than they valued their own lives. Let's restore the spirit of America.\"\n\n2/19/24\n\nConor Jay Chepenik",
  "wordCount": 639,
  "readingTime": 3.1113207547169814,
  "claps": 0,
  "voters": 0
}