{
  "id": "a90e2d83bf57",
  "title": "Day 628",
  "createdAt": "2023-12-11 03:25:02",
  "tags": [
    "tweets",
    "credit-cards",
    "words",
    "cash",
    "social-media"
  ],
  "url": "https://chepenikconor.medium.com/day-628-a90e2d83bf57",
  "content": "# Day 628\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1733953790598942730%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nToday I tweeted this and wanted to expand on it here because it is a good analogy. Just like a credit card, tweeting can feel deceptively easy and painless. The immediate gratification of likes and retweets can be intoxicating, much like the thrill of purchasing with a credit card. Let us use my made up colleague, Jason, to show that just like how irresponsible credit card use can lead to a mountain of debt, careless tweeting can result in reputational damage and social isolation. Jason's Twitter was a mix of harsh criticisms, controversial opinions, and impulsive remarks. Each tweet was a swipe of his digital credit card, accumulating a debt he wasn't aware of.\n\n![sup with it DALLE!!!](https://miro.medium.com/0*u8wLJzwu8TD_sGiT)\n\nIn contrast, our real-life conversations are more like cash transactions. When we speak face-to-face, we're immediately aware of our balance - our words, tone, and the immediate reactions of those around us. We measure and tailor our words, aware of their impact, much like counting cash before making a purchase. Jason, in person, was thoughtful and considerate, always ensuring he had enough 'cash' for his conversations.\n\nThe turning point came when an old tweet of Jason's resurfaced. It was a flippant, insensitive comment about a sensitive issue. This forgotten tweet was like a hidden charge on his credit statement, suddenly demanding payment with high interest. The repercussion was swift and severe - Jason lost his job. The digital debt of his past tweets, overlooked and underestimated, had finally come due. The 'interest' accrued over time in the form of public opinion and company reputation had magnified the impact.\n\nThis incident was a stark reminder of the long-term effects of our digital footprints. Unlike the immediate consequence and resolution of a cash transaction, tweets can linger and accumulate 'interest' in the form of lasting impressions and unforeseen repercussions.\n\nIn Jason's case, there was no 'savings' of goodwill or credibility to cushion the blow. His online persona, built impulsively, had not invested in the 'savings account' of thoughtful, positive communication. It highlighted the importance of building a reservoir of goodwill through consistent, considerate communication, both online and offline, which can provide a safety net in times of misjudgment.\n\nI made this story up but I'm sure most people reading this know of someone who faced negative consequences for their social media usage. I need to remind myself of this metaphor before tweeting stupid things. Sometimes I want to swipe my \"digital credit card\" super hard, but in most cases I will regret it. If you spend time on social media you are almost guaranteed to find someone being unnecessarily rude. Remember, an eye for an eye makes the whole world blind, or...\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1720516355877736520%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThere is value in treating each tweet with the same consideration as a cash payment, being mindful of one's 'balance' and the potential 'debt' they could be accruing. There is no denying it is fun to dunk on people online, especially when they make it so easy or are so confident in their incorrect opinion. However, one should remember that the words we swipe today can demand a hefty payment tomorrow.\n\n12/10/23\n\nConor Jay Chepenik",
  "wordCount": 525,
  "readingTime": 2.181132075471698,
  "claps": 5,
  "voters": 3
}