{
  "id": "a9b564fd5a7e",
  "title": "Day 919",
  "createdAt": "2024-09-27 02:52:36",
  "tags": [
    "technology"
  ],
  "url": "https://chepenikconor.medium.com/day-919-a9b564fd5a7e",
  "content": "# Day 919\n\nI got curious about the font Apple uses for their lock screen, and wow, did I go down a rabbit hole. It reminded me of when I first learned about Steve Jobs taking calligraphy classes at Reed College - an experience that shaped many of his design choices at Apple. To be fair, the man brought some remarkable innovations to life. I mean, I _do_ love the iPhone.\n\nAnyway, I stumbled upon this link, and I was blown away by how intricate Apple's design process is. It's a long read, but if you're into the details, it's fascinating.\n\n![[https://developer.apple.com/design/human-interface-guidelines/typography](https://developer.apple.com/design/human-interface-guidelines/typography)](https://miro.medium.com/1*v9CE5pzYqtEzame8sx-nVg.png)\n\n> [**Typography | Apple Developer Documentation**](https://developer.apple.com/design/human-interface-guidelines/typography)\n\n![[https://www.reddit.com/r/typography/comments/t9u0wa/today_i_discovered_apple_san_francisco_and_new/](https://www.reddit.com/r/typography/comments/t9u0wa/today_i_discovered_apple_san_francisco_and_new/)](https://miro.medium.com/1*UK5bN66MqpiQ6qM0-_Wj0g.png)\n\nThe little designs truly matter. It's very interesting to think about how seemingly small design choices can have far-reaching impacts. Take the telephone system, for example. Its early design decisions continue to shape our communication infrastructure today. The standard telephone keypad layout is a great example.\n\nThe layout of numbers on a phone keypad might seem arbitrary, but it's a design that has persisted for decades. In the 1960s, AT&T and Bell Labs conducted extensive research to determine the most efficient and user-friendly layout. They tested various arrangements, including a circular dial similar to rotary phones and a two-row layout. Ultimately, they settled on the 3x3 grid with 1–2–3 at the top - a design that won out due to its ease of use and memorability.\n\nThis layout became so ingrained in our collective consciousness that it influenced the design of early ATMs, calculators, and even modern smartphones. When the transition to touch-screen devices began, designers initially experimented with different layouts. However, the familiarity and muscle memory associated with the traditional phone keypad layout proved too strong to ignore. As a result, our smartphones today still use a design rooted in mid-20th century research, demonstrating how early decisions can echo through time and technology.\n\n![](https://miro.medium.com/1*W5LQh1Eew569FKuyKOoPxg.png)\n\nI can see glasses projecting the standard dial pad in the future just for comfort even though at this point few people remember numbers since everyone's contact is saved.\n\nBetter tech will keep winning out but legacy code lives on forever. Such is life:)\n\n9/26/24\n\nConor Jay Chepenik",
  "wordCount": 377,
  "readingTime": 1.9726415094339622,
  "claps": 0,
  "voters": 0
}