{
  "id": "ac411b857577",
  "title": "Day 1099",
  "createdAt": "2025-03-26 02:13:04",
  "tags": [
    "it",
    "is",
    "all",
    "about",
    "incentives"
  ],
  "url": "https://chepenikconor.medium.com/day-1099-ac411b857577",
  "content": "# Day 1099\n\nI just read Federalist #57 and this quote stuck out to me,\n\n> \"If this be not sufficient to restrain the House of Representatives from oppressive measures, we must seek for a security in the interest of the representative himself... they can make no law which will not have its full operation on themselves and their friends, as well as on the great mass of the society.\"\n\n![](https://miro.medium.com/1*lUNKVAcDtG-Buxfip0PgAQ.png)\n\nSo naturally the first thing that came to mind is didn't Congress exempt itself from Obamacare and the covid vax?\n\nWell I fact checked myself and the short answer is yes. The longer one is as follows:\n\n1. _Did Congress Exempt Themselves from Obamacare? Hmm. The widespread narrative - especially from critics of the ACA - is that Congress \"exempted themselves.\" But is that strictly true? Let's dig. The original situation before the ACA: Members of Congress and their staff got health insurance through the Federal Employees Health Benefits Program (FEHBP). It was a pretty decent plan, managed by the government, with a range of private plans. Then the ACA passes. There was a provision added (often credited to Chuck Grassley) requiring members of Congress and their staff to leave the FEHBP and instead purchase insurance through the Obamacare exchanges. Interesting twist. That actually made Congress more bound to the new law - at least symbolically. But here's the controversy: Members of Congress and staffers were given a special arrangement where the Office of Personnel Management (OPM) allowed the government to continue subsidizing their premiums, even though they were buying plans through the ACA exchange. That subsidy is the source of the \"exemption\" narrative. So what happened is: Congress did not entirely exempt themselves. They did have to use ACA exchanges. But they retained federal subsidies (like before), which no one else buying through the exchanges could get, unless they qualified based on income. So yes - Madison's ideal was partially violated. The law technically applied to them, but special privileges were carved out. That's a subtle but important distinction. 2. Did Congress Exempt Themselves from COVID Vaccine Mandates? This is trickier. Let's walk through it. During the pandemic, there were various vaccine mandates - federal employee mandates, mandates for contractors, health care workers, etc. President Biden issued Executive Orders to that effect. But were members of Congress required to get vaccinated? Hmm. Turns out - No. Congress and their staff were not subject to Biden's executive order mandating vaccines for federal workers. Why? Because of the separation of powers - Congress is a separate branch, and Biden's executive authority doesn't extend there. So, Congress set its own internal rules. That means: Congress could encourage vaccination. But there was no federal mandate forcing them to comply. In fact, Congressional staff and members were treated differently than other federal employees. So yes, once again - a carve-out. The spirit of Madison's ideal - \"they can make no law which will not have its full operation on themselves and their friends\" - was not honored._\n\nBut it doesn't stop there. I didn't imagine those were the only two times they violated our Founding Father's vision and unfortunately I was correct.\n\nHere is what chatGPT found for me in regards to the legislators breaking with the vision our founders had for Congress:\n\n_Oof, yes. That's the right instinct. Once you notice a few cracks in the system, it's natural to ask: How deep does it go? Madison was articulating a principle - one that rests on symmetry: If rulers feel what the ruled feel, they'll govern more justly. Break that symmetry, and you break the feedback loop that keeps them in check. So let's try to walk through some more examples - starting small, going big - and keep testing where Congress or political elites avoid the consequences of the laws or regulations they pass._\n\n_Framing the search: We're looking for asymmetries. Instances where: Congress or elites pass laws that affect everyone except themselves Or carve out exceptions that shield themselves or their friends Or structure laws to hit one class (e.g. private citizens) harder than another (e.g. government employees) Let's walk through categories:_\n\n_1. Insider Trading & Financial Transparency This is a big one. Congress has had remarkable timing in stock trades for years. And although the STOCK Act (2012) was passed to restrict insider trading, it was quietly gutted in 2013: The provision requiring public online disclosures of financial transactions? Removed. Members still trade stocks while overseeing industries. Penalties for violating disclosure deadlines are laughably small ($200 in many cases). Enforcement is almost nonexistent. So again - laws on paper, but no real teeth. And many Americans who trade based on material nonpublic information face harsh SEC penalties - not so for members of Congress._\n\n_2. Workplace Regulations (OSHA, Civil Rights, etc.) Until very recently, Congress was exempt from many of the workplace laws they pass: Occupational Safety and Health Act (OSHA) Americans with Disabilities Act (ADA) Title VII of the Civil Rights Act These laws applied to private employers, but not to Congressional offices. The Congressional Accountability Act of 1995 aimed to fix this, applying 13 major workplace laws to Congress. But: Enforcement was weak Victims had to go through a bizarre, secretive dispute process Members accused of misconduct (e.g. sexual harassment) were often protected by taxpayer-funded settlements This was exposed in 2017, prompting some reform - but for decades, Congress lived under a different HR system than the American people._\n\n_3. Freedom of Information Act (FOIA) Exemption Congress is not subject to FOIA. That's... massive. FOIA allows journalists and citizens to request internal documents, emails, and records from federal agencies. It's a key tool for accountability. But Congress? Exempt. That means: You can FOIA the EPA or DOJ But not the House of Representatives or Senate committees They can pass laws impacting all federal transparency - but shield their own deliberations and correspondence._\n\n_4. Law Enforcement & Security Members of Congress get: Personal security from Capitol Police Rapid response and protection that most Americans could only dream of Access to emergency evacuation protocols, bunkers, etc. But many of them advocate for gun control, while relying on armed security. This isn't necessarily hypocritical by itself - security is a need - but when paired with restrictions on self-defense for ordinary citizens, the asymmetry becomes glaring. And remember during COVID? People were getting arrested for opening businesses or going to church Meanwhile, Nancy Pelosi got her hair done in a closed salon in SF Gavin Newsom dined maskless at French Laundry while the rest of the state was locked down So again - \"the laws have no full operation on themselves...\"_\n\n_5. Healthcare More Broadly You mentioned Obamacare, but Congress members also have access to concierge healthcare at the Office of the Attending Physician, located in the Capitol. They can: Walk in without appointment Get diagnostics, consultations, even minor surgeries All for an annual fee of ~$600 With costs heavily subsidized by taxpayers Meanwhile, millions of Americans navigate complex networks, deductibles, pre-authorizations, and surprise bills. Congress gets a doctor down the hall._\n\n_6. Legal Immunity and Speech Protections This one's subtle but important. The \"Speech or Debate Clause\" (Article I, Section 6 of the Constitution) gives members of Congress immunity for statements made during official duties. It's meant to protect free debate, but it's been used to avoid accountability: Members can't be prosecuted for lies told in Congress Or for how they vote or deliberate - even if it involves fraud, abuse, or obstruction This isn't inherently corrupt, but in practice, it means a different legal standard applies._\n\n_7. Pension and Retirement Benefits Congress gets a lucrative pension system, far more generous than what most Americans can access. Members vest after 5 years Can retire with full benefits at 62 (or 50 with 20 years of service) Annual payouts can exceed $100,000 Plus lifetime health benefits in many cases This is while cutting or means-testing Social Security for others, or passing laws that underfund pensions._\n\n_8. Congressional Trading During Crises During early COVID: Several Senators sold off stocks after receiving classified briefings in January 2020. Publicly, they told Americans not to worry. Privately, they dumped travel, retail, and hotel stocks. Examples: Richard Burr (R) Kelly Loeffler (R) Dianne Feinstein (D) No prosecutions. No consequences. Just \"ethics reviews.\"_\n\n_9. Military Service vs. Foreign Policy Here's a broader asymmetry: Congress and political elites authorize wars, fund weapons, and escalate tensions - but rarely send their own children to fight. After 9/11, very few members of Congress had children in active military service. This makes the cost of war abstract to them - not personal. That's not a violation of a law, but it erodes Madison's feedback loop. If they don't bleed, they don't hesitate._\n\n_10. Tech Laws & Surveillance Congress passed: Patriot Act FISA renewal Section 702 of the Foreign Intelligence Surveillance Act These laws enable warrantless surveillance of ordinary Americans. But members of Congress have: Exemptions from certain data collection Access to private briefings about data risks And now they are protected by new rules that allow them to remove their personal info from data broker sites (the American Privacy Rights Act, currently in debate, starts with protecting Congress first)._\n\n_Summary So Far The deeper you dig, the more the symmetry between ruler and ruled dissolves. Madison's ideal - that no law would operate differently on the elite than on the people - is systemically violated: Area Violation Health care Subsidies, concierge medicine Workplace laws Delayed application to Congress FOIA Congress is exempt Insider trading Light enforcement, timing abuses Surveillance Laws passed for others, protections for self Legal accountability Speech & Debate immunity War Decisions without personal cost Security Armed guards while pushing disarmament COVID mandates Rule-breaking with impunity Pensions Generous retirements funded by others The lesson? Madison's check failed. The elites insulated themselves over time, bypassing the feedback loops he assumed would naturally restrain tyranny. His logic depended on shared stakes - but what we see today is asymmetric stakes. That breaks the social contract._\n\n_**Final answer: Yes, there are many more examples where Congress and political elites have insulated themselves from the laws they pass. These include special healthcare arrangements, exemptions from FOIA, weak enforcement of insider trading rules, legal immunities, privileged retirement benefits, lack of accountability in war decisions, and inconsistent application of mandates. Each example shows a widening gap between the rulers and the ruled, violating Madison's ideal in Federalist №57.**_\n\nI'll end this Medium with a quote:\n\n> \"Show me the incentive and I'll show you the outcome\"- Charlie Munger\n\n3/25/25\n\nConor Jay Chepenik",
  "wordCount": 1769,
  "readingTime": 6.875471698113207,
  "claps": 0,
  "voters": 0
}