{
  "id": "ac547b2c4091",
  "title": "Day 306",
  "createdAt": "2023-01-23 03:39:12",
  "tags": [
    "bitcoin",
    "debt-defaults"
  ],
  "url": "https://chepenikconor.medium.com/day-306-ac547b2c4091",
  "content": "# Day 306\n\nLot of craziness going on in the world so I decided that I would write another Bitcoin Magazine article. This one is I'm still working out but hopefully some people can find value in it.\n\n**Picking A Ponzi Scheme**\n\nAs Congress debates about whether or not it should raise the debt ceiling for the [23rd time since 1997](https://www.cnbc.com/2023/01/19/yellen-says-treasury-is-taking-extraordinary-measures-to-avoid-default-as-us-hits-debt-limit.html) it's important to hear what the United States Treasury Secretary has to say.\n\n\"Since 1789, the U.S. has always paid all of its bills. The knowledge that we can be trusted and counted on to do that underlies the foundations of the entire global financial system. Default would cause widespread damage to the U.S. economy.\" - [Janet Yellen on Twitter](https://twitter.com/SecYellen/status/1616869486627266560?s=20&t=OLUieS89hp1bnp9cLpikxw)\n\nI'm not surprised that Janet Yellen wants to ignore the fact that the U.S has actually defaulted on its [debt five times](https://twitter.com/bitcoinpierre/status/1616983945916071937?s=12). To declare otherwise would undermine her claim that US Treasury Securities are the safest investment on the planet. If the U.S Treasury was truly the safest investment on the planet we would not need to raise the debt ceiling. Depending on your definition of default, maybe these five instances don't qualify as a true debt default. I will quickly articulate what happened in 1792, 1834, 1862, 1933, and 1971 so the reader can decide for themselves.\n\n[The panic of 1792](https://globalfinancialdata.com/the-panic-of-1792) was the first financial crisis in the United States, which occurred in Philadelphia. It was caused by a speculative bubble in the bank scrip of the Bank of the United States, which was chartered by Alexander Hamilton as the first Secretary of the Treasury. The government intervened to save the markets, but the panic led to a decline in the value of the debt, which hurt the country's credit rating and caused widespread financial instability, with many banks and businesses failing.\n\n[The Coinage Act of 1834](https://en.wikipedia.org/wiki/Coinage_Act_of_1834), signed by Andrew Jackson, defined the weight of coins and allowed the Treasury Department to pay the full amount of gold deposited at the mint within 5 days. This led to the undervaluation of silver and its near disappearance from circulation. Jackson, along with members of Congress, attempted to replace paper currency with \"hard-money\" (gold and silver) despite the existence of over a thousand banks issuing their own notes. The Act was part of a contentious political battle over the fate of the United States Bank, with Jackson believing that the bank would be manipulated by powerful financiers to exploit the nation's financial system and arguing that the Constitution did not give Congress the power to charter a corporation that could operate outside the District of Columbia.\n\nThe United States defaulted on its debt [in 1862](https://www.treasurydirect.gov/kids/history/history.htm) by passing The Legal Tender Act of 1862, also known as the \"Greenback Law\". It was passed by Congress during the Civil War in order to finance the war effort. The act authorized the issuance of paper money, known as \"greenbacks,\" which were not backed by gold or silver, but were considered legal tender for all debts, public and private. This meant that the government could pay its debts, including bonds and interest, with these greenbacks. Naturally this caused inflation, and the value of the greenbacks fell in relation to gold and silver. The Legal Tender Act of 1862 effectively defaulted on the government's promise to pay its debt in gold and silver, as the greenbacks were not worth the same value as the gold and silver that the government had originally promised to pay. This default led to a significant loss of value for bondholders and other creditors who had lent money to the government. As one can imagine the Act was met with strong opposition from bondholders and other creditors. The same play book was applied in 1933 and 1971.\n\n[In 1933](https://www.cato.org/cato-journal/fall-2018/american-default-untold-story-fdr-supreme-court-battle-over-gold-sebastian), the United States government defaulted on its debt by devaluing the dollar and outlawing the ownership of gold for its citizens. This was done as part of President Franklin D. Roosevelt's New Deal policies to combat the Great Depression and stabilize the economy. Again, the default was met with opposition from bondholders and other creditors, who felt that the government had reneged on its promise to pay its debt in a stable currency, but it was considered necessary to address the economic crisis according to those in power. It doesn't take a Nobel prize winning economist to see that the default again led to a loss of value for bondholders and other creditors who had lent money to the government, as they were paid with currency that was worth less than what they had originally lent.\n\nFinally [in 1971](https://wtfhappenedin1971.com/), the United States defaulted on its debt in a different way, when President Nixon suspended the convertibility of the US dollar into gold, effectively defaulting on the promise the United State made to all other nations at Bretton Woods to redeem dollars for gold at a fixed rate. All done in the name of combating inflation and stabilizing the economy from the \"greedy foreign forex speculators\". 52 years later and the U.S is staring down the barrel of another major financial problem. Governments and businesses are clearly different types of organizations, but both are run by individuals. If you saw a CEO claiming the solution to his insolvent business was to raise more debt would you invest? Especially if said CEO was claiming he had to raise more money in order to make sure they can pay their original debts? Sounds a bit like a ponzi scheme to me.\n\n![](https://miro.medium.com/0*rl2qAe2lbmXPIozk)\n\nIt's all so tiresome. People in charge will manipulate the truth to fit whatever agenda is beneficial to them. The only reason the United States is not considered insolvent is because we have the ability to create money out of thin air with the Treasury and Federal Reserve. With a situation so dire you would think there would be more political will to either limit spending or increase the amount of revenue coming in. Unfortunately, campaigning on cutting spending or raising taxes doesn't get people elected. Many think if their side gets in they can fix these problems but the reality is neither side, Democrat or Republican, will fix the problem.\n\n![](https://miro.medium.com/0*L6B81h3JUaUI8odP)\n\nThe uniparty wants you to fight with the opposing side while they enjoy the cantillon effect for themselves. Thus, the solutions floated by the majority of our elected leaders amount to either raising the debt ceiling, or printing a trillion dollar coin. If it makes you feel better the trillion dollar coin would be platinum so at least, in a way, it's a return to hard money.\n\n![](https://miro.medium.com/0*H_OFIx3BeC_TDmJY)\n\nJokes aside, if we are at the point where using a trillion dollar platinum coin to pay our bills is considered a legitimate proposal it makes me wonder how arbitrary the rules and metrics we use to measure things are. Take pensions for example, a retirement savings plan that provides a regular income to an individual during their retirement years, usually provided by an employer or government. What initially seems like a sound idea to reward savers has been turned into a tool of leverage for governments. In 2023, there are protests in France because central planners are raising the retirement age by two years. According to this [article from the A.P](https://apnews.com/article/france-retirement-age-limit-protests-866eb86aea5cf0d39894b96d2888c26f) \"Macron acknowledged the public discontent but said that 'we must do that reform' to 'save' French pensions. 'We will do it with respect, in a spirit of dialogue but also determination and responsibility' he added.\" Doesn't seem very respectful to force people to work longer if the initial agreement said otherwise. To be fair, everyone receives a state pension in France according to the article. That doesn't fix the fact that people are saving their own money in a pension that has become insolvent due to poor choices made by central planners and the solution to fix this insolvency is to make people work an extra two years. That money should not be a tool for the state to leverage their power over the individual, especially if the individual has paid into it.\n\n![](https://miro.medium.com/0*dXzz7dfxbe4JKlA_)\n\nAnother arbitrary metric in my opinion is Gross Domestic Product (GDP). Economists use GDP to measure the total economic output of a country and assess the overall health and growth of an economy. GDP does not measure the quality of life, such as happiness, health, or social connections which are nearly impossible to accurately measure anyways. There are central planners who think if they could install a central bank digital currency so the government could be at the center of every transaction this would fix many of these issues. However, the informal economy of goods and services that are not reported and taxed as well as the black market will not be stopped with a CBDC. People will find ways to either barter or trade with a different medium of exchange. There is a reason cigarettes are often used as money in jail. Another thing GDP can not measure is the human capital, or the knowledge, skills, and abilities of the population. In Western countries we love to talk about democracy, but we have no tools to measure the social capital, the trust, cooperation, or civic engagement of a society. GDP is surely not factoring in any of these things. Finally, GDP does not measure the natural capital, the natural resources, and the ecosystem services of a country. I imagine this last part is very important because if these things were measured it would be much more difficult for the IMF & World Bank to continue their grift of extracting resources from less developed countries via [debt slavery](https://bitcoinmagazine.com/culture/imf-world-bank-repress-poor-countries).\n\nThere are other metrics such as the Human Development Index (HDI) and the Genuine Progress Indicator (GPI) which aim to provide a more comprehensive measure of a society's well-being by taking into account factors such as education, health, and environmental sustainability. However, these metrics are have their limitations and may not capture all aspects of a society or economy. Plus, they aren't used like GDP to determine if we are in the boom or bust part of a Keynesian economic cycle.\n\nThe use of GDP as the sole indicator of a country's economic and societal well-being is inadequate and fails to capture the complexity and diversity of a society or economy. It is important for decision-makers to consider a variety of indicators when assessing the overall health and growth of a country, and to recognize the limitations of each metric. With the advancement of Artificial Intelligence, it may become possible to use multiple indicators in conjunction with one another to gain a more comprehensive understanding of a society or economy. However, it is also important to be aware that this increased sophistication in data analysis may also lead to manipulation of the data to present a falsely positive image. Therefore, it is important to approach these metrics with caution and to consider their potential biases and limitations. The tweet below articulates why more sophisticated modeling doesn't necessarily mean better outcomes for everyone.\n\n![](https://miro.medium.com/0*U6f8VJpl7HwKHp5K)\n\nInflation is theft. Defaulting on promises to pay someone back in the initially agreed upon medium of exchange is theft. Quantitative easing is theft. The proof of work required to fully understand, use, and save in bitcoin is not easy. However, the idea is simple. There are 21 million coins that no one can create more of. The money society uses today is a ponzi scheme. The only way it works is if the Treasury can borrow more to make sure it doesn't default on its initial obligations. There is an argument to be made that Bitcoin is also a ponzi scheme. My question is do you want to save your life's energy in the ponzi scheme that is infinite like fiat currency or something that is capped at 21 million like Bitcoin. The choice is yours: debt slavery or self-sovereignty, ignorance or truth, green pill or orange pill. What's it going to be anon?\n\n![](https://miro.medium.com/0*EecY_na3JR2JGCRs)\n\nGoing to wait until tomorrow to actually submit so I can give it one more read through when I'm not tired from a full day of raising a newborn, writing, and running. That said, I'm pretty proud of pulling this one together, feels good to write!\n\n1/22/23\n\nConor Jay Chepenik",
  "wordCount": 2039,
  "readingTime": 8.644339622641509,
  "claps": 3,
  "voters": 2
}