{
  "id": "ac76938c90da",
  "title": "Day 135",
  "createdAt": "2022-08-05 01:46:20",
  "tags": [
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-135-ac76938c90da",
  "content": "# Day 135\n\nGot to go boating around the Boston Harbour today for a week event. Pretty badass getting to enjoy the company of my colleagues as we cruised around in a electric boat. Pretty cool business honestly. [https://www.electricboatsboston.com/](https://www.electricboatsboston.com/)\n\n![](https://miro.medium.com/1*LziFOXHz_nFIJkzKcH_7JA.png)\n\nShout out my manager Kevin for thinking through the idea. One of the homies on the team was recommending tail ship but this was honestly was more fun. It is always great getting to chat with coworkers outside of the work environment. Don't get me wrong I really like all my coworkers but there is a certain level of stress when you are trying to hit quota and in an office setting.\n\nDrank way more than I should've on a Thursday but overall a 10/10 day. After throwing back some espresso martinis in southie the squad went across the street in the north end to get some more drinks at a downstairs basement. I got a pistachio martini which didn't have any ingredients that tasted like pistachio but the drank tasted like pistachio. I was surprised. One of the ingredients was an almond liquor but the drink actually tasted like pistachio. I was impressed.\n\nAnyways, not a very insightful post. Just interesting to see how nice it is to interact with humans when you are not dealing with each other in a work environment. Felt so good to just crack jokes and breath in a much smaller setting. Even told my coworkers I was having a kid and one joked about teaching my child basketball lessons. I'm honestly so lucky and while I will always preach the kid word of Bitcoin I need to remember I have it pretty good and just because the Bitcoin twitter rabbit hole exposes 🤡 🌍  on my feed doesn't mean I should let that shit effect me.\n\nLife is precious man. I'm lucky to be leading the one I am and tonight is a great reminder I'm so lucky for everything I have.\n\n8/4/22\n\nConor Jay Chepenik",
  "wordCount": 331,
  "readingTime": 1.4490566037735848,
  "claps": 0,
  "voters": 0
}