{
  "id": "acea4e2cae32",
  "title": "Day 417",
  "createdAt": "2023-05-13 20:50:27",
  "tags": [
    "web-development",
    "personal-web-store",
    "bitcoin",
    "nostr",
    "github"
  ],
  "url": "https://chepenikconor.medium.com/day-417-acea4e2cae32",
  "content": "# Day 417\n\nToday I decided to spin up a Webstore so people could purchase a personal website built by me. The process was so simple. Shout out [Super Testnet](https://twitter.com/super_testnet) for developing [magicwebstore.xyz](https://magicwebstore.xyz/onboard.html).\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1657484414274740226%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAllowing people to offer their goods and services online this easily means entrepreneurs can provide value in a much more seamless manner. All the tools being developed right now have me so bullish for the future.\n\nIn the same way I write something on this Medium everyday I'd like to start pushing at least one thing to github everyday. Today I pushed up some edits on my personal website conorchepenik.com to include a link to my online store. No clue if this 100 is a good price target but I think that 100 dollars is a fair price for my dev services and 30 minutes of my time to show someone how to get their own personal website hosted. In fairness someone could just fork my github code and do it themselves. However, many are not familiar with github and code editors so they can pay me to help them create a website. If no one purchases then maybe I'll lower my prices. Ahhhhh I'm free market teeeeeestiing!\n\nFeels good. By the way I was motivated to start committing everyday after seeing Gigi's github page.\n\n![](https://miro.medium.com/1*S42jyRpCH2lR6_HaBqeEUA.png)\n\nWhat a freaking savage. My guy likes pushing code!\n\nThat's all for today. Feels good getting something spun up and taking steps to provide other's value. It ain't easy providing value, but as they say... you miss 100% of the shots you don't take.\n\n![](https://miro.medium.com/0*dzPBkLwWOYdz1UA0)\n\n5/13/23\n\nConor Jay Chepenik",
  "wordCount": 265,
  "readingTime": 1.3833333333333333,
  "claps": 0,
  "voters": 0
}