{
  "id": "acec4d83818e",
  "title": "Day 638",
  "createdAt": "2023-12-21 03:33:07",
  "tags": [
    "writing",
    "anger",
    "ai",
    "muscles",
    "skill"
  ],
  "url": "https://chepenikconor.medium.com/day-638-acec4d83818e",
  "content": "# Day 638\n\nIn our haste to categorize emotions, we often overlook the nuanced value of anger. Life, in all its complexity, rarely adheres to strict dichotomies of good or bad. Anger, harnessed correctly, can be a powerful catalyst for personal growth and positive change.\n\nConsider anger as a dual-edged sword. Uncontrolled, it has the potential to wreak havoc. When directed with purpose it can forge pathways to remarkable achievements. The key lies in its application. Channeling anger's potent energy towards constructive ends can transform our lives.\n\nFor instance, imagine using the fiery intensity of anger to fuel your aspirations, pushing you beyond perceived limits. This is the essence of embracing anger for greatness. Making a deliberate choice to convert a potentially destructive force into a force for positive momentum.\n\nThink of managing anger like working out a special kind of muscle in your mind. Just like how writing regularly can make you better at expressing yourself, learning to control your anger is like training your emotional smarts. It's like this: even though you can't see these 'muscles' like the ones in your arms, they're still real in their own way. Our brains, which do a lot of heavy lifting thinking and feeling, use up a lot of energy. So, in that sense, practicing how to handle anger really is like giving your brain a good workout.\n\nThis analogy extends to human interaction with AI technologies. Of course writing every day makes me better at it, but when I lean too much on ChatGPT it weakens my writing muscle. Sure it helps me edit and polish my work. The problem is it also makes it so I am not exercising that natural ability to come up with creative stuff on my own.\n\nIt feels more like I am an editor when using AI. I give the model a weak draft and then take the great parts it gives me back. It's important to find the right mix of using these cool tech tools and relying on my own skills. I'm still learning how to figure out that balance. This balance is something I think about a lot, especially because I want my kid to grow up knowing how to use these tools wisely, without losing their own ability to think and create independently.\n\nIn the same way we need to use anger in a smart, positive way, we should use AI carefully to improve our thinking abilities, but not so much that we can't do things on our own. Being aware of this balance and managing it well is really important for us to keep growing and adapting in a world where technology is everywhere.\n\n![](https://miro.medium.com/0*rijJ01P3yfMz36iU)\n\n12/20/23\n\nConor Jay Chepenik",
  "wordCount": 449,
  "readingTime": 1.8943396226415095,
  "claps": 2,
  "voters": 1
}