{
  "id": "ad4b6bf543ed",
  "title": "Day 368",
  "createdAt": "2023-03-26 02:26:42",
  "tags": [
    "ai",
    "real-estate",
    "commercial-real-estate",
    "future",
    "change"
  ],
  "url": "https://chepenikconor.medium.com/day-368-ad4b6bf543ed",
  "content": "# Day 368\n\nIt's hard to estimate how much the world will change in ten years when technology is changing at an exponential rate. I'm no commercial real estate guru but it is amazing to read this article and realize that the only certain thing is uncertainty.\n\n> [**Commercial Real Estate Faces Perfect Storm: The Demise Of Downtown Office Buildings**](https://www.zerohedge.com/personal-finance/commercial-real-estate-faces-perfect-storm-demise-downtown-office-buildings)\n\nFrom what I can gather the commercial real estate industry is entering a perfect storm that has never been seen on a systemic level. The world has changed, and commercial real estate is a secular change coinciding with a cyclical downturn. Staying nimble, staying flexible, and constantly assessing beliefs is important in a world where technology is improving at a rate humans are bad at understanding. Embrace this and adapt to the changes so you can ensure survival and success in the future.\n\nTo paraphrase from the article above, locating banks and brokers closely together made sense in the past, as there were no internet, email, cellphones, or video conferencing. Relevant executives would meet in one of their boardrooms to discuss a new equity or bond issue. Nowadays, technology has changed everything. Office spaces remain half-empty due to the lockdowns of 2020. Now that most people have tasted what working from home is like it's doubtful we will ever go back to the way it what is. I'm not saying offices will be a thing of the past, but the past few years have made clear many jobs can be done remotely using video conferencing, email, and all the tools in between. Office space is expensive and as companies look to cut costs because of a looming recession more will decide to forego a big office and hire remote workers.\n\nIn the past, Detroit was known as the Motor City and was the hub of the American automobile industry. However, as car manufacturing jobs started moving overseas to countries with lower labor costs, the economy of Detroit took a major hit. The loss of these jobs had a ripple effect, leading to the decline of the entire city's economy.\n\nSimilarly, with the rise of remote work and the ability to work from anywhere, big cities may no longer be the only place for companies to establish their headquarters. This could lead to a shift in the job market away from big cities, resulting in a decline in their economies. Just as the loss of car manufacturing jobs impacted Detroit, the loss of high-paying office jobs in big cities could have a similar effect.\n\nThe article above pointed out that commercial real estate has been a cash cow for the landlord and banks who lent them money to buy the commercial real estate. Now it seems there could be a ton of negative equity for these landlords. Negative equity means that you owe more money on something, like a house or a car, than it is worth. For example, if you owe $10,000 on a car that is only worth $5,000, you have negative equity of $5,000. This can happen if you borrowed too much money to buy the thing or if the value of the thing went down after you bought it. Negative equity is a problem because if you need to sell the thing, you won't get enough money to pay off your loan. Negative equity means bankruptcy in almost every case. Unless you have a sentimental attachment to the thing which you have negative equity in, paying off that loan no longer makes a lot of sense. The ripple effects of negative equity can be devastating for those who hold commercial real estate portfolios. If investors are unable to make their loan payments or if they are forced to sell their properties at a loss, it can result in significant losses to their portfolios. Additionally, if one investor is forced to sell at a loss, it can create a domino effect, causing other investors to panic and sell their properties as well, further driving down prices and creating even more losses.\n\nAs far as I can tell there will be many different types of debt spirals in the coming years. I don't want to be left holding the bag. Bitcoin seems like the best alternative to all this mayhem, but I must continue to assess and challenge my beliefs. If I've learned anything from this article it's that things can change rapidly. No one knew what all the effects of shutting down a global economy. Some people had a general idea it would be bad, but the powers that be went ahead and did it anyway. I think for a world with exponentially increasing technology we should remain optimistic, but also constantly question what we believe and why we believe it.\n\n> [**A Message from 2035!**](https://www.jeffbooth.ca/post/a-message-from-2035)\n\nThings are going to get both weird and exciting in this next AI revolution. Tread carefully and enjoy the ride anon.\n\n![](https://miro.medium.com/1*Nm_uJVymtUlqHBN1X8TURg.png)\n\n3/25/23\n\nConor Jay Chepenik",
  "wordCount": 865,
  "readingTime": 3.4641509433962265,
  "claps": 4,
  "voters": 1
}