{
  "id": "ae80559e7318",
  "title": "Day 210",
  "createdAt": "2022-10-19 01:26:01",
  "tags": [
    "psyops"
  ],
  "url": "https://chepenikconor.medium.com/day-210-ae80559e7318",
  "content": "# Day 210\n\nI received the [book](https://www.amazon.com/Mastering-Bitcoin-Programming-Open-Blockchain-ebook/dp/B071K7FCD4/ref=sr_1_fkmr2_1?crid=D97Z5T7JZD8Q&keywords=progaming+bitcoin+andreas&qid=1666130194&qu=eyJxc2MiOiIwLjY1IiwicXNhIjoiMC4wMCIsInFzcCI6IjAuMDAifQ%3D%3D&sprefix=progaming+bitcoin+andreas%2Caps%2C82&sr=8-1-fkmr2) Mastering Bitcoin today and it brings a warm tingly feeling to my heart reading up on how far Bitcoin has come from the time since Andreas wrote this masterpiece. The first chapter was full of things I knew, but I still learned a lot going back to the basics. It was also funny to read up on the \"how to get some Bitcoin section\" because for people in the U.S it's hard to miss all the crypto exchanges being advertised to us online, in cities, and everywhere else we look. I like the idea of people sending KYC free sats to their friends for cash. I guess not completely KYC because the seller likely got that 🌽  on an exchange, but for the receiver it is KYC free unless someone wrench attacks them. However, it would be pretty wild to wrench attack someone and force them to reveal their sources if they bought like 100 bucks of bitcoin. If enough people can do this and create a circular economy it becomes quite hard for the government to do a massive wrench attack so that is my hope. We want to force the government to cooperate with the people rather than coerce them with violence.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/xbtgbh/status/1582535957240500224&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThought this was fitting tweet to put because it's kind of true. Absolutely wild the person speaking out against all the BS is Kanye. Good for him man. Glad someone with a shit-ton of money out there is not getting his checks cut from global parasites. I'm not sure what to think of Elon. He seems to also be in this camp but it's hard to tell. Maybe all these camps are more decentralized then any of us truly realize.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/techamazing/status/1582147866751291392&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThis video points out the algorithm for TikTok in \"The West\" shows videos full of dumb stuff while the algorithm in China shows positive stuff that gives people hope. The United States and the rest of \"The West\" is on a dangerous path if we don't start promoting better things. I'm not sure what the exact differences are in the algorithm of TikTok in China vs the U.S.A but now I want to get a VPN and set my location to China so I can check it out.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/drandelson/status/1581729180055924737&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI sent my buddy that Kanye video and he sent me back this. Which makes me not so sure Kanye is speaking out against the machine. Who knows. Psy-ops, Psy-ops everywhere. Whatever the truth may be these tweets about Kanye serve as a great reminder that everyone has an agenda and taking stuff with a grain of salt is important. Also that incentives are key. Stole that from my buddy who put me on this tweet about Kanye maybe not being controlled opposition. Luckily the bird app is an American company so we don't have to worry about the algorithm being different (then again) China doesn't even allow Twitter in China I'm pretty sure plus who knows what else Twitter is pulling.\n\n🤔\n\n10/18/22\n\nConor Jay Chepenik",
  "wordCount": 508,
  "readingTime": 1.9169811320754717,
  "claps": 0,
  "voters": 0
}