{
  "id": "aeb6a97193de",
  "title": "Day 940",
  "createdAt": "2024-10-18 00:08:51",
  "tags": [
    "the-space"
  ],
  "url": "https://chepenikconor.medium.com/day-940-aeb6a97193de",
  "content": "# Day 940\n\n**Denver's New Bitcoin Citadel \"The Space\"**\n\nDenver's, [The Space](https://denver.space/), is one of the latest Bitcoin Citadels popping up in the United States. The team is looking to improve and redefine what it means to be part of a Bitcoin community in Colorado. This member-run hub is not just a co-working space; it's a thriving ecosystem focused on collaboration, education, and networking for those passionate about Bitcoin and the principles it stands for.\n\n![](https://miro.medium.com/1*nR8XxTkQ0wIeXRUbEeOYZA.png)\n\nThe inception of The Space is a story of organic growth and community spirit. It all began with Denver's BitDevs meetups, which saw a surge in attendance and enthusiasm.\n\nEric, one of the founding members, recalls, \"Our BitDevs started to grow, and we thought, why don't we have our own space? We didn't want it to be something owned by investors or an organization. We wanted it to be community-based, not really owned by anybody.\"\n\nTyler, now the general manager, adds, \"We had a recurring turnout that was strong at our BitDevs Meetup. We thought, how can we do it differently - be not owned by a company or some guys with more capital than us?\"\n\nWhat sets The Space apart is its commitment to being genuinely community-driven. The founders structured it as a nonprofit, emphasizing transparency and collective ownership. \"We gave a lot of motivational talks and got members to start paying for membership upfront,\" Eric explains. \"We organized a board through elections. Nobody really owns it; it's just a community-based organization.\"\n\nThe board consists of nine members, each with specific responsibilities ranging from operations to marketing. Tyler elaborates, \"We really put a lot of thought into how we could structure it. We want it to live on without us, whether we're all fired in a couple of months or not.\"\n\nWyatt, the Chief Marketing Officer, highlights the serendipitous journey. \"We had gotten the social club aspect going and started to build a treasury through membership. Then, a wealthy individual visited from Nashville and was impressed with what we were doing. He secured a building, which catapulted us into the likes of a [Bitcoin Park](https://bitcoinpark.com/) or [Bitcoin Commons](https://www.bitcoincommons.com/).\"\n\n![](https://miro.medium.com/1*MlIM5ONAVQ7kQZ_YEVL7fw.png)\n\nThe Space offers more than just flexible workspaces and amenities like conference rooms and lounges. It serves as a hub for education and innovation in the Bitcoin space. With a robust calendar of events, workshops, and social gatherings, there's something for everyone - from the highly technical BitDevs meetups to more casual Bitcoin and beer evenings.\n\n\"We're planning to have educational events, workshops, and even Bitcoin-adjacent topics like self-sovereign tech stacks,\" Tyler mentions. \"One of our board members is [Jason Wrich of Wrich Ranches](https://www.wrichranches.com/about), co-founder of the Beef Initiative. We're planning to have his beef for sale on-site for Bitcoin.\"\n\nThe Space also aims to be inclusive and welcoming. \"We have an educational committee,\" Wyatt says. \"Growing Bitcoin adoption is at the core of what we're trying to do with our events. We're working on getting a 'Women in Bitcoin' event up and running.\"\n\nTrue to Bitcoin's ethos of decentralization and self-sovereignty, The Space operates its own tech stack. \"We run everything in-house as often as we can,\" Tyler states. \"We have our own server, so all of our members can have some usage on it. They can treat it almost like a Google Cloud or an iCloud where they actually know where the computer is because the cloud is just someone else's computer at the end of the day.\"\n\nThis commitment extends to their operations. \"Our newsletter runs right through our server,\" Tyler continues. \"Nothing we write ever goes through Big Tech. We use open-source software and avoid platforms like Amazon, Microsoft, and Google.\"\n\nLaunching The Space was not without its hurdles. Securing a building without traditional capital was a significant challenge. \"Every building owner wants 12 months' rent in dollars in your bank account,\" Tyler recalls. \"We have a Bitcoin treasury, so that was a hard stop.\"\n\nBut the community's determination paid off. \"We encountered our current landlord, and it was a sign that The Space needed to be much bigger earlier on,\" Eric says. \"Now we've got this building that basically competes with Bitcoin Park.\"\n\nThe founders are keen on ensuring that The Space remains a democratic institution. \"We didn't want it to be a dictatorship by any means,\" Tyler emphasizes. \"We have an entire formalized governance policy. We have quarterly all-hands meetings where members can ask questions. We're trying to structure it like a real organization that's around for the test of time.\"\n\nThe board positions are subject to annual elections, and any member can run for a position. \"We structured it in a way that it should very well live on without us,\" Tyler adds.\n\nOne of the most admirable aspects of The Space is their intention to open-source their blueprint. \"We're planning to build a blueprint that's open-source on our website,\" Tyler reveals. \"Anyone can see how we did it - how we elect our board, what we do for our tech stack, how to file for a nonprofit 501(c)(3). We want that all out there so anyone else can build off what we've done.\"\n\nWyatt echoes this sentiment. \"We're trying to open-source this as much as possible to make the next citadel that much easier to start. We had a lot of generosity - lawyers willing to donate their time. We definitely want to pass it forward.\"\n\nDespite Denver's reputation for being a hub for various blockchain projects, including many altcoins, The Space stands firmly as a Bitcoin-only institution. \"There is a lot of shitcoinery here,\" Wyatt notes. \"Given all this other noise around us, we were able to congregate signal within the Bitcoin community in Denver.\"\n\nEric adds confidently, \"We're poaching all these ETH devs out here. They're all starting to build on Bitcoin. We're going to be throwing events around all that. They need somewhere to go once they realize they've been wrong.\"\n\nThe Space is more than just a physical location; it's a testament to what can be achieved when a community comes together with a shared vision and commitment to foundational principles. As Eric proudly states, \"We're the best Bitcoin community in the country, far and away, and we're just starting.\"\n\nFor those looking to be part of this thriving community or to replicate its success elsewhere, The Space offers both inspiration and a practical roadmap. In a world increasingly dominated by centralized powers and big tech monopolies, The Space shines as a beacon for self-sovereignty, collaboration, and the true spirit of Bitcoin.\n\nYou can learn more about The Space at [https://denver.space/](https://denver.space/) and find both their X (Formerly Twitter) & Nostr links on the home page.\n\n10/17/24\n\nConor Jay Chepenik",
  "wordCount": 1132,
  "readingTime": 4.655031446540881,
  "claps": 0,
  "voters": 0
}