{
  "id": "afad2f4b8410",
  "title": "Day 453",
  "createdAt": "2023-06-19 02:23:04",
  "tags": [
    "fathers",
    "day",
    "love",
    "black",
    "mirror"
  ],
  "url": "https://chepenikconor.medium.com/day-453-afad2f4b8410",
  "content": "# Day 453\n\nHappy Father's Day to all the amazing dads out there! As a father myself, I feel incredibly grateful for the joy and love that fatherhood brings. I want to give a special shout-out to my sister Grace for capturing such a beautiful photo of our family.\n\n![](https://miro.medium.com/1*5EEtnHMwCHPcgJHGX6RigQ.png)\n\nToday, my partner and I had a wonderful time sharing dinner with our neighbors, who also have a little boy. It's moments like these that remind me of the beauty in life and the importance of appreciating what we have.\n\nAfter our neighbors left, P and I decided to unwind by watching an episode of Black Mirror called \"Beyond The Sea.\" If you haven't seen it yet and don't want any spoilers, you can find more information about it on IMDD below.\n\n> [**David Ross In 'Black Mirror' Season 6, Episode 3 'Beyond The Sea,' Explained - IMDb**](https://www.imdb.com/news/ni64123405/?ref_=tt_nwr_1)\n\nThe episode revolves around a heinous crime where the victim becomes the victimizer. It's truly horrifying to imagine experiencing such a tragedy, and it emphasizes the value of life in real-world scenarios. In the show, life seems cheap, but in reality, it's impossible to comprehend such pure evil.\n\nI must say, the ending of the episode didn't feel entirely realistic. If it were to happen in real life, I believe the two characters would have fought each other to the death. Nonetheless, it was a dark and thought-provoking episode that made me appreciate my family even more. It also served as a reminder to avoid space travel in my lifetime.\n\nTechnology has certainly given us incredible capabilities, but it hasn't reached a point where I'd be willing to leave my family for 6 years like the guys in the show. As you can imagine it was a dark episode to say the least. Makes me grateful to have a family and a good reminder to never go up to space in my lifetime even if they get robot replica's I can take to visit Earth.\n\n![](https://miro.medium.com/0*8PObBbfu0hpxJiPA.jpg)\n\nLet's cherish our loved ones and the blessings we have here. Do not lose sight of a good thing.\n\n6/18/23\n\nConor Jay Chepenik",
  "wordCount": 369,
  "readingTime": 1.7757861635220125,
  "claps": 0,
  "voters": 0
}