{
  "id": "b071dc6a46a9",
  "title": "Day 223",
  "createdAt": "2022-11-01 01:15:53",
  "tags": [
    "halloween",
    "bitcoin",
    "snowden",
    "faketoshi",
    "public-key-cryptography"
  ],
  "url": "https://chepenikconor.medium.com/day-223-b071dc6a46a9",
  "content": "# Day 223\n\nToday is both Halloween and Bitcoin White Paper day. I used to be excited about Halloween because trick or treating for candy was the best. Now I'm worried about the crap they put in those candy bars because of Bitcoin Twitter. 不不不不 Oh how one can change over the course of their life. Don't get me wrong I love sweets way too much and need to chill with my sweet tooth. I'm just a little freaked out by this video about what \"the producers of various types of candy don't want us to know\"\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/thehealthb0t/status/1582688131815333892&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAnyways, better to focus on what makes me happy and that would be the thing Satoshi released 14 years ago today on a cryptography mailing list. Snowden had a nice tweet that showed this photo.\n\n![](https://miro.medium.com/0*fJ2I2ID8II4ZN8q4)\n\nSnowden then followed it up by roasting Craig Wright who responded to his original tweet. I'm blocked by Mr Faketoshi himself but [here](https://twitter.com/Snowden/status/1587103289027461120?s=20&t=IvWfIh7iF4rZkB-_wJn08w) is the link to the thread if you want to see a murder. Hahahaha today must be a scary day for central bankers around the world who are realizing Bitcoin is money they can't debase at will. While reading Jimmy Song's Bitcoin Magazine Article celebrating this amazing day I was reminded of my father who has a great mind reading trick. The gist of the trick is my Dad tears up a piece of paper into 6 pieces, asks 3 questions and every time he writes an answer he folds it up, writes down the actual answer on a separate piece of paper and the person opens all the paper afterwards and compares with their answers. My Dad can sell the the trick well and one of the things he does to sell his mind reading trick is act like he got the first two questions wrong so on the last question he can say \"Alright I'm botching this give me an easy one red or blue\". The secret to the trick is my Dad writes either red or blue on the first piece of paper so he can write the first two answers on the last two pieces of paper. I've seen my Dad do this trick many times to get free drinks or a bartender to kiss his friends. I bring this up because reading this piece from Jimmy Song reminded me of it.\n\n> [**Bitcoin Songsheet: Bitcoin Maximalism Is The Continuation Of The Cypherpunk Ethic**](https://bitcoinmagazine.com/culture/bitcoin-maximalism-is-cypherpunk-ethic)\n\nI think it had to do with the fact that public key cryptography seems a bit like magic. Song wrote\n\n> The main innovation in public key cryptography was the ability for someone to prove that they know a secret without revealing the secret. If this seems like a magic trick, it does for me, too, and I've been studying this stuff for 20 years. The mathematics are sound but it's not that intuitive that you can prove that you know something without revealing it. Still, this is something that's possible and public-key cryptography is now the basis for the modern internet and the security around a ton of digital properties.\n\nMy Dad can get people to reveal secrets with his mind reading tricks. Many times he asks questions like \"Who was the best kisser you knew\" and the person answering thinks there is no way he gets it correct. Usually it's with strangers so I guess it doesn't matter but theoretically this might be a good way to expose a secret you wanted to know. Now you can make predictions and prove with hashes your prediction was correct. Computer science and math are very much like magic. Crazy to think that people couldn't actually prove secrets this way until some brilliant minds came up with this invention in 1976.\n\n> Public-key cryptography was invented by a couple of academics: Whitfield Diffie and Martin Hellmann. Indeed, the protocol for exchanging keys bears their names, [ECDH](https://en.wikipedia.org/wiki/Elliptic-curve_Diffie%E2%80%93Hellman) stands for Elliptic Curve Diffie-Hellman\"\n\nSo cool to think how Bitcoin was built on past breakthroughs/innovations. Just like our entire modern world today. Humanity gets better and better at building powerful tools. Most technology would seem magical to previous generations. I'm sure the things will have in 25 years from now will seem magical. If you told my ten year old self that by the time I was 25 I would have a magic glass screen in my pocket that can order me food, do my laundry, hail a ride, or find me a partner I would not have believed you. Be hopeful anon technology is going to make life magical when we get on a hard money standard and start harnessing more energy for everyone in the world. Energy is life and under a hard money like bitcoin we won't have psychopaths acting like they care about the environment without recognizing that fossil fuels make our modern world possible. Important we allow it to thrive rather than cut off the thing at its knees because if we use fossil fuels we can set up nuclear plants and innovate with other forms of energy so this chart can keep growing and humanity can prosper.\n\n![](https://miro.medium.com/0*fGNu93H4_ZMGDNDo)\n\nSpooky thought because it's halloween; the modern world without energy. Hahahahaha there would be pandemonium.\n\n10/31/22\n\nConor Jay Chepenik",
  "wordCount": 889,
  "readingTime": 3.7380503144654087,
  "claps": 0,
  "voters": 0
}