{
  "id": "b16503152979",
  "title": "Day 387",
  "createdAt": "2023-04-14 02:52:53",
  "tags": [
    "nostr",
    "pv"
  ],
  "url": "https://chepenikconor.medium.com/day-387-b16503152979",
  "content": "# Day 387\n\nEnjoyed attending the MassAdoption Bitcoin meetup and watching Luke Broyles give a speech. I brought my Daughter and she was so well behaved. All my Bitcoiners friend got to meet her which was cool. Despite being 3 months old she didn't cry until we were in the car riding home. Probably because she wanted to stay longer and hear more of the speech. Luckily, it was streamed live.\n\n> [**Luke Broyles - Bitcoin the next 300 years**](https://www.youtube.com/live/O798l2Sv3nU?feature=share)\n\n> [**JavaScript is not available.**](https://twitter.com/i/broadcasts/1MYxNgqZQgXKw)\n\nI've provided two links in case in the future one link goes bad. Hopefully it remains up on Twitter or Youtube. I also enjoyed this JRE pod on the way to and from the meetup.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F62Dk5MWyjBU0bClFMqG732%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F62Dk5MWyjBU0bClFMqG732&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fdcea00b8868835883f7a6174&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nAmazing to see Nostr go mainstream like this. I talked about Nostr and zapping with a lot of people at the Bitcoin meetup. It is truly amazing how people are all at different points in our Bitcoin journey yet most of us have such a passion for it. Sometimes one person might be very ignorant of the tech aspect, but get the finance side perfectly and vice versa. Never assume someone is bad at one thing just because they are bad at another thing. People can suprise you.\n\nAnyways, I'm grateful for Bitcoin, I'm grateful for free speech, I'm grateful for America, and I'm grateful for my Bitcoin Maxi child named Sloan. Pura Vida.\n\n4/13/23\n\nConor Jay Chepenik",
  "wordCount": 250,
  "readingTime": 0.9433962264150944,
  "claps": 0,
  "voters": 0
}