{
  "id": "b1804a4a274b",
  "title": "Day 156",
  "createdAt": "2022-08-25 14:15:39",
  "tags": [
    "airport",
    "fiat",
    "bitcoin",
    "politics",
    "voting"
  ],
  "url": "https://chepenikconor.medium.com/day-156-b1804a4a274b",
  "content": "# Day 156\n\nWaiting at the airport this fine morning. Flight got delayed, but that's alright. Gives me some time to write this morning. Figured out that I had a pell grant for college so I had about 87% of my debt wiped out. On top of that, the remaining amount is technically cheaper to pay back because the 3k that remains today (out of the 23k I had in student loan debt before it was forgiven) is worth less now than 3k from 2020. High inflation is good for those in debts because their debt becomes cheaper to pay back. For the people who are creditors they get screwed. The money they lent out does not hold the same value upon return unless the interest rate is higher than inflation. Which at the time of this writing (if you believe the government C.P.I # which I would not) is 8.5% C.P.I. Absolutely wild that I got so much of my debt wiped out and the little bit I will have to pay back is getting cheaper with every high CPI print. It honestly is really sad how the people who did the right thing are getting absolutely screwed so the left can try and buy some votes. I hope that those who benefit, like myself, can reflect on how unfair this is and see through the charade to buy votes. Bitcoin is the way out of this corrupt system, but I will be voting for the first time in these upcoming midterms.\n\nI don't think we are in a situation that we can vote our way out of. Too much corruption in both parties, but it's worth a shot. Better to try anyways and vote with both my money and my actual vote. I'm taking the optimist approach. People like Thomas Massie, Rand Paul, and Senate candidate for New Hampshire, Bruce Fenton, give me hope for a brighter future. We need more candidates like the ones listed above who understand the importance of less federal government overreach and more personal freedoms. It is so crazy that the people who broke the most rules, loot from everyone, and are constantly hypocritical want to pass tyrannical laws that go directly against the U.S constitution. Pelosi, Warren, McConnell, and so many other dinosaurs are so out of touch with the average American it's not even funny.\n\nIt would be great to see some age limits so we don't have dinosaurs in the highest levels of our government. The problem is that it is hard to imagine the people in power would allow so because then they would lose power. Absolute power corrupts absolutely so I'm sure those people would fight with all they got to prevent age limits from passing. Thus, we need more people adopting Bitcoin so it becomes so painfully obvious that printing money out of thin air is no longer an option. As long as the Federal gov can force the fed & treasury to turn on ze money printer it seems they will. I do not like the idea of a hyperinflation but it seems more inevitable every passing day. Printing money to pay off debt people took out will literally be like throwing fuel on a fire. All to buy some damn votes. Which just brings me right back to the point I've made multiple times...it's the damn money. Fiat is broken. I'm privileged in one sense to live in the U.S with the global reserve currency, but ultimately all fiats are destined to fail. Even the mighty dollar. USD aka United Shit Dollars. Literal melting ice cubes.\n\n![](https://miro.medium.com/0*0Zl9oDUJ7fBl3weC)\n\nLearn about Bitcoin people. Get off zero, run a node, ask your friends to transact in bitcoin. I love throwing 5 cuckbucks worth of bitcoin on games of fifa. With apps like Strike you can even pay in bitcoin without having to worry about taxable events. With the new card feature coming out I'm very impressed with what they are doing as a company. I would not be surprised to see Strike become bigger than all the private banks like Chase, Wells Fargo, BOA and the others. Fiat banks are lame. \"Bitcoin banks\" tho 👀\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1562613107150581761&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhile they haven't killed shitcoin casinos for traders, they have started to kill them for myself. With the D.C.A feature they make it so I have no need to use shitcoin casinos anymore. Looking forward to the day they make the Fed irrelevant. This will be a long time since central banks won't just give up their ability to print money willy nilly, but one day I Imagine Bitcoin will have made central banks so powerless that companies like Strike are more powerful.\n\nAnyways, who knows how this shit all plays out. Life is crazy, we can't predict the future very well. We can just make educated guess and do our best to adapt to the changing circumstances. Hoping for a smooth transition from fiat to hard money again, but highly doubt that is what will happen if we are just forgoing people's debts and continually printing trillions out of thin air. Saw someone on Twitter say we are at the part of the empire where people just start acquiring as many assets as they can. For those with the means I'd recommend you start acquiring hard assets like bitcoin or else you will end up having to work for bitcoin in the future. Not financial advice, just my best guess on what is in store over the coming decades. While Bitcoin can attract the best and worst people (those who want to build a better world and those who want to use it as a tool to scam the uneducated) I think the former can make the world a better place.\n\nLike my boy Jeff Booth always says \"Tech is deflationary\" and as I see it Bitcoin is the most deflationary tech ever created. Hell yea Bitcoin. Love you! :)\n\n8/25/22\n\nConor Jay Chepenik",
  "wordCount": 990,
  "readingTime": 3.935849056603774,
  "claps": 0,
  "voters": 0
}