{
  "id": "b31bdf51881b",
  "title": "Day 766",
  "createdAt": "2024-04-26 20:57:55",
  "tags": [
    "apple",
    "tesla",
    "elon-musk",
    "steve-jobs",
    "walter-isaacson"
  ],
  "url": "https://chepenikconor.medium.com/day-766-b31bdf51881b",
  "content": "# Day 766\n\nI'm reading Walter Isaacson's book on Elon Musk and this passage stood out to me:\n\n> This followed the principle that Steve Jobs and Jony Ive had instilled at Apple: design is not just about aesthetics; true industrial design must connect the looks of a product to its engineering. \"In most people's vocabularies, design means veneer,\" Jobs once explained. \"Nothing could be further from the meaning of design. Design is the fundamental soul of a man-made creation that ends up expressing itself in successive outer layers.\"\n\n![](https://miro.medium.com/0*jcVxJErJKnotZxuN)\n\nThis principle is particularly important when creating products, services, or any man-made creation because it ensures that the design is not just superficial but fundamentally tied to the engineering, functionality, and purpose of the thing being created. It should be no surprise that some of the most successful companies out there, like Tesla and Apple, had founders that understood the importance of blending the two to make amazing products.\n\nWhen form and function are seamlessly integrated from the outset, the resulting creation becomes greater than the sum of its parts. The aesthetics are not just a shell but an expression of the underlying engineering and purpose. This leads to products that are not only beautiful but also intuitive, efficient, and optimized for their intended use.\n\nOne of Tesla's lead designers, Franz Von Holzhausen, is quoted in the book saying \"The vision was that we would create designers who thought like engineers and engineers who thought like designers.\" I love this quote. I think some of the most profound discoveries come from combining two things which don't seem like they should be combined.\n\nElon Musk, being a visionary in his own right, likely resonated with this principle because it aligns with his approach of creating groundbreaking products that push the boundaries of what's possible. Whether it's electric vehicles, reusable rockets, or other ambitious endeavors, Musk clearly understands that true innovation requires a deep integration of design and engineering from the very beginning, if he didn't get this there is no way he would have built the companies he now runs.\n\nI've enjoyed learning about Musk's life and what shaped him to be who he is today. This is the second book from Isaacson I've read and it seems both are guiding lights for those seeking to create products and experiences that not only captivate but also profoundly impact the world around us. Here is to the dreamers who think they have what it takes to change the world for the better.\n\n4/26/24\n\nConor Jay Chepenik",
  "wordCount": 423,
  "readingTime": 1.7962264150943397,
  "claps": 2,
  "voters": 1
}