{
  "id": "b34f1c369ee1",
  "title": "Day 68",
  "createdAt": "2022-05-30 04:34:22",
  "tags": [
    "faith",
    "bitcoin",
    "friends",
    "seeking-truth",
    "good"
  ],
  "url": "https://chepenikconor.medium.com/day-68-b34f1c369ee1",
  "content": "# Day 68\n\nIf you want to change the world it starts from within. If you learn to love yourself it becomes a lot easier to not pass judgment and forgive. As humans it is a lot easier to be critical of someone without trying to understand where they are coming from. Loving yourself is admitting to God you are not perfect, you are a sinner, and that you have faith. This is both humbling and empowering. You stop judging people because you realize no one is perfect. You also start focusing inward rather than getting caught up with the problems of the world. To actually come up with solutions that can improve the world requires work. Work that can't be done by just dwelling on the problems. There are millions of solutions to the same problem. The best way to find one that works is by seeking truth and loving yourself. Complex problems with a simple solution.\n\nMy two friends convinced me last night that I need to take my faith more seriously by talking about how they perceived the Bible. Neither person pushed their agenda but rather focused on the lessons they each learned from reading the Bible. It gives me great hope and faith that good will win. Having conversations with people who you know seek truth causes you to forget the bullshit you have been focused on. Good is a broad term and hearing my buddies talk about what they have learned from being religious reminded me of how I view Bitcoin. As truth. Since everyone seemed truth it was fine when we disagreed. Rather than get emotional all of us got smarter. It helped clarify my own thoughts by seeing a new perspective, and gave me more questions to ponder. Those who lie or wish to manipulate and control others will face the consequences of their action later on. Short-term pleasure does not lead to long-term fulfillment. Having the courage to face pain is what will bring long-term fulfillment. Ultimately, the truth will come out. Evil is another broad term the difference between good and evil is so small. Evil is the opposite of truth. Evil things happen when people seek meaning in the wrong way. The banality of evil is ever-present in our world and it is as simple as lying to yourself to justify some short term pleasure rather than face the consequences of the truth. My boys have me convinced that despite all the problems in our modern-day world the answer is simple. Seek truth which for me means having faith in God. I had so much hope and passion for bitcoin because I saw it as truth. Listening to my buddy talk about what the Bible means to him can also be summed up as truth. We disagree that Christianity is the one true religion but we never got mad at each other for this. We both are trying to understand each other. Seeking truth. The more you learn about someone's opinion the more you realize it is a direct result of the experiences they've gad. God is truth as far as I can tell. I'm fortunate to have people in my life who led me here. I've always thought of God as the highest being and every religion leads to the same God. While I can't be sure I'm right or my buddy is the Bible helps remind you it doesn't matter. If you have faith you start to realize it will all be okay. Being right doesn' t mean anything in an imperfect world. There is nothing subjective about truth in heaven and it seems that when the truth becomes subjective on earth it causes evil to occur. It's the same idea I had when learning about bottom up vs top down control. The reason talking about religion resonated with me is because my buddies weren't trying to persuade me to think like them. I saw the love talking about Christ filled them with and experienced its power. The raw truth if you will. I was reminded that while Bitcoin is great and has all these lessons that align with the truth my faith needs to be in God. By doing that I know I will fulfill whatever my role is with bitcoin and this will allow it to take root in a bottom up fashion. They were seeking the truth for themselves which is good and noble and it convinced me to join the same cause. I've been Christian my whole life but I hated going to church as a kid. I learned more from one night of listening to someone I trust talk about their experience with the bible than I had in all my CCD classes, and church outings. I've been seeking truth for myself in this corrupt world, but I've been focusing more on the problem than I have myself. People get along so much better when they take the time to work together on challenges. We are all searching for meaning and I saw in action how powerful speaking your truth was. Didn't agree with all their thoughts but it's an important reminder that we as humans are biased based on our prior experiences. You can't optimize systems to enforce top-down control to fix a problem. Well you can but eventually they will break and cause evil to spread which means they will ultimately fail. Being honest about your shortcomings upfront takes maturity in a lot of situations. The more honest you are with yourself the better off you will be. Easier said than done but that is what leads to those who do good or evil in the world. I strengthened my faith in God by witnessing others conviction in the Bible. It seems like many of the truths he had come to realize from studying the Bible were also truths I had gotten from studying bitcoin. It felt like a modern miracle was being performed by God himself. I've been placing my faith in the wrong thing for the right reason. By focusing all my energy on Bitcoin I've become convinced a lot of the problems with society stem from our broken fiat system. I think that is a part of the problem but what I realized seeing Pierce and Timmins describe to me the way they view the Bible is that it takes someone who is willing enough to have an open mind and be saved. Evil results when someone tries to manipulate the truth. Thus, evil will not win out because manipulating the truth will always cause pain later on. It made me realize I can serve bitcoin by talking about it openly and seeking genuine feedback from other people who are truthseekers. I can't convince everyone to think like me and that's fine. People have different opinions based on their upbringing. It is important to find the truth seekers because it opens your eyes to the struggles other people face while convincing you the good guys will win. Convincing others that bitcoin fixes their problems rather than focusing on myself is evil. So many of these ideas are repetitive but they are so powerful. I'm still trying to grasp the simplicity and complexity of it all.\n\nIt is hard to look inside and admit my shortcomings. Especially because I believe deep down that Bitcoin can fix a lot of problems. I thought I was doing the right thing. It took getting religion pilled by a buddy who wasn't trying to get me to think a certain way to help me realize my faults. It seems the Bible has changed the world for the better and spoke truth to billions of humans. Maybe God put Bitcoin in place to serve as the modern day form of truth. Religion has also led to war and suffering. It seems the suffering stems from people trying to implement their beliefs onto others. The reason I called it a miracle is because the lessons I learned from bitcoin my buddy Pierce was taught from the Bible and my buddy Timmins learned from football. It was both humbling and eye-opening to see we could come to the same solution in different ways. It was a great reminder that just because you don't agree on the solution with someone doesn't me you both can't be right. People need to go on the journey themselves. There is no substitute for Proof of work. Loving someone isn't shielding them from pain, but having the faith in them to let them learn from their experiences. Failure and pain are some of the best teachers. I had to realize that while my heart might've been in the right place I can't force bitcoin on to others in a top down fashion. While I do think it can solve many of the problems of the world today I realized the most effective thing for me to do is focus on myself rather than convincing others. It wasn't my buddy imposing his agenda on me that got me to realize my faith in God. It wont be my top down will that convinces the masses to adopt Bitcoin either. It will be people's own search for truth that ushers in a Bitcoin standard. Seeing the passion in my friends when they talked about the Bible was beyond humbling. Jesus Christ died for our sins and now we are free. Accept this anon and life can be heaven. Loving yourself is working on your relationship with God. Seeking to understand rather than convince people will do wonders. This seems so simple but what makes Bitcoin so special is exactly what I was ignoring by putting my faith in a network. The idea I am powerful enough to impose top-down control is now comical looking back. People who focus on themselves end up being the kindest humblest and will likely find bitcoin on their own. People who are so worried about what others think of them are insecure and will just lash out if you shill them Bitcoin, faith, etc. Over time people will realize for themselves the importance of preserving their purchasing power and if I focus on myself and what I know is good I'll be there to help those who seek me out. Today was a reminder that God had planned for my buddy to drive up and be with me to remind me that if I focus on myself and my relationship with God I can do the most good that way. People are prone to copy others and it is up to us to focus on how we can be the best version of ourselves. If you do that the rest will take care of itself. I've never been so sure that Bitcoin will succeed, but I'm also not 100% sure how the hell it will play out in the long run. My buddy reminded me that I don't have faith in the network fixing the problems of the world anymore. I have faith in God and it makes my life so much easier knowing that I'm not perfect, I will sin again, and I'm willing to ask for forgiveness. Whatever Bitcoin does or does not fix in this world is still up for debate. I feel much better knowing that the best thing I can do is seek truth and try to understand others rather than convince them to think like me. One person can make all the difference by seeking truth. For too long I was looking at only the solution rather than the problem. God offers a solution for all. Faith is different for everyone and will help those who seek it find a higher passion. Which for me is Bitcoin, but I now realize for others could be a range of things.\n\n5/29/22\n\nConor Jay Chepenik",
  "wordCount": 1978,
  "readingTime": 7.464150943396226,
  "claps": 0,
  "voters": 0
}