{
  "id": "b3590268884e",
  "title": "Day 657",
  "createdAt": "2024-01-09 02:15:24",
  "tags": [
    "shitposts",
    "consume",
    "produce",
    "twitter",
    "ayn-rand"
  ],
  "url": "https://chepenikconor.medium.com/day-657-b3590268884e",
  "content": "# Day 657\n\nI read another Chapter of the Fountainhead and it is amazing how well Ayn Rand can craft a story. I'm a fanboi. Wish she was still alive so I could be a reply guy to her on Twitter.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1744541307417031111%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI wonder if the cheap dopamine has ruined anyone's ability to write like Ayn. Hell before I sat down to write this post I mindlessly scrolled Twitter for 30 minutes. A complete waste of time but I was grinding all day for my first day with Swan and then had wrestling followed by dinner with my in-laws so I was craving it. CRAVING THAT EASY DOPAMINE!!!\n\nI need to be better though. Social media can be valuable but I know that producing rather than consuming is important. Be in the 1%. The other 99% just consume.\n\n![](https://miro.medium.com/1*ns8q5RoaSSVi1b3VJwdn1Q.png)\n\nOur world has changed a lot. Look at this picture from 1980. Everything was glass on the shelves. Plastic has its uses but when you learn about how many micro plastic we ingest it's disgusting. Glass bottles > plastic ones.\n\n![[https://x.com/BrianRoemmele/status/1744540354257592574?s=20](https://x.com/BrianRoemmele/status/1744540354257592574?s=20) (Notice how every bottle in 1980 was glass)](https://miro.medium.com/0*4LBZCP0aoIlASZr-)\n\nAnways, I'm grateful. God has blessed me and I appreciate all his treasures. Pray more. Enjoy life. Work hard. It ain't rocket science but constant scrolling keeps us slaves to that little piece of glass in our pockets. Not to mention the medium sized glass we use to work and the big glass we use to watch Netflix after a day of work.\n\nSo yea note to self: produce. Don't consume so much.\n\n1/8/24\n\nConor Jay Chepenik",
  "wordCount": 254,
  "readingTime": 1.3418238993710692,
  "claps": 2,
  "voters": 2
}