{
  "id": "b3b904627483",
  "title": "Day 1087",
  "createdAt": "2025-03-14 02:57:46",
  "tags": [
    "god",
    "is",
    "good",
    "history-is-complex",
    "be-humble"
  ],
  "url": "https://chepenikconor.medium.com/day-1087-b3b904627483",
  "content": "# Day 1087\n\nToday, I drove up to Acworth Georgia to visit my Grandparents for the weekend and had the pleasure of listening to two excellent podcasts along the way. I've linked them both below:\n\n![[https://youtu.be/DE9oFxGoMvE](https://youtu.be/DE9oFxGoMvE)](https://miro.medium.com/1*cMaVImQmZnFEo-MLUgYOMg.png)\n\n![[https://open.spotify.com/episode/2pLd5KHmOO7axKd9gKz4WD?si=3e56c2b08b804bef](https://open.spotify.com/episode/2pLd5KHmOO7axKd9gKz4WD?si=3e56c2b08b804bef)](https://miro.medium.com/1*zq_w8HhGyF5w_kBaAEjZ3g.png)\n\nThere's so much to unpack, but my biggest takeaway is how one-sided history often is and how many perspectives we've missed. This happens partly because history is written by the victors, but also because it's filtered through individual lenses and institutional biases. Until recently, only privileged segments of society possessed the literacy, resources, and freedom to document their experiences. Now, the pendulum has swung dramatically in the opposite direction. We've shifted from a scarcity of voices to an overwhelming abundance. Today in 2025, virtually everyone can broadcast their story, creating a cacophony where authentic perspectives compete with an insane amount of disingenuous propaganda, making it increasingly difficult to discern meaningful narratives from noise.\n\nStill, it's incredible to look back on history. It gives us a sharper perspective on today and a humbling reminder that, for all our faults, we have it so good. Both of these podcasts drove that point home for me.\n\n![](https://miro.medium.com/1*xwY-RHVMQV0ciWUNHIfIrg.png)\n\nThere is a comment from the JRE YouTube video with Martyr Made is one that really stood out to me. Especially because X is filled with so many anti-Semitic views nowadays. And what saddens me is both sides seem so locked in. We need more nuance, compassion, love, and understanding. I get both arguments, I really do. Jewish people do have a lot of power and control, and I hate how much sway AIPAC has with our politicians. I believe in America First, not Israel First. But man, just listen to the beginning of that Fear & Loathing in the New Jerusalem podcast and tell me what you wouldn't do in that situation to make sure that same thing didn't happen to your own family.\n\nBoth sides dig their heels in, and we get nowhere. Maybe the way forward is stepping back - listening more, shouting less, and finding common ground in the messy human stuff, like protecting the people we love.\n\nThat's where the real lessons lie. Inside the nuance, the gray areas, the ugly, gritty, crucial details most people gloss over. That's where your perspective expands and deepens. I'm grateful for creators like Darryl. Gratitude.\n\nTo be clear I have love for all people of the world regardless of race, creed, or religion. I am a Christian and grateful Jesus Christ died from my sins. I now have a much greater appreciation for why Zionist feel the need to have their own country and also believe Andrew is right in his post below.\n\n![[https://x.com/BasedTorba/status/1900334260487413900](https://x.com/BasedTorba/status/1900334260487413900)](https://miro.medium.com/1*ocYhhGl_14jON8dSjlp4aw.png)\n\nI also must continue to educate myself. To read the bible cover to cover. To keep growing my own understanding. I've read parts of the bible but I have not read it all the way through. I've heard plenty of opinions and takes since I was a little kid being forced to go to CCD (Confraternity of Christian Doctrine), but the best way to understand something is to experience it first hand for yourself. What I do know is God has answered my prayers so many times and I have love for all of God's children. Well I have another one for you, The Almighty. I pray now for the wisdom, the courage, the grit, and the genius to bring about more peace, prosperity, and love in this fallen world. Thank you.\n\n3/13/25\n\nConor Jay Chepenik",
  "wordCount": 580,
  "readingTime": 2.8886792452830186,
  "claps": 0,
  "voters": 0
}