{
  "id": "b7d88d60e4d9",
  "title": "Day 240",
  "createdAt": "2022-11-18 03:29:55",
  "tags": [
    "fake-meat",
    "honking-for-freedom",
    "bitcoin",
    "mass-adoption",
    "growth-curve"
  ],
  "url": "https://chepenikconor.medium.com/day-240-b7d88d60e4d9",
  "content": "# Day 240\n\nI just reread my piece from day 161 and it's a beautiful thing to be able to read how I was feeling about work 79 days ago. I've put in my two weeks at Datadog and as of the end of this month I will no longer be working there. I'm definitely a bit nervous about what the future holds but I'm also excited. It's my time to shine baby!\n\nI don't necessarily agree with everything in this speech like the idea we will all be eating synthetic meats, getting our universal basic income from the government, or that economics will make fossil fuels absolute in the short term. However, there is a lot to be excited for. Great speech from Emerson Spartz that was super enlightening.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FiHlUgFr9pSo%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DiHlUgFr9pSo&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FiHlUgFr9pSo%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIt is good to challenge the things and ideas I hold dear. Being able to stress test your ideas and remain open-minded to the possibility you might be wrong is the key to learning. This speech made me think that Emerson might be on to something with the UBI here. The Fed recently announced a CBDC test run and I bet the way they urge people to sign up for CBDCs is by offering a UBI if you sign up.\n\nI've also seen the WEF is pushing synthetic meat. That I don't know what to make of. Of course it is great if we can slaughter less animals. Also would be amazing to see less factory farming which is horrific. What seems ideal though is raising animals the right way. I'm not sure if we have the technology to 3D print quality meat. If we could actually 3D print red meat that was exactly like the grass fed steak I have in my freezer I'd be all for it. This is the picture I saw though.\n\n![](https://miro.medium.com/0*MdIjrys1lxKcjP2f)\n\nLooks like play-do. Thus, I'm still on board the let's have more regenerative farming and eliminate factory farming train. If you want to join me buy more meat from organizations like [https://beefinitiative.com/](https://beefinitiative.com/) and less from your local super market. Another idea I've been thinking about since watching that video is the growth curve.\n\n![](https://miro.medium.com/0*ZZ4mRe3KhowNTWlo.png)\n\nWe are probably at about the 30 year mark on this graph in terms of Bitcoin adoption. Exponential growth is hard to fathom but that is what's coming with the Bitcoin network. The best metaphor I can give is the internet bubble in 2000. 22 years later and companies like Facebook, Apple, Amazon, Google and many others have changed the lives of humanity in ways that seemed unimaginable not long ago. They have made it mostly better but also offered nation-states the ability to increase their authoritarianism. Bitcoin fixes this in so many ways. It allows the individual to go down a hero's journey where they can keep the value of their labor in their head.\n\nI must say I completely agree with Bruce Fenton who has been getting a lot of slack on Twitter recently for saying that self-custodying bitcoin is difficult. He is absolutely right. It's very difficult to self-custody your bitcoin in an ideal manner especially if you have large amounts of money. That's the beauty of Bitcoin though. Your wealth rests on complete ownership of how you create your setup. Everyone has different tradeoffs to consider and the majority will not take the time to remember 12 words to store the majority of ones wealth in their head. It might not be a bad idea to store a little bit of 🌽  in memory though for a rainy day. Everyone's situation is unique and the fact that Bitcoiners have that option is what matters.\n\nBitcoin empowers and offers a better system. One where people take full responsibility to play the game. If you try and cheat Bitcoin it will come back to bite you in the ass. Preston said it best \"Bitcoin is like the affinity stone.\" Not many can hang on to it but those who do over long periods of time will be greatly rewarded.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F9b1boWwTvNw%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D9b1boWwTvNw&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F9b1boWwTvNw%2Fhqdefault.jpg&key=d04bfffea46d4aeda930ec88cc64b87c&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThe zero to one invention. I can't stop thinking about all the hope Bitcoin as a technology will bring to humanity. Got to attend the Greater Boston Bitcoin meetup which was a truly special event. The author of [Honking For Freedom](https://honkingforfreedom.com/) attended and gave a speech which was awesome. Hard not to be hopeful after meeting Bitcoiners in person. This space is truly special. The main host Greg also killed it with his warm up speech. Proud to be a part of Mass Adoption and let this post serve as a reminder to buss out the website. Tomorrow my Medium will entail both my wins and struggles with creating a website.\n\n![Mass Adoption Meetup at Exhibit A brewing 😎 ](https://miro.medium.com/1*38JIxGDf9lPdYO6xzEOlQw.png)\n\n11/17/22\n\nConor Jay Chepenik",
  "wordCount": 789,
  "readingTime": 3.527358490566038,
  "claps": 1,
  "voters": 1
}