{
  "id": "b7fa5e80ab34",
  "title": "Day 404",
  "createdAt": "2023-05-01 01:34:19",
  "tags": [
    "margin-call",
    "fair"
  ],
  "url": "https://chepenikconor.medium.com/day-404-b7fa5e80ab34",
  "content": "# Day 404\n\n![](https://miro.medium.com/1*Ajo44vF7rAk5nwvIooxKJw.jpeg)\n\nI watched Margin Call for the first time tonight, and I enjoyed it more than I expected. On the surface, it may seem like a low-key drama about finance bros (and Demi Moore who looks incredible for her age) in an office, but it offers thought-provoking insights into human nature and our perception of fairness.\n\nOne memorable scene features the guy from \"You\" driving across a bridge with a British character in his Aston Martin. The British guy points out that while everyone desires a fair system, the reality is that removing any unfair advantage would lead to chaos. The house always has to win right?\n\nThis got me thinking about whether I genuinely want a fair system, especially if it would negatively impact me. It's human nature to respond to incentives and to forget about terrible events unless they're too painful to move past. Life is full of paradoxes that we experience on this strange journey. I like to think I want a fair system, but I also must recognize I'm not a Cantillonaire. I do benefit from the U.S hegemony though so there is that.\n\nOne takeaway from Margin Call is the importance of focusing on my own perspective and actions. Shifting my focus towards a system that naturally deflates, like the Bitcoin standard, can be incredibly rewarding. Over long time frames, goods and services tend to become cheaper as technology improves productivity, and a fair system like Bitcoin reflects that.\n\n![](https://miro.medium.com/1*JJbfc0HBOO5J7VEUF1rIqA.jpeg)\n\nHowever, if I were to measure value in a flawed unit of account, such as fiat currency, I might be frustrated by a fair system. The reason being, if the system is left to function fairly, it might collapse due to deflationary pressures. Although I'm not an expert on the subject, the concept is that without printing money, GDP could shrink significantly as increased productivity from technology makes goods and services more affordable. This would be great for those who aren't wealthy, but it would be bad for those who hold a bunch of securities.\n\nBondholders will face challenges in a deflationary environment. Deflation can lead to a higher real interest rate, which could lower bond prices. Moreover, if deflation persists and leads to an economic slowdown or recession, credit risk increases as more companies might default on their debt obligations. This scenario would be particularly problematic for those holding corporate bonds.\n\nIt's important to consider all of the factors involved before deciding whether or not you want to use a fair system as your unit of account.\n\n> \"The paradox of education is precisely this - that as one begins to become conscious one begins to examine the society in which he is being educated.\" - James Baldwin\n\nGreat quote. Shoutout chatGPT for helping me find something solid to end this piece on.\n\n4/30/23\n\nConor Jay Chepenik",
  "wordCount": 474,
  "readingTime": 2.172012578616352,
  "claps": 0,
  "voters": 0
}