{
  "id": "b84f0fa5bca8",
  "title": "Day 694",
  "createdAt": "2024-02-15 03:39:23",
  "tags": [
    "subways"
  ],
  "url": "https://chepenikconor.medium.com/day-694-b84f0fa5bca8",
  "content": "# Day 694\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1757967974869106915%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe unparalleled splendor and functionality of Moscow's subway system really throws a spotlight on what's possible, setting a benchmark that seems to whisper to us in the U.S., \"Come on, you can do better!\" It's a bit like watching the culinary mastery on a cooking show and then looking down at your own burnt toast. There's a certain artistry in how our leaders manage to aim for the moon with public funds, only to miss and hit a lamppost instead, prioritizing projects with the impact of a feather duster in a hurricane over the substantial overhaul our public transportation sorely needs.\n\nIn response to Tucker's original post, I couldn't help but marvel at Grand Central Station in Manhattan, which stands like a lone swan amid a flock of pigeons when compared to the rest of New York City's subway network. And let's not even start on Boston's subway, which, while not exactly the epitome of modernity, feels like a luxury cruise liner compared to the nautical nightmare that is the NYC subway. It's like comparing a slightly stale but serviceable sandwich to one that's been left out in the rain; both leave much to be desired, but you'll only seriously contemplate the latter when you're particularly desperate. (I might be biased because I lived in Boston for 7 years but I really do think Boston does a better job than NYC with their subway)\n\nThis glaring contrast between the dazzling subways abroad in Moscow and the rather less sparkling state of our own underscores a broader, somewhat comical tragedy of budget allocation. Imagine, if you will, a world where our penchant for overseas adventures in landscape redecoration (also known as military spending) took a backseat to something revolutionary - like fixing the potholes in both our streets and our public transit systems. By channeling our inner Bob the Builder rather than Genghis Khan, we could significantly uplift our quality of life and maybe even get places on time, fostering a more connected and productive society.\n\nIt's an odd sensation, realizing our nation's coffers are controlled by what seems like a cabal of kleptocrats with a peculiar fondness for overseas demolition projects over domestic refurbishment. It's a tough pill to swallow, realizing that the same hands that could turn our subways into underground palaces prefer to play a high-stakes game of Battleship across continents. But, as they say, admitting you have a problem is the first step to recovery. Here's to hoping we can shift from funding fictional villains in far-off lands to becoming the heroes of our own urban epic - complete with subways that don't double as horror movie sets. First step? Maybe a reality show where politicians are made to commute daily on the subways they neglect. Now, that's a season finale worth waiting for!\n\n![](https://miro.medium.com/0*zXUe7bxAhALICLBa)\n\n2/14/24\n\nConor Jay Chepenik\n\nP.S Happy Valentines Day anon! Hope you spent it with loved ones like I did :)",
  "wordCount": 491,
  "readingTime": 2.0528301886792453,
  "claps": 0,
  "voters": 0
}