{
  "id": "b882e45346c5",
  "title": "Day 505",
  "createdAt": "2023-08-10 01:13:58",
  "tags": [
    "books",
    "innovation",
    "information",
    "quotes",
    "smart-contracts"
  ],
  "url": "https://chepenikconor.medium.com/day-505-b882e45346c5",
  "content": "# Day 505\n\nFinished up my read of Nick Szabo's Smart Contracts today. Here is the link.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FQ1lVWmy3Dn0%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DQ1lVWmy3Dn0&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FQ1lVWmy3Dn0%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nFeels good to finish this video which took a lot longer than anticipated. It amazes me how spot on Szabo was about many of the things to come in our digital world. I don't agree with the idea of tracking CO2 like he mentioned but I do agree with the broader point of advocating for less monopolies on violence and using privately practiced law organizations (PPLs). Szabo writes,\n\n> Other important areas of liability include consumer liability and property damage (including pollution). There need to be mechanisms so that, for example, pollution damage to others' persons or property can be assessed, and liens should exist so that the polluter can be properly charged and the victims paid. Where pollution is quantifiable, as with CO2 emissions, markets can be set up to trade emission rights. The PPLs would have liens in place to monitor their customer's emissions and assess fees where emission rights have been exceeded.\n\nWhile some see carbon dioxide as a climate change boogeyman, its role should be put in perspective:\n\n- By volume, CO2 only comprises about 0.04% (400 parts per million) of the total atmosphere.\n\n- The largest components of the atmosphere are nitrogen (N2) at 78% and oxygen (O2) at 21%. Argon, neon and other noble gases make up most of the remaining percentage.\n\n- This means CO2 is indeed only a trace gas in the total atmospheric composition.\n\nI do believe it is important that we work to treat our planet better. However, the idea that CO2 is what is going to destroy us all is ridiculous in my humble opinion. I'm no scientist so do your own research. I just think there are much greater issues than CO2 that plaque society.\n\nHaving addressed the CO2 point, I find the rest of Szabo's propositions to be highly sensible. When we remove the influence of the state's exclusive control over violence and the manipulation of large corporations that exploit the system to increase their pollution or purchase allowances for it, Szabo's ideas align remarkably well. However, a notable challenge arises when the state collaborates with such corporations. Public/private partnership is not good. This partnership often leads to performative actions (aka virtue signaling) rather than genuine efforts to reduce pollution. The crux of the matter lies in establishing robust accountability mechanisms and a framework for compensating damages, as opposed to merely engaging in symbolic displays of virtue. Conflicts of interest are legit and they exist in many places today.\n\nAnother idea brought up by Szabo in the article was about the importance of biometric data and how public/private keys don't contain biometric data. I see the value in biometric data (my iPhone's face ID feature is great) but it seems like using biometric data for private keys, regardless of if it is for Bitcoin, Nostr, PGP, or any other technology, faces the same challenge as the pollution tracker smart contracts: how do we prevent the institution with the monopoly on violence from corrupting it. I would like to put more thought into how humanity can use technology to create a better world rather than hand over control to bureaucrats. My answer is build better freedom tech. Bitcoin & Nostr seem to be the two best examples I've seen so far. The goal is more user-centric technologies that create a more liberated world.\n\nThere are two quotes I want to share before I wrap this up. The first one I meant to share and the second came during my search for this first one but it was so good I wanted to share.\n\nThe Roman poet Virgil wrote,\n\n> Nature is never in a hurry yet everything gets done.\n\n_Zen and the Art of Motorcycle Maintenance_ by Robert M. Pirsig has a great quote,\n\n> The Buddha, the Godhead, resides quite as comfortably in the circuits of a digital computer or the gears of a cycle transmission as he does at the top of the mountain, or in the petals of a flower. To think otherwise is to demean the Buddha - which is to demean oneself.\n\nIt is often hubristic for humans to believe we know better than nature. Ironically, we are the species that manipulates nature to suit our purposes. Yet nature likely has sound reasons for operating as it does. We would be wise to consider that there may be logic in natural processes beyond our current understanding.\n\nParadoxes all the way down. I heard this quote the other day that has stuck with me. 'A book is made of other books'. At first glance this seems obvious, but it has deeper implications. Life itself is constructed from prior life. We owe our very existence to the fact that our parents bumped uglies. The same holds true for everyone. This interconnectedness of life should fill us with gratitude and appreciation for nature's amazing creativity. It also reminds us of our responsibility to build upon what came before - to innovate and carry forward the legacy of life. Though we individuals are small, we are also part of something greater and ancient.\n\n![](https://miro.medium.com/0*5IMTP0hVfVw8DvZS.png)\n\nLike I mentioned yesterday we live in a time of information overload. With access to so much knowledge it is a fine line discerning what is signal in all the noise. There will be amazing innovations that occur in my lifetime and ones that will lead people astray. I pray to God that I have the skill, wit, and humbleness to leverage my ancestral knowledge while also leveraging all the amazing breakthroughs that will happen during my lifetime.\n\n8/9/23\n\nConor Jay Chepenik",
  "wordCount": 939,
  "readingTime": 3.7433962264150944,
  "claps": 1,
  "voters": 1
}