{
  "id": "b8b64567a31a",
  "title": "Day 401",
  "createdAt": "2023-04-27 19:03:16",
  "tags": [
    "running",
    "motivation"
  ],
  "url": "https://chepenikconor.medium.com/day-401-b8b64567a31a",
  "content": "# Day 401\n\nThis month has been a grind trying to reach 40 miles ran. Hit 4 miles today though and that felt great. Running is one of those weird things where sometimes I love it and other times I hate it. It's all love once a run is over. Starting and during a run though is typically a mixed bag.\n\n![](https://miro.medium.com/0*HD1R0ET0-oiKZARn)\n\nI'm really happy I sit a goal of 40 miles every month. Just under 3 more miles in April and I will have successfully hit my goal every month this year. Like the 21 million hardcap Satoshi picked 40 miles was an arbitrary-ish number. I kept successfully hitting 30 month after month at the end of 2022 and was like it makes sense to increase how many miles I run in a month. 40 is much more difficult because I can't just run a singular mile everyday to hit my goal, but that is ideal.\n\nI'm getting better at coding slowly but surely. I have no idea what the right amount of coding everyday is to become a successful software engineer but I know that consistency is super important. So here is to putting my hands on the keys every single day. If I can do that my skills will naturally start to improve. I've got to submit what I want to do for my breakable toy which is the project I'll be working on in my coding bootcamp. Here are my three ideas.\n\n1. Personal Website Builder & GitHub Setup:\n\n- Name: \"SiteGenius\"\n\n- Offer customizable personal website templates to choose from, allowing customers to select a layout and color scheme that matches their personal brand or style.\n\n- Include a user-friendly form that collects relevant information such as their name, bio, portfolio, contact details, and social media links.\n\n- Offer optional add-ons such as a 30 minute call to show them how to host their website on github for free.\n\n- Provide a brief tutorial on how to update their website, so they can maintain it themselves after the initial setup.\n\n- Offer multiple payment options, including Bitcoin via the Strike API, but also consider other traditional payment methods from an API like Stripe. Stripe and Strike one for fiat one for Bitcoin.\n\n2. MassAdoption Merchant Portal:\n\n- Name: \"MassAdoption Merchant Portal\" or \"BitAccept\"\n\n- Create an easy-to-use interface that guides merchants through the process of setting up their account and integrating it with their existing e-commerce platform.\n\n- Offer various integration options, such as plugins for popular e-commerce platforms like Shopify, WooCommerce, and Magento.\n\n- Implement an automatic currency conversion feature, so merchants can display prices in their local currency while still receiving Bitcoin.\n\n- Provide a comprehensive dashboard that tracks transactions, generates invoices, and exports tax-compliant CSV files.\n\n- Offer a referral program that rewards merchants for bringing new users to the platform.\n\n3. Habit-Chain:\n\n- Allow users to set personalized goals and milestones for each habit, helping them track their progress more effectively.\n\n- Integrate a \"Streaks\" feature that highlights users' longest streaks of consecutive days for each habit, motivating them to continue.\n\n- Offer a \"Habit Insights\" section that provides statistics and trends on users' performance, allowing them to better understand their habits and areas for improvement.\n\n- Enable users to share their progress with friends and family through social media, fostering a sense of community and support.\n\n- Include a \"Habit Marketplace\" where users can unlock and purchase rewards, such as motivational wallpapers, exclusive content, or discounts on related products and services.\n\n- Offer customizable reminder settings, such as frequency, timing, and the option to include motivational quotes or images (from Giphy) in the notifications.\n\nThis is a start!\n\nConor Jay Chepenik\n\n4/27/23",
  "wordCount": 610,
  "readingTime": 2.5018867924528303,
  "claps": 0,
  "voters": 0
}