{
  "id": "b97753904006",
  "title": "Day 108",
  "createdAt": "2022-07-08 21:08:28",
  "tags": [
    "sales",
    "bitcoin",
    "minions",
    "fiat",
    "celebration"
  ],
  "url": "https://chepenikconor.medium.com/day-108-b97753904006",
  "content": "# Day 108\n\nToday was a fun day at work. Sales can be an emotional roller coaster but not getting too high or low is important. Some days will suck and others will be a rush, but continuing to develop good habits, learning about what I sell, and being comfortable detaching my worth from my job seems to be the key to a fulfilling life. There is so much to do in the world, like continuing to orange pill people lmao, that I'm finding it easier and easier to disconnect from placing any of my self worth in my current gig. That said, I'm human and still like celebrating the wins so I'm happy to see that I had a good day today.\n\nGoing to a Bitcoin meetup this Tuesday in Boston which I'm excited about. Continuing to do the little things in my day-to-day life like running, cooking, and listening to podcasts in order to better myself. Need to get back on the reading grind here as well. Tiny improvements make a big difference over long stretches of time. Also looking forward to staying in a nice Inn up in Vermont for my birthday. Wild how fast life is going by but I'm grateful that I've been able to stop and smell the roses...literally Cambridge is full of flowers.\n\nOutside that not much to report. Was talking with my Dad today about moving back to Jacksonville, Greenville S.C, and even potentially north of Atlanta area. I have a lot of time until my lease is up so we will see what I decide to do. I love it here in New England but I would also like to get some land and start doing self-sovereign shit so only time will tell. Having a child too will make it clear in the first 3 months if city living is reasonable or if it's time to get outside the city.\n\nFinal thought for today, Bitcoin is not inevitable but the more I listen to other Bitcoiners speak the more faith I have they will do anything to usher in this new system compared with parasites who will do anything to be a leach and hold onto their purchasing power. One will thrive and one will flail. My bet is on the one who seeks to help others by providing them a life boat out of fiat inflation while the other drowns as they try to pull others down so they can stay on top. Bitcoin will eat fiat in the same way my old self would be eaten (not literally tho) by my new self. I look back and I'm very proud of the growth I've achieved since the pandemic hit. So many areas I still need to improve but Bitcoin has helped me make strides in my life I never thought possible. If you are reading this anon and are sad about where you are, develop some good habits, do your best to remain eve and keel, and learn the importance of stopping and smelling the roses (celebrating the small things)\n\nNow to go watch Minions with my smoke show baby mamma. :)\n\n7/8/22\n\nConor Jay Chepenik",
  "wordCount": 529,
  "readingTime": 1.9962264150943396,
  "claps": 0,
  "voters": 0
}