{
  "id": "b98fc25973f4",
  "title": "Day 429",
  "createdAt": "2023-05-25 22:27:37",
  "tags": [
    "us-v-sterlingov"
  ],
  "url": "https://chepenikconor.medium.com/day-429-b98fc25973f4",
  "content": "# Day 429\n\nMan this podcast upset me. I'm glad I listened to it but holy crap. If you have read enough of my posts or had a conversation with me in real life it is apparent that I have a disdain for corrupt states. Which is not to say I don't have a deep respect for the U.S constitution and the ethos of my country! I love what my constitution has enabled. Genuinely, I believe it is one of the most powerful peaces of paper humanity has ever had the pleasure of scribbling on. What I've got a problem with is how deeply corrupted the system has become.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1661852467405922305%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIt breaks my heart hearing about all the corruption, profiteering, and outright disrespect for the constitution that has gone on. I don't understand how the DOJ, Chainalysis, and the rest of the people involved think doing something like this is okay. I mean I do; incentives are everything. People don't respond to authority they respond to incentives. It just saddens me deeply that this is happening and rather than considering a seemingly innocents man's perspective everyone just opts for the \"fuck Roman I need to get paid route\". That route has nothing to do with justice. If you listen to the podcast and decide to contribute here is the link to the Geyser fund the attorneys have set up.\n\n> [**US v. Sterlingov**](https://geyser.fund/project/usvsterlingov)\n\nI must note I just found out about this recently. I have not heard the DOJ's side or Chainalysis's side. If someone has links or resources to documents which might expand my perspective please leave a comment or contact me somewhere on the internet. It's always important to realize there are 3 truths; each person's side and what actually happened. With that noted I truly believe these lawyers are telling the truth. It doesn't make sense that Roman was caught with all his computers and there was no evidence to suggest he ran Bitcoin fog. Or that someone who could set up a mixer like this would then decide to KYC himself on Kraken. The world is not black and white. There are plenty of grey parts. I don't know if Roman is a good dude or a bad dude. What I do know is everything I just found out from his lawyers is completely out of whack with what the constitution demands our justice system do.\n\nGood will win out. I've posted about this case in the Boston Bitdevs meetup I'm attending tonight and look forward to discussing it. It is best to remain focused on the positives. Karma always comes around and I hope if there is ever a situation where I'm motivated by money, prestige, power, etc to be like Chainalysis or the DOJ in this case I can do the right thing. Easier said than done. I can talk shit on my Medium like this because what's the cost. As far as I can tell nothing. Glad I wrote about it though and suggested it as a topic.\n\n> [**Socratic Seminar 16 Reading List (May 2023) · Issue #20 · 0xBEEFCAF3/bostonbitdevs**](https://github.com/0xBEEFCAF3/bostonbitdevs/issues/20)\n\nOne more reminder because it can not be said enough, in my humble opinion, the Universe and its infinite wisdom has a reason for everything. Do not fuck with karma unless you wish to find out!\n\n![](https://miro.medium.com/1*wuZASs9DOAbo2ClN97lKlg.jpeg)\n\nPeace and love anons.\n\n5/25/23\n\nConor Jay Chepenik",
  "wordCount": 600,
  "readingTime": 2.4641509433962265,
  "claps": 0,
  "voters": 0
}