{
  "id": "b9fba8335e",
  "title": "Day 389",
  "createdAt": "2023-04-15 20:48:37",
  "tags": [
    "nostr",
    "coding",
    "brilliant",
    "education",
    "basics"
  ],
  "url": "https://chepenikconor.medium.com/day-389-b9fba8335e",
  "content": "# Day 389\n\nI've been using a web app called brilliant to learn random things. Thank you Bitcoin for motivating me to learn about math and comp-sci. It's a good web app that I do recommend checking out. [Here is a link](http://brilliant.org/ref/DbYdlLYwap/).\n\nMath is hard but gamifying it helps. I will say going through a coding bootcamp is a grind because there is such a plethora of knowledge and tools available for someone just getting started. I'm enjoying the software engineering education and having a guided curriculum is helpful for knowing where to start. Of course at times it can feel like I'm drinking from a firehose, literally (but actually figuratively just using literally for emphasis). That's why brilliant and other fun gamified web apps are great. Low stakes way to reap the benefits and go back to basics.\n\n![](https://miro.medium.com/1*D49stHkJFP0f2LyPj-MXzA.png)\n\nConstantly challenging myself before getting a dopamine hit helps me build a strong foundation. I love social media and all but it does not challenge my brain in order to receive dopamine. It just gives me the dopamine like ice cream does. Sure I had to scoop the ice cream (or open my phone) but that is such a mundane task for cheap dopamine. I do think there is a metaphor to be made about how revisiting fundamental concepts is a great way to solidify my understanding of earlier material and become better equipped to tackle more complex problems. There will always be gaps overlooked during my initial learning. I like how software engineers joke even the best guys google everything. (soon to be AI). Of course we can't rely solely on the internet or AI at all times. Mastering the basics instills confidence and enables one to approach advanced topics with a greater sense of self-assurance. Once someone has a strong grasp of basic principles they start to analyze and solve problems more effectively and efficiently. No matter how skilled I become I must remember revisiting basic concepts reinforces my memory and helps ensure that essential knowledge is retained over time.\n\nProud of myself. Also note to self start trying to contribute to open source Nostr projects. What a cool way to earn some corn! Here is the github for other devs who might be interested.\n\n> [**GitHub - nostr-protocol/nostr: a truly censorship-resistant alternative to Twitter that has a...**](https://github.com/nostr-protocol/nostr)\n\n4/15/23\n\nConor Jay Chepenik",
  "wordCount": 414,
  "readingTime": 1.7622641509433963,
  "claps": 0,
  "voters": 0
}