{
  "id": "ba5afc8bbb37",
  "title": "Day 1026",
  "createdAt": "2025-01-12 04:15:55",
  "tags": [
    "fix-the-money",
    "fix-the-world",
    "bitcoin",
    "is",
    "money"
  ],
  "url": "https://chepenikconor.medium.com/day-1026-ba5afc8bbb37",
  "content": "# Day 1026\n\nIs money the pinnacle of society? You could argue it outweighs culture, politics, laws, and traditions. But that depends on the person. Some will do anything for the right price; dollars, bitcoin, gold, take your pick. Others wouldn't sell their soul for all the money in the world. The old saying, \"everyone has a price,\" isn't true. More like, \"most people have a price for most things.\"\n\nWorking for money isn't evil. Maybe the saying should be, \"everyone has a price for things that aren't evil.\" But even that misses the mark. Some people just don't want a boss breathing down their neck. It's not morality, it's freedom to do as one pleases.\n\nHere's the reality: most people work because they need money. If the paychecks stopped, so would the work. But a few lucky souls work because they love it. They've mastered their craft, and grinding doesn't feel like grinding. They're in the flow. When passion meets success, it's obvious. Their work speaks for itself, and people flock to experts. Society thrives on competence. Just ask California how well incompetence worked out when fire hydrants ran dry during wildfires.\n\n![[https://x.com/EpochTimes/status/1878094530806714416](https://x.com/EpochTimes/status/1878094530806714416)](https://miro.medium.com/1*TZJT-S-6jeA7v6TDEoDP5Q.png)\n\nBroken monetary systems crush passion. If the cost of living actually dropped over time, more people could ditch soul-sucking jobs and chase what they love. Without the rat race, people wouldn't waste 50 years grinding just to \"enjoy\" life when they're too old to move.\n\nSure, other factors matter: upbringing, inheritance, education, and that little voice saying you need a mortgage to impress the Joneses. But broken money makes it worse. It feeds insecurity, turns investing into a second job, and makes good workers resent their jobs. The ripple effects are massive, even if they're not obvious. Like Charlie Munger said, \"Show me the incentives, and I'll show you the outcomes.\"\n\nWhen a handful of people can print the money everyone else works for, the game's rigged. People stop chasing value creation and start cozying up to the money printers. Why work harder when you can rent-seek? Not everyone plays that game, but plenty do.\n\nKill that perverse incentive. Thank God Satoshi gave the world a money like Bitcoin: something no one can print out of thin air. If you want Bitcoin you have 3 options, mine it with electricity, trade your fiat for, or offer goods and services while accepting bitcoin as the money for said things. No shortcuts, no handouts. The world becomes a better place when more people use money that can't be whipped up out of thin air by a select group of men.\n\nMy 2 sats :)\n\n![](https://miro.medium.com/1*Gm0wBO0ACVfpQCaoUZDL6g.png)\n\n1/11/25\n\nConor Jay",
  "wordCount": 439,
  "readingTime": 2.0399371069182393,
  "claps": 0,
  "voters": 0
}