{
  "id": "ba71195de720",
  "title": "Day 36",
  "createdAt": "2022-04-27 22:11:34",
  "tags": [
    "wef",
    "bitcoin",
    "proof-of-stake",
    "proof-of-work",
    "tokenization"
  ],
  "url": "https://chepenikconor.medium.com/day-36-ba71195de720",
  "content": "# Day 36\n\nThis entire post will be dedicated to the absolutely egregious [tweet](https://twitter.com/wef/status/1519119185422524416?s=20&t=xLLjNU9eiM3KGU6F8jGsow) the World Economic Forum put out urging the users of the network to change Bitcoin from a proof of work protocol to a proof of stake one. Another way to put this is changing bitcoin from a cyber vault secured by energy to one secured by people's wealth.\n\nThe video starts out by saying \"experts have found a way to eliminate 99.9% of bitcoin's carbon footprint.\" Who the hell are these experts and what are they experts of? Gaslighting? I mean seriously could this be more vague?! For someone who knows absolutely nothing about Bitcoin this might seem like a good thing. For those who have taken the time to research Bitcoin, it is clear this is a dishonest take at best. They should've put \"experts have found a way to eliminate both Bitcoin's value prop and carbon footprint with this simple change\".\n\nThe next slide reads \"They say a change in the way bitcoin is coded could virtually eliminate its environmental impact\". Nothing about how code changes work, who controls the network (miners, node operators, and bitcoin core contributors if someone was wondering), or why it's not as simple a CoDe ChAnGe. They follow this up with \"The world's most popular cryptocurrency uses more electricity than Denmark\". This is true and so do [Christmas lights in America](https://www.igs.com/energy-resource-center/energy-101/how-much-electricity-do-christmas-lights-use). (Rough math done here but I'm pretty confident that Christmas lights use more energy in a year than bitcoin currently so if the WEF is right about this then so am I) No one is talking about getting rid of Christmas lights because it brings people joy and happiness. Well guess what: Bitcoin gives people financial freedom, censorship-resistant money, and a store of value that is truly scarce. I genuinely hope that by the time I have kids Bitcoin is using more energy per year than the United States so all Bitcoiners can rest easy knowing a 51% attack is damn near impossible.\n\nThe WEF seems to hope for the exact opposite because the next thing they point out is \"Bitcoin alone could help push global warming above 2 degrees Celsius if it becomes widely adopted\" source - Nature Climate Change. Rather than lookup however Nature Climate Change got this terrible take here is a great [documentary](http://youtu.be/b-7dMVcVWgc) about why Bitcoin mining actually incentivizes green energy infrastructure. Miners can be used as a buyer of last resort for excess energy that would otherwise be wasted thus derisking capital put up to build green energy infrastructure.\n\nThe next take was actually kind of helpful for noobs who don't understand how Bitcoin works. It reads \"Bitcoin's huge energy demands stem from the way its transactions are verified\". I'm going to skip ahead a little because the next 15 seconds of the video explain how mining works and the game theory of miners and engineers building and buying better hardware in an effort to be more successful while mining. Yet rather than acknowledging this, they point out how the ChAnGe ThE cOdE cAmPaIgN doesn't believe Bitcoin needs to use more energy over time to be secured. This is wrong so I'll continue on.\n\n\"Instead of using computers to crunch numbers...Miners could stake their own bitcoins to verify transactions instead\" As I said in the first paragraph of this essay \"Another way to put this is changing Bitcoin from a cyber vault secured by energy to one secured by people's wealth.\" Doing this would completely centralize Bitcoin and if this ever happened I would sell all my bitcoin and be absolutely devastated. If there wasn't Bitcoin I'm not sure I would have any hope for a world of abundance where poverty is nearly eliminated and violence is at all-time lows.\n\nThe video follows up with \"Eliminating most of the network's energy demands at a stroke\" they just forgot to add \"also eliminating its entire value prop and reason for being created\". The WEF isn't done yet though, \"The campaigners say this could be achieved with a basic change in the coding along with the buy in of 30 key figures in the bitcoin universe.\" WRONG AGAIN! My node will not accept this change EVER. I imagine 99.9% of the Bitcoiners out there running nodes would agree with me. Even if this take wasn't so wrong I'd love to know who these 30 key figures are? Seems a little vague lol👀\n\nTo make matters that much sweeter the video concludes by pointing out that Ethereum has pledged to switch to proof of stake and that it's 2000 times more energy-efficient than Bitcoin mining. First I want to point out Eth has not successfully transitioned to Proof-Of-Stake yet so there is that. Here is a great [thread](https://twitter.com/MartyBent/status/896775534658686979?s=20&t=8s2H0kmFlvcU1BMtQyynIw) from [Marty Bent](None). Marty if you ever read this I'm sorry if I blew up your notifications liking every single tweet in that thread but I was cracking up while doing it because this is such a great example of how stupid it is to try and switch a proof of work protocol that millions (hopefully one day billions) of people use to proof of stake.\n\nThe video concludes by asking \"What do you think of cryptocurrencies?\". I think that bitcoin is the only one that has a chance at being money and the rest are more or less securities. Would a tokenized world be cool? As far as I can tell yes. However, it doesn't matter whether we tokenize the world if the money is broken. The system can't fix itself if it has been completely gutted from within. We need a new monetary system not controlled by anyone (especially central banks 🏦  ). Those are my thoughts on cryptocurrency WEF. Thank you for asking.\n\nI'd also like to note this [tweet](https://twitter.com/Dennis_Porter_/status/1519185733675732992?s=20&t=xLLjNU9eiM3KGU6F8jGsow) Dennis Porter shared that is \"A non-western viewpoint\" from the WEF. I do appreciate the fact they gave a different perspective but it does not excuse the video in my opinion.\n\n![](https://miro.medium.com/1*OB3ckvVfFJHZgGY_a_iyqg.jpeg)\n\n4/27/22\n\nConor Jay Chepenik",
  "wordCount": 1005,
  "readingTime": 3.9924528301886792,
  "claps": 10,
  "voters": 1
}