{
  "id": "baa4b30cf7bf",
  "title": "Day 179",
  "createdAt": "2022-09-17 22:12:31",
  "tags": [
    "food",
    "dinner",
    "meat",
    "pregnant",
    "new-england"
  ],
  "url": "https://chepenikconor.medium.com/day-179-baa4b30cf7bf",
  "content": "# Day 179\n\nIf you get your girl pregnant expect her to use the baby as an excuse every time. If your girl wants something \"baby\" is hungry for \"x\". If your girl needs rubs... \"baby needs rubs\". If your girl is cranky... \"baby is cranky\". Kind of true though because the thing is inside of her and can feel what she is feeling. I want my baby to feel great and be born healthy so my girl is going to get her request. Sloan if you ever read this one day know your Mum used you to get her way all the time. That is alright though I love your Mum with all my heart. She is also doing all the heavy lifting while I get to root from the sidelines so it is a pretty fair tradeoff. I read that giving pregnancy is like running an ultra marathon in terms of pain. So I appreciate you P for carrying our unborn child.\n\nThought this was a good tweet. I might look like a tan version of the pillsbury doughboy but I do feel gangster listening to some banging rap music. Hadn't thought of it this way so thank you Kata. Good insight on the bird app if you know where to look.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/katathegreat/status/1571215061443559424&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nGot to try and do the same with my art: make it inspiring. Which considering the fact we are all stimulated as can be because of social media is not easy. But anything easy is usually not worth much. So I'm on it! That's why I'm writing everyday honestly. To get better at writing so people feel inspired when they read my stuff. Funny to think of writing as an art but it definitely is an art.\n\nGot to play put-put with my Dad and girlfriend today. I came in last but the view from the course was stunning. I love the mountains in New England.\n\n![](https://miro.medium.com/1*ywGMpMDVpCXAv9FJM_12XQ.jpeg)\n\nSomething special about the white mountains in NH: Live free or die baby! Went and visited the town of Conway which is really close to where I'm staying in Maine. This area of New England is quite charming. I'm falling more and more in love with this part of the world. My Dad desperately wants my girl and I to move to South Carolina. I appreciate the fact he wants us close but it is going to be hard to pull us away from this part of the country. I also think it is good to raise our child the way my girl and I want to raise the child. I hear having grandparents around to help is amazing. Which I'm sure is true but I also feel good about the fact Sloan will have 4 Granddads and 2 Grandmas who will want to help anyways and will visit often. I don't know time will tell what happens but after seeing more of Maine and New Hampshire I'm pretty sold this is where I want to raise a child.\n\nFinally, grilled some bussing meat. Felt good cooking on a grill. I'm leveling up my Dad skills. Need to keep crushing runs though because I don't want to develop a serious \"Dad-bod\".\n\n![](https://miro.medium.com/1*MVUXn6o04nZbj5CakZW47A.jpeg)\n\nFelt good making this meat. Just doing my part to make sure ranchers get paid and my cells get the nutrients they need. God I love meat. Also had some Maine lobster before this steak and hamburger I crushed. I'm so blessed. Like most people living in our dopamine filled social media 21st century having ass world I get down but good god do I have it so nicely. Kings literally didn't live as good as most people in the 21st century. Back in the day royalty had people fanning them with huge leaves and now most of the developed world has A/C. Thank you God for everything. Seriously. Worrying about taking the time to write everyday can be a drag but then I get to writing and almost every time I'm reminded how fortunate I am to be living and breathing.\n\nWhich reminds me, because it was food that made me be grateful, I had a really interesting conversation with my girlfriend at dinner last night. She mentioned that in Europe you usually don't tip the waiter. If you want service you have to really try and get their attention. In the United States tips are a huge thing and usually the waiter is more attentive. I like the idea of not paying tips but I also appreciate the fact that here in the States the waiters are more attentive. My girl also mentioned that in Europe meals are much longer and usually enjoyed. Where as in the states it is a quicker process usually an hour vs say 3 hours. This is all a big generalization, every place is different, but it is interesting to think about. Seems to go back to incentives. If you know your pay depends on your service you are likely to be nicer. However, there are shitty tippers no matter how good you are so I'm sure its nice to have a rate you know you will get no matter what. Food for thought...pun intended. :D\n\n9/17/22\n\nConor Jay Chepenik",
  "wordCount": 869,
  "readingTime": 3.662578616352201,
  "claps": 0,
  "voters": 0
}