{
  "id": "badd47de92a9",
  "title": "Day 552",
  "createdAt": "2023-09-25 19:19:45",
  "tags": [
    "travis-kelce",
    "taylor-swift",
    "freedom",
    "pfizer",
    "evil"
  ],
  "url": "https://chepenikconor.medium.com/day-552-badd47de92a9",
  "content": "# Day 552\n\nIf this meme offends you I'm sorry. I hope Taylor Swift does not break Travis Kelce's heart either but if you consider the incentives she seems to do quite well singing about heartbreak. As for the red part of the meme if that upsets you maybe consider that in [2009 Pfizer paid 2.3 Billion to settle a marketing case](https://www.nytimes.com/2009/09/03/business/03health.html#:~:text=The%20cases%20charge%20that%20illegal,fines%20related%20to%20other%20medicines.).\n\n![](https://miro.medium.com/0*f5zbVm_VHcaP1lRQ)\n\nOf course this is just a silly meme which is funny because it holds truth. This video is a much more apt explanation of the whole thing.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/HiRezTheRapper/status/1705983725685690594%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI understand wanting to make as much money as possible but to sell out for Pfizer seems wrong. Especially now after all the evidence has come out that they did falsely market the 💉 . 100% safe and effective, you won't get the vid if you get these, etc. Don't believe they said that? Here is a montage you should watch.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/WallStreetSilv/status/1706178028018008199%3Fs%3D2&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI won't dwell on reiterating the sheer audacity of the lies. What's heartening is that the tide has finally turned, and in 2023, we can express our opinions more freely without the looming threat of account obliteration. I pray it stays this way and that citizens don't put up with our first amendment being violated going forward. This has been a significant issue for many over the past three years.\n\nAnways, the reason I wanted to write about this today is to emphasize the corrupting influence of money. My admiration for Travis Kelce stems from both his [podcast](https://www.youtube.com/@newheightshow) with his brother Jason, and the fact he is a great football player. However, I can't help but feel that endorsing Pfizer, post the blatant deception, casts a shadow. The thought of Pfizer being an evil company didn't even cross my mind until it became a presidential mandate to partake in their products (or those of Moderna or J&J).\n\nFreedom is not free. It must be defended every single day. America has long been a place where the struggle for freedom is taking place everyday. If you want to learn more about that struggle this series is worth the listen.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FTEXaOc3fzWc%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DTEXaOc3fzWc&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FTEXaOc3fzWc%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI'll end this by saying do not trust me. Do not trust big pharma. Do not trust celebrities getting paid millions to promote products. Think critically and verify things for yourself.\n\n9/25/23\n\nConor Jay Chepenik",
  "wordCount": 381,
  "readingTime": 1.6377358490566036,
  "claps": 1,
  "voters": 1
}