{
  "id": "bbbcb75bd80b",
  "title": "Day 299",
  "createdAt": "2023-01-15 23:28:05",
  "tags": [
    "chatgpt",
    "moving",
    "football",
    "exercise",
    "health"
  ],
  "url": "https://chepenikconor.medium.com/day-299-bbbcb75bd80b",
  "content": "# Day 299\n\nMan that Jaguars playoff game last night was insane. Makes me miss playing football watching a game like that. Happy to see Duval get a muched deserved win.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1614480106998710274&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWas going to tweet out that we should've let Tennessee win but then I reconsidered because playoff football is always nuts. Sure enough the Jags came back. This late in the season anything can happen with these games so it's important to not get over your skis. I saw a story of all these tweets clowning the jags and sure enough now those tweets look ridiculous so I'm happy I listened to my gut.\n\nIn other news the Mass Adoption Youtube channel has gained some solid traction since our Jason Lowrey speech the other night. Pretty cool to see this kind of growth on our videos. I like the idea of trying to make a company out of our Bitcoin meetup. I'm sure we need a lot more followers to really make some serious cash, but apparently at 1k subs and 4k views you can start monetizing your content. We have nearly 2.5k views at the time of this writing and ~150 subs so we are trending in the right direction.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FfL23a7nqh1M%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DfL23a7nqh1M&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FfL23a7nqh1M%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThe future is bright and I can't wait to keep building.\n\nUsed chatGPT to write this thread and then edited it to make it more \"human.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1614761440295936000&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI imagine as this thing gets better and better less editing will be required. Exponential growth is hard to fathom and that's what chatGPT is going to experience. I could be wrong on the number but I believe if you could fold a piece of paper 64 times it would go from earth to the sun. The most people can fold is like 8 times or something depending on the paper. Anyways, might be off a little with those numbers but it gives you an idea how powerful exponential growth can be.\n\nCrushed a nice 5k today and it felt amazing. Running really does clear up the mind, body, and soul. That's all for today because it's a somewhat lazy Sunday for me and I want to watch more football. Stay safe, stay healthy, and don't forget to move.\n\n1/15/23\n\nConor Jay Chepenik",
  "wordCount": 370,
  "readingTime": 1.3962264150943395,
  "claps": 0,
  "voters": 0
}