{
  "id": "bc5d7c59364b",
  "title": "Day 18",
  "createdAt": "2022-04-10 03:29:49",
  "tags": [
    "glassblowing",
    "norfolk",
    "bitcoin",
    "open-source-science",
    "mf-doom"
  ],
  "url": "https://chepenikconor.medium.com/day-18-bc5d7c59364b",
  "content": "# Day 18\n\n![](https://miro.medium.com/1*uzCrAWDKiTb9-fJzt-Ub6w.jpeg)\n\n![](https://miro.medium.com/1*eDriPW3JydY-ORO14kPq2w.jpeg)\n\n![](https://miro.medium.com/1*VfwdH3dd4jeTv5Wu76OLjg.jpeg)\n\n![](https://miro.medium.com/1*jyrsk377Y_62u5XmxN88wg.jpeg)\n\nAt this point these Medium posts are just my new daily social media post. It's nice though because my main audience is currently me, myself, and I. So much good bitcoin content has been on these past couple of days courtesy bitcoin 22. I've also been having a kick exploring Norfolk and getting to meet some of the incredible glassblowers in the area. Today I even went and saw my sister do a live demonstration of glass blowing at [The Chrysler Museum Glass Studio](https://chrysler.org/glass/). My sister and her mentor made a glass heart and watching the show was mesmerizing. Norfolk is a charming town and Virginia seems like a cool place to live outside of the 14.5% sales tax. That part is ridiculous. I can't imagine trying to buy a $10,000 dollar car and having to pay $1450 for the right to do so. Seems like a gross abuse of our government's power to tax their citizens to transact when we already get taxed on said money for anyone who has a W2 or 1099.\n\nI love the last picture because it is so true. Everyone I've seen go down the Bitcoin rabbit hole has made a bunch of connections they didn't see before. As I understand it, Psycolsibin helps the brain communicate with parts it wouldn't otherwise be able to communicate with. It's very humbling and intense. Feels good to know there are powerful things at play in the universe we will likely never understand. Hopefully, after death I'll get some questions answered. Maybe it'll just be pure euphoria. Also possible death = nothing. However, life is a lot more fun if you believe the former. No one likes a pessimist.\n\nI also went to the musuem right next to my sister's glass blowing studio and I really appreciated the _Tightrope: Yellow Season_ painting because it was such an emotion-provoking photo made out of recycled material. Anything I've seen around ESG seems to be about control. If ESG was a pure effort to create a healthier environment I'd be for it. It's not so I oppose it. I remember Jordan Peterson saying on J.R.E *paraphrasing* \"You can not model the environment because the variables are endless. The farther out you get from your simulation the more exponentially wrong your predictions become.\".\n\n![](https://miro.medium.com/0*CID_9PWXLJrG1AFt)\n\nI've thought about this quote a lot since first hearing it muttered on one of the 🐐  podcasts of my time. (Sad that I have way more faith in a comedian than 99% of politicians but God Bless comedians) The power of exponential growth can not be understated. Anyone who says the Science is settled is an idiot. The Science will never be settled: it will only become better, more predictable, and lead to more questions that become more answers only to lead to even more questions. Open sourcing data is important to improving science. In order to constantly add and improve the variables used in algorithms to predict the environment scientists need to be able to collaborate. We can make better and better predictions, but the more we learn the more new variables that will need to be added to the algorithms. This growth over time becomes exponential and this typically leads to great improvements in the quality of human life. The more politics seeks into science and people can't debate, test, and form new hypothesis's the worse off societies become. Rules, Protocols, traditions, culture, etc matter deeply. Open sourcing data and letting humanity optimize to make everyone's life better is a good thing in my book. I think Bitcoin does a great job optimizing money in a way that gives its users exponential growth if they get skin in the game and educate themselves.\n\nFinal thought. My Sister killed it with this M.F Doom painting.\n\n![](https://miro.medium.com/1*9VgMCqLpq6mFXbG7_WrZ-g.jpeg)\n\n4/9/22\n\nConor Jay Chepenik",
  "wordCount": 636,
  "readingTime": 3.3499999999999996,
  "claps": 10,
  "voters": 1
}