{
  "id": "bce602ea5b5d",
  "title": "Committing To Writing Everyday For A Year",
  "createdAt": "2022-03-23 21:02:55",
  "tags": [
    "dedication",
    "writing",
    "input",
    "output",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/committing-to-writing-everyday-for-a-year-bce602ea5b5d",
  "content": "# Committing To Writing Everyday For A Year\n\nI'm going to look back on this post and either be really proud or upset with myself. I'd prefer the former so I'm making this public to hold myself accountable.\n\nRecently, I've been consuming a ton of content in the form of podcasts, books, and articles. This is great, but I've heard many people with far greater knowledge and experience than myself talk about how writing is a great way to solidify your ideas and thinking. Makes sense considering it is much easier to convince others over a drink than it is to convince them with your writing. (From my own personal experience I'm sure there is an introvert out there who disagrees with me) Coherently organizing your thoughts through writing is harder than it seems.\n\nMy hope with these posts is to help others learn as I do. Things that interest me right now include bitcoin, computer science, philosophy, technology, nutrition, and exercise. This is a working list and is likely to change as new things attract my interest and topics I was once fascinated by fade. As I understand it, the greatest way to increase your output into the economy is by providing value to others. There are tons of problems in the world and plenty of people are willing to pay to have these problems solved. Even the ones who aren't willing to pay are usually willing to suffer through targeted advertisements in order to use the service. *Cough cough Social Media* The greater one's education the more likely they are to be to solve these problems.\n\nI've increased my inputs and now it's time to start increasing my outputs. Until tomorrow anon.\n\nConor Jay Chepenik\n\n3/23/22",
  "wordCount": 287,
  "readingTime": 1.0830188679245283,
  "claps": 50,
  "voters": 1
}