{
  "id": "bded7f96801b",
  "title": "Day 503",
  "createdAt": "2023-08-08 00:19:28",
  "tags": [
    "bitcoin",
    "fiat",
    "twitter",
    "nostr",
    "incentives"
  ],
  "url": "https://chepenikconor.medium.com/day-503-bded7f96801b",
  "content": "# Day 503\n\nIf more people realized how ridiculous our banking system is I don't believe they would keep much money in the bank. Which is sad because the United States arguably has the most robust banking system in the world.\n\n![](https://miro.medium.com/0*522tMVltgGmNVDAG)\n\nI thought I forgot the technical term for when you deposit your money in a bank but it turns out I did not. You are an unsecured creditor.\n\n![](https://miro.medium.com/1*MXk9sWTf_XktGgBL-xu1hQ.png)\n\nIf you are a big enough bank though it appears the Feds are now willing to bail out depositers (looking at you Silicon Valley Bank). Fractional reserve banking is wrong and I will gladly type about it from the rooftops.\n\nIn other news I don't have much to report on today. Went for a hill run which I always do when visiting my girlfriend's family in New Jersey. Proud to say I ran non-stop the whole time which can be a challenge because these hills are no joke.\n\nI've also spent time today doing a read of this article from 1996. Aged quite well in my opinion.\n\n<iframe src=\"https://drive.google.com/viewerng/viewer?url=http%3A//www.truevaluemetrics.org/DBpdfs/BlockChain/Nick-Szabo-Smart-Contracts-Building-Blocks-for-Digital-Markets-1996-14591.pdf&embedded=true\" title=\"\" height=\"780\" width=\"600\"></iframe>\n\nIt is taking me some time to get through it but when I finish I'll share the Youtube here. So yea pretty uneventful day but that's alright it is nice having some relaxing days to enjoy.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/anilsaidso/status/1688632406599929856%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWent to Twitter to find a post I saw earlier and wanted to write about but saw this meme that I had to share. Then of course I couldn't find the post because I don't follow the account. It was a post of a fat guy who is losing weight and posting about it on Twitter. Which is incredible. The guy now has over 62k followers and got paid over $1,000 dollars by Twitter for his impressions. Truly amazing but the dark side is the fact you have to have a blue check and 5 million impressions (a month I think but could be wrong on that number).\n\nNostr fixes this. Anyone can earn on Notes and other stuff transmitted by relay without a blue check or 5 million impressions. I could try and explain the problems with Twitter's blue check agenda but Odell does such a better job than I ever could in this episode.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F-Ms-dE6aasA%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D-Ms-dE6aasA&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F-Ms-dE6aasA%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nSo after failing to find the thing I wanted to find while scrolling Twitter I came across more fiat disrespect. So I'll end this post with another worthy video that I recommend watching.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/profstonge/status/1688527914139332608%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n8/7/23\n\nConor Jay Chepenik",
  "wordCount": 405,
  "readingTime": 1.9116352201257862,
  "claps": 0,
  "voters": 0
}