{
  "id": "be23340d5a4e",
  "title": "Day 687",
  "createdAt": "2024-02-08 04:59:00",
  "tags": [
    "anarchism",
    "society",
    "you",
    "dont",
    "speak-for-me"
  ],
  "url": "https://chepenikconor.medium.com/day-687-be23340d5a4e",
  "content": "# Day 687\n\n![](https://miro.medium.com/0*-PayTYOzA95Zdar2)\n\nI like how Micheal Malice describes anarchism. The elevator pitch is this: You do not speak me for. A simple way to denote to other people that they don't get to vote on my rights as a human being. Building a society based on cooperation, not coercion sounds great. Let's explore anarchism.\n\nThe prevailing narrative often frames politics as a battle between left and right, yet this oversimplification misses the essence of the true conflict: establishment versus anti-establishment. In this vast & intricate game of politics, it's not about ideological spectrums but about those who maintain the status quo for personal gain versus those who challenge it to create value. Entrepreneurs competing with each other until the price of goods reaches their marginal cost of production is a good thing. Unfortunately, the state interferes with this constantly.\n\nContrary to widespread belief, an overwhelming majority of individuals, exceeding 99%, occupy the role of observers rather than active players within the political landscape. They remain on the periphery, witnessing a select minority navigate the direction of their futures, often devoid of their approval or interest. This stark division underscores a critical deficiency in our political dialogue: it is a scenario where a handful dictate on behalf of the masses, prioritizing personal gain over the collective interest. This phenomenon is not without reason. It stems from a fundamental understanding of human nature: individuals are inherently more reliable when acting in their self-interest. However, by structuring society to harmonize personal incentives with collective well-being, we can foster a system where self-serving actions inadvertently contribute to mutual prosperity.\n\nMichael Malice's interpretation of anarchism offers a compelling framework for understanding these dynamics. Describing anarchism as the best way humans know how to deal with each other, Malice champions a philosophy of self-governance, personal autonomy, and a rejection of the coercive power structures that define the establishment. His perspective illuminates a path forward that transcends traditional political binaries, advocating for a society where individuals are free to create, contribute, and thrive without the oppressive hand of rent-seeking authorities.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FQSNLF3F7mlI%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DQSNLF3F7mlI&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FQSNLF3F7mlI%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThe true challenge lies not in choosing a side between left and right but in recognizing and confronting the deeper conflict between the establishment and the anti-establishment. By embracing the principles of anarchism, as eloquently described by Michael Malice, we can begin to dismantle the bad ideas which stifle innovation and give state actors the right to abuse others. I think Bitcoin will be a huge help ushering in this new paradigm, rooted in the values of autonomy, collaboration, and mutual respect. These ideas offer a blueprint for a society where everyone is an active participant, not a spectator. Where the creation of value supersedes the extraction of it by 1000x fold. You do not speak for me is not just a statement of dissent but a declaration of independence, marking the way toward a more prosperous, decentralized, and genuinely free society.\n\nThat's how I perceive anarchism anyways. I feel like it unfairly gets a bad rep. Less monopolies and more freedom sounds like a great way to help society function better. 🤷‍♂️\n\n2/7/24\n\nConor Jay Chepenik",
  "wordCount": 527,
  "readingTime": 2.188679245283019,
  "claps": 3,
  "voters": 1
}