{
  "id": "bef02ec9347d",
  "title": "Day 721",
  "createdAt": "2024-03-13 02:07:37",
  "tags": [
    "inscriptions",
    "ordinals",
    "data",
    "magic-eden",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-721-bef02ec9347d",
  "content": "# Day 721\n\nI recently did my first Bitcoin inscription. It felt good because one day I will die, but my name will live on in Bitcoin's blockchain for as long computers are still running Bitcoin.\n\n> [**Inscription 64125106**](https://ordinals.com/inscription/bc2702612fb830af7aadc3e5ce491da223a6ea0043ce29dd6ded1dc3c00869f8i0)\n\n![](https://miro.medium.com/1*GUWSr7Sc1pzaLP0ZJUWhsQ.png)\n\nThis is so cool. I spent roughly $10 USD worth of BTC to make this happen. To have your name etched in something which will live on for a long time for that cheap is amazing.\n\nI've got a lot of reasons to love Bitcoin, but being able to preserve data for that long is truly incredible. I myself have underestimated how easy it is to lose data in a world that is constantly being flooded with new data.\n\nBullish on humanity and bullish on Bitcoin:\n\nFuture looks bright!\n\n— - - - - - -\n\nEnded up writing even more on this exact topic for bitcoinnews so I wanted to share it here before it gets edited and put on their site:\n\n**Magic Eden Ordinals: A New Way Of Preserving Data**\n\nMagic Eden, a leading name in the cross-chain NFT marketplace, is now pioneering the integration of Ordinals into their platform, representing a novel way to mint and transfer digital assets on the Bitcoin blockchain. Leveraging its leadership in the space, Magic Eden has made it seamless to harness the decentralized and immutable nature of Bitcoin, ushering in a new era of digital collectibility. Remarkably, for around $10, users can indelibly inscribe their names onto Bitcoin's blockchain, etching their digital legacies for as long as Bitcoin exists.\n\nThis temptation is difficult to resist while the opportunity remains affordable. However, as Bitcoin continues to appreciate in value, so too will the cost of block space, implying that the ability to inscribe one's name, and the name of their family may not remain this inexpensive indefinitely.\n\n![[https://ordinals.com/inscription/bc2702612fb830af7aadc3e5ce491da223a6ea0043ce29dd6ded1dc3c00869f8i0](https://ordinals.com/inscription/bc2702612fb830af7aadc3e5ce491da223a6ea0043ce29dd6ded1dc3c00869f8i0)](https://miro.medium.com/0*4_SRS1okRPbjeWOq)\n\n**The Ordinals Protocol and Inscriptions Explained**\n\nOrdinals and inscriptions represent a novel utilization of the Bitcoin blockchain, where each satoshi (the smallest unit of bitcoin) can be uniquely identified and associated with digital data such as images, videos, or text. This technology enables the creation of non-fungible tokens (NFTs) directly on the Bitcoin blockchain.\n\nThe Ordinals protocol assigns a sequential number to each satoshi, known as an ordinal number, based on the order in which it was mined. This unique identification allows satoshis to carry distinct data, rendering them individually significant and traceable across transactions. Inscriptions are the process of embedding data into these satoshis, effectively creating a Bitcoin-native digital artifact or NFT. Unlike traditional NFTs that may reside on separate blockchains or utilize smart contracts, ordinal inscriptions are fully integrated with the Bitcoin blockchain.\n\nHowever, it is important to note that the ordinal software itself is not a part of Bitcoin. It is a separate software that individuals run alongside their Bitcoin node to number satoshis. Inscriptions, on the other hand, do reside in Bitcoin itself, permanently embedded within the blockchain's satoshis. Since they are part of the actual Bitcoin blockchain, these ordinal inscriptions inherit the core properties of the network, such as its security, immutability, and decentralized nature.\n\n**Enabled by Bitcoin Upgrades**\n\nThe ability to inscribe data onto satoshis became feasible with Bitcoin's Segregated Witness (SegWit) and Taproot upgrades, which allowed for more extensive and flexible data inclusion in transactions. SegWit, for instance, separated witness data (including signatures and scripts) from transaction data, enabling the inclusion of arbitrary data without impacting the core transactional integrity of Bitcoin.\n\nEvery engineering decision involves tradeoffs, yet it's fascinating to observe how these upgrades have facilitated the emergence of a new marketplace. This marketplace uniquely leverages Bitcoin for two key purposes: storing the data of the products (inscriptions) being sold and serving as the medium of exchange for transactions.\n\n![[https://x.com/DylanLeClair_/status/1767616364745806104?s=20](https://x.com/DylanLeClair_/status/1767616364745806104?s=20)](https://miro.medium.com/0*QRJPGAa9lN1rjPEQ)\n\n**A New Frontier and Point of Contention**\n\nOrdinal NFTs represent a double-edged sword within the Bitcoin community. The tech is hailed by many as an innovative frontier for digital ownership and creativity on the blockchain, yet also a point of contention due to concerns over blockchain bloat and prioritization of block space usage.\n\nThese dichotomies are valid grounds for both excitement and caution. However, Bitcoin's bottom-up, permissionless nature ensures that debates around Ordinal NFTs will likely persist, as no central authority can dictate their acceptance or rejection. If some view inscribing family names on the blockchain as frivolous, they cannot unilaterally prevent others from doing so, as threats and coercion ultimately prove ineffective and unsustainable in Bitcoin's decentralized ecosystem. This stands in sharp contrast to fiat systems, where coercion is a common practice, largely facilitated by the ability to print money out of thin air. This centralized financial power, inherent in every fiat currency, provides the means to fund enforcement actions, reinforcing the role of coercion in these governance models.\n\nThe stark contrast between bottom-up and top-down systems underscores the elegance of Bitcoin's permissionless innovation. While contentious, Ordinal NFTs exemplify the blockchain's ability to organically evolve and accommodate new use cases, with the free market and community consensus determining their long-term viability and impact.\n\n![[https://x.com/RussellOkung/status/1767592310865297530?s=20](https://x.com/RussellOkung/status/1767592310865297530?s=20)](https://miro.medium.com/0*b5_W6_cIYm0tOpvz)\n\n**In Conclusion**\n\nOrdinals and inscriptions usher in an exciting approach to leveraging Bitcoin's blockchain for digital asset creation and management, seamlessly amalgamating the concept of NFTs with the foundational technology Satoshi created. While some inscribed projects or artwork look like they are made by a child that is exploring AI and photoshop, others aim to immortalize meaningful works, such as [Julian Assange's WikiLeaks documents exposing war crimes.](https://projectspartacus.org/)\n\nSimultaneously, a subset of enthusiasts simply seeks to etch their names into the blockchain, preserving their legacy for a long time. The true beauty of this innovation lies in its permissionless nature. Regardless of one's passion or purpose, be it artistic expression, historical preservation, or personal immortalization, the Bitcoin blockchain embraces all, granting the freedom to inscribe any data - as long as one possesses the necessary satoshis to cover the transaction fees. As this domain progresses, the varied viewpoints within the Bitcoin community will guide its development, with the free market and collective consensus deciding the lasting significance of this promising technology.\n\n3/12/24\n\nConor Jay Chepenik",
  "wordCount": 1017,
  "readingTime": 4.537735849056603,
  "claps": 0,
  "voters": 0
}