{
  "id": "c1285f8f8d4d",
  "title": "Day 46",
  "createdAt": "2022-05-07 14:30:25",
  "tags": [
    "technology",
    "powerful",
    "bitcoin",
    "moores-law",
    "twitter"
  ],
  "url": "https://chepenikconor.medium.com/day-46-c1285f8f8d4d",
  "content": "# Day 46\n\nOne thing I've noticed about my life is I have fads. When I was young it was Pokemon, Yu-Gi-Oh, and NFL cards. In college, I loved Fortnite and making movies. Now I'm obsessed with Bitcoin and Twitter (because that is where I find the most Bitcoin maxis). While the platform can be great the internet is full of some shit. My god, cyberspace is so vast. Filled with all sorts of amazing and horrendous stuff.\n\n![](https://miro.medium.com/1*KxdAYQlMVciLpevtaaCsPg.jpeg)\n\nI wouldn't be surprised if I move on from Twitter at some point to another social media platform, but for the time being it is my favorite. I don't think Bitcoin will be a fad because it is either going to make the world a better place or we get central bank digital currencies and the world is going to look like George Orwell's 1984. Considering I don't want to raise a kid in the latter environment I'm going to continue preaching the 🍊  💊  to anyone willing to listen. Luckily, Bitcoin Twitter reminds me I am not alone and [Moore's Law](https://www.youtube.com/watch?v=lCbcIFAtB0A) makes it seem like the possibilities for things that can be built on Bitcoin will only continue to grow.\n\nI bring all this up because it is important to filter your internet time. I need to be much better about how long I spend on the bird app. Learning about Bitcoin is fantastic. Frying my dopamine receptors not so much. Technology is such a pendulum. Allowing for incredible things while also giving powerful organizations a much greater ability to impose top-down controls. The only solution I see is Bitcoin because everything else will be co-opted by the powerful. Like I said in the past, I'd love to be wrong. I just don't see the most powerful institutions on this planet giving up power willingly. They will try to be rulers as long as they can. Luckily, when you have to enforce your rules by decree (Fiat means [an authoritative or arbitrary order](https://www.merriam-webster.com/dictionary/fiat) by the way) you expend massive amounts of resources. Resources are finite and these institutions can only keep up the game for so long until they run out of resources. They can print unlimited amounts of money at this point, but because the laws of thermodynamics won't change, no matter how much they print there is only so much people are willing to do for fiat currency. If we have learned anything from these past 2 years it is that the people in power want rulers, not rules. Bitcoin does not require coercion and those who use it are happy to expand their resources on it because it is a finite asset with rules and no rulers. I love writing about Bitcoin because it makes me feel like I'm picking the right store of value.\n\nWhile I love Bitcoin it is important to remember life is not just about magic internet money. One thing that is pretty easy to implement in my day-to-day is taking time to go tech-free. I do feel good about learning and reading more since I got into Bitcoin. However, there is only so much I can process at once, and reflecting and being alone with my thoughts is crucial to development. Most of life seems to be imitation so I think it would do me a lot of good to think through my own values rather than those found on Bitcoin Twitter. Obviously, I don't get all my opinions from random anon plebs, even though they have some great takes lol. It is just important that on my journey I start to figure out who I am. Can't grow if you are just cherry-picking other people's ideas that you like.\n\nAnyways, be safe out there anon. Put yourself and your loved ones first and don't ever apologize for it.\n\n5/7/22\n\nConor Jay",
  "wordCount": 646,
  "readingTime": 2.637735849056604,
  "claps": 0,
  "voters": 0
}