{
  "id": "c12b1028eed8",
  "title": "Day 213",
  "createdAt": "2022-10-22 02:03:54",
  "tags": [
    "urbit",
    "bitcoin",
    "rabbit-holes"
  ],
  "url": "https://chepenikconor.medium.com/day-213-c12b1028eed8",
  "content": "# Day 213\n\nListened to a \"What Is Money\" Show with the guy who held up the Bitcoin sign behind Janet Yellen and I'm impressed. Homie is working on a sick new operating system project.\n\n![](https://miro.medium.com/0*DuWOU5e14RgaRBfD)\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F4DWI2QaS76gcLHOYAEu4iU%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F4DWI2QaS76gcLHOYAEu4iU&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f93b73680d271042f05d89869&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nI have a lot more research to do but from what I heard on that podcast it seems like this [https://urbit.org/](https://urbit.org/) thing is going to revolutionize the internet in the same way Bitcoin is revolutionizing money! Exciting times and I plan to do a nice deep dive into Urbit. Might even mess around and run an Urbit OS on my home server. I'm pretty excited to go down this rabbit hole.\n\nRead the intro on the Urbit website and it makes sense to me. I had not thought about the current internet's tech stack being a \"frankenstack\" but it definitely is the more I learn about technology. Going down the computer science rabbit hole has been cool, but it has also been eye opening in a scary way. The power companies like Amazon, Apple, Facebook, Twitter, and the likes have is crazy. Urbit seems like it can break up some of these monopolies and give people a better option for \"being\" online.\n\nI do appreciate the services many of the above mentioned companies provide. I also appreciate the banks I use because they make my life easier. I'm very glad to hold some Bitcoin that is off an exchange as well in case my banks fail. Not saying that is likely or something I want to happen. Just pointing out it is nice the piece of mind I have knowing if all the major banks in the U.S failed because our money hyper-inflated, people realized fractional reserve banking was a scam and a bank run happened, or some black swan event that I couldn't predict in a million year occurs I will be okay. Bitcoin is an assuring backup. I feel like Urbit can provide the same back up for one's internet presence. I don't want to lose access to any of the services mentioned above or hell this Medium. I would be very sad, but I would also feel better knowing that something like Urbit is out there ready for me if these internet 2.0 companies tried to ban ya boi.\n\nBetter to be over-prepared and not have needed the extra prep than to be under prepared and deal with the consequences. I will say the internet is incredible. I googled \"AI art generator\" typed in \"futuristic computer\" to the first website that popped up and got this image below.\n\n![[https://creator.nightcafe.studio/](https://creator.nightcafe.studio/)](https://miro.medium.com/0*p0CG13qw_pqbrBl7)\n\nLike that is FREAKING AWESOME. Truly incredible the things computers can give us but I worry complacency will cause many negative effects for humanity in the long term if we don't decentralize some of the power computers can give to humanity. Bitcoin decentralized money like never before and I'm excited to dig down this Urbit thing and see if it truly does the same for the TCP/IP protocol that many of us have never interacted with (We've interacted with layer 2, 3, 4 and so on but I can confidently say I've never interacted with the layer 1 protocol of the internet) At least I don't think I have. Need to keep digging down the rabbit hole. So many damn rabbit holes hahahhahahhaha\n\n10/21/22\n\nConor Jay Chepenik",
  "wordCount": 554,
  "readingTime": 2.4738993710691823,
  "claps": 0,
  "voters": 0
}