{
  "id": "c17c67d40bce",
  "title": "Day 360",
  "createdAt": "2023-03-18 01:50:00",
  "tags": [
    "chatgpt"
  ],
  "url": "https://chepenikconor.medium.com/day-360-c17c67d40bce",
  "content": "# Day 360\n\nI've talked about this before but it seems more and more relevant everyday. How will colleges keep up when the cost of getting an education online is trending to zero? I hope going to the library, verifying your sources, etc stay relevant as AI makes it easy to learn almost anything. I don't want people to be lulled into believing everything AI spits out when it clearly has bias programmed in. Then again, college has psy-oped a lot of people into believing utter bullshit so who knows. College has also been helpful in many ways for a lot of people. The experience is what you make of it and while I wouldn't trade my college experience there were probably cheaper ways to get a film and media major. I guess it helped me parse through the mainstream media bs these past few years a little bit faster but anyways I digress.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/BrianRoemmele/status/1636521526790074369%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nWhat an amazing tool. Highly recommend using that prompt in chatGPT to learn. I did it for Computer Science and learned a good bit. Amazing you can just ask it questions. Will have to do it for English next. Got to keep improving my writing ;)\n\nWell I had a lil case of writers block tonight so that's exactly what I did. This is what it returned.\n\nchatGPT: Section 1: The Writing Process In this section, we will explore the writing process, from generating ideas to revising and polishing your work. You will learn strategies for overcoming writer's block, organizing your thoughts, and drafting effective paragraphs and essays.\n\nTopics covered:\n\n- Brainstorming and freewriting\n\n- Outlining and organizing\n\n- Drafting and revising\n\n- Editing and proofreading\n\nStep-by-step guide:\n\n1. Brainstorm: Think about your topic and generate a list of ideas.\n\n2. Freewrite: Write down everything that comes to mind about your topic, without worrying about grammar, spelling, or structure.\n\n3. Organize: Use your ideas to create an outline or a mind map.\n\n4. Draft: Write your first draft, focusing on getting your ideas down on paper.\n\n5. Revise: Review your draft and make revisions for clarity, coherence, and conciseness.\n\n6. Edit: Proofread your revised draft for grammar, spelling, and punctuation errors.\n\n7. Polish: Make final edits and formatting changes to create a polished, professional final draft.\n\nAre you ready to continue to the next section?\n\nMe: proceed\n\nchatGPT: Great! Let's move on to Section 2: Grammar and Style.\n\nSection 2: Grammar and Style In this section, we will focus on the nuts and bolts of writing, including grammar, punctuation, and syntax. You will learn how to write clear, concise sentences that effectively communicate your ideas.\n\nTopics covered:\n\n- Parts of speech\n\n- Sentence structure\n\n- Punctuation\n\n- Active vs. passive voice\n\n- Clarity and concision\n\nStep-by-step guide:\n\n1. Identify the parts of speech: Review the different parts of speech, including nouns, verbs, adjectives, adverbs, and pronouns.\n\n2. Analyze sentence structure: Understand the different components of a sentence, including subject, predicate, and clauses.\n\n3. Use correct punctuation: Master the rules of punctuation, including commas, semicolons, and apostrophes.\n\n4. Choose active voice: Write in the active voice to create more dynamic and engaging sentences.\n\n5. Be clear and concise: Use clear and concise language to communicate your ideas effectively.\n\nHere's an example to illustrate these concepts: Original sentence: The dog ran quickly through the park, which was filled with many people, and he barked loudly at a squirrel that was climbing a tree. Revised sentence: The dog sprinted through the crowded park, barking at a squirrel in a tree.\n\nAre you ready to move on to the next section or do you have any questions or concerns about grammar and style?\n\nMe: Explain this like im 11 Analyze sentence structure: Understand the different components of a sentence, including subject, predicate, and clauses\n\nchatGPT: Sure thing!\n\nWhen we talk about sentence structure, we're talking about how sentences are put together. There are a few important parts that make up a sentence, including the subject, the predicate, and clauses.\n\nThe subject of a sentence is the person, place, thing, or idea that the sentence is about. For example, in the sentence \"The cat sat on the mat\", the subject is \"the cat\", because that's what the sentence is about.\n\nThe predicate is the part of the sentence that tells us what the subject is doing. It usually includes a verb, which is a word that describes an action or a state of being. In the sentence \"The cat sat on the mat\", the predicate is \"sat on the mat\", because that's what the cat is doing.\n\nFinally, a clause is a group of words that has a subject and a predicate. A sentence can have one or more clauses, and each clause can express a complete thought. For example, in the sentence \"When the cat sat on the mat, it purred contentedly\", there are two clauses: \"When the cat sat on the mat\" and \"it purred contentedly\". Each clause has its own subject and predicate, and together they make up the full sentence.\n\nI hope that helps! Let me know if you have any more questions.\n\n...\n\nNow I know you might be thinking ehhh whatever. Who cares. Well for those who didn't grow up speaking English this is amazing! So powerful. I can use this thing to learn Spanish. Actually sent my sister a thread about that today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jbrukh/status/1636421694687461392%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI mean seriously the possibilities are endless. This tool is just going to get exponentially better. Buckle up humanity. We are in for a wild ride.\n\nOn the bright side this means I probably won't have to worry about saving for my kid's college tuition. I will work with her and chatGPT to learn as much as possible and if we get some bias programming will go to the local library and see if we can find a different opinion. I'm excited for humanity to become more productive which in turn with a hard money like Bitcoin means people will get to work less and enjoy life more. That's my hope at least.\n\n*I do think saving is important and doing so in bitcoin I believe will help me be in a position where I can send my kid to college if need be. I just don't know if college will be what it is today in 18 years when my kid is getting ready to go*\n\n3/17/23\n\nConor Jay Chepenik",
  "wordCount": 1053,
  "readingTime": 3.973584905660377,
  "claps": 3,
  "voters": 1
}