{
  "id": "c251b85d3a80",
  "title": "Day 61",
  "createdAt": "2022-05-22 13:39:55",
  "tags": [
    "modern-art",
    "climate-change",
    "parenting",
    "philosophy",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-61-c251b85d3a80",
  "content": "# Day 61\n\nWow look at this masterpiece and tell me it doesn't provoke an emotion.\n\n![Pierre Rignnat 15th century medevil painter](https://miro.medium.com/1*YrHCWEBIcSoCW_wFRKJOAg.jpeg)\n\nSo simple yet so profound. Modern art before modern art was even a legitimate thing. Painted with actual feces this piece was done by Pierre Rignnat who resided in what is now Sicily, Italy. Amazing how someone could convey so much with so little back then. An absolutely incredible piece that inspired some of the greatest minds and propelled us into the most advanced times the world has ever seen. When I look at this I am reminded of _The Bitcoin Standard_ by Saifedean Ammous. The reason? Because I made this horrible piece of art in 15 seconds on Procreate with my Ipad. Wanted to emphasize Saifedean's point that in our high time preference society bullshit often gets passed on as solid gold. I've honestly always been a fan of modern art but I imagine a big part has to do with my upbringing. The more I look at modern buildings the more I feel Saifedean might be right. Most stuff today is not built to last. While I do like the glass homes and modern appliances, some of the most charming and well-built stuff was from previous centuries. You would think with humanity's advancement in technology we would have much higher quality stuff, but the high time preference of most people, organizations, and governments has given us the opposite. Thus, keep a sharp eye, and do not be afraid to call bullshit anon. There is some brilliant modern art out there and there is even more bullshit like this 15-second drawing I made this morning. The beautiful thing is that Art is completely subjective so maybe there is someone out there who likes my piece. If you do feel free to hit copy, paste, and make it your own. That is what the internet is good for :D.\n\nSpeaking of stuff that provokes an emotion I thought this pic of Johnny Depp and Amber Heard was beautiful. Have not been keeping up with the trial because if they won't televise the Ghislaine Maxwell trial, but they will televise this one that's all I need to know. Screw the mainstream media for saying look over here but not there. Anyways I digress, check out this badass, emotion-provoking picture of the two before shit went south.\n\n![](https://miro.medium.com/1*5ThA3awbf5Yrdz26TMIYdQ.jpeg)\n\nThat red whip is so fire. Also the passion in both these people's eyes. Sometimes it takes a little crazy on both sides to have a passion that is unlike anything the world is seen. As I said, haven't been paying much attention to the trial, but I hope the truth comes out and Johnny and Amber can live happy lives once they get out of the public arena. It might be fun for the public to watch, but it has got to be an absolute pain in the arse to have your private life broadcast all over the airwaves. In other news I thought this was some of the best parenting I've witnessed over the internet.\n\n![](https://miro.medium.com/1*6_Em-GQRZt0QIGHlMHYhRg.jpeg)\n\nHahahahhaha such a perfect example of how people will try and virtue signal up until you actually call them out on their bullshit. Yes the world needs to be more green, but it can be achieved with Nuclear power, hydro power, and other reliable sources of energy. Wind and Solar are not cutting it. We need legitimate reliable sources of energy yet most people just want to flaunt their Tesla and look like they're helping without actually considering where the electricity they charge their car with is coming from. Energy makes our modern world possible and yet so few people seem to realize this. I will do my best to raise my unborn child to understand how important energy is while reminding them it is not something to take for granted. If they try to protest climate change without taking any action to actually help climate change they are going to learn a lesson similar to the one Dave's children just learned lmao. To top of this Sunday edition let's discuss Bitcoin.\n\n![](https://miro.medium.com/1*4vCZabCX-4Iy9l8ndpYCzQ.jpeg)\n\nYou have to be able to make fun of yourself if you want to succeed in this world. OBVIOUSLY BITCOIN HAS REAL BENEFIT😤🙄 . At least I hope it does because if not it is going to get ugly for me hahaha. Jokes aside, I think the benefit of being able to store your value in an asset that can't be debased can not be understated. We are witnessing massive problems arise from the trillions the United States government printed and I'm hopeful Bitcoin can correct some of these problems. I don't know how it all plays out and at this point we are so early in the journey a lot can happen. I do know the longer the chain exists the more likely it will be to succeed. Bitcoin is truth, Bitcoin is hope, and unlike Philosophy Bitcoin can act as the next global reserve currency. Philosophy is important because it teaches people to think for themselves. It shows them we have complex problems and there is something useful about thinking through them. Bitcoin is just math, engineering, energy, truth, and decentralization wrapped together perfectly. Slowly but surely bitcoin is getting ready to become the next global reserve currency. I believe in it so I will keep putting my evil fiat in sats (outside of bills and other things I still need to use fiat for at the moment). Can't wait till we get to the point where I'm buying stuff with sats. I have bought stuff in the past with sats, but I mean everyday use. Like going to Starbucks and buying my morning coffee with sats.\n\n![](https://miro.medium.com/1*uE1f0DRKV8904MMVNe_kIw.jpeg)\n\nPeace and love anon.\n\n5/22/22\n\nConor Jay Chepenik",
  "wordCount": 958,
  "readingTime": 4.448427672955975,
  "claps": 0,
  "voters": 0
}