{
  "id": "c299215a344f",
  "title": "Went To Dinner Without My Phone",
  "createdAt": "2021-11-12 14:06:23",
  "tags": [
    "technology",
    "dopamine",
    "depression",
    "therapy",
    "honesty"
  ],
  "url": "https://chepenikconor.medium.com/went-to-dinner-without-my-phone-c299215a344f",
  "content": "# Went To Dinner Without My Phone\n\nLast night my girlfriend asked me to go out to eat without our phones. The second I heard this I knew it was a good idea, but my first reaction was shit how will I get by without my phone. There have been multiple times I've thought to myself yea I'm addicted to my phone, but the visceral feeling that shot through my body upon realizing I wouldn't get my dopamine fix for a few hours was the nail in the coffin.\n\nRecently, I've been feeling depressed. Very mild depression, but I find myself sitting at work being annoyed I have to sit through a meeting. Currently I work in sales and cold calling people has become such a chore. I'm very fortunate that I have a good support system in place and I try to exercise, read, and get sunlight to feel better. All those things help tremendously, but sometimes I can't shake this existential dread that makes waking up on Monday for work an absolute bitch. My guess is there are a couple of factors at play.\n\nThe first thing that erks me is I feel like the government is overreaching. I saw this [article](https://aaronsiri.substack.com/p/cdc-admits-crushing-rights-of-naturally) about the CDC begrudgingly admitting people with natural immunity don't spread the virus, but at the same time we are seeing our nation segrated between people who are and are not vaccinated. This is ridiculous and even though I did decide to get vaccinated I think mandates should be highly illegal. It's evident that big pharma and the White House are working together otherwise mandates would be out of the question for a vaccine that still has a lot of unknowns. Lex Fridman said it best on his [podcast](https://www.youtube.com/watch?v=mRZE-SJShkE) with the director of the \"NIA\". I'm paraphrasing but Lex said, \"It's sad that such a great scientific achievement like coming out with a vaccine so fast is not celebrated, but instead approached with skepticism because so many have lost faith in our government\". I agree wholeheartedly and it is discouraging to see Washington not being able to stop spending, thus the Fed can't stop printing, and now the solutions are becoming more ridiculous. It's amazing how long it took the talking heads of the mainstream media to admit that inflation is not transitory, which of course it never was, but to people who aren't doing a deep dive past the bullshit how are they to know any better?\n\nIt's great we have information so quickly and I can use the internet to find out almost anything. Look at stocks for example. I don't have to call a stock broker to buy, sell, or check on my portfolio. I can do it instantly with Robinhood, Sofi, and a plethro of other apps. The downside in this age of information is that there is always something for me to consume. This has led to me having an incredibly short attention span. Multiple times at dinner last night my thoughts started wandering off and I didn't hear a word of what my girlfriend was saying to me. Luckily, she's a smart cookie and called me out. I readily admitted I didn't mean to lose focus on what she was saying, but I just zone out without thinking about it. My buddy's in college used to joke I was a space cadet because I would just stare off into space at the most random of times, but truth be told I think I just have an incredibly short attention span.\n\nFinally, I feel helpless at times. It genuinely feels like the cards are stacked against the people because the ones with the monopoly on violence (The U.S Government in my case) are addimant about not giving up any control. I mean the tweets the White House is putting out are ridiculous: so tone deaf. I'm not going to link the White Houses twitter to this post, but I remember seeing one post mention how the 3.5 trillion dollar spending bill they were trying to pass was free. It's almost as if they are spitting in the face of every U.S citizen because to print 3.5 trillion dollars and call it \"free\" is a disgrace. It saddens me more people don't protest this, but the sad truth is the government makes simple things seem big and complicated so people just go along with their bullshit. After a little research it appears the federal government's mandatory spending for fiscal year 2021 will have to be [2.966 trillion](https://www.thebalance.com/current-u-s-federal-government-spending-3305763) because many people are starting to retire and will need their social security. The irony is the government has been spreading F.U.D calling Bitcoin a ponzi scheme when social security is the real ponzi scheme. I used Indeed to look up the [average salary](https://www.indeed.com/career-advice/pay-salary/average-salary-in-us) of a U.S employee and not one state is it over 100k. Now I'm not sure having the average salary be upwards of 6 figures will solve the problem, but I know it's becoming harder and harder to live on an average salary as the government crushes the purchasing power of the middle and lower classes.\n\nIt feels good to just write down my thoughts. Let it all out. It's almost like therapy in a way which I have honestly never tried. Maybe I should try a therapist; I've heard really good things from close friends of mine about how their therapist helped them tremendously. I do feel much better having written my thoughts out. I'm very fortunate to live in the United States and while I might only be one person I hope this resonates with others and they too stand up to the U.S government's bullshit when they can. It's easy to get upset in this technological world where our phones and devices constantly flood our brain with dopamine. Thus, it is important to take breaks from technology and get exercise, go outside, and express yourself through writing, creating, directing, or whatever else floats your boat. Who cares if your work is bad at first. Anything worthwhile takes tons and tons of practices. Putting yourself out there is the real challenge. I will leave you with this quote from Thomas Jefferson because I think it holds a lot of truth. \"When the people fear the government, that's tyranny; when the government fears the people, that's freedom.\"\n\n11/12/21\n\nConor Chepenik",
  "wordCount": 1059,
  "readingTime": 3.9962264150943394,
  "claps": 0,
  "voters": 0
}