{
  "id": "c304a791f8a2",
  "title": "Bitcoin Seems To Be Like Self Driving Cars: Inevitable.",
  "createdAt": "2021-12-02 03:39:20",
  "tags": [
    "self-driving-cars",
    "software",
    "pepe",
    "orange-pill",
    "inertia"
  ],
  "url": "https://chepenikconor.medium.com/bitcoin-seems-to-be-like-self-driving-cars-inevitable-c304a791f8a2",
  "content": "# Bitcoin Seems To Be Like Self Driving Cars: Inevitable.\n\nTypically humans have processes for doing things. For better or worse there are reasons why humans have put infrastructure and regulation in place for various services. These rules and regulations are much clearer in more developed countries, but I do believe (despite seeming otherwise) that a lot of these rules and regulations were meant to be beneficial to society. Over time innovations occur that completely disrupt this infrastructure and institutional inertia. As I understand it this is the innovators dilemna. You need people to update the rules but bearuacacy is never fast so you are stuck with issues when it comes to implementing your innovations. This brings me to incentives. You need to align the incentives of your innovation in a way where adoption will continue organically without compromising what makes the innovation so beautiful. Easier said than done, but Bitcoin is a great example of this and so are self driving cars.\n\nIt's incredible and scary all the things software can do to make our lives easier. Self-driving cars are one of the coolest inventions and literally turn road trips into Netflix and chill sessions. (Thank you for this [Tesla Motors](None)) Adoption of these vehicles won't happen over night because people are resitant of letting go of their gas vehicle, don't want to pay for an expensive EV, are scared to ride in a car driven by AI, or some combination. Truth is AI is only going to learn from itself over time and the amount of accidents that happen in AI driven vehicles will trend down to zero which will never be the case for human driven cars. This is not to say I want to get rid of gas cars because the opposite is true. I very much enjoy driving a manual vehicle. It's a visceral feeling and when I'm old I bet I'll miss the rush that you get from switching gears in a combustion engine vehicle. Innovation doesn't care about my feelings though and I 'd be a fool to assume that over time more people won't start to accept and become comfortable with the fact robots can drive better than humans. It seems like the same can be said for Bitcoin. When the Federal Reserve has two methods for executing their mission and one of them is Quantiative Easing (Printing money) they are going to print that money. Bitcoin doesn't have that problem and as more and more people realize this the idea of having Bitcoin as a global currency seems more and more likely.\n\nLike most change, Bitcoin will lead to painful experiences for plebs who don't do their own research and get rug pulled, scammed, or lose money due to their own incompetence. I want to do my part to help mitigate some of that pain by educating others about what Bitcoin is and why it's important for the world. Similiar to self driving cars this technology will piss people off, the early adopters will get to experience the greatest benefits, and people who don't understand it will continue to make egregious statements about technology they don't know. However, I'd be willing to argue any Bitcoin bought today with the intention of giving it to your children in 10+ years will appreciate greatly. I'm grateful I was born in 1997 so I get to experience how Bitcoin disrupts current instituional inertia and hopefully creates more freedom, libery, and self-sovereignity for not just the U.S.A, but for people around this planet we call Earth.\n\nPlease find below a Wise Oranged Pilled Pepe\n\n![](https://miro.medium.com/0*EOkOTZhw0GhuWQsr)\n\n12/1/21\n\nConor Chepenik",
  "wordCount": 603,
  "readingTime": 2.475471698113208,
  "claps": 1,
  "voters": 1
}