{
  "id": "c3474b1a1f14",
  "title": "Day 339",
  "createdAt": "2023-02-24 19:07:44",
  "tags": [
    "bitcoin",
    "dedication",
    "small-improvements",
    "smart",
    "rich"
  ],
  "url": "https://chepenikconor.medium.com/day-339-c3474b1a1f14",
  "content": "# Day 339\n\nWe all want to be smarter, richer, and more beautiful. Few are actually taking the necessary steps to achieve this result. So as someone who is not rich or beautiful I'll tell you the steps I am taking to become rich & beautiful.\n\nI've spent a great deal of time trying to learn about all the value 4 value platforms out t[[here](https://fountain.fm/conorchepenik?code=acccf4700d)](https://stacker.news/r/Chep). The ad-subsidized internet is not good for the end user who's attention is being sold by a third party. Value 4 value cuts out the middleman and allows both the consumer and producer of content to receive genuine value without having their attention sold to the highest bidder like in the ad model. Here are two platforms I've been enjoying a lot recently. Stacker News - check it out here and fountain.fm which you can check out here. The first is a great place to zap people sats and find some solid signal via links. Fountain is a podcasting 2.0 apps. Both links on this page are referral links so if you use them to check out the platforms I will earn a few sats. You can also just check each out by doing some searches. Fountain is better as a mobile app so if you're reading this on a laptop it would make more sense to use your phone to download Fountain.\n\nA lot of people censor themselves online because in a centralized platform they could risk being kicked out. Others simply censor because they don't want to get push back from their job. These aren't the only reasons people self-censor but they are the biggest two I can think of. If money was not an issue than less people would self-censor. There will always be the crowd who thinks that we should have some techno-fascist control by the elite and these people will push it by pretending this is the solution to save democracy. Like Sam Harris.\n\n![](https://miro.medium.com/1*K-uf8rZx5sRRvTjgMoBOIg.png)\n\nI mean come on...Horrible take. This is the same guy who said it didn't matter if Hunter Biden had corpses in his basement, he would not be worse than Trump. Which whatever Trump had his issues sure, but corpses in a basement?! Insane. So yea long story short move away from these centralized ad-subsidized platforms slowly now so you can practice free speech without having to worry about being deplatformed.\n\nSome quick math before I move on to the how to look beautiful fraction of this Medium. A whole Bitcoin equals 100,000,000 million satoshis which at the time of this writing is worth above 23k US dollars. If you could get 10 thousand people to donate 10k satoshis to you then you can earn a whole bitcoin. Now that's not the easiest feat in the world but 10k satoshis is only $2.31. If you spend enough time creating quality content and posting it on value 4 value platforms it is not unreasonable to think there will be plenty of people willing to zap you anywhere from 10-100k sats for the value you have provided them. Nostr is also an up and coming platform helping with this. I have not spent enough time there but I did post on Stacker.News to try and learn more so I can start providing value on it and earn some zaps. [Here is the link to the post](https://stacker.news/items/143232) if you have some insights or want to see if anyone provided quality links to things.\n\nFor looking beautiful I've been on a running kick. Like I talked about back in December I made a promise to myself that I would run 40 miles every month. I'm less than 2 miles from 40 in Feb and I hit over 40 in January. Find an exercise or activity you like and commit to doing a certain amount. Tell your friends about it, commit to doing it online, find a way to make sure you will be held accountable. Not exercising is hard and so is exercising. Choose your hard. Some people might be born ugly and if that's you well I'm sorry anon. You can still get in better shape. At the end of the day we can not pick our faces but we can shape our body. Plus it feels better when your system is firing on all cylinders because you treat it right.\n\nAs for the smart thing. Only advice I'll give on that is curate your content diet carefully and try to put what you learn into actionable activities. Learning how to code is amazing, but did you actually do anything with your new abilities? I'm far from finished with my coding journey but since starting I've enjoyed creating conorchepenik.com massadoption.net & binmucker.com and can confidently say most of the learning comes from actually doing. All of these sites need a lot more work done on them, but I'm just starting to learn backend technologies like node JS and I'm excited to have websites I've built the front end for so I can start integrating back end technologies. Practice makes perfect.\n\nSo yea if you want to be rich, smart, and beautiful start taking steps to become all of these things. No one is going to magically make you any of these things. Maybe technology lol, but you still have to work at them. Dedication > motivation. You got this anon. Go improve your life day by day.\n\n![](https://miro.medium.com/0*-mUF8TcmpaHa8YOW.jpg)\n\n2/24/23\n\nConor Jay Chepenik",
  "wordCount": 906,
  "readingTime": 3.8022012578616353,
  "claps": 8,
  "voters": 3
}