{
  "id": "c38922bc4d02",
  "title": "Day 170",
  "createdAt": "2022-09-09 01:05:31",
  "tags": [
    "bitcoin",
    "seltzer"
  ],
  "url": "https://chepenikconor.medium.com/day-170-c38922bc4d02",
  "content": "# Day 170\n\nLast night in my running group chat I made the joke if you do a run and you don't record it in Nike Run Club did you really do a run? It was a reference to the idea of a tree falling in the forest without anyone around to hear it. What's wild though is how easily digital data can be manipulated by those who control the data vs manipulating data in real life. Not to say there aren't some crazy optical illusions and ways to manipulate stuff in real life because if the three letter agencies in the U.S.A have shown us anything it is that people's perception in real life can definitely be manipulated. It's just a lot harder and your reach is a lot smaller in real life. For example, someone changed and then locked Wikipedia's definition of a recession when we saw 2 negative GDP prints. If that same group wanted to do so with hard books it would be nearly impossible to get every book. Their best bet would be to go in the library and cross out the page and replace it. At which point it would be clear someone had been manipulating the definitions. There is a way to see edits in Wikipedia but you have to have the technical knowledge to see that changes were made.\n\nIt is crazy how reliant on technology humans are as a species. From the early days of farming tools to the modern day data harvesting going on we have been using technology to make our lives easier, better, and more productive. As technology gets better though it can be a real double edged sword if we are not careful. I'm sure everyone thinks it's a good thing being able to chat with any friend/family member from the other side of the world. What they probably don't find to keen is the idea a nation-state can track their location 24/7/365 and target them in a wide variety of ways. The optimist in me believes deep down that technology will lead to humans flourishing as tools like Bitcoin help the masses protect themself from tyranny. I just hope more people can get on board before hyperinflation and the fiat on ramps get cut off. Maybe I'm wrong, but as far as I can tell it is just math and Bitcoin will become the network of money around the world while fiat debases gradually then suddenly. Another example of technology doing good is from an app Nike made. I love the Nike Run Club app and tracking my runs because it helps me compete with my friends and records stats about my runs that I enjoy viewing. I'm not saying I would not run if I didn't have NRC but I know I would run a lot less and it would be a lot harder to talk crap and become motivated via my running group chat. I'm not so worried about Nike messing with my data (which they definitely could if they wanted because all the data is hosted in their servers). I'm more worried about definitions (like recession) being manipulated by bad actors for their political gain.\n\nI've been dipping my feet in Comp-Sci as mentioned in some previous posts and it's really crazy how amazing applications are when in reality they are just a bunch of zeros and ones put together in a fancy computer program. It kind of hurts my brain to think about all the things you can build via 0s and 1s because technology gets exponentially better and you can use math, like exponents, functions, and algorithms to build cool stuff. It also excites me because technology can alleviate a lot of human suffering if it's used for productive purposes rather than tyrannical ones. A lot to think about but when I get challenged on my learning journey I remind myself that coding is the best way to free the masses, not protesting (shoutout my boy Hal Finney). It's also cool to better understand the attack vectors out there and what I should do with technology to protect myself. I've come to the understanding that going up against a nation-state is futile. If they wanted to destroy me it would be pretty hard to fight back. However, if the masses adopt something like Bitcoin it becomes more advantageous for a \"nation-state\" to barter with their people rather than just attack everyone. No clue how this all plays out but as the saying goes better safe than sorry. Might as well start learning more about computers and get a little bitcoin in case it catches on anon ;).\n\nAnother thing I thought was interesting was a post I saw from Steven Lubka on Twitter. My mans roasted this hopium Twitter account. I appreciate the dudes enthusiasm for paying people via their gaming, but unless that gaming provides someone else value (via streaming or because some market actor is willing to pay you for your time to game) I would not classify grinding as the same thing as adding value to the world. Clearly the market wouldn't either.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/dzambhalahodl/status/1567520399210037255&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nA nice idea but deeply flawed thinking from a first principal perspective. One might argue that once the network effect takes hold this idea could be sustainable but I don't believe the company paying the people to play the game could maintain paying people for long enough. They could run ads and make money from the ads that get displayed but that has always irked me. I try and avoid most ads which nowadays is nearly impossible as developers around the globe use all my past internet data to filter what ads to show me. Maybe they will get good enough to make the ads very subtle in the game, but overall I think Steven is right to say \"Work isn't valuable because it's work, it is valuable because it produces value\". The value of energy is what makes Bitcoin so powerful. Proof of Stake systems are like these play to earn video game systems. A big circle jerk. Much different from the intellectual circle jerk you can find on Bitcoin twitter during a raging bull market. Anyways I don't know what the world looks like in 2030 but hopefully it is thriving rather than full of people eating bugs in pods getting paid the equivalent of pennies in todays fiat currency to play a video game.\n\nFinal thought: got to go to a Bitcoin Developers meetup and choked on a piece of steak. I didn't like fully choke though it just got lodged in my throat. So I had to keep running to the bathroom to spit out all the mucus that was building up while at the same time try and keep a straight face in a room full of mostly strangers. They also had amazing food their that I couldn't eat because the steak was lodged in my throat and every time I tried to eat anything I would feel like I have to throw up. Ended up having to leave because it was getting egregious and it was not until I got home and drank some seltzer water that I was able to dislodge the steak. Overall, it was a huge ordeal and it brought a new meaning to the phrase find what you love and let it kill you. Hopefully at the next meetup I can stay the whole time and not worry about getting food stuck in my throat. Also probably a good lesson to eat my food slower🥲\n\n9/8/22\n\nConor Chepenik",
  "wordCount": 1266,
  "readingTime": 4.777358490566038,
  "claps": 0,
  "voters": 0
}