{
  "id": "c3954014b397",
  "title": "Day 24",
  "createdAt": "2022-04-15 21:57:01",
  "tags": [
    "washington-post",
    "bad-takes",
    "sauna",
    "elon-musk",
    "trudeau"
  ],
  "url": "https://chepenikconor.medium.com/day-24-c3954014b397",
  "content": "# **Day 24**\n\nWent to a Sauna for the first time today since Covid became a thing and it was glorious. It feels so good sweating out toxins without having to exert myself. Also went to the steam room after the Sauna and that was even better, except the air was harder to breathe because of the steam. Learned a hard lesson today about how quickly our bodies lose strength when we stop using our muscles. Used to be able to warm up with 135 on the bench press. Today getting 10 reps of 145 was barely achieved. Like every human, I often overestimate my strengths. Getting into the gym and testing this out was a good reminder that A. I am not as strong as I once was and B. Not to overestimate my abilities. Hopefully, as I get back in the gym the strength training will get easier, but it's also not as important that I put up PRs anymore. It was one thing when I was playing football but at this point, I'm just trying to tone up and stay healthy.\n\nOther things? The first week of work was good. I like my fellow co-workers and my employer does a good job making sure employees have all the resources they need to succeed. I'm also enjoying commuting into the city surprisingly. At my old gig, it was a 25-minute ride out to Lexington from Cambridge. It wasn't a bad drive but I'm enjoying starting my morning with a walk to the train. Plus being in the city is pretty exciting. I've been thinking a lot about moving to a farm and becoming more self-sovereign but at the same time, I love being near a city. I don't wanna be a [gridder](https://www.urbandictionary.com/define.php?term=Gridder) but boy do I love the grid. With all the covid stuff it was pretty maddening seeing some of the draconian policies implemented. I hate the idea of living in a \"papers please\" society which is why I've been thinking so much about farming. If I end up having a family later in life I will seriously consider this, but while young being close to a city is so valuable. Stand up venues, good restaurants, and easy access to adult sports leagues are huge. I'm also lucky to have built a good friend base here in Boston.\n\nFinally, I want to end today by discussing the first and likely last Washing Post article I've read in a long time. I remember growing up I used to respect the Washing Post but after Bezos bought them in 2013 I quickly lost interest. Nothing against Bezos, the guy has provided people a lot of value with Amazon, but if you aren't actively voicing your concern for open debate and free speech I'm going to believe you are likely acquiring a media organization to push your own agenda and bias. We all have agenda and bias by the way. The important thing is letting those you disagree with openly discuss their opinions without censoring, or as The Post likes to say \"moderating\".\n\n![](https://miro.medium.com/1*FdqyznWH8rY1gwaBgwYTpQ.jpeg)\n\nFirst off, content moderation is a fancy way to say censorship. Absolutely ridiculous that a journalist accuses someone of using hyperbole only to say someone who believes in free speech doesn't deserve to run one of the most powerful platforms. While the same guy is writing for a platform owned by a different billionaire. Also, Justin Trudeau is the worst. The dude literally talks about protecting democracy and peaceful protest while sending horses to trample on peaceful protesters. I really wonder if Max Boot is a person or a bot because this has got to be either the worst piece of journalism I've ever seen or a satirical piece that was so good I couldn't tell it was satire. I thought about tweeting a snarky comment but I didn't want my 200 followers to waste their time reading something from a gridder🤡 🌎 🤣💯\n\n4/15/22\n\nConor Jay Chepenik",
  "wordCount": 662,
  "readingTime": 2.69811320754717,
  "claps": 0,
  "voters": 0
}