{
  "id": "c3c8f3773041",
  "title": "Day 626",
  "createdAt": "2023-12-08 23:50:59",
  "tags": [
    "freedom-technology"
  ],
  "url": "https://chepenikconor.medium.com/day-626-c3c8f3773041",
  "content": "# Day 626\n\n![Bitcoin > fiat](https://miro.medium.com/0*TY42zDAPh2ouN0IW)\n\nToday someone on X paid me 50k sats to ask Grok, X's new AI tool, some questions. While at the time of this writing that is just under 25 bucks I believe one day 50,000 sats will be able to purchase a vehicle. I know that sounds insane but exponential growth is insane. Infinity/21 million means that everything is going to zero against Bitcoin.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/YoshishiSatoshi/status/1733267366316830747%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIn my view, it wouldn't be surprising to see a car sell for 50k sats or less in the future. Let me explain why.\n\nWith Bitcoin we could have a deflationary system. This encourages long-term, prudent economic decisions. Compared to fiat currencies, which often inflate at varying rates, a deflationary Bitcoin system would shift consumer and business behaviors for the better. Excessive spending and debt accumulation result in capital misallocation, typically driven by the diminishing purchasing power of fiat money. In contrast, knowing that a bitcoin's buying power gradually rises, would allow people to save and think twice before making risky decisions. This means both individuals and businesses can focus on what they do best rather than worry about investing their cash just to keep up with inflation.\n\nThis gradual deflation under Bitcoin also simplifies financial forecasting for businesses. Predictable deflation aids in setting prices, projecting revenues and profits, and modeling long-term financial impacts. High and volatile inflation often leaves merchants grappling with pricing strategy changes due to fluctuating input costs and consumer price index benchmarks. The relative stability offered by a deflationary scenario can help businesses set competitive, yet profitable, prices for the foreseeable future.\n\nFurthermore, predictable deflation rewards those who hold the currency, as their purchasing power increases simply by maintaining and compounding their assets. In contrast, inflationary currencies tend to penalize savers, as the value of money depreciates over time. A deflationary system, therefore, fosters financial responsibility, encouraging citizens to earn increased purchasing power without having to take large risk.\n\nThis is why I believe a Bitcoin-centric economy would foster in increased purchasing power for the holders of bitcoin, where both consumers and businesses alike get increased purchasing power without having to take on unnecessary risk. Such an environment would lead to more sustainable economic growth, driven by the appreciating value of the currency. While the future of Bitcoin's purchasing power remains speculative, its potential for fostering an economically responsible society is increasingly recognized by myself and many enthusiasts I meet online.\n\nIn a world where Bitcoin becomes a predominant form of currency, its value would extend beyond mere transactional utility, embodying a tool for financial sovereignty and enabling a healthy deflationary process. I mean seriously how incredible is it that I don't personally know the guy above but he paid me 50k sats because I happened to come across his post. Fiat could never. \"WhAT aBOuT veNMo?\" Well that dude is an anon and I don't know him personally so venmo would not have worked. Bitcoin & lightning made it work like a charm though, I'm so bullish on freedom tech :)\n\n12/8/23\n\nConor Jay Chepenik",
  "wordCount": 509,
  "readingTime": 2.120754716981132,
  "claps": 0,
  "voters": 0
}