{
  "id": "c43829068a11",
  "title": "Day 42",
  "createdAt": "2022-05-04 00:16:51",
  "tags": [
    "globalists",
    "current-thing",
    "roe-v-wade",
    "bitcoin",
    "grain-of-salt"
  ],
  "url": "https://chepenikconor.medium.com/day-42-c43829068a11",
  "content": "# Day 42\n\nIt is wild how fast people will forget about \"the current thing\" when a new \"current thing\" is introduced. I'm not a lawyer and don't plan to be so please take this next part with a large grain of salt. As I understand it, leaking the supreme court decision about Roe v. Wade before the justices actually rule on it is one of the worst things that someone can do in the field of law. It is unfortunate that our Supreme Court has to deal with the blowback and I hope the person who leaked this decision is brought to justice. Considering they put the F.B.I and C.I.A on it I'm not hopeful. I'd love to believe those branches of the government had the interest of the people in mind, but since no one from the Ghislaine Maxwell has been brought to justice I'm not exactly hopeful. I remember when I first watched Succession thinking there is no way the \"elite\" of the world are this dumb and corrupt. Based on everything I've seen these past 2 years I feel like the people in Succession might be an upgrade.\n\n![](https://miro.medium.com/0*9ZywyT58PoRmbCO5)\n\nMy personal opinion also holds little weight on this next topic since I am a man but I've always believed women should have the right to choose what they do with their bodies. That said, people should be encouraging people to raise the child unless it is an excruciating situation. People in the field of healthcare should be laying all the cards on the table and letting women know the toll having an abortion can have on their mental health. Again, I'm probably out of my depth here but I imagine a lot more women regret aborting their babies than the ones who decided to keep them. It also seems to go over everyone's (the people I see online screaming Reeeeeeee is who I'm referring to here) head that Roe V. Wade being overturned will force states to draft actual legislation on the subject. If we could have states draft up some laws allowing women to get an abortion in the first trimester that would be ideal. Women should absolutely have the right to abort a baby if that is their will, but at a certain point, it seems inhumane and cruel to wait. If you are going to do it I don't understand why you hold off until the 2nd or 3rd trimester. Saw this [video](https://twitter.com/courrielche/status/1521363687969214464?s=20&t=SjiibKIqLFfN3fvX6HtjBw) on Twitter and I do agree that having a baby aborted as the mom is dilating is some demonic shit. Again, I'm not a woman, this is far from my expertise, and I know there are people who feel very strongly about this one way or another. I'm just trying to think critically here and layout my own personal opinion.\n\n![](https://miro.medium.com/1*GGZyaF7D_tUue8bhHKpErQ.jpeg)\n\nYou know what helps everyone though: a good laugh. This was definitely my favorite meme of the day because it so perfectly encapsulates the doublespeak that comes from our western democratic leaders who think the public is full of idiots. While the public is full of idiots it is also full of brilliant, kind, and hard-working people. Millions (probably billions honestly) I'm sure just want to go to work and live a life not being bothered by big brother. It is crazy the stuff W.E.F cronies have gotten away with recently but it does feel like the pendulum is swinging back to the side of sanity. Today Keean Bexte ratioed Trudeau by simply stating, \"You literally had me arrested for trying to cover a press conference of yours.\" because Trudeau [tweet](https://twitter.com/TheRealKeean/status/1521547683667709952?s=20&t=SjiibKIqLFfN3fvX6HtjBw)ed, \"To journalists across the country and around the world: Thank you for your relentless pursuit of the truth, and for your commitment to sharing those truths. Today, we celebrate your work - and we pay tribute to your colleagues who have been injured or lost their lives on the job.\" Here is the tweet. That is good stuff. Social media has some problems but it also has some incredible moments. It is pretty crazy watching these people make an absolute ass of themselves, but if Succession taught me anything it is that the elite are not so elite.\n\n![](https://miro.medium.com/1*REGqlUxifRIxexxqY-LVbQ.jpeg)\n\nIf we only had rules, not rulers so people were not constantly up in arms about whatever the \"current thing\". We need more critical thinkers in this country and way less thought police. To some degree, I believe a functioning democracy could lead to a world of abundance but under our current system, the state seems like it is becoming more authoritative by the day. These people want to convince you to kill babies because it is your body your choice while at the same time ban the unvaccinated from society. Opt-out of the MSM narrative and forge connections in your community anon. Learn, study, and purchase (once you truly believe in it) bitcoin. No one is coming to save you, but if you learn to think critically you might be able to save yourself. Again, I've always thought a woman should have the right to choose, but if you blindly follow the state it will be our own life, not our unborn child, that we have to worry about. I would love to be wrong about all this but I highly doubt I am. The globalists want us isolated, lonely, and tuned in to whatever bullshit Psy-Op they are running. Luckily, they will expose themselves because you can only weaponize the goodwill of others for so long before you expose yourself.\n\nKindness, love, joy, and every other word that encapsulates the idea of good will win out. Be patient, think critically, and treat others right. It makes a difference.\n\n5/3/22\n\nConor Jay Chepenik",
  "wordCount": 954,
  "readingTime": 4.15,
  "claps": 2,
  "voters": 2
}