{
  "id": "c4a7bca1741c",
  "title": "Day 38",
  "createdAt": "2022-04-29 20:35:05",
  "tags": [
    "going-outside",
    "born-to-run",
    "bitcoin",
    "fiat",
    "neutral-money"
  ],
  "url": "https://chepenikconor.medium.com/day-38-c4a7bca1741c",
  "content": "# Day 38\n\nFriday which means it is time to smile. Feeling a little down but plenty of walks today have helped turn my frown upside down. When I got to the park near where I lived I took off my shoes and walked through the grass. It felt really good. Grounding if you will. Something about touching grass with my actual feet is refreshing. Recently finished a book called _Born To Run_ that talks about the importance of running barefoot. Obviously, there are situations where this is not practical but I do think the author was on to something.\n\nMight need to take some time off Twitter. Easier said than done but the online world is just full of so much doom and gloom. Can't focus on the negative and expect to be positive. Outside of that, not much is going anon. Just taking life day by day and doing everything in my power to remind myself that life is a blessing and losing sight of that is a grave mistake.\n\nAlso, excited to see Panama and the Central African Republic give bitcoin legal tender status. I truly believe this will do wonders to make these two countries prosperous in the future. The game theory works out in Bitcoin's favor as well. Would be surprised if we didn't have more countries adopt it in 2022. Signed up to go to a Bitcoin meetup in Cambridge Monday which I'm so excited for because it will allow me to meet other bitcoiners in the area. Late May I will also be going on the Nyc & Gryff show to talk Bitcoin. Making moves to further orange pill 🍊  💊  my fellow humans. Finally, I will be putting out a podcast soon called The Conor Chepenik Podcast. Recorded my first episode with my friend Ariel the other day and had a great time. Putting a reminder for myself here - learn how to use bitcoin podcast tools so you don't have to rely on big tech platforms that will censor unpopular opinions and call it disinformation.\n\n![](https://miro.medium.com/1*-jkmylEAyT-Z40KCaas3CQ.jpeg)\n\nBitcoin radicalized me in the best way possible by making me question everything and constantly reassess what I believe. Open minded people are happier because they don't get so stuck on one thing. If something comes along and proves to be a better more fair form of money than Bitcoin I will consider it. Currently, all other crypto/fiat currencies don't make compelling cases for why they would be a fair money for the globe. Every other currency has been corrupted by politics. Just look at the U.S dollar and how it is used to sanction people all over the world. I've said it a lot and I will keep saying it a lot: rules not rulers. Especially when it comes to neutral money. That said, this is just my opinion and maybe it will turn out to be wrong. Feel free to shill me in the comments why you might disagree anon. I'm always eager to learn! :)\n\n4/29/22\n\nConor Jay Chepenik",
  "wordCount": 505,
  "readingTime": 2.1056603773584905,
  "claps": 0,
  "voters": 0
}