{
  "id": "c4d535e8135a",
  "title": "Day 1040",
  "createdAt": "2025-01-26 03:34:08",
  "tags": [
    "writing"
  ],
  "url": "https://chepenikconor.medium.com/day-1040-c4d535e8135a",
  "content": "# Day 1040\n\n![[https://youtu.be/WpIhPIiVtOo](https://youtu.be/WpIhPIiVtOo)](https://miro.medium.com/0*V8NpGlbJ8Gz2LtnF)\n\n1. A good reminder. Not easy to shut those voices up that say \"I know what I must say next\" but doing so makes for better conversation.\n\n2. This makes me want to build an app to help people learn a new word every day. Here is a good word to add to your vocabulary: **Ineffable** - Too great or extreme to be expressed in words.\n\n3. I just cleaned my office and I feel this to be true. Much easier to get stuff done when my work place is clean, organized, and easy to work from.\n\n4. You need to embrace pondermaxing: thinking deeply, brainstorming ideas, and hacking solutions. Today, I took apart a trimmer with a frustratingly poor design. The issue? Every time you turned it on, the trimmer blade would expand outward. I shit you not the thing basically made you choose between burning through the spool of wire or burning through the battery. Luckily after some tinkering I figured out how to adjust the blade mechanism so it stayed in place. It was a glaring design flaw and the [Youtube comments](https://youtu.be/A9_iiDHlAlg) about this trimmer showed that. I'm just glad my problem-solving skills paid off. There's something satisfying about turning a frustrating product into a functioning one! So in short find what you like to ponder about so you can ponder off into your own thoughts gleefully. Don't trust what the TV tells you.\n\n![[https://x.com/BasedTorba/status/1882969702709989678](https://x.com/BasedTorba/status/1882969702709989678)](https://miro.medium.com/0*FOd4jVkcCyt0dPEs.png)\n\n6. Foster a spirit of collaboration and mutual growth, recognizing that competition is not always the most effective approach to achieving success. While competition can be beneficial in certain contexts, such as sports or other zero-sum games where there are clear winners and losers, life's greatest achievements come from working together with others towards common goals. By collaborating and sharing knowledge, skills, and resources, individuals and groups can achieve more than they could on their own. This applies especially to AI and why I want to see it open sourced.\n\n7. It was not on the list but it was in the video: Surround yourself with great books. It kind of applies to six except in this case you get to consume the work of great writers.\n\nI'll finish today's post with a nice meme about why Christ is King:\n\n![[https://x.com/AuronMacintyre/status/1883277669019836859](https://x.com/AuronMacintyre/status/1883277669019836859)](https://miro.medium.com/1*3QW8LWX1MLCi1UZ10yTKhQ.png)\n\n![Ok one more photo actually because this inside joke made me lol😂 ](https://miro.medium.com/1*Tm3mKlTZdzt5x10_jOnlfg.png)\n\n1/25/25\n\nConor Jay Chepenik",
  "wordCount": 381,
  "readingTime": 2.137735849056604,
  "claps": 0,
  "voters": 0
}