{
  "id": "c5dae5ee12de",
  "title": "Day 497",
  "createdAt": "2023-08-02 01:55:09",
  "tags": [
    "bitcoin",
    "satire",
    "texting-and-driving",
    "focus",
    "podcasts"
  ],
  "url": "https://chepenikconor.medium.com/day-497-c5dae5ee12de",
  "content": "# Day 497\n\nPodcasts have brought immense value into my life. By listening to podcasts, I stay informed, entertained, and in some cases even educated - far more than I would by watching news or television. Of course, different people have different tastes. But for me, podcasts are superior for gaining real understanding on a topic, rather than being misled.\n\nMainstream media is beholden to advertisers, limiting the scope of their content. But podcasters have far more freedom in what they cover. While some may have sponsors, the range of topics and depth of conversations available in podcasting outpaces legacy media models. With more variety and nuance, I find podcasts genuinely enrich my life in a way that cable news simply can't.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FcWd6f4WWgO4%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcWd6f4WWgO4&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FcWd6f4WWgO4%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nAfter listening to the impactful podcast posted above, it reminded me to be more attentive when driving. The podcast discussed how many people in the States are distracted while driving, and it struck me that I've been guilty of distracted driving - changing podcasts, checking emails, even texting while on the road. This podcast was a wakeup call for me, reminding me to be fully present behind the wheel. Driving attentively could save lives.\n\nThere are many areas of life we can improve simply by not outsourcing our responsibilities. Mike joked about how we (the taxpayer) have outsourced driver's ed to the state, and the result is a focus more on parallel parking than defensive driving. I've been fortunate my whole life to be a safe driver, but I still aim to do better. Rather than blindly follow others' poor examples, I will take ownership of my actions.My driving is one space where I can choose focus over distraction.\n\n![guy texting on phone created with firefly from Adobe](https://miro.medium.com/1*5mrRvTV_XdPzDsXiPbBY0g.png)\n\nOnce you are thinking about something it seems to appear everywhere. On my way to play basketball today I noticed a guy driving a Ferrari holding a cell phone on top of the steering wheel while driving. Texting and driving is an awful thing to do and yet most people do it. I don't trust survey data and would suspect the number is higher than this but according to [drive research report 45% of people have texted or used their phone while driving](https://www.driveresearch.com/market-research-company-blog/car-driving-stats/#:~:text=Key%20statistics%20from%20the%20national%20driving%20survey%20included%3A&text=Over%20half%20of%20drivers%20(54,used%20their%20phone%20while%20driving).\n\nIt seems there is immense value in being more cognizant. In the same way I now want to reject the distraction of texting while driving, I want to reject passive consumption of media and outsourcing of responsibility in other aspects of my own life. Paying attention, thinking critically, and owning my actions - that is the path forward. If we all can tap into our agency and override the defaults of technology and social conditioning, perhaps we can create a culture that brings out our humanity rather than diminishes it. That possibility begins with small choices, like keeping my eyes on the road. Meaningful change starts by improving yourself :)\n\nThat's what I aim to do with my own podcast. Use it as a space to teach, inform, and learn. Today I experienced a master class in satire from the brilliant [Max Keiser](https://twitter.com/maxkeiser). If you want to enjoy his latest article from the Gatekeepers edition of Bitcoin Magazine link below.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FUu9c777z_ak%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DUu9c777z_ak&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FUu9c777z_ak%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\n8/1/23\n\nConor Jay Chepenik",
  "wordCount": 527,
  "readingTime": 2.188679245283019,
  "claps": 0,
  "voters": 0
}