{
  "id": "c680600d99b3",
  "title": "Day 395",
  "createdAt": "2023-04-21 23:22:58",
  "tags": [
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-395-c680600d99b3",
  "content": "# Day 395\n\nFriday lets gooooooo. Started my morning with the No Agenda podcast. Middle of the day Saifedean Pod. Finished with a KR podcast.\n\n> [**No Agenda - 1548 - \"Dangle Op\" - Listen on Fountain**](https://fountain.fm/episode/15013238037)\n\n> [**The Bitcoin Standard Podcast - 164. Is the world de-dollarizing? With Peter St. Onge - Listen on...**](https://fountain.fm/episode/14951798017)\n\n> [**The Kevin Rooke Show - E103: Pablo F7Z on Building Nostr Projects, Why Open Networks Win, and The...**](https://fountain.fm/episode/14497320207)\n\nI also stacked 510 sats for writing this as a comment in Stacker News.\n\n''Bitcoin is like a beautiful woman. She can be appreciated by people of all political persuasions. But just because everyone can appreciate her beauty doesn't mean that everyone agrees on what to do with her. Some people want to marry her, some people want to sleep with her, and some people just want to look at her. But no matter what they want to do with her, they can all agree that she's beautiful.''\n\nAll these value for value models are incredible. It's going to change how humans interact with each other. Try out Stacker News if you like signal & sat stacking. Here is my referral link if interested [https://stacker.news/r/Chep](https://stacker.news/r/Chep)\n\nAnyways, I've got to finish my Bitcoin Magazine print edition I wrote yesterday (and get my kid to sleep) so that's all for today. I'm thinking I will incorporate that comment into my piece. For the record this was the post I responded to.\n\n> I constantly hear that Bitcoin is apolitical. I get where this comes from. This is a money that anyone can use, no matter what ideology they have. It will benefit everyone if we get on a Bitcoin standard. Bitcoin network doesn't discriminate. However it means just that: the network doesn't discriminate based on political leanings.\n\n> Nondiscrimination =/= Apolitical\n\n> Look at the goal of Bitcoin. It is meant to either provide an alternative to our current monetary system or hopefully replace it entirely. Who has control over the monetary system right now? The state, an inherently political entity. If you're trying to compete with or replace something the state is doing, its going to get political whether you like it or not.\n\n> Also look at the properties of Bitcoin. Satoshi Nakamoto was very obviously influenced by Libertarianism and Austrian economics. I don't know if he ever stated it, but the implications are there. The 21,000,000 cap is proof enough. Look at the headline inscribed in the genesis block. The act of putting that particular headline in the genesis block itself is a political statement.\n\n> Take a look at the ideologies of the people who criticize or dismiss Bitcoin:\n\n> Socialists\n\n> Communists\n\n> Progressives\n\n> Neoconservatives\n\n> Neoliberals\n\n> (actual) Fascists\n\n> Now look at the ideologies of a lot of vocal Bitcoiners:\n\n> Libertarians\n\n> Anarchists\n\n> Paleo-conservatives\n\n> Monarchists\n\n> Classical liberals\n\n> I hate that I have to say this, but I'm obviously generalizing here. I'm not saying that every progressive is against Bitcoin and every libertarian is for it. I'm just doing some basic pattern recognition.\n\n> Just because every person, regardless of ideology, can use Bitcoin doesn't mean they support its use or existence. Just because it will likely benefit everyone if Bitcoin succeeds in replacing fiat, doesn't mean that every ideology will be for it. In fact, the ideologically possessed won't care if it will benefit them. If it goes against their creed, they will oppose it.\n\nKeep it easy anon.\n\n4/21/23\n\nConor Jay Chepenik",
  "wordCount": 625,
  "readingTime": 2.358490566037736,
  "claps": 0,
  "voters": 0
}