{
  "id": "c7c6c2922b13",
  "title": "Day 641",
  "createdAt": "2023-12-24 02:30:18",
  "tags": [
    "the-fed",
    "money",
    "tech",
    "inflation",
    "deflation"
  ],
  "url": "https://chepenikconor.medium.com/day-641-c7c6c2922b13",
  "content": "# Day 641\n\nTechnology is deflationary. The cost of goods and services will become cheaper over time in a free market governed by fair rules. Entrepreneurs will compete with each other and continually erode each other's profit margins as they vie for business. This competitive dynamic is a big driving force behind technological deflation. As companies innovate to outdo competitors, they often make their operations more efficient, leading to lower costs and prices. The decreasing cost of goods and services over time is great for everyone involved in that market.\n\nConsider computing power: in 1970, a gigabyte of storage cost approximately $100 million, but today, it's under a dollar. This dramatic reduction has not only made computers and electronic devices more accessible to the average consumer but has also spurred the development of groundbreaking technologies like LLMs, smartphones, and cloud computing.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/NickADobos/status/1738601907827122472%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nHowever, the dynamic of a free market is significantly altered by the capacity of central banks to print money. Inflation dilutes consumers' purchasing power and erode deflationary gains. The ability to create money from thin air has another more insidious impact as well. It can prop up unsuccessful businesses and foster monopolies.\n\nWhen central banks inject new money into the economy, they often channel these funds toward specific institutions or sectors, including companies and sovereign debt. This allocation of capital can artificially maintain entities that would otherwise falter under normal competitive market conditions. Entities benefiting from this influx of funds might then prioritize aligning themselves with those in control of monetary policy, rather than focusing on serving their customers effectively. This practice distorts the foundational principles of a free market and hampers innovation, as it shields non-competitive entities from the natural market pressures that drive efficiency and innovation.\n\nThis dynamic leads to a situation where the lines between state and corporate power become increasingly blurred, with monetary policy acting as a bridge. When the state begins to play a decisive role in determining market winners and losers through financial interventions, it risks creating an environment where the independence of the market is compromised, and the interests of a few are placed above the needs and welfare of the many. This can lead to a concentration of power that resembles aspects of authoritarian/fascist governance, where the state exerts control over various sectors, potentially leading to systemic corruption and inefficiency.\n\nFix the money and the world will be a much better place. The best way to fix the money is to ask your \"What is money?\" and explore that question for yourself.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/RealSpikeCohen/status/1738696879917957561%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n![](https://miro.medium.com/0*-3Kpu0sLxNOSN8tk)\n\n12/23/23\n\nConor Jay Chepenik",
  "wordCount": 425,
  "readingTime": 1.8037735849056604,
  "claps": 0,
  "voters": 0
}