{
  "id": "c90a71ba3d26",
  "title": "Day 327",
  "createdAt": "2023-02-12 20:56:39",
  "tags": [
    "super-bowl"
  ],
  "url": "https://chepenikconor.medium.com/day-327-c90a71ba3d26",
  "content": "# Day 327\n\nSuper bowl Sunday and my boy Q is coming with his family to vist my family up in Acworth. I'm excited to watch the Eagles play today and hope they can secure another super bowl this century. It was nice watching them get revenge against New England, while I was watching from Boston. I was a sophomore in college at the time and did not know if we would be able to pull it off with a backup QB. Definitely one of the sweetest football watching moments of my life. Especially after I had my heart broken in person when they played in my hometown of Jacksonville for the 2005 Super bowl. I was at that game personally but since I was a small child I mostly just wanted to go to the concession stand.\n\n![](https://miro.medium.com/0*vMOZ4n_Cmc5CbmyG)\n\nWalked around downtown Acworth with my Partner, Sloan, Mum, Aunt, and Grandmother. Its cool how much this small town has grown since my Grandparents moved here 25 years ago, the year I was born. The antiques stores around here are incredible and I would've spent more time walking around if Sloan didn't get hungry and start fussing. That's okay it was nice getting to show my Partner what a cool place Acworth is. Here is a photo I took while downtown.\n\n![](https://miro.medium.com/1*jpSmZQcDSgmGtxg6ouruDQ.jpeg)\n\nImagine that. 5 cents could buy you a Coca-Cola. Now I genuinely can't think of the last time I spent 5 cents and was able to buy something. Hell the only thing I can think of for under a dollar is using a quarter to buy gum-balls from the machine or pay for parking (which usually requires multiple quarters....lol) Inflation is insidious.\n\nWhat kind of blows my mind is that if I think inflation is a problem while I reside in the spot that holds the world reserve currency what is it like for other nations. Must be absolutely brutal living under inflation that is even worse than what America is experiencing. Pain is the best teacher I guess. I'm sure many of these people living in high inflationary regimes don't have to be told about the merits of hard money.\n\nOn a brighter note I made some nachos for the Super Bowl. Lot of Bitcoiners have been hating on \"sportsball\" because it distracts people. I do agree with that quote that is something like \"Give a man bread and a circus and he will always be content\". There is no denying sports can be a major distraction and bad habit for those addicted to sports gambling. Of course they can also be a valuable tool to build relationships. I have made a lot of life long friends and improved my health through sports. So I look at it with a nuanced opinion. On the one hand watching to many sports and basing your whole personality around it you might end up forgoing all your drive to do something of merit because you're watching other men strive for greatness. At the same time big events like the Super Bowl offer an incredible time to have friends and family get together. With anything it's important not to go overboard. Playing \"sportsball\" > watching \"sportsball\". With that said I still get a big kick out of watching football, my sportsball game of choice.\n\nNot much else to report. Seeing a lot more tweets about that blow up in Ohia so hopefully mainstream media starts reporting more. Problem for another day. Going to enjoy the mega sports ball game that's happening at 6:30.\n\n2/12/23\n\nConor Jay Chepenik",
  "wordCount": 594,
  "readingTime": 2.6248427672955974,
  "claps": 0,
  "voters": 0
}