{
  "id": "c95c48f08e7",
  "title": "Day 268",
  "createdAt": "2022-12-15 18:47:36",
  "tags": [
    "nfts",
    "trump",
    "us",
    "bitcoin",
    "noah"
  ],
  "url": "https://chepenikconor.medium.com/day-268-c95c48f08e7",
  "content": "# Day 268\n\nJust when you thought 2022 couldn't get any crazier Trump has decided to sell NFTs. You can't make this shit up hahahahaha. I guess I'm glad to see the dude no longer has a thing out for crypto but man. I did not have that on my 2022 bingo card.\n\n> [**CollectTrumpCards | Donald Trump Digital Trading Card NFTs**](https://collecttrumpcards.com/)\n\nWhat's even funnier is he seems to be using polygon to mint them. I would assume this is because minting on Ether costs too much😂 .\n\n> [**Trump Announces $99 Digital Trading Card NFTs**](https://www.coindesk.com/web3/2022/12/15/trump-announces-99-digital-trading-card-nfts/)\n\nIt's pretty funny to see Trump do a 180 but I guess if there is a bag to be made Donald doesn't care. With 45k NFTs at $99 a pop that equates to slightly over 4.45 million dollars. I'm sure Trump and his team had to pay some software engineers to get things set up but sheeeeeesh. Not a bad haul. I'm curious if these will sell out. I won't be buying one but it seems like there are some sweet prizes you could win depending on the NFT you end up with. Stuff like a round of Golf with Trump or attending a dinner hosted by Trump.\n\nI will just keep stacking sats but I do think this is a positive in the sense it means the G.O.P is less likely to attack crypto. In a way attacks on Bitcoin are good because they make the network more anti-fragile, but I'd also just prefer to live in a society that quickly adopts bitcoin as money. Either way I think bitcoin will be the next global reserve currency. It will just be the global reserve currency a lot faster if the U.S government embraces it.\n\nOutside of that not much else to report. Met with the people at [noah.com](https://app.noah.com/) to go over what I like about their app and earned 100,000 sats in the process which was pretty cool. My advice to them is leverage social media as much as possible so people put their noah names in their profiles. For anyone using noah feel free to send me some sats chepenikconor@noah.me ;). I also have a Boston Bitcoin holiday party at 6:30 which I'm pretty pumped about. Meeting Bitcoiners IRL is the best.\n\nLast thing I'll note is I'm in the process of sending some sats from my Umbrel to my other node and that has been a pain. Not sure what the problem is but it has been stressing me out trying to figure out why my sats aren't sending. I'm going to figure it out but I wish Umbrel made it easier. It is possible it's something to do with my ras Pi, but I don't know. Will see what I can do. Glad I'm going through these challenges now when the stakes are low rather than trying to figure this out in an emergency.\n\n12/15/22\n\nConor Jay Chepenik",
  "wordCount": 523,
  "readingTime": 1.9735849056603774,
  "claps": 26,
  "voters": 1
}