{
  "id": "cabc457a0897",
  "title": "Day 858",
  "createdAt": "2024-07-28 02:51:44",
  "tags": [
    "bitcoin",
    "politicians",
    "politics",
    "snowden",
    "exposing"
  ],
  "url": "https://chepenikconor.medium.com/day-858-cabc457a0897",
  "content": "# Day 858\n\n![[https://primal.net/e/note146nlu65g7zvnk5afu980lsla0yvvjf97gxtrdc92zl3prevstzdq6d0ew2](https://primal.net/e/note146nlu65g7zvnk5afu980lsla0yvvjf97gxtrdc92zl3prevstzdq6d0ew2)](https://miro.medium.com/1*xisDtptyF8Fi6xSThaMkBA.png)\n\nEdward [Snowden's speech at the Bitcoin conference](https://youtu.be/f3NBhSXtE5g?si=KWy3TVsdl7G-WKX3) is a must-watch, showcasing his unwavering courage in exposing the United States Government's wrongdoings. Speaking truth to power is never easy! Especially when that power is as formidable as the U.S. Government. Snowden's conviction is a powerful reminder that individual actions can have a profound impact on the world. Without him I doubt many people would know the NSA blatantly violated the Fourth Amendment of the U.S. Constitution, which protects against unreasonable searches and seizures.\n\nIn contrast, Donald Trump's speech at the conference was more of the same - a mix of rally-style rhetoric and superficial references to Bitcoin. While entertaining, it lacked the substance and depth of Snowden's speech. Trump's conflation of Bitcoin and cryptocurrency was to be expected from someone not in the space, but it's worth acknowledging that Bitcoin is, in fact, a cryptocurrency. However, this doesn't diminish Bitcoin's unique status as the only cryptocurrency which is sound money.\n\n![](https://miro.medium.com/1*t8UPhim76CrwqfzXdRLW-w.png)\n\n[As a single-issue voter, I'm willing to support Trump](https://www.thecommonsensemovement.com/posts/why-im-voting-for-trump) based on his stance on Bitcoin, despite the theatrics of politics. I believe he would be more effective than the Democrats in this regard. Nevertheless, it's hard to shake off the feeling that politics has become a reality show, where power brokers engage in public battles only to fraternize behind closed doors.\n\nSnowden's speech was the true signal. A good reminder of the importance of speaking truth to power. Trump's speech seemed to be more a more calculated attempt to woo voters.\n\nSo, what's the takeaway? Focus on what you can control. Get involved, speak truth to power, and share your opinions with others. Convince them to vote for candidates who will genuinely improve their lives. However, don't be naive - no politician will single-handedly fix your issues. The divide-and-conquer tactics employed by those in power are designed to distract you from the real enemy: those who devalue your currency by printing it out of thin air and then tell you 2% inflation is a legit target because reasons. It is okay to engage in discussions about politics, but don't let it divert your attention from the root causes of the problems we face.\n\n![](https://miro.medium.com/0*epqf1dNRLuBUD7Ig.png)\n\nAs Erik pointed out so nicely in the video below screw people who think it is okay to spend money that we do not technically have and will end up printing out of thin air. There are consequences and unfortunately politicians don't typically pay the price until much later for their reckless spending.\n\n---\n\n![[https://x.com/IwanRabbinstein/status/1817129715624251532](https://x.com/IwanRabbinstein/status/1817129715624251532)](https://miro.medium.com/1*9_ph8xwdPOTNxlk-PdrxuA.png)\n\nFix the money; fix the world :)\n\n![[https://x.com/TuurDemeester/status/1817342358666596485](https://x.com/TuurDemeester/status/1817342358666596485)](https://miro.medium.com/1*i28_Fd8CmKGywdZ0aEglFg.png)\n\n7/27/24\n\nConor Jay Chepenik",
  "wordCount": 434,
  "readingTime": 2.4710691823899373,
  "claps": 0,
  "voters": 0
}