{
  "id": "cb00afe2dfe0",
  "title": "Day 1060",
  "createdAt": "2025-02-15 04:17:59",
  "tags": [
    "grind",
    "dont",
    "stop",
    "good",
    "thank-you-god"
  ],
  "url": "https://chepenikconor.medium.com/day-1060-cb00afe2dfe0",
  "content": "# Day 1060\n\nI had a lovely Valentines day with my wife tonight. We got to eat at one of the best restaurants in Jacksonville and I feel very fortunate that I get to spend time with the love of my life at such a delicious restaurant. Even if we were eating at McDonalds it would have still been a lovely time because I get to spend it with her, but eating at a nice restaurant was the icing on the cake.\n\nI'll finish today by drafting my latest article for Bitcoinnews.com on Joltz.\n\n**Joltz Co-Founder Ian Major on Bringing Stablecoins to Bitcoin**\n\nThe Bitcoin ecosystem is constantly evolving, and one of the latest developments is the integration of stablecoins onto Bitcoin's blockchain through Taproot Assets. This move has sparked both excitement and debate within the Bitcoin community. To understand the implications of this development, we spoke with Ian Major, Co-Founder of [Joltz](https://www.joltz.app/), a company at the forefront of accelerating hyperbitcoinization by making Bitcoin, the Lightning Network, and Taproot Assets more accessible.\n\nJoltz has developed the world's first non-custodial Bitcoin wallet supporting the Taproot Assets protocol. This allows users to interact with various Bitcoin-based assets, including stablecoins and loyalty rewards, directly on the Bitcoin blockchain. Their wallet, available via TestFlight for Apple devices with Android support on the way, aims to provide a user-friendly interface for managing Bitcoin and other assets, leveraging the Lightning Network for enhanced scalability and speed. Furthermore, Joltz offers an SDK and API, enabling businesses to integrate Bitcoin rewards and Taproot Assets into their services, particularly customer loyalty programs.\n\n![**Bitcoin-native stablecoins are unlocking a $3.2T market, according to Joltz - Taproot Assets make it possible.**](https://miro.medium.com/0*EACQJ5rlbuWbqVJw)\n\n\"We made the big bet basically a year ago,\" Major explained, referring to Joltz's focus on Taproot Assets. \"We were like, okay, we think Taproot Assets is going to be a thing.\" That bet seems to be paying off, with the recent announcement of Tether launching USDT on Bitcoin via Taproot.\n\nA key question surrounding stablecoins on Bitcoin is why they are needed in the first place. Major addressed this, emphasizing the chain efficiency of Taproot Assets. \"One of the really nice properties of Taproot Assets is that it's extremely chain efficient,\" he said, noting how it avoids the unnecessary bloat and storage overhead that plague other protocols such as \"Ordinals\" or \"Runes\".\n\nBeyond efficiency, Major highlighted the importance of bridging the gap between traditional finance and Bitcoin. \"How few degrees of separation can we create between someone and the ultimate life raft that we all know is Bitcoin?\" he asked. He acknowledged the stickiness of fiat currencies, driven by the massive amount of global debt. While acknowledging the potential controversy around stablecoins, he also emphasized the importance of bringing stablecoin users closer to Bitcoin. \"There are millions of people now around the world that are exclusively using stablecoins... and so by default those users are all going to these other networks,\" Major noted. \"They're one step removed from what they have to be from Bitcoin.\"\n\nThe Joltz team believes Taproot Assets can enable fluid transitions between different forms of value. The protocol facilitates seamless interoperability: merchants can accept Bitcoin while receiving stablecoins, or vice versa. \"Taproot Assets allows for a lot of these really interesting payment flows that hopefully can actually accelerate us across that path of Bitcoin becoming a true medium of exchange,\" Major said.\n\nThe recent adoption of Taproot by Tether, rather than USDC or other major stablecoin issuers, raises an interesting question about market dynamics. When asked about this, Major expressed confidence that other players would eventually join. \"I definitely think we will see all of the above eventually,\" he stated. He pointed to the scaling challenges faced by other blockchains, like Solana and Ethereum, as a key factor driving this trend. \"As we relearn and relearn this lesson of like, blockchains don't scale, every major issuer is going to ultimately say, 'Ah, it turns out that payment channels... are crucial for payment scalability.'\"\n\nMajor also expressed his hope for a growing ecosystem of smaller stablecoins, including decentralized Bitcoin-backed stablecoins. \"For me, that would be the ultimate dream,\" he said, explaining that this would allow users to denominate payments in familiar units while the underlying collateral remains Bitcoin.\n\nThe discussion touched on the speed and efficiency of Lightning Network for payments, especially in the context of increasing demand for near-instantaneous transactions. Major agreed, saying, \"Every blockchain looks awesome until there's actual usage and then you start to see the strains.\" This is where the importance of payment channel-based networks like Lightning for handling the growing volume of transactions shines.\n\nAddressing the concerns of some in the Bitcoin community who see stablecoins as prolonging the dominance of fiat, Major acknowledged the validity of these concerns. \"It's tough,\" he admitted. He pointed to Tether's dominant market position and the challenges of competing with them. However, he also highlighted the potential for innovation and the development of alternative stablecoins, particularly Bitcoin-backed ones. \"That's why I am so encouraged by some of the experiments happening around like Bitcoin backed you know stablecoins,\".\n\nMajor also discussed the potential regulatory challenges associated with stablecoins on Bitcoin, particularly concerning freezing assets. He believes enforcement will likely occur at the address level, with regulators targeting specific addresses associated with illicit activity. \"I think that's probably where the enforcement will mostly be,\" he said.\n\nLooking ahead, the team is excited about the development of the Joltz wallet, the upcoming Android release, and the integration of Lightning support. Major is also enthusiastic about the growing interest from businesses in Joltz's SDK and the potential for new stablecoin projects. \"We're pretty pumped to see what they build with the Joltz SDK,\" he said.\n\nIt will be interesting to watch the broader impact of stablecoins on Bitcoin adoption. Major highlighted the potential for economic empowerment, particularly in regions with hyperinflation or limited access to traditional financial services. He drew a parallel to successful Bitcoin businesses like Strike, which facilitate cross-border payments. \"Imagine being able to do more of that natively on Lightning,\" he said, emphasizing the potential for improved privacy and efficiency.\n\nIan Major's insights provide a valuable perspective on the evolving landscape of Bitcoin and the role of stablecoins within it. While challenges and concerns remain, the potential benefits of bringing stablecoins to Bitcoin, particularly through Taproot Assets and the Lightning Network, are significant. Joltz, under Major's leadership, is poised to play a key role in shaping this future.\n\nFor many, stablecoins on Bitcoin aren't just a side project, they are a bridge. Taproot Assets and the Lightning Network aren't about turning Bitcoin into just another asset to hold; they're about making it the foundation of a parallel financial system. Whether it's enabling merchants, facilitating seamless global payments, or onboarding the next billion users, the pieces are coming together.\n\nFiat won't disappear overnight, but the rails beneath it are shifting. The future isn't built by waiting, it's built by the first movers. And Bitcoiners? Well they are already building.\n\n![You can learn more at [https://www.joltz.app/](https://www.joltz.app/)](https://miro.medium.com/1*2s3jWeRrjKFFhKUVIYjuXQ.png)\n\n2/14/25\n\nConor Jay Chepenik",
  "wordCount": 1168,
  "readingTime": 4.790880503144654,
  "claps": 0,
  "voters": 0
}