{
  "id": "cb71ced8bbf7",
  "title": "Day 597",
  "createdAt": "2023-11-10 03:23:36",
  "tags": [
    "ai",
    "finance",
    "regulators",
    "abundance",
    "lead-with-love-not-anger"
  ],
  "url": "https://chepenikconor.medium.com/day-597-cb71ced8bbf7",
  "content": "# Day 597\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/BitcoinVeterans/status/1722674781659476380%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI would likely agree with this regardless of who wrote it, but the fact it was written by a veteran, someone who sacrificed their life for the freedom of people in the United States, makes it that much more powerful. Seriously what an incredible comment for Fincen to read. I hope they consider it before passing this law.\n\n> [**Regulations.gov**](https://www.regulations.gov/comment/FINCEN-2023-0016-0229)\n\nHere is the actual comment posted on the .gov site if you don't believe it is real. This evening, I had a profound conversation with my partner about the futility of leading with anger - an important lesson, indeed. It is the belief that love ultimately triumphs that resonates with me, even in times of disagreement.\n\nI am grateful for the dissemination of this comment to FinCEN, as it highlights a crucial point: the proposal to restrict peer-to-peer transactions and the autonomy of managing one's private keys is, frankly, misguided. Nonetheless, harboring bitterness towards the world serves no purpose.\n\nIt's a common defense to perceive adversaries around every corner, yet oftentimes, the most formidable opponent we face is the one within. To reiterate, your greatest adversary can indeed be yourself. This realization brings to light that we are also capable of being our most formidable ally. Echoing the sentiments of [a creator I hold in high esteem](https://twitter.com/patrickbetdavid), \"Choose your enemies wisely.\"\n\nIn advocating for financial freedom and engaging in civil discourse, let us not become enemies to ourselves or our values. As we navigate this complex landscape, let us choose our battles with care and continue to foster an environment where constructive dialogue and mutual respect prevail.\n\nI am thrilled to conclude this post by highlighting an innovation that has me genuinely exhilarated: the rapid development of new GPTs. Take a moment to explore this one, for instance:\n\n> [**ChatGPT - Retro Adventures**](https://t.co/PizaKbIjQ7)\n\nChatGPT - Retro Adventures. Imagine delving into any fictional realm via retro video games. I requested a Pacific Rim-inspired game from it, and the result was nothing short of impressive!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1722811695293223194%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe velocity of this technological evolution is astounding - it reminds me of a comet streaking across the sky, far outpacing the grasp of regulators. The notion that traditional governance can keep pace with such exponential growth is becoming increasingly untenable. It's a race where only humans augmented by AI stand a chance at keeping up.\n\nAnd yet, this rapid development excites me not just for the technology itself, but for the shift in focus it demands from our regulators. I eagerly anticipate the day when the conversation pivots from constraining peer-to-peer transactions to embracing a world of abundance. After all, peer-to-peer interactions are the bedrock of our markets. Why stifle the foundational element of commerce?\n\nThis tech is evolving swiftly, and I can hardly wait to see how we navigate this burgeoning world. May we move from a stance of restriction to one of expansive possibilities.\n\n![](https://miro.medium.com/0*L1uJAzEWbHvaQku3)\n\n11/9/23\n\nConor Jay Chepenik",
  "wordCount": 500,
  "readingTime": 2.086792452830189,
  "claps": 0,
  "voters": 0
}