{
  "id": "cd5b402ba18d",
  "title": "Day 280",
  "createdAt": "2022-12-27 17:10:05",
  "tags": [
    "omnibus",
    "radical-podcast",
    "twitter-spaces",
    "goals",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-280-cd5b402ba18d",
  "content": "# Day 280\n\nToday I spoke on Twitter spaces. I've attended a lot of Twitter spaces but I've been kind of nervous to actually speak on one. It turned out to be a rewarding experience. Friendly reminder to get outside your comfort zone more often. Didn't realize at the time, but it turned out to be a podcast episode for Shane Hazel's radicalpod.com I'm excited to have made it on to an episode!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fshow%2F7ztGuDsRRnwL9PnZQhZPwP%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fshow%2F7ztGuDsRRnwL9PnZQhZPwP&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fc29774ba8a413259625612d1&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nHit a nice run this morning to officially round out the final month of the year with 30+ miles. Was worried about getting 30 this December but glad I did. Felt so good finishing this run knowing I don't have to run anymore this month. I might hit a joy run before the month is over but knowing that my goal is met feels rewarding. Texted this in \"My Proof Of Work\" groupchat afterwards...\n\n![](https://miro.medium.com/1*hFJE2XVNokscHL-YN2oYqw.png)\n\nBig plans in the New Year. Excited to crush them and become a better runner. A better person. Someone who is more optimistic about life and building towards a better future. The world has its problems but they sure as hell won't be solved by complaining. Speaking to people, keeping an open mind, and learning from your mistakes.\n\nOutside of that not much to report. I'm going to see Babylon with my partner today. Big fan of our Tuesday cinema outings because our theater has discount tickets on humpday jr. Also thought this write up from Mr. Axelrod was stellar.\n\n> [**Andrew Axelrod on LinkedIn: #bitcoin #banking #money #business #economics | 139 comments**](https://www.linkedin.com/feed/update/urn:li:activity:7013182380249075712?utm_source=share&utm_medium=member_desktop)\n\nOh before I go I must also mention that reading 10 pages a day has been a success. Read the bible last night and it was awesome learning about how Joseph got stuck in a horrible situation, stayed patient, worked hard, and went from a prisoner to the King of Egypt. Low time preference for the win! :)\n\n12/27/22\n\nConor Jay Chepenik",
  "wordCount": 337,
  "readingTime": 1.471698113207547,
  "claps": 0,
  "voters": 0
}