{
  "id": "cd78071c381c",
  "title": "Day 841",
  "createdAt": "2024-07-11 05:07:12",
  "tags": [
    "montana",
    "the-gentlemen",
    "money"
  ],
  "url": "https://chepenikconor.medium.com/day-841-cd78071c381c",
  "content": "# Day 841\n\nDrove to a gorgeous lake after I got off work today. Read a chapter and a half of How To Write Short while I was there. The lesson from that book? Mark up your books more. Jot down your thoughts in the margins because that's where the magic happens. Good avice. Then drove a dope Jeep Cherokee back to the ranch and ate steaks with my family. After putting lil boots to sleep I watched a movie with my mom called _The Gentlemen_. I enjoyed it and this rap scene from the movie went hard.\n\n![[https://youtu.be/DOPzWkyb3PU?si=5_cJN2YM-Y8HfR2V](https://youtu.be/DOPzWkyb3PU?si=5_cJN2YM-Y8HfR2V)](https://miro.medium.com/1*z1qIRTeCgw2EubwiyfPuyQ.png)\n\nThe film got me thinking about the dynamics of big money. As they say, \"more money, more problems.\" While it's just a movie, it portrayed how real power players might employ ruthless strategies. There is no doubt the actual drug trade involves wealthy individuals willing to backstab and deceive for an advantage.\n\nBeing in Montana's wilderness provides an interesting perspective on money. Out here, no amount of wealth can buy what you want if there are no people, products, or services to fulfill your requests. It reminds me of that meme about software engineers dreaming of farm life, while farmers dream of being developers. There are trade-offs in both lifestyles. It's easy to fantasize about things without realizing the challenges they entail.\n\nMost money's true value lies not in the money itself, with the exception of gold, which makes great jewelry. You see, without people, money becomes worthless. In our society, we often get so caught up in the pursuit of wealth that we mistake the menu for the food - thinking money is the end goal when it's really about what money can buy.\n\nWith enough money, you can certainly buy a beautiful ranch in Montana and furnish it with nice amenities. But when you're on the side of a mountain, your dollars are practically only good for kindling. It's a humbling reminder of what truly matters in life.\n\n7/10/24\n\nConor Jay Chepenik",
  "wordCount": 332,
  "readingTime": 1.4528301886792452,
  "claps": 1,
  "voters": 1
}