{
  "id": "cde4eebabf12",
  "title": "Day 813",
  "createdAt": "2024-06-13 02:56:19",
  "tags": [
    "power"
  ],
  "url": "https://chepenikconor.medium.com/day-813-cde4eebabf12",
  "content": "# Day 813\n\nIn the realm of power and politics, there is a golden rule that all the cunning and conniving players knew and revered: Law 13 of \"The 48 Laws of Power\" by Robert Greene. It's a gem of wisdom that states, \"When asking for help, appeal to people's self-interest, never to their mercy or gratitude.\"\n\n![](https://miro.medium.com/0*YWw4VKDbebCsGJtz)\n\nHere are some great examples throughout history:\n\n**The Louisiana Purchase**\n\nIn the early 19th century, the United States was eager to gain control of the Mississippi River and the port of New Orleans. President Thomas Jefferson, the sly fox that he was, dispatched envoys to France to negotiate a deal. Napoleon Bonaparte, the emperor of France, was facing potential conflict with the British and saw an opportunity to bolster his finances by selling the Louisiana Territory, which was vulnerable to a British invasion.\n\nJefferson's envoys played a strategic game, appealing to Napoleon's financial interests and his desire to reduce France's presence in North America. They cleverly pointed out that selling the entire Louisiana Territory would benefit both parties: the U.S. would expand its territory, while France would gain much-needed funds.\n\nAnd so, the deal was struck, with Napoleon pocketing the cash, and the U.S. securing a prize far greater than they had initially hoped for. It was a win-win situation, or as they say in the world of power, \"Every great achievement is built on the backs of other people's desperation.\"\n\n**The Kissinger-China Connection: A Game of Cold War Chess**\n\nFast-forward to the Cold War era, and Henry Kissinger, the astute strategist of the United States, sought to counterbalance Soviet influence by forging a relationship with China. He initiated secret diplomatic efforts, emphasizing the mutual benefits of opposing the Soviets.\n\nMao Zedong, the pragmatic leader of China, was eager to counter Soviet influence and recognized the potential for economic and technological benefits from opening relations with the U.S. This strategic alignment led to President Richard Nixon's historic visit to China in 1972, marking the beginning of the normalization of diplomatic relations between the two nations.\n\nFor the United States, this newfound alliance meant a significant strategic advantage in the Cold War, isolating the Soviet Union and creating new economic opportunities. For China, it opened doors to Western technology and investments, setting the stage for economic reforms and modernization. Both nations saw improved geopolitical stability and a shift in the global balance of power, showcasing the profound impact of appealing to mutual self-interests.\n\n**The Marshall Plan: A Monetary Masterstroke**\n\nAfter World War II, Europe was in ruins, and the communists were circling like vultures around their prey. The United States stepped in with the Marshall Plan, providing over $12 billion (equivalent to over $100 billion today) in economic aid to help rebuild Western European economies.\n\nThe plan appealed to Europe's self-interest in economic recovery and stability, while also serving the U.S.'s strategic interest in creating strong, non-communist allies and markets for American goods. It was a masterful stroke of diplomacy, using money as the ultimate weapon to win hearts and minds.\n\n**The Treaty of Tordesillas: A Geopolitical Gambit**\n\nIn the 15th century, Spain and Portugal were both eager to claim new territories in the New World. However, they needed to avoid conflict over overlapping claims. Enter Pope Alexander VI, who brokered a treaty dividing the newly discovered lands outside Europe between the Spanish and Portuguese Empires.\n\nBoth countries had a strong interest in avoiding conflict and securing their claims to new lands for exploration and colonization. The treaty effectively averted potential disputes and allowed both nations to focus on exploration, much like two predators circling the same prey but agreeing to divide their spoils instead of fighting over them.\n\n**The Cuban Missile Crisis: A Nuclear Near-Death**\n\nExperience The final example of Law 13 at work comes from the Cuban Missile Crisis, where the United States discovered Soviet ballistic missiles in Cuba. President John F. Kennedy and Soviet Premier Nikita Khrushchev engaged in a tense standoff, each side refusing to back down.\n\nIn the end, Kennedy appealed to Khrushchev's interest in ensuring Soviet security and maintaining a balance of power. The two leaders agreed to a secret deal: the U.S. would remove its missiles from Turkey in exchange for the removal of Soviet missiles from Cuba. It was a narrow escape from nuclear war, but one that demonstrated the power of appealing to self-interest in achieving a peaceful resolution.\n\nAnd so, the lesson of Law 13 remains: when seeking help, always appeal to the self-interest of others. For in the world of power, it is not mercy or gratitude that drives the game, but the cold, hard logic of self-preservation and mutual benefit. That said, 13 is an unlucky number, and if you appeal to someone's greed who wishes to be virtuous: good luck.\n\n6/12/24\n\nConor Jay Chepenik",
  "wordCount": 814,
  "readingTime": 3.2716981132075476,
  "claps": 0,
  "voters": 0
}