{
  "id": "ce6a03597cc",
  "title": "Seeing Ourself In The Television Shows We Watch",
  "createdAt": "2021-04-05 16:48:09",
  "tags": [
    "media",
    "communication",
    "television",
    "dialogue",
    "desire"
  ],
  "url": "https://chepenikconor.medium.com/seeing-ourself-in-the-television-shows-we-watch-ce6a03597cc",
  "content": "# Seeing Ourself In The Television Shows We Watch\n\nDoes anyone else ever feel like when you are binge-watching a television show you have similar cravings to the characters in that show? When I was watching \"It's Always Sunny In Philadelphia\" I was always feeling tempted to day drink. Luckily, I was pretty good about keeping my urges in check, but I do think it's funny how much television can influence what we crave. Another example of this is cigarettes. Whenever I see someone smoking a cigarette in a television show/movie I always get cravings to smoke a cigarette myself. Then when I try to smoke a cigarette it's a miserable experience and I'm reminded why I don't smoke cigarettes, but I still have that thought \"Damn that looks nice\" every time I see someone smoking on the screen.\n\nNow I'm watching the Sopranos and I'm constantly longing to be in New Jersey. Not sure what you would call this phenomenon, but it is fascinating. Back when television first came out I imagine the media had so much power by broadcasting to the masses in a one-way dialogue.\n\nI know I've blasted social media in my past posts, but if one great thing has come from it social media challenges the status quo in the sense that the media can no longer relay their message to the masses in a one-way type of communication. Too many ways for individuals to interact and spread a message of their own. So cheers to all the social media platforms that make sure the mainstream media can't control the narrative for their own gain. Or at the least, limit the power these organizations have and make it so the rest of the people in the world have a voice as well.\n\nAlways got to find the silver linings :p\n\n4/5/2021\n\nConor Chepenik",
  "wordCount": 310,
  "readingTime": 1.169811320754717,
  "claps": 0,
  "voters": 0
}