{
  "id": "ced0d8360146",
  "title": "Day 60",
  "createdAt": "2022-05-21 17:54:10",
  "tags": [
    "dreams",
    "coffee-shops",
    "bitcoin-coffee",
    "god",
    "religion"
  ],
  "url": "https://chepenikconor.medium.com/day-60-ced0d8360146",
  "content": "# Day 60\n\nCan't stop dreaming about sports. No clue why, but I keep dreaming I'm about to watch professional sports games. In my dreams, I'm still recovering from my appendicitis so I can not actually play which is frustrating but I'm very up close to the action. It isn't just football I'm dreaming about either. Had a dream I was on the sidelines for a hockey game which I've never played in my life. Wish I had though, Hockey seems fun. Sports are some of the best modern-day equivalents for entering a true flow state. Watching sports is cool, but nowhere near as fun as actually playing. Since hanging up my football cleats I've probably watched the least amount of football in my life. Could be because as an adult you get other responsibilities, but another part of me thinks it is because when I'm not actually able to play it just makes me miss the sport the more I watch it. I can still play the occasional flag football game, but not many opportunities to pick up an 11 v 11 tackle football game hahaha.\n\n![](https://miro.medium.com/1*6Np7Ab2xBudR6N1j7wgW3w.jpeg)\n\nStarted reading _The Soul After Death_ by Fr. Seraphim Rose and got goosebumps reading it. Growing up I was raised Catholic and as I got older I stopped believing in God for a brief moment. Quickly realized being an atheist was not the move, and became a Christian again. I won't pick a denominational family because I think it doesn't matter to God. I also lean towards the camp that the Jewish God, Muslim God, Christian God, and any religion I might have missed are all the same God. It is a fool's game, in my humble opinion, trying to prove your religion is the right one. I came back to religion because there is too much on this planet that can't be explained. There has to be a higher power in this world that makes it all possible. Religion is great because it shows you how to be a decent person. To help others and not get so caught up in whatever you might be focused on. What is meant to be will be. Religion allows for me to sin and then find forgiveness. That doesn't mean I should go looking for sin, as a matter of fact, it is the opposite. I should try to avoid it, but since I'm human I'm sure I will sin again. Knowing that I will be forgiven is so powerful. It makes me want to sin less. Which is becoming increasingly difficult in modern times. Obviously, technology changes and it makes the human condition difficult to live a truly sin-free life. We have problems and challenges that 50 years ago people wouldn't even understand because they didn't have smartphones. I do appreciate the fact that in Christianity if you give yourself to God you will be okay. I was genuinely scared for a second when I was in the hospital on Wednesday. I said some prayers and God looked over me. Never got to the point of a near-death experience which was appreciated. Reading the first couple of pages _The Soul After Death_ was a wake-up call that I want to be on good terms when my day comes. Hopefully, it is a long time from now, but who knows what that experience is like. That book does have me convinced our soul is what makes everything function in our body. Our body can still break down and have parts that don't work. There was one story about a blind guy who had his soul leave his body during a near-death experience and he saw perfectly when outside of his body, but upon return, he could not see again. This does lead me to believe the soul is the energy of the body. Without it, nothing else works. Can't run a car without gasoline, or electricity if you whipping a Tesla.\n\nAnyways, religion is a lifelong journey and one we all figure out as we go. Your relationship with God is determined by the faith you put in. It is great to hear others' stories, but I've found people who force their views on others just push them away in the end. Thus, I think seeking truth for yourself from as many people as possible is ideal. I didn't get the importance of Church as a kid. It annoyed me I had to go and even now I rarely go. I do want to strengthen my relationship with God though so when I'm done with _The Soul After Death_ I will look into starting the bible. Chruch's can be great if you don't know where to start but I think the most important relationship you can have with God is the voice in your head. If you pay close attention to what is inside your body you can start to feel God. Atheists might call it a bunch of electricity and chemical reactions occurring, which yea it is, but the only reason those reactions can occur is because a high power made it so.\n\nTalked with my girl about opening a Bitcoin Coffe Shop. I think it would be an incredible small business. A place for Bitcoiners to gather and discuss ideas while drinking amazing coffee. It would be cool to host a spot that great minds can come and share ideas. Kind of like what our founding fathers did back in the day before they revolted in 1776 and gave the world the greatest country the earth has ever seen. Yea I'm biased and what not, but the U.S did become the dominant global power for a reason. I'd like to see the world now flourish under a Bitcoin standard where everyone could win. God did create Satoshi so he must've been thinking it's time to end the dollar heminogy and start a win-win scenario for everyone. A global reserve currency that doesn't require everyone else suffering inflation so Congress can spend money they don't have. Anyways, it is Saturday so I am going to go enjoy myself. Love you anon, thanks for reading.\n\n5/21/22\n\nConor Jay Chepenik",
  "wordCount": 1029,
  "readingTime": 4.083018867924528,
  "claps": 0,
  "voters": 0
}