{
  "id": "cf815b668d4b",
  "title": "Day 212",
  "createdAt": "2022-10-21 02:30:41",
  "tags": [
    "community",
    "regulation",
    "sec",
    "bitcoin",
    "soap"
  ],
  "url": "https://chepenikconor.medium.com/day-212-cf815b668d4b",
  "content": "# Day 212\n\nPM Liz Truzz resigned today which seems like a big deal. Don't know much about British politics and not sure what this means for their government outside of the fact they need a new Prime Minister. That said, I don't think it's a good sign that the UK is having a PM resign with the shortest tenure ever on record while they are experiencing energy shortages, super high inflation, and a bunch of other indicators that things aren't great. Hopefully they can get a PM who opposes war, seeks peace, and lets the free market operate but I am not holding my breath. I would assume the WEF is drooling at the mouth to install another puppet who will follow their heinous policies. This is the new world order people hope you enjoy owning nothing and eating bugs!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/grdecter/status/1583127476825653249&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nJokes aside, I am hopeful. Finished the podcast between Preston and Jeff this morning and I'm reminded how important are own time on this planet is. Using it wisely is important because we can make a massive difference. While the identity of Satoshi is unknown, his creation has the potential to free humanity from Central Banks. If Satoshi had listened to the naysayers I'm not sure what the world would like but I imagine there would be a lot less hope in it.\n\nRead a powerful piece from Erik Voorhees today which was a response to SBF's call to regulate crypto. Erik gets a lot of shit from maxis for being into CrYpTo but the dude can write well and I appreciate his perspective on this subject.\n\n> [**A Response to SBF and Principled Crypto Regulation - Money and State**](https://www.moneyandstate.com/blog/response-to-sbf)\n\n> In it he states, \"The vast majority of Iranians, like the vast majority of Americans, are good people. They are not criminals. And to make a criminal of a good American because she does business with a good Iranian... this is inexcusable for a nation that purports to be virtuous. Two good people interacting voluntarily with each other should not be a crime.\"\n\nThis was in reference to the fact that Americans ca not legally do business with anyone in Iran because of OFAC sanctions. I didn't even realize this was a thing but how ridiculous. Erik is spot on and it is heinous that citizens are coerced to not cooperate by the threat of violence. I didn't agree with everything, mostly the part about Ether being one of the great inventions ever, but the majority of the essay was really insightful. The fact consenting adults must face uncertainty about whether or not the cryptos they trade are securities is ridiculous. Enforcement through litigation is wrong and if Gary really wants to help consumers they need to make the rules clear or back the hell off. It is sad to think about the opportunity cost many developers have faced and likely chosen the less risky route because they either didn't have the money to pay a lawyer or didn't want to risk the SEC coming down their throats. The free world is seeming like the U.S.S.R more and more.\n\nBitcoin fixes this though. Over a long enough time horizon Bitcoin makes it so institutions that not only don't provide value, but limit said value in the world, will become obsolete. In a free market consenting adults can cooperate freely. The SEC claims to be protecting the people, but the reality is they haven't protected squat. Politicians are constantly insider trading and the SEC is busy worrying about whether computer code passes the howie test. Shameful. I honestly think most of these crypto tokens are securities if we apply the howie test but the SEC has clearly shown they don't want to help. They would much prefer to litigate than actually answer questions.\n\n> Like Erik pointed out, \"I don't believe anyone, even the die-hard libertarians, are really opposed to an agency like the SEC of CFTC prosecuting someone who steals or defrauds people. Gary, go after fraudsters and I will applaud your work.\"\n\nIf the SEC was helping I'd be happy to see them arrest fraudsters but from everything I've seen they have no desire to do that. Maybe I'm missing something but from an outsider looking in it seems that Gary Gensler is more concerned with his legacy than with protecting the people he pledged to protect.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FZqTjwsJ3r68%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DZqTjwsJ3r68&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FZqTjwsJ3r68%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nListened to this podcast on the way to my Bitcoin meetup tonight and it was incredible. I highly recommend and I'm hopeful Blackrock will default based on what I'm hearing from Tom & Marty. It was a great conversation piece to discuss at the meetup and others actually brought up this exact podcast. Shoutout my boy Jackson for recommending. Finally, I got this piece of soap from a nice guy named Jordan at the greater Boston Bitcoin meetup. God I love the Bitcoin community.\n\n![](https://miro.medium.com/1*FY0MgXAg-Uu3ObBxuTf7Hg.jpeg)\n\n10/20/22\n\nConor Jay Chepenik",
  "wordCount": 831,
  "readingTime": 3.3358490566037737,
  "claps": 0,
  "voters": 0
}