{
  "id": "d276d2a77fb1",
  "title": "Day 833",
  "createdAt": "2024-07-03 03:58:38",
  "tags": [
    "bold"
  ],
  "url": "https://chepenikconor.medium.com/day-833-d276d2a77fb1",
  "content": "# Day 833\n\nToday I got to interview two super cool people for my side gig at Bitcoinnews. Here is the article for the first interview:\n\n**A Bold Way To Build A Bitcoin Exchange**\n\nImagine living off your Bitcoin stack. That experience is what motivated Bold's CEO, [Zack Pardey](https://x.com/ZacharyPardey), to build a Bitcoin exchange. Living off your Bitcoin is much easier said than done, especially depending on where you live in the world. Even in the United States, with some of the most developed financial systems, there are still tons of frictions to consider. To simply pay off credit cards it can require navigating between multiple platforms - the Bitcoin network, Bitcoin wallets, exchanges, and traditional banks.\n\n\"We know how resistant the fiat world can be to all things Bitcoin. Many bankers and politicians feel threatened by Bitcoin, viewing it as a disruptive force. The fiat system often reacts like oil to the water of the Bitcoin network,\" Zack noted to Bitcoinnews.\n\nThrough his journey dealing firsthand with these challenges and inefficiencies of navigating between multiple platforms, Zack decided with his team that it was time for something new, something: Bold. \"I had the vision for the integrated platform and I thought it was a bold vision because we knew that it would be a real challenge to build because these two systems don't necessarily want to work together, but given the state of the world, they kind of need to work together in order to be able to bridge the two worlds and to be able to bridge us as a society to a hyper Bitcoinized world.\"\n\nGetBold aims to be more than just a Bitcoin exchange. The vision is to become a seamless, all-in-one Bitcoin experience where you can bank and save in the world's first truly scarce asset. Launched with the goal of upgrading the Bitcoin stacking journey, Bold is designed to be easy to use, self-sovereign, and beautifully intuitive. It's Bitcoin-only, built by Bitcoiners for Bitcoiners.\n\nZack faced a unique challenge while living off his Bitcoin stack: traveling with his life's savings stored on a hardware wallet. Carrying around such significant wealth, secured by just 12 words or a small device, can be as nerve-wracking as traveling with very large amounts of cash.\n\nSecurity is paramount in the Bitcoin world, and Bold addresses this with Bold Vault. This feature employs a 2-of-3 multisig collaborative custody setup, where users hold two of the three keys, while Bold holds the third key as a backup, ready to sign transactions at the client's request. This way, clients have complete control of their funds, but if they lose a key or only have one on them, they can have Bold help move funds. Supported devices include Trezor, Ledger, and Cold Card. Multisignature custody protects against theft and loss, ensuring your Bitcoin remains safe from single points of failure.\n\nBold isn't just about security; it's about making your Bitcoin experience better. For a limited time, new users can claim $25 in free Bitcoin when making their first buy and pay zero fees on the first $10k of buys. After that, fees remain low at just 0.99% for buys and sells of any size.\n\nTo help mitigate Bitcoin's price volatility, Bold offers automated recurring purchases. This feature allows clients to set up weekly or monthly investments, enabling dollar-cost averaging into Bitcoin over time. This approach transforms the investment strategy from a speculative venture into a systematic method of saving in the world's most scarce money.\n\nZack noted that the Bold team is just getting started. The next big step? Integrating a banking service into the platform so clients can have FDIC-insured USD and a debit card for spending that fiat. The team's vision is to create a place where Bitcoiners can manage everything without ever leaving the Bold app. No more jumping between exchanges and banks - Bold aims to bring it all under one roof.\n\nIt's safe to say that Bold has some bold goals to become a new standard for Bitcoin exchanges by combining security, ease of use, and an all-encompassing vision for the future. If you're a Bitcoiner looking for a better way to stack and secure your coins, Bold is a platform to watch.\n\n![[https://x.com/ZacharyPardey/status/1808139844243104150](https://x.com/ZacharyPardey/status/1808139844243104150)](https://miro.medium.com/0*od3Lt9vW-uTgu9iy)\n\nIf you want to try [Bold sign up here.](https://app.getbold.io/rewards?p=true&r=chepenikconor%40gmail.com&c=6y128xD&u=preview%40getbold.io&s=copy)\n\n7/2/24\n\nConor Jay Chepenik",
  "wordCount": 728,
  "readingTime": 2.9471698113207547,
  "claps": 0,
  "voters": 0
}