{
  "id": "d2f03706e9a9",
  "title": "Day 1179",
  "createdAt": "2025-06-14 02:43:45",
  "tags": [
    "hodling-vs-spending",
    "bitcoin",
    "food",
    "for",
    "thought"
  ],
  "url": "https://chepenikconor.medium.com/day-1179-d2f03706e9a9",
  "content": "# Day 1179\n\nBitcoiners are stuck in two camps.\n\nThe HODLers: stacking like honey badgers, afraid to ever sell.\n\nThe Spenders: zapping sats to build the future. Here's why both are half-right and some things to consider\n\n![](https://miro.medium.com/0*DPwxCDxeEKHWIxK2)\n\nSatoshi called Bitcoin \"Peer-to-Peer Electronic Cash.\" Not \"digital gold.\" Not \"number-go-up tech.\" It was made to be used as permissionless money. But that's only half the story since fiat currency has been an awful store of value over the years.\n\nGlassnode shows over 60% of Bitcoin hasn't moved in over a year. HODLing is at record levels. Long-term holders are locking up supply like never before. Saylor put it nicely today \"If it's not going to zero, it's going to a million.\"\n\n![](https://miro.medium.com/0*rlf8gGflxvETMYgB)\n\nBut here's the twist: Lightning Network payments are exploding. → Merchants are integrating → Remittance rails are opening → Fast food chains are accepting zaps, I literally grabbed SteaknShake 2 days ago & paid with sats. Instant. Permissionless. Felt like the future.\n\n![[https://x.com/ConorChepenik/status/1932953383997977078](https://x.com/ConorChepenik/status/1932953383997977078)](https://miro.medium.com/1*VwqvQVKlVOw3SSrsPNFd_g.png)\n\nSo what gives? The more valuable Bitcoin becomes, the less people want to spend it. Why pay 0.0002 BTC for coffee today...if those sats might buy you the entire coffee farm in 10 years? (probably not but never say never) Welcome to the Pizza Day paradox.\n\nThis splits the tribe:\n\nStore-of-Value Maxis → Stack. Wait. Delay gratification.\n\nSpend-and-Replace Activists → Use it. Build circular economies. Zap sats, then refill the stack. Both believe in Bitcoin. They just prioritize different chapters of its adoption curve.\n\nEnter Gresham's Law: \"Bad money drives out good.\" Fiat = melting ice cube Bitcoin = digital granite So what do people do? Spend dollars. Hoard sats. It makes perfect sense... until it doesn't.\n\nBecause money that never moves... isn't really money. Tools like Muun, Phoenix, Alby, CoinJoin mixers, & so many more exist for a reason. They aren't gimmicks. They're infrastructure. They're how we go from digital gold → global reserve currency.\n\nAnd in places like Nigeria, Argentina, and El Salvador... Bitcoin is money. People don't HODL because they can't afford to. They spend Bitcoin to survive. To pay rent. Buy groceries. Escape capital controls. HODLing is a luxury...something I try to remind myself of living in the USA.\n\n![](https://miro.medium.com/0*oTeseKpHmxy5lwpO)\n\nThe truth? Bitcoin is both savings tech and payments tech. That's not a contradiction. It is one of the superpowers that make Bitcoin amazing magic internet money. → Save with cold storage → Spend with Lightning → Replace when you can → Stack for sovereignty\n\nBitcoin is freedom. Freedom to save. Freedom to spend. Freedom to choose. This debate will never end but that's a feature, not a bug. Stack sats. Zap good memes on Nostr. Figure out what works best for you. Everyone has their own set of priorities so consider what tradeoffs work for you.\n\nIf you want a more in depth analysis than this Medium post I used AI to help me make a podcast and you can listen to it on X:\n\n![[https://x.com/ConorChepenik/status/1933714679412506631](https://x.com/ConorChepenik/status/1933714679412506631)](https://miro.medium.com/1*3gXmItp-e-FAuyWSBlMQaQ.png)\n\nOr if you prefer to watch your videos on Youtube here is the other link\n\n![[https://youtu.be/GgSIjd26oVA](https://youtu.be/GgSIjd26oVA)](https://miro.medium.com/0*B55QKh2bffh5xHBb)\n\n6/13/25\n\nConor Jay Chepenik",
  "wordCount": 518,
  "readingTime": 2.9047169811320757,
  "claps": 0,
  "voters": 0
}