{
  "id": "d62a38caf0af",
  "title": "Day 346",
  "createdAt": "2023-03-04 03:30:09",
  "tags": [
    "ai-art",
    "psyops",
    "joe-rogan",
    "bitcoin",
    "russell-brand"
  ],
  "url": "https://chepenikconor.medium.com/day-346-d62a38caf0af",
  "content": "# Day 346\n\n**My tips for generating cool AI art. Psy-ops. First dabble at true UI work (probably should've planned a little more before coding but f it we ball) Let's get into it.**\n\nI had a buddy reach out and say he would send me some sats for AI generated art. It was a kind offer and I sent him some AI generated photos for free because I enjoy generating them and appreciate my buddies work to help onboard people to the Bitcoin life raft. You can checkout his work here.\n\n> [**The Fiat Cave | MacroJack | Substack**](https://fiatcave.substack.com/)\n\nOne comment he made was I should come up with a framework for how to do AI art generation and sell a course. Not the worst idea, but I'd rather start creating a community, give away value for free, and then put faith in my community returning that value. So here are some tips to improve your AI art generation.\n\n1. Choose a good starting image: Start with an image that has a good composition and is visually interesting. This will help the AI generator create more interesting and complex output. This is one of my favorite features on nightcafe.studio because you can edit already created images to be more unique.\n\nBefore\n\n![](https://miro.medium.com/0*yG1aw2dp3Eg7KtVA.jpg)\n\nAfter\n\n![](https://miro.medium.com/0*JzaD1bOsLpZ7Ic6V)\n\n2. Experiment with different AI models: There are so many many different styles to choose from. The example above is just one. Don't be afraid to adjust the parameters: Most AI art generators have adjustable tools such as color scheme, texture, and level of detail. Play around with these settings to create the look and feel you want.\n\n3. Play with as many AI art generators as you can. Each has its own unique algorithms and features. Try experimenting with different models to see which one produces the best results for your specific needs.\n\n4. Keep it simple: Sometimes less is more when it comes to AI art generation. Simple, abstract images can often be more visually striking than complex, realistic ones. For example I tried to get to fancy with this one and got this.\n\n![](https://miro.medium.com/0*IIHTCeTHPSOfD9CJ)\n\n5. Use high-quality source images: The quality of your source images can have a big impact on the output of your AI generator. Make sure your source images are high-quality and have good resolution (if you are going sourcing route instead of prompting).\n\n6. Don't be afraid to iterate: AI art generation is an iterative process. Don't be afraid to generate multiple versions of the same image and make tweaks until you get the result you want.\n\n7/ Have fun with it: AI is getting exponentially better, but it sure is not perfect yet. The more you play around with the tool, the more you'll learn about what works and what doesn't.\n\nOn another note I read this article today. Pretty sad to see this in the Financial Times. I'd expect better from the FT but mainstream media seems to like to shooting at their own feet. Anyways...\n\n> [**Psy-ops are a crucial weapon in the war against disinformation**](https://www.ft.com/content/1e030bbb-a074-4fbd-94c5-94fe579a9a8a)\n\nThe real misinformation of these past 3 years is not being able to question the narrative. So many mainstream media outlets blew their reputation on obvious lies. [Calling a noble prize winning drug horse dewormer](https://www.isglobal.org/en/healthisglobal/-/custom-blog-portlet/ivermectina-un-medicamento-de-nobel-pero-poco-accesible/91127/0)? Joe Rogan makes a good point about the short sightedness and damage that occurs to a mainstream-media outlet's credibility when they blatantly lie to the public. The answer to combit misinformation, according to this FT article, is more psy-ops. I do appreciate the honesty.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F7p7u5CZdpYtLcFnsEwzPNB%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F7p7u5CZdpYtLcFnsEwzPNB&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f51d320cb301e78b0e8b56af1&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nOf course you should read as many things as possible, always check your sources, and be careful when online. The idea that the same people who botched the past 3 years should be the ones in charge of policing disinformation online is comical. Especially in an age when information changes rapidly and new facts are revealed constantly. One of my favorite parts of that podcast is when Russel Brand talks about a guy he knew who worked in an intelligence agency. The guy said he would never forget seeing a chart in 2001 when the amount of information from that one year equaled the amount of information of recorded history. Then the next year that doubled.\n\nIt's possible I'm botching that paraphrasing but the episode is worth the listen if you want to hear Russel say it. Makes you wonder how much misinformation has been spread over the years. The biggest misinformation of course being war. People should be trading freely and operating in open decentralized markets. Will get to that future soon enough thanks to Bitcoin. Sad we have to deal with the kleptocrats for the time being, but they will keep shooting themselves in the foot \"trying to combat misinformation\". The more they lie the more they lose credibility. Keep the fiath anon. We are going to win.\n\nOn a final note for today I spent some time coming up with the UI/UX for deciding how to sell tickets on MassAdoption.net and I'm pretty proud of the work. Still have tons to learn but it was cool thinking about how a user would go through the journey of buying tickets.\n\npage 1\n\n![](https://miro.medium.com/1*E5kiwdAT2HNx_M9ZD3UkXw.png)\n\npage 2\n\n![](https://miro.medium.com/1*kEb7ZOP1cBEcm260teZDfQ.png)\n\npage 3 (if they pay in fiat)\n\n![](https://miro.medium.com/1*sIZgU0ybSQrAefIH4VRVmg.png)\n\npage 3 (if they pay in bitcoin)\n\n![](https://miro.medium.com/1*vl_DGe7fFB5UT3i3IcnWLA.png)\n\nNeed to actually integrate an API (likely with [Strike](https://invite.strike.me/MZKOQO)) to generate an invoice to accept bitcoin. If you aren't using Strike use that link above to get 5 dollars in bitcoin if you sign up and make a deposit.\n\nAlso need to get our ticketspice page spun up. In due time they will be. Then users will actually be able to buy tickets instead of clicking the button and nothing happening.\n\nExcited to put on the MassAdoption Freedom Festival with my fellow Bitcoiners. Amazing experience getting to think through the designing of the website. Nice having parters as well who are working behind the scenes to make sure the actual festival comes together. Lot of moving parts but it makes life more fun. Find what you love and spend more time doing that :)\n\n3/3/23\n\nConor Jay Chepenik",
  "wordCount": 1057,
  "readingTime": 5.038679245283019,
  "claps": 50,
  "voters": 1
}