{
  "id": "d6f0ba5ab792",
  "title": "Day 363",
  "createdAt": "2023-03-21 02:29:13",
  "tags": [
    "children",
    "coding"
  ],
  "url": "https://chepenikconor.medium.com/day-363-d6f0ba5ab792",
  "content": "# Day 363\n\nI asked AI what ways it would help humanity flourish.\n\n1. Improving Communication: Effective communication is essential in various fields, from business to personal relationships. As a language model, I can help people improve their communication skills by offering suggestions on word choice, tone, and sentence structure. This can lead to better relationships, more successful negotiations, and increased collaboration, all of which can benefit humanity.\n\n2. Providing Mental Health Support: Mental health is a growing concern globally, and I can provide assistance by providing a non-judgmental and safe space for people to express their concerns. I can also offer coping strategies, resources, and guidance on how to seek further help. This can promote emotional well-being and help reduce the stigma surrounding mental health.\n\n3. Promoting Cultural Understanding: Cultural differences can sometimes lead to misunderstandings and conflicts. As a language model, I can provide a platform for people to ask questions and learn about different cultures. This can foster empathy, promote inclusivity, and encourage a more peaceful world.\n\n4. Helping with Research and Development: I can assist researchers in their studies by providing data, analyzing results, and generating new ideas. This can speed up the pace of scientific discovery and innovation, leading to new technologies, medical breakthroughs, and other advancements that can benefit humanity.\n\nAll of these ideas seem great. Number 4 makes me feel uneasy though. I've seen chatGPT spit out some very bias responses. The way to see past cultural differences is to not see color and treat people based on their actions. Not seeing color is a vague statement. I'm just not sure how to phrase it better and too lazy to ask chatGPT another meta question about itself lol. What I hope for is that chatGPT is willing to teach people to respect others based on their actions and not based on various woke ideologies. We can appreciate cultural differences while acknowledging the common humanity that binds us together. If someone is acting inhumane not wanting to interact with said person has nothing to do with their culture.\n\nAsking this question then got me down a Twitter thread writing rabbit hole. This is what I came up with today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1637991366608158722%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThis thread was also partly inspired after listening to this Bitcoin podcast.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F0U7Gli54yqTYfyc67o4KvZ%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F0U7Gli54yqTYfyc67o4KvZ&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f474f72640b2611da482cb670&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nSo much signal. Worth the 3 hour listen (Two hours if you listen at 1.5x speed :D )\n\nIn other news I had my first day of in-person coding bootcamp today which was cool. One important thing I learned is that an object is in instance of a class. Think about it like this I am an object and humans are the class. My dog Kobe is an instance of a dog. Twitter is an instance of social media. You can set up classes like this and create objects by passing arguments to the class constructor. These objects then have attributes and methods that are defined by the class. By creating instances of a class, you can create multiple objects with similar properties and behaviors, which makes it easier to manage and manipulate data in your code. Overall, understanding the relationship between classes and objects is fundamental to object-oriented programming, and it's exciting to learn about these things in my coding bootcamp. If you don't find that interesting, I don't blame you, but it's a shame because software can do amazing things. Software is hard to explain though and taking the time to write down and communicate what you learn can be super helpful.\n\nI'll end today's post by noting that having a kid is the best thing I've ever done. Sure babies are super fussy at times, but they are also the most incredible thing you have ever seen. When they are your child anyways. My Dad asked me a day after the birth if my life had changed after having my first kid. I said yes but it was kind of a half-hearted yes. I didn't comprehend it at the time because it was all a blur the week after my partner brought life into this world. Well two and a half months into this thing and I'm just starting to realize how lucky I am. Today I literally cried for like 15 minutes just holding and admiring my kid. The best happiest tears I've ever cried. Man it feels good. Having kids feels like I have a whole new sense of purpose in life. It feels like exactly what I'm supposed to be doing and makes me want to be a better man. Try it anon. You might regret it initially and then you'll quickly realize there is nothing more beneficial for society than becoming a parent and spending the majority of your time doing stuff to help the next generation thrive. Here is a photo of Boston I took on my walk home from the bootcamp today with an AI generated baby cropped in🫡\n\n![](https://miro.medium.com/1*29iucTt7UVWIccPNpMIArQ.jpeg)\n\n3/20/23\n\nConor Jay Chepenik",
  "wordCount": 819,
  "readingTime": 3.290566037735849,
  "claps": 1,
  "voters": 1
}