{
  "id": "d783062895c9",
  "title": "Day 391",
  "createdAt": "2023-04-18 02:28:07",
  "tags": [
    "btc",
    "react"
  ],
  "url": "https://chepenikconor.medium.com/day-391-d783062895c9",
  "content": "# Day 391\n\nGoing to use today to try and get another piece into Bitcoin Magazine's print edition. Here goes nothing!\n\nComparing the traditional financial system to a crackhead might seem a bit unfair because the drug addict at least has a chance to get better. The legacy financial system on the other hand is so far gone that no amount of liquidity can fix fiat. Our money should be built on bedrock, but unfortunately it has been built on quick sand. Using legacy systems is like using an unreliable translator in a foreign country. The Fed, acting as the translator, often gives wrong advice, causing confusion and mistrust. When the Fed's ledger becomes increasingly unreliable due to unchecked money printing, it's as if the translator starts inventing words and phrases, leading to a breakdown in communication.\n\nThe traditional financial system's complexity stems from a lack of transparency and verifiability in asset ownership and transfer. Intermediaries such as banks and clearinghouses are meant to verify and settle transactions, but their vulnerability to corruption and compromise often results in financial instability. This is exacerbated by the persistent issue of fractional reserve banking, which can provide unfair advantages but ultimately erodes public trust and triggers financial crises.\n\nIn contrast, Bitcoin offers a more transparent and verifiable system that doesn't rely on middlemen. Transactions are recorded on a public, immutable ledger called the blockchain, which anyone can access and verify. This eliminates the need for intermediaries and reduces the possibility of corruption and fraud.\n\nMoreover, Bitcoin operates on a fixed supply, with a predictable inflation rate that prevents the unchecked money printing seen in the traditional financial system. This helps to maintain the value of the currency and encourages responsible monetary policy.\n\nBitcoin can be seen as the perfect translator because it's based on math, a universal language that everyone on the planet can understand. This ensures that there is no room for misinterpretation or manipulation, providing a solid foundation for a financial system that promotes trust and stability.\n\nAs the traditional financial system continues to struggle with the \"translator effect,\" more people are turning to Bitcoin as a more reliable, transparent, and verifiable alternative. By embracing this innovative technology, we can build a more stable and inclusive global financial system that empowers individuals and promotes economic growth. Bitcoin provides a promising alternative that addresses all of these challenges and paves the way for a more stable and equitable financial future. Thanks God for the universal language of mathematics. Now we can bask in absence of unneccesary middlemen.\n\n...\n\nDon't love this yet but we made progress. I did get distracted and build out part 1 of Habit-Chain after watching this video.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FRh3tobg7hEo%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DRh3tobg7hEo&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FRh3tobg7hEo%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nLFG!\n\nHere is a sneak peak.\n\n![](https://miro.medium.com/1*XlHRAyz12eZzuQOvn1jgcw.png)\n\nLot of work to be done but sheesh I've been talking about building this app forever and I finally did it!\n\n4/17/23\n\nConor Jay Chepenik",
  "wordCount": 480,
  "readingTime": 2.0113207547169814,
  "claps": 0,
  "voters": 0
}