{
  "id": "d78b528fd3ed",
  "title": "Day 887",
  "createdAt": "2024-08-25 23:26:45",
  "tags": [
    "friendship",
    "sailing",
    "life"
  ],
  "url": "https://chepenikconor.medium.com/day-887-d78b528fd3ed",
  "content": "# Day 887\n\nBeen a long weekend, but an incredible one. Had the chance to reconnect with my freshman year roommate, Q, and it got me thinking about how quickly time passes and how life evolves.\n\nThe weekend was packed with great moments. Reuniting with Q, my college roommate, was definitely the highlight. We also got to enjoy some time on a sailboat, visit my grandparents, and have some deep conversations about life.\n\nIt feels like just yesterday that Q and I were gearing up for college - two wide-eyed freshmen eager to play football and start our new adventures. Now, here we are, both adults with real jobs and responsibilities. The contrast is striking, and it's made me realize how swiftly time flies.\n\nQ and I couldn't be from more different backgrounds. He's from Los Angeles - literally the opposite side of the country from me. Yet, we connected instantly at Tufts and became best friends during our freshman year. It's one of those serendipitous friendships that college often brings about.\n\nInterestingly, we've both ended up working in the digital assets space, albeit with different focuses. I'm a dedicated Bitcoiner, while Q is more into other cryptocurrencies and NFTs. Despite our differing views, I admire his success and love seeing him crush it in his career.\n\nThis weekend reminded me of the importance of maintaining connections and reflecting on our journeys. I'm incredibly grateful for the opportunity to reconnect with Q and see how we've both grown since our college days.\n\nAs I sail back into my routine, I carry with me renewed appreciation for old friendships, the passage of time, and the unexpected ways our paths can align even as we pursue different dreams.\n\n![[https://x.com/ConorChepenik/status/1827498379221287046](https://x.com/ConorChepenik/status/1827498379221287046)](https://miro.medium.com/1*sH9sfKHCSUqkoudfQGnR8Q.png)\n\n8/25/24\n\nConor Jay Chepenik",
  "wordCount": 290,
  "readingTime": 1.2943396226415094,
  "claps": 23,
  "voters": 2
}