{
  "id": "d812406ab769",
  "title": "Day 357",
  "createdAt": "2023-03-15 01:15:21",
  "tags": [
    "meditations",
    "the-soul",
    "after-death"
  ],
  "url": "https://chepenikconor.medium.com/day-357-d812406ab769",
  "content": "# Day 357\n\nI recently started rereading Fr. Seraphim Rose's book, _The Soul After Death_ which explores the traditional Orthodox Christian understanding of the soul after death. Coincidentally, I am also reading through \"Meditations\" by Marcus Aurelius, who lived in Rome during the 2nd century AD. In Book IV, Marcus suggests that the soul is eternal and continues to exist after death, moving on to another stage of existence beyond human perception. It is fascinating to note the similarities between the beliefs of Fr. Seraphim Rose and Marcus Aurelius, despite the fact that they lived in vastly different times and cultures. Both agreed that the soul is separate from the body and capable of growth through personal discipline and introspection. They also shared the belief that the soul is eternal and continues to exist beyond physical death.\n\n![](https://miro.medium.com/0*ouZWd8IyulWeGiVQ)\n\nHowever, there were some differences in their beliefs. Fr. Seraphim Rose emphasized the importance of judgment and repentance after death, while Marcus Aurelius focused on cultivating the soul through self-reflection and moral virtue in the present life. Nonetheless, both authors saw the soul as a central aspect of human nature with the potential for eternal existence beyond physical death.\n\nTo give a little more insight in _The Soul After Death_ I've summarized five of the main concepts below.\n\n1. The soul's separation from the body: Fr. Seraphim Rose believed that the soul and the body are separate entities and that the soul continues to exist after the body dies. He believed that this separation is a natural process that occurs at death and that it is a necessary step in the journey towards the afterlife.\n\n2. The soul's judgment: Fr. Seraphim Rose believed that after death, the soul is judged by God according to its deeds in life. He emphasized the importance of repentance and living a righteous life in order to attain salvation. He also stressed that the soul's judgment is a personal experience, and that each individual is judged according to their own actions.\n\n3. The existence of demons: Fr. Seraphim Rose believed in the existence of demons and their role in tempting humans towards sin. He warned against the dangers of materialism and the pursuit of worldly pleasures, which can lead to spiritual emptiness and ultimately damnation.\n\n4. The nature of heaven and hell: Fr. Seraphim Rose believed that heaven and hell are real places that exist after death. He described heaven as a place of eternal joy and communion with God, while hell is a place of eternal suffering and separation from God. He emphasized that the choices made in life determine one's ultimate destination in the afterlife.\n\n5. The importance of prayer and spiritual practice: Fr. Seraphim Rose believed that prayer and spiritual practice are essential in preparing the soul for the afterlife. He stressed the importance of developing a personal relationship with God through prayer, fasting, and other spiritual disciplines.\n\nNow here are 5 takeaways from Meditations about the soul.\n\n1. The soul's eternal nature: Marcus Aurelius believed that the soul is eternal and exists beyond the physical body. He wrote, \"The soul, being eternal, after death is like a caged bird that has been released. If it has been a long time in the body, it will suffer for a while after being released, but then it is restored to its place of origin and there feels no more pain.\"\n\n2. The importance of self-reflection: Marcus Aurelius believed that self-reflection is essential in understanding the nature of the soul and achieving spiritual growth. He wrote, \"Take a good look at yourself, and scrutinize yourself carefully. Are you doing the things that you want to be doing? Are you living the life that you want to be living?\"\n\n3. The transitory nature of physical existence: Marcus Aurelius believed that physical existence is temporary and that the soul's true home is in the eternal realm. He wrote, \"Do not waste your time on what is temporary or what will not last. Focus on the eternal, and you will find peace.\"\n\n4. The role of virtue in the soul's journey: Marcus Aurelius believed that cultivating virtue is essential in preparing the soul for the afterlife. He wrote, \"Live a virtuous life, and you will find that the soul is prepared for whatever comes after death.\"\n\n5. The interconnectedness of all souls: Marcus Aurelius believed that all souls are interconnected and that the actions of one person can affect the entire universe. He wrote, \"The universe is interconnected, and so are our souls. What you do affects not only yourself, but everything around you.\"\n\nWhile these two might have differed on the specifics both clearly understand the soul is the most important part of our \"self\". By reflecting inwards and taking time to learn about ourselves we can better prepare our soul for the afterlife. Both stressed the importance of there being more to life than our finite time here. One quote that really hit me is \"Do not waste your time on what is temporary or what will not last. Focus on the eternal, and you will find peace.\"\n\nI think that is part of what attracted me to Bitcoin. The fact that it will last long after I'm gone. There are also plenty of other things like how it can help humanity thrive. Which ties in with the point Marcus made about everything being interconnected.\n\nSometimes I get so excited to orange pill other people but the truth is the best thing I can do is work on myself. Continue to put in the time to understand myself, my hopes, my dreams, my soul. We are always changing and I can't fix all the world's problems. What I can do is be the best version of myself and that will help more good spread in the world. Funny to think Fr and Marcus wrote these books which had a major impact on my life in a positive way. Ironic because they talk so much about how to prepare yourself for the afterlife you would think these two would not have made such a large impact on the world. Maybe that is the key though. If you focus on what matters you can help others on this finite planet. Maybe one day someone in the distant future will get value out of these blog posts. Which I do hope is the case but what is more important is I get value out of them. If I can do what I know is right then the rest will figure itself out. That is my belief.\n\n3/14/23\n\nConor Jay Chepenik",
  "wordCount": 1091,
  "readingTime": 4.316981132075472,
  "claps": 0,
  "voters": 0
}