{
  "id": "d8e6465818f4",
  "title": "Day 317",
  "createdAt": "2023-02-03 02:29:24",
  "tags": [
    "family",
    "grandparents",
    "ask"
  ],
  "url": "https://chepenikconor.medium.com/day-317-d8e6465818f4",
  "content": "# Day 317\n\nGot to have my Daughter meet her Great-Grandma today and it was a beautiful moment. One that brought some tears to my eye. My Grandma has been struggling recently and had to do dialysis today. When she got carted back into her hospital room from the treatment I could tell it had been hard on both her mind and body. When she saw her great-grand-baby that all changed. It was amazing to see how much her spirit was lifted when looking at Sloan! Such a beautiful moment that this AI image didn't merely capture well enough, but still not bad for a random AI generated photo with the prompt \"A great grandchild baby and their grandmother seeing each other for the first time\"\n\n![AI generated photo from nightcafe.studio](https://miro.medium.com/0*3sYnELhwbBWCK9BT)\n\nI'm not one to tell people what their religious beliefs should be. Never have been and I pray to God I don't ever become that. People should verify for themselves and figure out their own belief systems. What I will say is that it is hard to see that kind of love and not believe in a higher power. It's a beautiful thing. Family is so special.\n\nI love living in Boston but being down here makes me want to move back home. Just so I can be around family. It's awesome having loved ones around to help. That said, I'm going to do big things with Mass Adoption and I've built a special community up there I'm not ready to abandon.\n\nTime will tell what happens. I need to listen to my heart. This coding bootcamp I'm taking has been a grind, but I'm loving it. Need to be a little better with my time management so I don't just end up coding until the late hours of the night but that's alright. My schedule has understandably been a bit all over the place due to visiting family and seeing my grandmother in the hospital. It's reassuring to see her getting better, especially when she spends time with my little one and fills up with love. It's hard to describe the energy in words, so I'll just leave it at: love is something special.\n\nOn a more exciting and less personal note, Shane got back to me and agreed to come on my podcast. LETS GOOOOOOOOO!!! I give my Dad crap often (and he gives it back) but that video he sent had a real positive impact. If you don't ask the answer will always be no.\n\nWise words to live by. Go out and ask something that makes you uncomfortable anon. Talk to you tomorrow. 🤝🫡\n\n2/2/23\n\nConor Jay Chepenik",
  "wordCount": 440,
  "readingTime": 1.860377358490566,
  "claps": 10,
  "voters": 1
}