{
  "id": "d963f7e12490",
  "title": "Day 1109",
  "createdAt": "2025-04-05 01:09:13",
  "tags": [
    "trying",
    "new",
    "things",
    "usa",
    "baby"
  ],
  "url": "https://chepenikconor.medium.com/day-1109-d963f7e12490",
  "content": "# Day 1109\n\n![](https://miro.medium.com/1*SJ2fnzgBAiS9rTqp3S0HcQ.png)\n\nYou can now prompt yourself into an action figure with chatGPT. Here is my prompt: \"A stylized plastic action figure of the character in the photo with the same exact features as the photo i sent, sealed in collectible blister packaging. The background of the packaging features a futuristic circuit board pattern in turquoise and gold hues, with centered bold white text at the top that says \"Chep\" with a return spacing sub lettering saying \"Action Figure\" in white. The figure is displayed in a central transparent casing, as his full body character. To the right of the figure are three miniature accessories: A Bitcoin hardware wallet, a colt 1911 airsoft gun, and a gold chain with a cherub on the chain each floating in their own compartments. The design is sharp, clean, and hyper-realistic, with a subtle plastic shine on the figure and a modern tech-inspired vibe.\"\n\nI used this photo:\n\n![](https://miro.medium.com/1*mt7-N-YB2G0Rp6j6PG4lCg.png)\n\nI'm bullish on tech. Especially now, with everyone on X playing tariff expert. I can't predict what'll happen, but I love that we're trying something fresh. Tech has the potential to transform everything and give America serious leverage to bring manufacturing back home. It'll be fascinating to watch it all unfold. Sure, it could flop, and I hope it doesn't, but sticking to the same old playbook that landed us $36+ trillion in debt clearly wasn't cutting it. Shaking things up feels right.\n\nIt's a now-or-never moment. The alternative, stagnation, would've been a brutal lesson, likely ending with institutions crumbling entirely. At least this way we give ourselves a chance to salvage them. In a 4th turning, which I'd say we are in, many institutions will still fall. Yet in my humble opinion, those that embrace innovation, experiment, and adapt might make it through. Those set in their ways will get clobbered. It's clear America is trying to get out of being set in our ways.\n\nSo cheers to that!!!\n\n4/4/25\n\nConor Jay Chepenik",
  "wordCount": 332,
  "readingTime": 1.6361635220125785,
  "claps": 1,
  "voters": 1
}