{
  "id": "d9c52f6cfaa3",
  "title": "Day 499",
  "createdAt": "2023-08-03 20:12:05",
  "tags": [
    "open-mind",
    "closed-mind"
  ],
  "url": "https://chepenikconor.medium.com/day-499-d9c52f6cfaa3",
  "content": "# Day 499\n\nTomorrow will be halfway to 1000 days, but that's getting ahead of myself. Even thinking about day 500 is getting ahead of myself because all I have is the present moment. It's funny to think about how much of our time in the present is concerned with the future or past.\n\nLiving in the moment is a skill that takes practice. It's easy to get caught up in thoughts of the past or dreams of the future. But the present is the only time we can truly act. Yesterday has gone and tomorrow is not guaranteed. The future will become the present soon enough. Rather than daydreaming or dwelling on regrets, I try to be fully engaged in whatever I'm doing right now. When my mind wanders to the past or future, it is important to gently bring it back to the present. Each moment is an opportunity to live fully. The future will take care of itself if I live with intention in the here and now.\n\nSpeaking of living with intention I made a new website which can be found here. The whole thing is coded in Python which was cool to learn for this project.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fchepython.streamlit.app%2F%3Fembed%3Dtrue&display_name=Streamlit&url=https%3A%2F%2Fchepython.streamlit.app&image=https%3A%2F%2Fstorage.googleapis.com%2Fs4a-prod-share-preview%2Fdefault%2Fst_app_screenshot_image%2Facbdbb70-2df4-418a-9410-cedad783538b%2FHome_Page.png&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=streamlit\" title=\"\" height=\"630\" width=\"560\"></iframe>\n\nI also made a Youtube video showing how I made this. It's free to host and uses Github, Python, Streamlit, Magic Webstore and some other tools. So cool that in 2023 you can host a website completely for free. Now if you need to scale up yes Streamlit I'm sure costs money. For a personal website though it's hard to beat free.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FoHUf66_NKGc%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DoHUf66_NKGc&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FoHUf66_NKGc%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nToday, I had an interesting discussion with my partner about the value of both open-mindedness and closed-mindedness. Often, society associates a negative connotation with the latter and praises the former. However, both approaches have their merits. Here are five reasons why being open-minded is valuable:\n\n1. Embracing new ideas and perspectives: An open mind leads to growth and continuous learning as it allows us to explore different viewpoints.\n\n2. Adaptability to change: Being open-minded fosters flexibility, making it easier to adjust to new circumstances.\n\n3. Empathy and understanding: Open-mindedness enables us to connect with a diverse range of people and promotes compassion for others.\n\n4. Reducing judgment and prejudice: An open mind encourages acceptance of differences and helps us overcome biases.\n\n5. Driving innovation and progress: By welcoming new information, an open-minded approach fuels creativity and propels us forward.\n\nOn the other hand, being closed-minded can also have some benefits:\n\n1. Reinforcement of existing beliefs: Closed-mindedness provides a sense of stability and confirmation of one's views.\n\n2. Quicker decision-making: When new information doesn't need to be processed, closed-mindedness can facilitate decisiveness.\n\n3. Streamlined thinking: A narrow focus can help avoid confusion arising from too many differing viewpoints.\n\n4. Protection from threats: Closed perspectives can shield us from embracing harmful or inconvenient ideas.\n\n5. Preserving tradition and loyalty: Resistance to change reinforces commitment to established ways.\n\nStriking a balance between the two mindsets is key:\n\nThe most effective approach lies somewhere in the middle. Combining open-mindedness with cautious skepticism offers the best of both worlds. An open yet discerning orientation, anchored in core values, allows us to pursue knowledge and innovation without losing sight of what truly matters.\n\n![Generated on nightcafe studio](https://miro.medium.com/1*L0QXPg6ekerhkBZ73cNSgw.png)\n\nThe only thing guaranteed is change.By being open to new possibilities but closed to true threats, we can thoughtfully evolve while maintaining our moral compass.\n\n8/3/23\n\nConor Jay Chepenik",
  "wordCount": 569,
  "readingTime": 2.347169811320755,
  "claps": 0,
  "voters": 0
}