{
  "id": "da1bbb69b5f3",
  "title": "Day 78",
  "createdAt": "2022-06-08 20:10:17",
  "tags": [
    "pepe",
    "based",
    "bitcoin",
    "politics",
    "money"
  ],
  "url": "https://chepenikconor.medium.com/day-78-da1bbb69b5f3",
  "content": "# Day 78\n\nAnother day another dollar. Dreaming of the day I can open my own comedy club and name it Chep's Comedy Club. Hahaha I feel like I would do a great job running a comedy club.\n\n> [**From Bernie To Bitcoin: In Search Of The Revolution**](https://bitcoinmagazine.com/culture/from-bernie-to-bitcoin-in-search-of-the-revolution)\n\nRead this article today and thought it was really well done. I agree with the author that having short-sighted politicians control the money is ridiculous. I'm not even trying to blame politicians here. Look at the incentives of the position they hold. All these people are gunning for reelection the second they get in office so of course, they aren't going to be able to think long term. The TL;DR was that Bitcoin can take the control of money out of politics which would do so much good. Imagine if our politicians were forced to actually do their jobs rather than buy call options (Looking at you Nancy Pelosi, but let's be real it's a bi-partisan thing done by many). Absolutely ridiculous how much money some of these people make while in office trading the stocks they legislate over while running up the deficit. The state doesn't deserve to control money. The state is currently trying to hinder the second amendment after sending $40B to Ukraine. This meme sums it up pretty well.\n\n![](https://miro.medium.com/1*ChVCmwbXAHJOYVmzP1g2eg.jpeg)\n\nPepe is so based. Responsible gun ownership is based. The U.S.A's constitution is based. Having the masses take back control of the money is going to be based.\n\nWe are going to win people. I can feel it in the air. Went for a walk and the sweet smell of the summer breeze was potent today. People are fed up with the B.S that has gone on for two years and they are ready for change. You love to see it.\n\n6/8/22\n\nConor Jay Chepenik",
  "wordCount": 324,
  "readingTime": 1.4226415094339622,
  "claps": 0,
  "voters": 0
}