{
  "id": "da5f1763d3d8",
  "title": "Day 922",
  "createdAt": "2024-09-30 00:49:44",
  "tags": [
    "life",
    "fernandina",
    "sound-bowl",
    "spirituality",
    "glory-be-to-god"
  ],
  "url": "https://chepenikconor.medium.com/day-922-da5f1763d3d8",
  "content": "# Day 922\n\n'Twas an excellent Sunday today - I started the day by crushing my opens at work. I don't have to work on Sunday, but I like to clear my opens at work at least one day during the weekend so when I come in Monday I am not swamped with a backlog of tickets I need to attend to. I then got up and went to Fernindina beach with my family and enjoyed breakfast at a nice diner.\n\nThen we went into the downtown and went shopping. We got some good stuff including mint chocolate chip ice cream that I shared with my daughter.\n\n![](https://miro.medium.com/1*l42FVNWC9dnuphPtVsmNmg.png)\n\nHowever, my favorite part of the trip was getting this sound bowl. It's so awesome the sound this thing makes. I'm not a Buddhist, but man did Buddhists get it right with their sound bowls.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//x.com/ConorChepenik/status/1840465645726552282&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nFinished the day by eating steak, salmon, salad, and potatoes at my Mums. I also got to attend the Tucker Carlson live show last night with my Grandpa. Poor quality photos in my tweet below.\n\n![[https://x.com/ConorChepenik/status/1840213595872747838](https://x.com/ConorChepenik/status/1840213595872747838)](https://miro.medium.com/1*xe_F0rknY27hBya47MCkbQ.png)\n\nAnyhow, I should probably try to get back to writing quality stuff here soon. Come to think of it quality is not the right word. A better word(s) would be 'posts for an actual audience'. I could change quality since I'm still writing this, but I won't because I also like these stream of consciousness posts. It feels more real to me that way. I understand that these Mediums which I treat like a journal are ones which most people won't care to read, but I know I will care to read them when I look back in many years.\n\nIf I'm being honest all the essays I've written that have paid me the most money I had AI help me write. It was of course my ideas, my curation, and my editorial decisions that made the pieces what they are, but AI helped me. I have AI help me all the time writing. Why would I not use tools to improve my ideas? It is important to learn how to write without it, but once you have learned not using them seems silly. It's like math. Yes I'm glad I learned long division and multiplication by hand, but since then I always use a calculator when I need to do math, unless it's simple enough to do in my head.\n\nNow that I think about it though it would probably be good to relearn long division and multiplication (outside the 12 x 12 stuff I can do via my brain since that multiplication table is seared into my mind) since I've forgotten how to do those things by hand. Especially long division, I could probably do the multiplication by hand. Use it or lost it, as they say. Writing is like that too. So I'm not having AI help me at all with this piece and I must say it feels nice to just write a more candid Medium. One that is not for an audience, but for myself. I think that's beautiful when you are writing for yourself. Doing it because it makes **you** happy not someone else. I mean that's the holy grail in a career. Being able to do something you love for yourself. Not giving a shit what others think. Yet, that is a damn hard thing to do. Worth it though.\n\nGlory be to God. So grateful for everything he has given me.\n\nThere is a spirtual battle going on. I am convinced of this. Feel more. Let your intuition guide you. Seek the light. Speak the truth. Don't betray yourself or you will live a life of regret.\n\n![](https://miro.medium.com/1*r-qU53dMUp7EjBjLMidfmQ.png)\n\n9/29/24\n\nConor Jay Chepenik",
  "wordCount": 615,
  "readingTime": 2.870754716981132,
  "claps": 2,
  "voters": 1
}