{
  "id": "db3f394275eb",
  "title": "Day 458",
  "createdAt": "2023-06-24 03:53:28",
  "tags": [
    "thomas-paine",
    "common-sense"
  ],
  "url": "https://chepenikconor.medium.com/day-458-db3f394275eb",
  "content": "# Day 458\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1615753413790146560%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThomas Paine wrote Common Sense in 1776 during the American Revolution. His purpose was to advocate for American independence from British rule and to inspire colonists to support the cause. Paine aimed to challenge the authority of the British monarchy, expose the injustices of the British government, and rally the American people to embrace a republican form of government, emphasizing the principles of self-governance and individual rights. In this essay, I will showcase seven of my favorite quotes from Paine's influential work, demonstrating their enduring relevance and the valuable lessons we can learn from them today.\n\n> 1. Society in every state is a blessing, but Government, even in its best state, is but a necessary evil; in its worst state an intolerable one.\n\nThroughout recorded history, the protection of private property has proven to be essential. In the absence of organized governance, individuals with power often exploited their strength to seize what they desired. Governments emerged as a means to establish a higher authority, yet as Paine astutely remarked, 'Government, even in its best state, is but a necessary evil.'\n\nWith the advent of Bitcoin, Satoshi Nakamoto introduced a groundbreaking system that grants property rights to anyone worldwide through a network operating on rules without the need for rulers. By leveraging mathematics and open-source software, private property can be secured in a manner that surpasses traditional government structures. The inherent incorruptibility of mathematical principles serves as a robust safeguard against human fallibility.\n\nOver time, governments tend to succumb to corruption, incompetence, and mistakes that can lead to the breakdown of society. In contrast, Bitcoin's decentralized nature and reliance on mathematical algorithms offer a more resilient foundation for protecting private property and upholding societal stability.\n\n> 2. The harder the conflict, the more glorious the triumph. What we obtain too cheap, we esteem too lightly: it is dearness only that gives every thing its value.\n\nThomas Paine's voice echoes through time, reminding us that true value and appreciation arise from overcoming challenges and persevering in our endeavors. These sentiments find resonance and relevance among Bitcoiners of today.\n\nEngaging with Bitcoin requires dedication, as it entails countless hours of learning and understanding. Even after attaining a profound comprehension of Bitcoin, securing private keys and weathering the volatility pose ongoing challenges, albeit ones that become more manageable with experience. As one delves deeper into the Bitcoin rabbit hole, the inevitable truth becomes apparent: fiat currency is on an inexorable path towards worthlessness. While some may view Bitcoin as a get-rich-quick scheme, a more fitting analogy portrays it as a safeguard against the slow erosion of wealth. I like the mantra\"Don't get poor slowly\" better.\n\nPaine's quote also applies aptly to the practice of money printing. Central banks worldwide have grown accustomed to conjuring credit out of thin air and charging others interest on this freshly printed money. Individuals who toil for their earnings tend to be more mindful of their spending, in stark contrast to those who can create money without any opportunity cost. \"What we obtain too cheap, we esteem too lightly.\"\n\nThe Congressional Budget Office, in 2020, released a chart illustrating the alarming trajectory of debt-to-GDP ratios, projected to exceed 200% by 2050. At our current rate, it may not even take that long to reach such levels. It has become unmistakably clear that those in positions of power harbor no intention to halt the incessant printing of money, consequently devaluing fiat currencies.\n\n![](https://miro.medium.com/0*g18R2ZQABDkTnIiv)\n\n> [**The 2020 Long-Term Budget Outlook**](https://www.cbo.gov/publication/56516)\n\nCommon sense unequivocally urges us to acknowledge that these entities will persist in their relentless printing endeavors until fiat currencies teeter on the precipice of worthlessness. Hence, it would be unwise to wait until the eleventh hour to seek refuge.\n\nThrough my extensive study of Bitcoin, I have come to a realization: simply telling others to buy bitcoin is not an effective approach. The persuasive strategy to orange pill people lies in encouraging them to learn about Bitcoin. By immersing themselves in its intricacies, individuals can make informed decisions regarding its merits as a superior form of money compared to fiat currency. In my experience, I have yet to encounter an intelligent person who has devoted more than 100 hours to studying Bitcoin and concluded that it is not a more viable and robust monetary alternative.\n\n> 3. A long habit of not thinking a thing wrong, gives it a superficial appearance of being right.\n\nSaifedean Ammous highlights a significant historical event in his book _[The Fiat Standard](https://saifedean.com/the-fiat-standard/)_. During World War I, the Bank of England issued bonds for war financing. Only 1/3 of the bonds were subscribed, indicating a lack of public interest in supporting the war. However, instead of halting the war effort, the Bank of England resorted to a rather unconventional approach. They extended a line of credit to their two top officials, empowering them to purchase the remaining two-thirds of the bonds. In essence, the bank utilized its monopoly over money to self-fund and sustain a war that the citizens clearly did not support. This top-down control exhibited by central banks has had long-lasting consequences and has allowed certain individuals to amass wealth without contributing real value to society.\n\n![](https://miro.medium.com/0*Uzcjgu0F3jDDgDX1.jpg)\n\nIt is worth noting that the Bank of England, established in 1694, holds the distinction of being the world's eighth oldest bank. This historical context is significant because central banks have become so ingrained in our modern world that no living individual has experienced a time when they did not exist. While many argue for the necessity of central banks, I wholeheartedly disagree with this notion. In my view, the world would be a better place without the presence of parasitic entities that monopolize the most critical market of all: money.\n\n![](https://miro.medium.com/0*BZH8ibKQY26nslWA)\n\n> 4. It is the good fortune of many to live distant from the scene of sorrow; the evil is not sufficiently brought to their doors to make them feel the precariousness with which all human things hang.\n\nWhen it comes to the harmful consequences of printing money, the true extent of the damage is not always apparent, as it tends to be obscured. Some individuals in America engage in virtue signaling by displaying the flag of Ukraine on their social media profiles, portraying themselves as supporters of a just cause. However, it is crucial to recognize that war brings no winners; both sides suffer the tragic loss of lives. As ordinary citizens, it is our responsibility to demand an end to this conflict. While it is undeniable that Putin's actions have been terrible, simply printing more money and providing it to Ukraine will not solve any of our underlying issues. In fact, it only serves to prolong a deadly war, resulting in even more loss of human lives, while corrupt leaders strategize how to finance post-war reconstruction.\n\n![](https://miro.medium.com/0*S0lAsz2zCKmmBs45)\n\n> 5. The mind once enlightened cannot again become dark.\n\nPeople joke that Bitcoin is a cult. While I agree Bitcoiners can often engage in cult like behaviors I believe it is because once you've seen how corrupt the system is you want to so desperately fix it. Fix the money; fix the world.\n\n> 6. The strength and power of despotism consists wholly in the fear of resistance.\n\nWhen the U.S. military possesses the ability to utilize force and coercion to seize assets, it may seem that resistance is futile. However, this dynamic changes when the use of force and coercion no longer guarantees successful confiscation of wealth. Before the advent of Bitcoin, it was possible to perpetrate acts of violence to acquire someone's wealth entirely. However, with Bitcoin, if an individual securely protects their private keys, the government can still harm them physically, but they cannot seize their wealth. This creates a significant shift in the equation, where the costs of attacking remains constant or decrease, while the benefits of an attack decrease significantly. Bitcoin effectively raises the cost of oppressing the people, making it economically burdensome for tyrannical forces to subjugate the masses.\n\n> 7. Until an independence is declared, the Continent will feel itself like a man who continues putting off some unpleasant business from day to day, yet knows it must be done, hates to set about it, wishes it over, and is continually haunted with the thoughts of its necessity.\n\nIn 1776, we declared independence from the British. Today, our task is to declare independence from fiat currency. While losing the ability to print the global reserve currency out of thin air is not without its challenges, it is imperative to move away from fiat currency for the greater good. Although there may be some difficulties in transitioning, America will emerge stronger as a result. The beauty of this endeavor is that it can be achieved through peaceful means, unlike the violent revolution of the past. We no longer need to take lives to declare our independence; we can simply choose to stop relying on fiat currency as our primary store of value.\n\n![](https://miro.medium.com/1*UVzZzJOShNtWA5t7962wSw.png)\n\n6/23/23\n\nConor Jay Chepenik",
  "wordCount": 1520,
  "readingTime": 6.569182389937106,
  "claps": 0,
  "voters": 0
}