{
  "id": "db4077007270",
  "title": "Day 193",
  "createdAt": "2022-10-02 01:14:42",
  "tags": [
    "medicine",
    "poison",
    "central-banks",
    "inflation",
    "alcohol"
  ],
  "url": "https://chepenikconor.medium.com/day-193-db4077007270",
  "content": "# Day 193\n\nWent to a fair last night with my girlfriend which was cool and also sad. It was really neat seeing animals up close and being reminded that I'm so fortunate there are farmers across the globe providing food for the rest of the world. It was saddening though because seeing these animals caged up seemed unnatural. There was one part of the fair that had horses in cages but the cages gave the horses almost no room to move around. Many of the horses eyes looked so sad. There was also a cow exhibit where some baby cows wouldn't stop mooing. Seemed like they were calling for their mother. I don't know what to think. It was sweet getting to see animals so up close but I was also sad to see that some of them looked unhappy. Animals might not be able to think abstractly like humans but I do believe they feel emotions. When my lease is up in April I would definitely like to raise animals and do everything I can to give them a happy life. Need to figure out what animals I can raise up in NH. Seems like chicken are a good animal to raise. Saw some chicks hatching yesterday at the fair and they were adorable.\n\n![](https://miro.medium.com/0*EL2nxsPguihdl1SF)\n\nWatched this music video again because I wanted to get in a better mood and again I got goosebumps.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F_9WndByCoG0%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D_9WndByCoG0&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F_9WndByCoG0%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nLoved the Ron Paul quote at the end so much that I decided to post a picture of it in this essay. Peter St. Onge made the point in the Svetski podcast I shared yesterday that inflation is so insidious because at first it takes like medicine. The problems don't show up till later on so people don't realize how bad printing money is for everything else. I think the same can be said for Central Banks. They seem like the medicine if your country is about to lose a war because it can't fund it anymore. I've written for Bitcoin magazine how the Bank of England literally gave a fresh loan to its two top officials so they could buy the remaining war bonds from the BoE to keep funding the war. Keynes called this a masterful deceit and Keynesian Economics as we know it today was born.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/gladstein/status/1576205385291026433&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nAmazing video from Alex Gladstein showcasing how Bitcoin is the escape hatch from this tyranny. I do believe most people in the world are good but are rulers are so incompetent and self-interested there are sanctions, tariffs, and all sorts of other geo-political B.S imposed by the rulers of the world. There was a time where the rulers of countries were selected on merit. This was called aristocracy. At this point in time they seem to be selected on the basis of who is the biggest cuck to the deep state and this is called democracy. Hahahahha deep state is a great term we Americans came up with. No surprise that electronics are becoming cheaper while the important things like healthcare and education are becoming more expensive. One lets the deep state spy on its citizens while the other helps them survive and think critically. Obviously, there is more nuance than my little deep state jab but overall the ideas hold true.\n\n![](https://miro.medium.com/0*_JAxZTiALgAJddHX)\n\nWent to some October fest festival in Boston today and while it was fun I'm reminded alcohol is like inflation. Poison that feels like medicine initially only to feel awful later on. Maybe there is some good in the poison because I'm writing this later part while under the influence of alcohol and it helps me tie some ideas together. Overall though I'm not looking forward to waking up and I'm grateful I had to walk around 2 miles back from South Boston because I know my liver (and body) is going to be grinding to get all this alcohol out of my system. Maybe inflation is like that as well. It absolutely sucks but it shows people (through pain) that there are better alternatives. Like Bitcoin and not relying on alcohol to have a good time.\n\nAnyways, what the hell do I know. I'm just a mere pleb trying to get through this weird thing we call life. Happy it is October though. The years are flying by now that I'm an adult.\n\n10/1/22\n\nConor Jay Chepenik",
  "wordCount": 725,
  "readingTime": 3.119182389937107,
  "claps": 0,
  "voters": 0
}