{
  "id": "db5032a91173",
  "title": "Day 133",
  "createdAt": "2022-08-02 23:38:12",
  "tags": [
    "memes",
    "knitting",
    "child",
    "giving",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-133-db5032a91173",
  "content": "# Day 133\n\nLife is a trip man. While clown world seems more prevalent everyday I scroll Twitter I just laugh it off. People have always been pulling bullshit, now you can just see it 24/7/365 on social media feeds. Nothing has changed except the technology that makes it more apparent. The thing that's great though is the internet comment sections are full of some hilarious memes. It does help if you know where to look, but sometimes the stupidest memes are the funniest. I guess that's why \"less is more\" is such a well known phrase.\n\n![](https://miro.medium.com/1*OeuWbQ8rP31RPxkkGrqQwQ.jpeg)\n\nApparently Freud, the \"father\" of modern psychology was a massive coke head. In his defense I don't think people understood the harm cocaine could cause considering it was a part of coca-cola for awhile. I do think drugs get demonized way beyond what they should. Especially stuff like mushrooms. I also think drugs can be a serious problem if not taken responsibility and in high stress places like the United States because too many people start using drugs as a way to cope with their problems. I once saw someone tweet something along the lines of \"Drugs are like money. If you use it correctly they can provide incredible experiences, but if you don't know how to properly consume then you'll never fill that gaping hole in your soul.\" While my paraphrasing might've been off that tweet stuck with me. Monetary wealth, fame, power, etc all seem great, but in the long run aren't the key to happiness. Relationships, love, and knowledge are much better ways to fill the human ego with positive things. Don't get me wrong drugs (this includes alcohol, caffeine, any substance that alters your mind) and money can be super fun. Important to remember if you over do them or use it to fill a hole in your heart the consequences will not be fun.\n\nLife is short and I'd like to work towards spending more time acquiring the things that matter in life. No one will care about the number in my checking account or bitcoin wallet on the day I die (besides maybe my children who inherit what I have left). Hahahaha hopefully they care more about the legacy I left. I'm so proud of my girlfriend. She has taken up the low time preference skill of knitting and is getting really good.\n\n![](https://miro.medium.com/1*qnyKPAFn2FwpHtkeeCcbSw.jpeg)\n\nOur first born child will be decked out in solid knitting swag. While I joke about having kids who hopefully don't care about the amount of wealth I pass on I realize it's a two way street. It's on me and my baby momma to raise a kid who understands the difference between material wealth and true wealth. I want to be remembered for what I did, not what I acquired on this earth. Giving is honestly one of the best feelings. At least when you know you gave to a good cause or person. The lizard brain in me has thought \"what will my parents pass down to me one day\" while my heart knows I'm so fortunate to have had parents who love me deeply, have been incredibly supportive financially, mentally, and physically, and would do anything to help me. Remember to be zen and observe the negative thoughts while feeling the good ones deep inside. Hard to monitor your feelings if you're not paying attention 👀\n\nThe more I read Fossil Futures by Alex Epstein the more I realize I might be blinding myself by not considering the benefits and negative consequences of something. One thing that is great about going down the Bitcoin rabbit hole is I have learned more about tradeoffs. Bitcoin is full of them. Shit most things on this planet are full of trade offs. That's what an opportunity cost is, considering the tradeoffs of taking an action. It seems our current education system is full of demonizing stuff like, fossil fuels, without considering the massive positive impact they have had on our planet. This chart I [tweeted](https://twitter.com/ConorChepenik/status/1554600262408478721?s=20&t=Itt7mG_UZFFVv2GlFuRfuQ) out was truly eye-opening. Bless Alex for helping get this knowledge out there.\n\nNever stop learning anon. There is always more to be discovered\n\n8/2/22\n\nConor Jay Chepenik",
  "wordCount": 700,
  "readingTime": 3.0248427672955973,
  "claps": 0,
  "voters": 0
}