{
  "id": "dbd6ffb7482e",
  "title": "Day 235",
  "createdAt": "2022-11-13 02:59:41",
  "tags": [
    "learning",
    "learning-to-learn",
    "mit-museum",
    "ai",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-235-dbd6ffb7482e",
  "content": "# Day 235\n\nMan today was a great day. I went to the MIT museum, played 2+ hours of basketball, and got paid to walk a sweet dog named Cooper. Here are two photos from today at the MIT musuem.\n\n![](https://miro.medium.com/1*BMG97KrvV9-i4RAYdXRCKw.jpeg)\n\nI wish I could play Fortnite, Fifa, and Madden on this screen. It was enjoyable to sit and watch these bubbles move around. Also for Cambridge residents the whole museum is free. I have my beefs with Taxachusetts but this was a cool perk I discovered. Then again it was the local city/government of Cambridge that hooked it up so maybe it's a win for local community. I digress, I'd like to go back soon and listen to some speeches here. Having a piece of digital signage like this behind you as you present is pretty cool.\n\nI also got to write a poem about Bitcoin with AI today. Excuse the blurry picture it was attached to a screen that rounded upwards after you typed out your poem.\n\n![](https://miro.medium.com/1*TLtYARQMEMYGke7gM7jCPw.jpeg)\n\nThat is some MIT shit to leverage an AI to help you write. You can tell which one line the AI contributed because the text font is different from the rest. I must say that it excites me as well as makes me a little skeptical. If AI gets so good it can become a tool for the worst of humanity. Cheating, lying, defrauding, and plagiary. Not that I was a saint in college and didn't finesse when needed. I'm just glad I didn't have this AI helping me because if I had this tool for freshmen year philosophy class I would've definitely been using it for my essays and done no original work. I'm curious if the AI would get caught for plagiarism since the algorithm is likely feeding the AI many data sets from writing online. Maybe it takes all that data and mashes it together in a new unique way the majority of the time so it wouldn't be flagged for plagiarism, I'm not sure. AI can also allow for the best in humanity. A tool to innovate, find life saving drugs and medical procedures, give humanity it's time back so we don't have to spend the majority of our time in a cubicle but instead use it to learn about things we care about. Speaking of learning I can not recommend this podcast from Robert Breedlove enough. His guest here is a fast talker but provides the audience with a lot of signal.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F2sE3kRcLvBPqU42K6Ihm1k%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F2sE3kRcLvBPqU42K6Ihm1k&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f151d10d2eb04fd58fa3e993e&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nI love the mental framework that if you speed up a podcast to 1.25x and only retain 1–4% less of the content you still increased your productivity by 21–24%. Not to mention when a podcast is faster you are forced to pay attention and end up getting less distracted because you are exerting more focus to stay up to date with the people talking. At least that was my experience. Obviously, we are human and will get distracted. When that happens you can click the go back button. Or you can do that if you hear an important point. If you use the go back button all the time it might decrease your productivity another 5–10% but even with that additional hit you are still increasing the value received from the sped up podcast. Over time you can speed up podcasts more and more until you peak and find yea maybe I can't pass 3x speed without blurring the words into meaningless noise.\n\nI like this framework of pushing yourself to the max. I canceled my gym membership recently because I was going in and doing the bare minimum followed by a nice sauna. I'd prefer to just run and push myself in that area. As well as body weight exercises and pick up sports. Maybe I should go find a cheaper gym than equinox and really commit but for the moment I knew I was not receiving enough value out of equinox. This podcast was a good reminder to myself that in order to see results in anything you have to actually put in the work and take action.\n\nFinally, I need to start brainstorming some more for that Bitcoin magazine article I keep talking about writing but haven't busted out yet. I did write this last night after trying to fall asleep. It just came to me 😎\n\nBitcoin != Crypto\n\nBitcoin On An Exchange != Bitcoin Where You Hold The Keys\n\nGold Under Your Matress != A Paper Claim For Gold\n\nReading A Book != Reading The Spark Notes\n\nThere is no substitute for proof of work. I hope people learn this sooner rather than later but unfortunately for most this lesson will be learned via pain. Kill your heroes anon and remain open-minded. If you want to stop the bleeding in your own life you will need to learn why Bitcoiners believe in the idea of not trusting, but verifying for yourself. Which can seem like a massive hill to climb because Bitcoin involves finance, computer science, physics, and a bunch of other fields. However, it's a much better hill to clim than trying to recover from losing all your money on a centralized exchange going down because of fraud, poor management, or a combination of the two. 🤝🫡\n\n11/12/22\n\nConor Jay Chepenik",
  "wordCount": 882,
  "readingTime": 3.7116352201257863,
  "claps": 0,
  "voters": 0
}