{
  "id": "dc4295d42e95",
  "title": "Day 655",
  "createdAt": "2024-01-07 03:57:39",
  "tags": [
    "technology",
    "infinite-games",
    "finite-games",
    "bitcoin",
    "nostr"
  ],
  "url": "https://chepenikconor.medium.com/day-655-dc4295d42e95",
  "content": "# Day 655\n\nI just read Kevin Kelly's \"[What Technology Wants,](https://amzn.to/3ScoHe8)\" where he discusses the difference between finite and infinite games. Finite games have a clear winner or loser - examples include football, wrestling, Fortnite, and poker. They end once a winner is declared. On the other hand, infinite games have no ultimate winner and go on indefinitely. Evolution and learning are examples of such games, and I'd also argue that money, with its constant flow and exchange, is an infinite game too.\n\nCertainly, there are finite games within the business realm. When competing with another company, driving them out of business represents a finite victory. Yet, there's no definitive winning point in the accumulation of wealth. Even if one becomes the richest person in the world, the game doesn't end; it simply continues. Take Elon Musk, who currently holds that top spot. Eventually someone will surpass him either by offering greater value as an entrepreneur or because Elon dies and his children can't maintain the wealth like their father. Life is the ultimate infinite game. Money is just a tool to allow you more options in that infinite game. That is one of the best insights I took away from Kelly's book. That technology is expanding in so many ways with the ultimate goal of providing more choices.\n\nNo one desires money solely for the sake of owning physical bills or accumulating zeroes in a bank account. After all, beyond its basic use, a cash bill holds little intrinsic value (outside of being burnt for warmth or used as toilet paper), and credit cards, mere plastic rectangles have zero intrinsic worth other than serving as a book mark. The true worth of these items stems from their recognized status as legal tender, enabling the purchase of goods and services from others. It's this ability to facilitate exchange and acquire what we need or desire that gives money its real value.\n\nIt's quite astounding to realize the contrast in spending opportunities between someone in bustling NYC and another in the quiet wilderness of Montana. A $100 bill in itself is just a piece of paper, virtually worthless, yet in a city, it can be exchanged for a delicious steak. The fact that we, as a society, universally accept this nearly valueless paper in exchange for genuine goods and services is a concept that, when you really think about it, is mind-blowing.\n\nToday I also watched a profound exchange between Edward Snowden and Jack Dorsey, two titans in the realm of technology. It was a beautiful talk and my takeaway is that we need to work on building more technologies which enable optionality. This is in line with what Kelly was saying. Technology is about offering more optionality. A society devoid of the liberty to secure privacy in its communication and financial endeavors is undoubtedly in decline.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FYbe09ImCnvk%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DYbe09ImCnvk&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FYbe09ImCnvk%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThere are no perfect technologies out there but I am convinced Nostr & Bitcoin are two technologies moving in the right direction. My journey to Bitcoin was initially fueled by personal gain and self-interest. However, as I navigated deeper, my understanding and dedication transformed. I became acutely aware of the trade-offs Bitcoin made, sacrificing perfect privacy to provide an open ledger with a truly scarce token called bitcoin that is used to transact on this network without a third party. Bitcoin had to be accessible to all with an internet connection because if you can't verify the hard cap of 21 million by yourself then how can you know it is scarce? While it's true that Bitcoin isn't inherently private, its architecture allows for enhanced privacy measures for those who seek it. Nostr on the other hand is a communications protocol which anyone can run a relay for and use the protocol to transfer (zap) money (sats) around.\n\nThese technologies feel magical when you use them. Imagine telling someone from 100 years ago \"Yea I have this piece of glass in my pocket and I use it to send someone 3 cents for a funny meme\". Trying to explain what a meme is would be hard enough let alone how protocols work under the hood and why the bitcoin you sent to a random npub (nostr public key) even has any value. For the non technical you might even be reading this like what the fuck is this kid talking about? If that's you then I encourage you to learn about it and I'll do my part to try and help create more educational content about how to use these protocols. Technology provides optionality and I'm grateful to be doing my small part to try and show others the value these technologies can provide if they take the time to play more infinite games and keep iterating towards better outcomes for everyone.\n\n![If you use the link above to buy What Technology Wants from Amazon I will get a commision. If you don't want that go buy from your local bookstore or simply google it and buy from your preferred provider.](https://miro.medium.com/0*yA5IEbrvH5n1ulSy)\n\n1/6/23\n\nConor Jay Chepenik",
  "wordCount": 804,
  "readingTime": 3.233962264150944,
  "claps": 0,
  "voters": 0
}