{
  "id": "dcfe5898034a",
  "title": "Day 125",
  "createdAt": "2022-07-26 00:38:37",
  "tags": [
    "podcasting",
    "q",
    "bitcoin",
    "sauna",
    "joe-rogan-experience"
  ],
  "url": "https://chepenikconor.medium.com/day-125-dcfe5898034a",
  "content": "# Day 125\n\nWorkout and Sauna this morning is a must before going in the office for 9 hours. I must say one of the worst parts about Covid for me was not being able to access a Sauna. God I love the Sauna. Literally got a gym membership because of the Sauna and a nice side effect is I've been working out again. Just some light lifting, but damn. I was way stronger in high school/college than I am now. I could probably run farther now though so that's good. Bench pressing large amounts is cool for the bragging rights when you're playing football but at this point in my life no one gives a shit at my day job what I'm putting up on the bench. I just workout for my health and to not get fat.\n\nWas listening to an interesting [J.R.E ](https://open.spotify.com/episode/2JDW5u8BlKHM5C5wInOT4u?si=wnB0D6q-Tx6w1gQFJghZwA)today with Marc Andreesen. While I do not like what he is doing with \"web 3\" in the sense of dumping tokens on retail I think the dude is pretty smart and had some interesting takes. One of which is that in retrospect technology that seemed inevitable did not seem so inevitable when it first came out. Many big companies doubted the PC, the iPhone, and a plethora of other crucial technologies today. Overtime the majority were forced to adopt these technologies, but before they did many resisted because they didn't think the impact these technologies would have could be so impactful. I think this is Bitcoin. Marc has been able to make a lot of money on other tokens which I don't want to completely write off, but personally I'd consider better forms of securities. There can only be one money, but maybe if I was in Marc's shoes and stood to make millions (if not billions) from \"Web 3\" I'd also be shilling said tokens. The reason I don't totally scoff at all these tokens is because I like ideas like B.A.T where I get free tokens for using the Brave Browser. The problem is lots of retail just goes head first into shitcoins, gets rekted, and then misses out on why Bitcoin is so important and what it means for money in the future. Then again, people should be able to buy what they want and learn lessons the hard way. Got to put in the proof of work.\n\nOh whale, pain is a good teacher and those who wish to take the time to go down the rabbit hole can learn on their own accord. We all get Bitcoin at the price we deserve. Remaining humble and stacking will continue being my goal. I also did appreciate listening to Marc's takes on J.R.E and the web browser so cheers Marc. Been trying to learn more about how computers and software work. Makes sense considering I sell software lol. Also though I find it interesting. So weird to think computers are in essence super powerful calculators and we can get these calculators to do incredible things like video games, video chat, streaming, and all the other stuff they do to make our life easier. Computers are going to play a pretty important role in the future and I did like hearing Marc talk about how he doesn't think AI is sentient yet. Hopefully, AI is good to humans if it ever becomes truly conscious. LOL don't need a terminator movie starting IRL when I'm about to have a child. While there is so much I will not be able to predict about the future I think learning about computers will help me better understand what's happening. It will also help me better protect myself from the mass surveillance state that is growing rapidly. Seems there is hope though as Bitcoin companies work on more P2P features for stuff like video chat. Solid article I read today on Bitcoin Magazine. [https://bitcoinmagazine.com/technical/keet-the-decentralized-communications-app](https://bitcoinmagazine.com/technical/keet-the-decentralized-communications-app)\n\nIt's honestly wild how much content and valuable information I can get from the TCP/IP protocol. I look forward to the day when the LNP/BP helps separate money from the government. Soon enough, just got to keep learning and having a low-time preference.\n\nAlso had to share this screenshot from a Lyn Alden article I saw she posted about on Twitter. That woman is one smart cookie!\n\n![](https://miro.medium.com/1*6uKFpvqlfdxmQPeuChJI9A.jpeg)\n\nPretty comedic to think of Eth as bitcoin's 4th largest exchange but I guess true in a sense. Had my buddy Q on the Podcast today and I'm still thinking of what to title the Pod. Maybe a Bitcoiner and a .ETH walk into a podcast and defend their ideas. Who knows that kinda sounds lame. Need to think of something better.\n\n7/25/22\n\nConor Jay Chepenik",
  "wordCount": 785,
  "readingTime": 3.1622641509433964,
  "claps": 0,
  "voters": 0
}