{
  "id": "dd06c4dbe997",
  "title": "Day 508",
  "createdAt": "2023-08-13 02:10:00",
  "tags": [
    "politics",
    "family"
  ],
  "url": "https://chepenikconor.medium.com/day-508-dd06c4dbe997",
  "content": "# Day 508\n\nIt's Saturday night and while I really wanted to fall asleep I didn't because every day ya boi has committed to writing on here. I knew I should not have laid down in bed but it happens. I'm damn proud to have made this comittment because it has become clear to me that consistency is key to becoming great at something. Doing this everyday makes me a better writer. By the time I die I should be able to accurately articulate my thoughts via writing.\n\nSpent last night and today hanging with my cousins in Larchmont. I'm so blessed to have such a large and loving family. It was really great seeing everyone. They all loved Sloan and it was a really special moment getting to see my Aunt and Cousins bond with my Daughter.\n\n![](https://miro.medium.com/1*SfNs2V1PNBe6BL3jqFWThw.jpeg)\n\nI was cracking up this morning listening to my cousin Nash, who is around 14 years younger than me, talk on the phone with his friend about fantasy football. They were discussing trades they would consider and you would've thought that they were doing 10 figure business deals. I'm sure Nash will make a good business man one day.\n\nThe drive back from New York to New Jersey was exhausting because we spent the majority of the day out in the sun enjoying the pool. On the ride back to my partner's family I listened to Joe Rogan and Tim Dillon.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F1e9LLjYuYcNhJBqm4aYumw%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F1e9LLjYuYcNhJBqm4aYumw&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fb309ef57c428de44b5009178&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\nAn engaging and thought-provoking dialogue took place on this episode of the J.R.E. While grappling with the distressing realities of the current state of affairs in D.C., Tim provided a unique perspective on the cutthroat nature of the political environment. He astutely pointed out that individuals wielding considerable power might resort to extreme measures, even violence, when faced with threats like blackmail from their subordinates. The mere thought of such power dynamics being manipulated in such reprehensible ways is disheartening.\n\nIt's a somber reflection on the darker aspects of human nature and the misuse of authority. I guess the point I'm making is I'm grateful I have a clear conscious. I like to believe there are some good politicians out there. Thomas Massie, Rand Paul, Mike Lee, and a couple others come to mind, but I don't know. Navigating the political landscape involves ruthless strategies and cutthroat tactics. This realization serves as a reminder of the immense pressure and moral dilemmas that come with being a part of this arena. Politics is a powerful game often marred by unsavory tactics and morally compromising decisions.\n\nFreedom technologies will win in the end. Why? A. because they must. B. because this quote points out the challenges with weilding power.\n\n> Mark my words, princess... energy learns. That, we call power... Every religious business and governmental question has the single derivative: Who will exercise the power? Alliances, combines, complexes... they all chase mirages unless they go for the power. All else is nonsense, as most thinking beings comes to realize.\n\n- Frank Herbert, Dune Messiah\n\n8/12/23\n\nConor Jay Chepenik",
  "wordCount": 503,
  "readingTime": 2.09811320754717,
  "claps": 0,
  "voters": 0
}