{
  "id": "de002105e4b3",
  "title": "Day 1194",
  "createdAt": "2025-06-29 03:23:51",
  "tags": [
    "bitcoin",
    "usury",
    "money",
    "life",
    "grateful"
  ],
  "url": "https://chepenikconor.medium.com/day-1194-de002105e4b3",
  "content": "# Day 1194\n\n![Usury sucks, save in bitcoin instead of chasing yield on your savings via bonds (unless of course you like getting your life savings debased)](https://miro.medium.com/1*-QO3Y8OFLMu-d9ErGVdWwQ.png)\n\nWhen you wake up, give yourself some grace. Thank God for another day.\nRealize the present is a gift, the past a memory, and the future uncertain.\nSo make do with what you got and enjoy it.\n\nShift your framing from the pain of what you will face in the day,\nto how great the outcome will feel after completing something hard.\nEven if the hard thing is as simple as getting out of bed\nwhen the weight of everything says stay down.\n\nSome days you'll have to grit your teeth just to make it through,\nand others will open like sunflowers, full of warmth, ease, and laughter.\nBut either way, you're still here. That's something.\nThat's everything.\n\nPlay the cards you're dealt.\nDeal in the system you live in.\nBut don't forget,\nyou didn't build this deck.\nAnd if it feels rigged sometimes,\nmaybe it is.\n\nThat doesn't mean fold.\nIt means stay aware.\nStay principled.\nAnd if you know things could be better,\ndon't just accept them as they are.\n\nBecause some systems we live under don't just _happen._\nThey are built. Designed. Structured.\nBy people, for power.\n\nTake money, for example.\nWe're told it's neutral. A tool.\nBut that's not the whole story.\n\nSee, money itself doesn't do anything.\nIt's inert.\nUnlike labor or land, it doesn't produce value by itself.\nSo if I lend you money and charge you more to get it back,\nI'm profiting off time, not effort.\n\nI didn't till the land.\nI didn't forge the metal.\nI just waited.\n\nIn that sense, usury feels parasitic... because it is.\nIt's the extraction of value from someone else's need,\nnot the creation of value through mutual benefit.\n\nThomas Aquinas argued that charging interest is a sin against justice.\nWhy?\nBecause it's like selling the same thing twice,\nfirst the principal, and then time.\nAnd you're exploiting the borrower's necessity.\nIf someone borrows, it's often because they're in need.\nThat makes interest a kind of moral hazard:\nthe lender profits more when the borrower suffers longer.\nThere's a twisted incentive structure.\n\nBut we live in a world where that's been normalized.\nCredit cards with 20+% interest.\nPayday loans that destroy families.\nMortgage debt, student debt, medical debt, the list goes on...\na mountain of pressure on the average person\njust to stay afloat.\n\nIt doesn't have to be this way.\nThere are people building lifeboats.\nThere are ideas like Bitcoin, like mutual aid, like localism...\nthat challenge the whole structure.\nThat ask, \"What if value came from effort again?\nWhat if you didn't need to sell your future just to survive today?\"\n\nI'm not saying it's easy.\nYou'll still have to work in the world as it is.\nBut you don't have to surrender to it.\n\nWake up with gratitude.\nFace the day with courage.\nAnd plant seeds of the world you want to see.\n\nBecause some of us were born into the house of usury.\nBut that doesn't mean we have to keep the lights on forever.\n\nMy 2 sats?\nWell...read the photo caption below ;)\n\n![Bitcoin will fix usury but only you can fix yourself](https://miro.medium.com/1*T7DrT8k2S7v4l2QaNPnFWA.png)\n\n6/28/25\n\nConor Jay Chepenik",
  "wordCount": 518,
  "readingTime": 2.338050314465409,
  "claps": 15,
  "voters": 1
}