{
  "id": "df60f25b04c5",
  "title": "Day 122",
  "createdAt": "2022-07-22 20:49:05",
  "tags": [
    "golf",
    "bitcoin",
    "incentives",
    "keynesian-economics",
    "are-so-dumb"
  ],
  "url": "https://chepenikconor.medium.com/day-122-df60f25b04c5",
  "content": "# Day 122\n\nWent back to the comedy show last night and did the open mic. Proud of myself for getting up there. That said, it was a much different experience doing the open mic vs the actual standup show. By the time I got to perform it was around 11:30 at night and the crowd was much smaller than the original comedy show which ran from 8–10. It was still fun to get up there and crack jokes, plus my boy Sam was laughing at everything I said. The only problem was most of the audience was ready to fall asleep. Thus, I'm glad I got up and got some laughs but it was eye-opening what a grind comedy is. Like anything worthwhile though you got to start with the shit positions and work your way up. In my short experience, the more people paying attention when you do your bit the better you feel . It was interesting though because with fewer people paying attention I felt a lot less pressure. Maybe it was the 4 bud lattes I drank before I did my set but who knows hahahaha.\n\nI've started reading _The Sovereign Individual_ again and it's both frightening & enlightenment to see how spot on the authors of that book are. They predicted a new cyber currency (sup with it Bitcoin) and how Government's would continue to inflate away people's purchasing power which we are clearly seeing play out since the book was written around 20 years ago. While they were not perfect most of what they wrote was spot on. I look forward to seeing how everything plays out in the future and want to try to write another piece for Bitcoin Magazine which includes my predictions for 2040. Some will be wrong, but I think there are a lot of important lessons I can take away from _The Sovereign Individual_ to make solid predictions about the future. Off the cusp I'd say by 2040 the U.S will be much less powerful on a global scale while individual states will have a much higher degree of sovereignty. The world will be a lot less globalist in terms of government cooperation, but citizens will interact globally at a scale never before seen. A better way of saying that might be borders will become less and less relevant as citizens can interact and do business with anyone via zoom and use 🌽  to transact. Hopefully war mellows out as people lose faith in fiat currencies and citizens become much harder to steal from since everyone is using magic internet money (btc).\n\nA lot more to think through but it's a fun thought experiment. I'd like to see minimal pain as the world progresses, but I do fear politicians will do everything in their power to keep power. Look at this [tweet](https://twitter.com/RepThomasMassie/status/1550480019356622848?s=20&t=HTTUBZKnP_xhgb8SZUPO8A) from my boy, Thomas Massie. The IRS bought $700,000 worth of ammunition? WTF is that?!?! Why does an organization tasked with collecting taxes need ammo. It's a rhetorical question because while the answer might be obvious the real answer should be it doesn't! These kleptocrats are happy to point a gun at citizens if you don't pay them taxes, and I'm not talking about the taxes that inflation brings, but the income and capital gains tax we also experience on top of inflation. This system makes Frankenstein look like Pamela Anderson in her prime. This meme sums it up pretty well.\n\n![](https://miro.medium.com/0*r9MEOJAnk1u6BkoL)\n\nPain is a good teacher though and people are self interested. Seems incentives will just continue to push people to hard money that is diffucult to steal with violence and damn near impossible to debase. When the people can verify the money for next to nothing everyone will be better off. Some homework if you so desire, go run a node and verify for yourself there will only ever be 21 million btc (or 20.9999999999 million if we being exact ;D). Now go try and do the same for the Federal Reserve. You won't be able to do the latter unless you work at the Fed, but if you have a raspberry pi and a 1 TB harddrive it's pretty easy to verify Bitcoin's authenticity.\n\nSo simple and so complex. Kinda like living life. Some days everything sucks and some days are incredibly euphoric. Setting up solid habits helps to have more of the euporhic days and I think Bitcoin will also make a big difference. No one likes seeing grifters benefit off the work of others and Bitcoin makes that much more difficult. Keep the hope anon. Incentives will take care of the bad actors over a long enough time horizon.\n\nAlso, I'm playing 18 holes of Golf tomorrow at Stow Acres. Fuck yea; going to break 100 one of these days!\n\n7/22/22\n\nConor Jay Chepenik",
  "wordCount": 802,
  "readingTime": 3.226415094339623,
  "claps": 0,
  "voters": 0
}