{
  "id": "e01003cf6975",
  "title": "Neutrality",
  "createdAt": "2021-12-31 22:34:12",
  "tags": [
    "new-years-reflections",
    "anti-mandate",
    "bitcoin",
    "technology",
    "world-reserve-currency"
  ],
  "url": "https://chepenikconor.medium.com/neutrality-e01003cf6975",
  "content": "# Neutrality\n\nWith 2022 quickly approaching it is crazy to think how much the world has changed since Covid became a thing. People were already polarized by social media and the global pandemic seemed to increase these differences. There is a lot to unpack from the way Covid was handled by governments around the world and I don't know what the right answer would've been. All I know is science is about questioning, analyzing, and concluding only to repeat this process over and over again. Thus, \"trusting the science\" is questioning the science because sometimes new data comes along that causes us to change our conclusion. What's that old adage again? Oh yea...\"The more we learn the more questions we have\".\n\nUnfortunately, it seems that many of our leaders have decided vaccines are a one size fits all solution. I've seen it argued online that if you are unvaxxed you shouldn't be given hospital treatment since you could've gotten your vaccine and avoided a trip to the hospital. While I disagree with this argument I do see why one could potentially make it. Governments around the world are demonizing those who are unvaccinated. The White House had on their website \"It is going to be a winter of severe illness and death for the unvaccinated\". If you believe this narrative then trying to take away the rights of the unvaccinated is, ironically enough, the position with the moral high ground. I'm not a Doctor and I'm not anti-vaccine. I'm anti-mandate. The narrative from the Mainstream Media was the vaccine stops you from getting covid which got switched to the vaccine helps fight covid systems. It upsets me that the public was lied to and yet we still have people considering implementing vaccine passports in major cities like Boston, Chicago, and many others who have already done so. Vaccine mandates infringe on our individual rights as citizens of the United States and taking away these rights because people don't want to put something in their bodies is wrong. Mandates in the name of public health are a slippery slope and I hope our leaders realize this A.S.A.P. This is my opinion based on 24 years of life and everything I have read, listened, and seen from books, podcasts, and social media posts which for all I know could be accurate or misinformation. I'm sure some people agree with what I've written and some might think I'm a crackpot because I don't want the government telling me what to put in my body. Whatever you might think I welcome you to share your insights and links to stuff that might expand my opinion. I'm open-minded and not afraid to change my opinion if new facts present themselves. The reason I bring all this up though is because I don't have much faith in the government to figure out the correct answer for Covid when so many companies and organizations have billions, if not trillions, of $ that will be effected based on various policies and mandates. Money is a powerful thing and when it can be created out of thin air by humans you bet your bottom dollar it will be created out of thin air.\n\nThis is why I love Bitcoin. A system that gives no one special privileges, doesn't give a shit if your vaxxed, unvaxxed, white, black, fat, skinny, ugly, or beautiful. A system that anyone can use and that will be neutral to every user regardless of if they are a conservative, liberal, anarchist, marxist, progressive, capitalist, communist, or any other political umbrella anon might fly their flag with. The network doesn't care and gives out no special privileges. Bitcoin treats me the same way it treats Micheal Saylor with the only difference being Saylor's wallet has A LOT more sats in it than mine. I'm not sure how we create a more welcoming, inclusive, and friendly world when big tech is incentivized to keep polarizing people so they can sell ads (A.K.A feeding you stuff that gets you worked up so you keep scrolling). It's a weird place to be because I love using Medium, Twitter, Reddit, Gmail and many others which I probably wouldn't use if they weren't free. It sucks though because 99% of ads just piss me off. Shoutout to that 1/100 ad that makes me smile. As far as I can tell the best thing to do is take everything with a grain of salt and remember that everyone has bias and an agenda they've acquired from doing this odd thing us humans call life (Even myself I want to live in a more welcoming, inclusive, and friendly world so I feel happy not because I want anon to be happy) There is never going to be a one size fits all piece of legislation that a government could create to solve the world's problems. There is however a network/protocol/system that treats everyone equally, allows them to join and leave at will, and is decentralized. This is what Bitcoin is and I'm still convinced that the majority of the world doesn't understand how important this asset will become. It's horrifying to see the lack of transparency governments around the world operate with. The Maxwell trail, Vaccine Mandates, banning of Robert Malone on Twitter, and a bunch of other stuff that is forgotten about since technology is causing our attention span to decrease rapidly. When the only thing backing fiat currency today is the military behind the fiat currency I don't think big government changes unless Bitcoin surpasses the US Dollar as a global reserve currency. I want a world reserve currency that I can audit without a third party, that I can use to send value to anyone in a permissionless manner, that I can divide easily, that is easy to store and use, and that has no single point of failure. Not a world reserve currency that has to [spend over 700 billion](https://www.defense.gov/News/Releases/Release/Article/2638711/the-department-of-defense-releases-the-presidents-fiscal-year-2022-defense-budg/) in 2022 to keep the war machine backing it strong. (I am grateful the U.S military serves to protect my freedoms and the other citizens in this country. Who I have a problem with is the politicians who can't balance a book and have run this country's debt up to 30 trillion) After taking some time to learn about Bitcoin I've become convinced it is the fairest, most transparent, and neutral store of value in the world. Bitcoin won't give anyone special privileges no matter how strongly they feel they deserve it. Bitcoin has proven so far it can't be debased and unlike central banks who signal to do something and then sometimes follow through Bitcoin has a fixed supply issuance that does what the code clearly states it's going to do. The truth seems like it's becoming a lost art in today's world of misinformation but Bitcoin serves as something to bring truth back to the forefront of modern day society in the form of open source software that allows anyone to be their own bank.\n\nTo anyone who got this far Happy New Years! If you're reading this way after the start of 2022 happy whatever day it is. Remember to feed yourself nutrious food, get exercise, and spend time with your loved ones because life is too short to live in fear or obsess over what others do. Cheers.\n\n12/31/21\n\nConor Jay Chepenik",
  "wordCount": 1229,
  "readingTime": 4.637735849056604,
  "claps": 0,
  "voters": 0
}