{
  "id": "e04448f27d18",
  "title": "Day 617",
  "createdAt": "2023-11-29 23:53:44",
  "tags": [
    "life",
    "god",
    "ai",
    "focus",
    "determination"
  ],
  "url": "https://chepenikconor.medium.com/day-617-e04448f27d18",
  "content": "# Day 617\n\n![Real Sunset taken with my iPhone in DUUUVVVVVVVAAAAAAAALLLLLLLLLLLLLLLLLLLLLLLLLL](https://miro.medium.com/1*m8zqQ2KVlEKWvp_Vj1UUrg.png)\n\nIt is important I do not lose sight of the mission. Technology is amazing but it also accounts for 99% of my problems. Which is such a funny thing to say and realize. Think about how many challenges in life are because of the amazing technology we have, car needs gas, that's a tech problem, your job is monotonous, that's a tech problem, ai not responding how you want, kind of a tech problem, prompt better?\n\nJokes aside, today's post does not feature any AI written content. I'll note when I do share AI generated content, it is content I have written first then asked chatGPT or other LLMs to improve. I like to think of these LLMs as turning me into an editor & a writer, but today I'm just going to wear my writer's hat. One thing I want to remember is tech can help but I should never rely on it to do my work when it comes to writing.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ConorChepenik/status/1730004782503370964%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThe reason I will not be using AI to help improve this particular writing is because AI can't answer these questions I want to answer. I saw someone tweet what questions they ask themselves when journaling and thought it was an excellent framework for evaluating your own life. So here are my candid answers:\n\nWhat's my perfect day look like?\n\nWake up next to my Daughter and Partner. Enjoy a nice pistachio mocha latte that we all walked to get after having a lazy morning enjoying each other's company. Reading for a bit at the coffee shop or at home after having a nice debate about interesting topics in the coffee shop. A nice run/pick up basketball game plus sauna before lunch followed by more reading. Dinner at one of our favorite restaurants. My 'rents are watching my child so my Partner and I can enjoy the dinner and not worry about Sloan because she is with family. Get back home and Sloan gets dropped off. Go to bed discussing why God is good.\n\nWhat steps will I take daily, weekly monthly to get there & create that life?\n\nI will pray more. Spend less time on my phone. Do the little things right. Be grateful for all the oppurtunites in front of me. Continuing growing as a person. Pass the series 7 and series 63 exam for my new job at Fidelity and work my butt off in the position so I can get promoted. Again, I will pray more and talk about God with my family. I've been seeing so many incredible leaders out there who constantly come back to thanking God for all their success. I've done a good job changing my content diet to podcasts of quality people I respect. Seeing these people constantly credit God for their success has reaffirmed my faith in a higher power and made me want to strengthen my own relationship with God. I'm not one to encourage others to become religious but I do believe that someone's personal relationship with a higher power is both an important and powerful thing.\n\nWhat ONE THING is distracting me from my goals right now that if I gave up or reduced my life would improve?\n\nSpending too much time consuming on social media. I need to create more and consume less full stop.\n\n11/29/23\n\nConor Jay Chepenik",
  "wordCount": 559,
  "readingTime": 2.3094339622641513,
  "claps": 1,
  "voters": 1
}