{
  "id": "e064c8fb4a6d",
  "title": "Day 51",
  "createdAt": "2022-05-13 02:16:22",
  "tags": [
    "keynesian-economics",
    "attitude",
    "bitcoin",
    "cbdc",
    "having-children"
  ],
  "url": "https://chepenikconor.medium.com/day-51-e064c8fb4a6d",
  "content": "# Day 51\n\nToday was a good day because a coworker inadvertently helped me change my attitude. I've been stressed about getting off to a slow start at my new job and learning I'm going to be Dad. I'm super excited about having a kid but it is a lot to take in. Also want to feel like I'm contributing at work and starting off slow has not been helpful. Today a fellow AE mentioned that he tries to have fun with his cold outreach. He searches his prospects up on Twitter and comes up with relevance that would make anyone reading a cold email laugh. Well, I started to do the exact same thing and it made the job a lot more fun. By doing this and worrying less about the outcome I had a good time crafting cold emails. Even if the prospects don't get back to me I feel good about sending them something that isn't a generic cold email. Funny how much a small change can cause your attitude to do a 360.\n\nAnother positive thing happened today. Someone from Bitcoin magazine tweeted that if you have an interest in contributing to their publication his DMs were open. Your boy sled right in and I'm happy to start working on my first publication. No guarantee I will be published, but I love writing about Bitcoin so I got a really good feeling. Obviously, some days are better than others but man am I excited about the prospect of contributing to Bitcoin magazine. Further updates will be posted here if I'm successful.\n\nOutside of that not much to report. Crazy to see what is happening in the crypto markets but I think it will be beneficial in the long run. A lot of Bitcoin maxis have been forged after getting scorched on Luna. I hate seeing people lose money, but the truth seems to be Bitcoin is the only thing that matters. If Bitcoin fails the world is fucked, but if crypto-equities (as I like to call the other projects that claim to be decentralized, but are clearly not that decentralized) fail, another one can replace it. Experimenting is important. I just want people to understand that only Bitcoin can become money. Everything else is a much better form of equity in an organization. Not sure if everyone would agree with me here, but that is how I view it. It would be kind of sick if I could send my apple stock to a buddy in exchange for something. You can do this with other crypto projects, but these projects have a team or foundation in place. These projects have rulers if you will and as long as rulers are involved I don't buy the whole decentralized idea. For me being decentralized is about having no single point of failure. Bitcoin seems to be the only one with no single point of failure. I do think the proof of work chains like litecoin, dogecoin, bcash, etc are better than proof of stake chains that claim to be decentralized, but they are much smaller and more centralized than Bitcoin in other ways. Ultimately, I imagine they go to zero against Bitcoin. Maybe I'm wrong but that is my guess.\n\nAs Gigi so elegantly reminded the audience on Preston's podcast: it is all probability. Nothing is guaranteed, but I will continue putting my eggs in the Bitcoin basket because it has the highest probability of storing my value over time as far as I can tell. Had a great conversation with a co-worker today who asked me about Bitcoin. Hahahaha I say conversation, but it was more like me ranting. In my defense, he did ask me about it so of course, I ended up ranting. He was very receptive though and I firmly believe that over time I'll make a Bitcoin maxi out of my co-worker who is a big fan of Doge. I'll admit memes are fun and Doge was essentially created as a joke. [Billy](https://twitter.com/BillyM2k), the creator is hilarious on Twitter. I appreciate the fact he made something as a joke to tip people online who make quality content. I blame the fed (as usual) for pushing people out on the risk curve causing Dogecoin to go parabolic and then wreck everyone on the way down. A lot of wealth was made when they turned on the money printer at the Fed and a lot has been decimated as they start to tighten. Don't know how this will play out, but I do know I'm going to keep self custody of my corn, dollar cost average, and avoid leverage during these tumultuous times. Stay safe out there anon.\n\n![](https://miro.medium.com/1*kK7sn97hxh3Umizu8Yc6ow.jpeg)\n\nI don't think this ideology will endure much longer when people realize these same economists get paid large amounts to be constantly wrong with their predictions. I got a feeling we are going to see \"the chickens come home to roost\" and when we do we will enter the suddenly part. That or we get a CBDC dystopia straight out of B_lack Mirror_. Not what I want to see so I'm putting my money in the good ol' orange coin.\n\n5/12/22\n\nConor Jay Chepenik",
  "wordCount": 869,
  "readingTime": 3.479245283018868,
  "claps": 0,
  "voters": 0
}