{
  "id": "e22eac9fb01e",
  "title": "The Good Side Of Technology",
  "createdAt": "2021-01-30 16:32:13",
  "tags": [
    "technology",
    "road-trips",
    "life",
    "positivity",
    "cheers"
  ],
  "url": "https://chepenikconor.medium.com/the-good-side-of-technology-e22eac9fb01e",
  "content": "# The Good Side Of Technology\n\nMy last post was about pointing out the flaws I see with big tech, more specifically the negatives of social media. Thus, I wanted to make a post pointing out the positives that technology has brought to our world.\n\nGrowing up I hated road trips with a passion. My poor parents must've answered the question \"How far are we?\" over 1,000 times between my sisters and myself asking it constantly. Now that problem is gone. Kids can use Maps or Waze to immediately find out their E.T.A. Not to mention, children can stream their shows or play their favorite game on their mobile devices so they probably aren't as antsy to get to their destination. I remember being so excited when I got a PSP (PlayStation Portable) because it meant I could play madden the entire car ride. Now children can play games with even better graphics straight from their mobile devices. While it's important to limit screentime so we don't strain our eyes or become anti-social these technological advances have made almost everyone's life easier when it comes to travel. Even if you're the one driving you can pick between millions of podcasts or songs to keep yourself entertained. If you have a Tesla you can just stream movies from your center console the entire time while the car drives itself. Seriously, how incredible is that when 15 years ago my parents were still pulling out those fold-up maps to see if they were going the right way.\n\nThe technology for various jobs is growing at incredible rates too. While I don't want to see every job become obsolete because robots do it better, cheaper, and faster than humans there is a lot of automation that makes people's jobs genuinely better. For example, I work in sales, and the amount of information on the internet I can gather about someone before I call them is so useful. Being able to come in with relevance about a person's life allows me to build a connection with a prospect I just cold-called. Sometimes my relevance isn't good enough and they ask me to take them off my list, but other times it's the reason these prospects decide to take a meeting. I'm curious as to what sales were like 20 years ago before you could find vast amounts of data on your prospects with a simple google search.\n\nFinally, technology is preventing massive hedge funds from controlling money. GameStop is a failing company, but because retail investors were able to use tech to find the biggest short positions on the market they screwed the hedge funds and drove the price up. You love to see it. Anyways, I think the world is a lot more gray than black and white, but if you focus on the positives you should be okay.\n\nCheers🍻\n\n1/30/21\n\nConor Jay Chepenik",
  "wordCount": 483,
  "readingTime": 1.8226415094339623,
  "claps": 50,
  "voters": 1
}