{
  "id": "e22e4d2abcc9",
  "title": "Day 987",
  "createdAt": "2024-12-04 03:17:29",
  "tags": [
    "food"
  ],
  "url": "https://chepenikconor.medium.com/day-987-e22e4d2abcc9",
  "content": "# Day 987\n\nBanger dude\n\n![Fyodor Dostoevsky](https://miro.medium.com/1*LIdEuuSntP5RoNMgRIom9A.png)\n\n![[https://x.com/ConorChepenik/status/1864132460851630118](https://x.com/ConorChepenik/status/1864132460851630118)](https://miro.medium.com/1*l58ExhA5qjiP6iVde3Xhrg.png)\n\n![](https://miro.medium.com/1*9y7SLEivFOJDfKQnI9hCIg.jpeg)\n\nLife has many things to be joyful about. So count your joys? Yes, I think that is the listen today. If you don't know what to be joyful about make yourself this.\n\n![](https://miro.medium.com/1*wlsVTRxbjPJyvIYwyXclqA.png)\n\nIf you are curious how to make this here is what chatGPT suggested:\n\nHere's a banging recipe for **Sourdough Bread Pudding with Homemade Raw Vanilla Bean Ice Cream** that will make your dessert shine!\n\n---\n\n## Sourdough Bread Pudding\n\n### Ingredients:\n\n- 5 cups sourdough bread, cubed (stale bread works best)\n\n- 4 large eggs\n\n- 2 cups whole milk\n\n- 1 cup heavy cream\n\n- 1 cup granulated sugar\n\n- 1 teaspoon pure vanilla extract\n\n- 1/2 teaspoon cinnamon\n\n- 1/4 teaspoon nutmeg\n\n- Pinch of salt\n\n- 2 tablespoons butter, melted (for greasing)\n\n- Powdered sugar (for garnish)\n\n### Directions:\n\n1. **Prepare the Bread**: Preheat your oven to 350°F (175°C). Spread the cubed sourdough bread on a baking sheet and toast for 5–7 minutes to lightly dry them out.\n\n2. **Make the Custard**: In a large bowl, whisk together the eggs, milk, heavy cream, sugar, vanilla extract, cinnamon, nutmeg, and salt until smooth.\n\n3. **Combine Bread and Custard**: Place the bread cubes in a greased 9x13-inch baking dish. Pour the custard mixture over the bread, ensuring all pieces are coated. Let it sit for 10 minutes to soak.\n\n4. **Bake**: Cover the dish with foil and bake for 30 minutes. Remove the foil and bake for another 15 minutes, or until the top is golden and the custard is set.\n\n5. **Cool and Garnish**: Let the bread pudding cool slightly. Dust with powdered sugar before serving.\n\n---\n\n## Homemade Raw Vanilla Bean Ice Cream\n\n### Ingredients:\n\n- 2 cups heavy cream\n\n- 1 cup whole milk\n\n- 1/2 cup raw sugar (or honey, for a richer flavor)\n\n- 1 vanilla bean (or 1 teaspoon vanilla bean paste)\n\n- 4 large egg yolks\n\n- Pinch of salt\n\n### Directions:\n\n1. **Infuse the Milk**: Split the vanilla bean lengthwise and scrape out the seeds. Combine the seeds, bean pod, cream, and milk in a saucepan over medium heat. Heat until it begins to steam (don't boil), then remove from heat. Cover and let it steep for 15 minutes.\n\n2. **Make the Custard Base**: In a medium bowl, whisk together egg yolks, raw sugar, and salt until pale and creamy. Slowly pour the warm milk mixture into the egg yolks while whisking constantly to temper the eggs.\n\n3. **Cook the Custard**: Return the mixture to the saucepan and cook over medium heat, stirring constantly with a wooden spoon, until it thickens enough to coat the back of the spoon (170–175°F or 77–80°C).\n\n4. **Cool**: Strain the custard through a fine-mesh sieve to remove any lumps and the vanilla pod. Let it cool to room temperature, then refrigerate for at least 4 hours (or overnight).\n\n5. **Churn**: Use an ice cream maker to churn the custard into creamy ice cream. If you don't have an ice cream maker, pour it into a shallow dish, freeze, and stir every 30 minutes until fully frozen.\n\n6. **Serve**: Top warm sourdough bread pudding with a generous scoop of vanilla ice cream.\n\n---\n\nEnjoy the marriage of warm, spiced pudding with cool, creamy ice cream for a truly indulgent treat!\n\nNow I'm hungry.\n\n12/3/24\n\nConor Jay Chepenik",
  "wordCount": 522,
  "readingTime": 2.669811320754717,
  "claps": 0,
  "voters": 0
}