{
  "id": "e2b39820907c",
  "title": "Day 665",
  "createdAt": "2024-01-17 03:04:21",
  "tags": [
    "the-prince",
    "the-state",
    "bitcoin",
    "freedom",
    "us-constitution"
  ],
  "url": "https://chepenikconor.medium.com/day-665-e2b39820907c",
  "content": "# Day 665\n\n![](https://miro.medium.com/0*42cg4w0MYX_ae_gt)\n\nToday I read some more of The Prince. To paraphrase one of the passages it talked about how people are happy to help the state when they need the state, but when the state needs the people they will be hard to find. This resonated as I feel this exact way about the U.S Government. I'll help the state if I see it trying to protect my freedoms as a U.S citizen. The constitution is quite based and I'd like to make sure it is solidified. However, the U.S.A best not expect me to help them in the future if it finds itself in a dire situation.\n\nIn my eyes, the United States has deviated from its ideals, engaging in practices like unwarranted taxation and funding wars, actions that I cannot condone. My interest in the state is purely transactional, centered around its ability to safeguard my private property. I have no illusions of confronting the state's military might. My realism dictates that all I expect from the state is to assist in protecting my personal assets. Should it fail in this regard, I am prepared to relocate to a jurisdiction more aligned with my values of private property rights.\n\nThe United States' structure, comprising various states, works in my favor. For instance, moving from Massachusetts (or \"Taxachusetts,\" as I like to call it) to Florida has been a positive change, as I perceive Florida to be more effective in protecting private property rights.\n\nNo state is perfect. People in power typically don't want to help the people and people don't want to help those in power, unless of course said parties can benefit from each other. Such is life. Power often breeds indifference to the populace unless quid pro quo is involved.\n\nMachiavelli's candid perspective in \"The Prince\" resonates with me for its honesty. I'm reminded of when John F. Kennedy famously urged citizens to \"Ask not what your country can do for you - ask what you can do for your country,\". While I appreciate his message, his opposition to war and the Fed is what got him killed. I respect JFK for being bold enough to take a stand but it is a stark reminder of the perils of challenging the status quo.\n\nMy allegiance is fiercely and unapologetically to myself and those close to me. The state, in my eyes, is far from a protective entity; it's more like a coercive force that I engage with only to guard my property rights. This isn't about allegiance or civic duty; it's a cold, hard reckoning with the state's role in my life. My allegiance? It's not to any faceless institution or its hollow ideals. It's firmly rooted in the principles of freedom and self-preservation, and that's where it'll stay. I interact with the state not out of respect or loyalty, but solely to sidestep the draconian consequences of its overreach. In essence, I pay taxes not out of civic responsibility, but as a means to avoid the unjust imprisonment by the state's enforcers, keeping me from being thrown like a common criminal into their cages.\n\nI believe the U.S constitution is starting to fail and I'm grateful Bitcoin exists to create the digital version that will be equally, if not harder, to corrupt than the document that for ~250 years has been the greatest protector of freedoms in the world. Bitcoin is freedom.\n\n1/16/24\n\nConor Jay Chepenik",
  "wordCount": 573,
  "readingTime": 2.3622641509433966,
  "claps": 0,
  "voters": 0
}