{
  "id": "e33085e6a74a",
  "title": "Day 182",
  "createdAt": "2022-09-21 00:14:04",
  "tags": [
    "shaming",
    "kids",
    "emotions",
    "prep-act",
    "congress"
  ],
  "url": "https://chepenikconor.medium.com/day-182-e33085e6a74a",
  "content": "# Day 182\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/repthomasmassie/status/1572277291475943424&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nThomas Massie is the man. The prep act is ridiculous and needs to be changed. Proud to say Thomas follows me on Twitter. Thank you for what you do Congressmen Massie. Need more people in congress like him who actually look out for their constitutions instead of the ones we got who are more worried about insider trading and their stock portfolios.\n\n> [**The Fuck Rate is about to Implode**](https://brighteyes.substack.com/p/the-fuck-rate-is-about-to-implode)\n\nThis article is pretty funny. One of the comments reads, \"Genius article - Civilization was built upon shaming women, and Feminism flipped the dynamic to shaming men.\n\nI've never seen this dynamic stated so concisely and articulately before.\"\n\nI've always believed people should be allowed to do whatever the hell they want but that also means people should face the consequences for their dumb decisions. If you want to go sleep around you should absolutely be able to do so but it is important to realize there are consequences to those actions. You can't fill a hole by putting something in a hole. Hahahhaha I couldn't resist but that goes for both men and women. Sex is a special thing. While back in the day the pendulum was too far on the shaming side I agree with Brighteyes that now the pendulum is too far on the \"I'll fuck whoever I want and its actually a good thing\" side.\n\nNow that I'm having a Daughter I'm genuinely trying my best to be a better human. I've cut out porn and I'm focused on treating my girlfriend as good as I possibly can. Part of me is terrified about the world my daughter is going to be growing up in. Another part of me can't wait to raise her right so she can be a happy truth seeker who finds her own way. This podcast gave me a lot of hope and inspired me to find a farm and start living off the land and homeschool my children.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F2RUExJIwT9eUHhy955g7Y8%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F2RUExJIwT9eUHhy955g7Y8&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fac8571716fb76d9af35274af&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nHaving kids is scary but it is also amazing. I look forward to relearning the world through a child's eyes. We are living through some crazy times but then again I'm sure living through any time period was \"a crazy time\". In this information technology age I am happy to admit I do not know how to properly manage my emotions all the time but I feel good knowing that my partner is amazing and is holding up super well. Sloan if you ever read these posts know your Mum is my rock. It feels good to know we both are getting ready to manifest our homestead and figure out how to farm and homeschool our kids.\n\nUltimately, everyone has their own journey to learn how to deal with this life thing we are all experiencing. It is hard with all the noise in today's world. For example, today was a good day but there was one part where I just felt sad. I don't know why but my heart just felt really heavy. Not myocarditis heavy (at least I don't think so but shiddddddd maybe) but like a deep sadness. I also felt elated when I went for a run. I started crying because I watched this video my GF sent me right after the run.\n\n[https://www.instagram.com/reel/Ciu5Cnlu0-s/?igshid=ZjE0ZGRhNjQ=](https://www.instagram.com/reel/Ciu5Cnlu0-s/?igshid=ZjE0ZGRhNjQ=)\n\nIt is special to see something like that. I'm sure the endorphins from my run also helped. Anyways this post was all over the place. Kind of how my brain feels. It is amazing how much is out there for humans to learn. It is also overwhelming everything you can find online. Thus, it is time to turn inward, check in with the present moment, live in the NOW, and never stop seeking truth. I'm sure I will read these posts many years from now and be like yea I just kept repeating the same message over and over again using different metaphors.\n\nThat is okay though. Good wins because good seeks truth and truth always comes out in the end. Powerful thoughts that might make me C.U.M good tears.\n\n![](https://miro.medium.com/1*zW02oYySn_MtF8RDfkkH8Q.png)\n\nUntil tomorrow.\n\n9/20/22\n\nConor Jay Chepenik",
  "wordCount": 702,
  "readingTime": 2.849056603773585,
  "claps": 0,
  "voters": 0
}