{
  "id": "e469828832dd",
  "title": "Day 176",
  "createdAt": "2022-09-14 23:48:52",
  "tags": [
    "podcasting",
    "adversity",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-176-e469828832dd",
  "content": "# **Day 176**\n\nMan I get such a kick out of doing a Podcast and talking with other Bitcoiners. Yesterday started out as a rough day, but after doing the Pod with Macrojack I felt completely re-energized and excited about life. Even woke up this morning in a great mood (Don't think it hurt that the sun was shining and I played Preston's recent podcast with Pierre Rochard who is a very insightful Bitcoiner).\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F7GYKnBx6eKaa1gDE7wAfPn%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F7GYKnBx6eKaa1gDE7wAfPn&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1f98b1d751bd11c48f2fff7911&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"152\" width=\"456\"></iframe>\n\nAnyways, I bring this up because I think the key to having a truly happy life has a lot to do with finding what you like doing and pursuing that. In today's fiat economy this is very difficult because doing what you love doesn't always pay the bills. However, I know deep down if I continue to put in the work, stack sats, and try to be as mutually beneficial in all my exchanges I can end up doing what I love for a career. If that means putting my head down and doing a job I'm not incredibly passionate about for the time being then GOOD. Adversity, I love it and I will embrace it. Fake it till you make it baby!\n\nNo job is perfect and I'm honestly very lucky to be in the position I am in now. I'm very excited for what the future holds and I think it will involve a lot of podcasting because every time I do a podcast with a fellow Bitcoiner I get so excited. Talking with Jackson was also a good reminder I need to take some time to write quality tweet threads. Long form stuff is great too, it is just much harder to gain a social media following with long form posts since most people have short attention spans, including myself. I try to switch between tasks because I also get bored if I'm doing something for so long. Few things really help me get in the flow state and podcasting seems to be on of those things. Writing and reading can be sometimes get me in the flow state but usually I'll only write or read for 5–15 minute increments before getting distracted so I try and do multiple 5–15 minute increments throughout the day. Except for the days when I'm firing on all cylinders and enter the flow state easily.\n\nRead this [substack](https://alilybit.substack.com/p/what-the-fuck-is-going-on) and it is brilliant and terrifying. Hopeful Bitcoin can be the next monetary order because if it is something else the world is in deep trouble; at least the plebs. Like Lily pointed out the people at the top are jumping with joy at the idea of a CBDC/Digital ID/distopia/utopia where they control everything and everyone. Going to just keep doing my part and spreading the good word of Bitcoin. Pain is the best teacher after all. At some point when people realize they can't just ride this one out and ignore everything that is happening I think will see a mass flood to safe haven assets like Bitcoin. Fiat is programmed to debase and it seems like everyday they are speeding up this debasement. I joked on my podcast I feel like the world is a big circus show and while there are people outside the tent trying to burn down the show so many are obsessed with what's going on inside the arena they don't care or are too preoccupied to see what is happening and what is coming.\n\nCan't save everyone though. If even one person can take the orange pill and learn as a result of some of my writing and/or podcasting then I'm happy. It's a mutually beneficial exchange because they discover Bitcoin which I truly believe can help benefit everyone and the Bitcoin network strengthens by having another human use it. God I love the free market in action when there isn't a coercive third party butting in messing things up.\n\n9/14/22\n\nConor Jay Chepenik",
  "wordCount": 652,
  "readingTime": 2.460377358490566,
  "claps": 0,
  "voters": 0
}