{
  "id": "e5db5d45f18b",
  "title": "Day 157",
  "createdAt": "2022-08-26 20:13:10",
  "tags": [
    "memes",
    "jokes",
    "golden-era",
    "clown-world",
    "twitter"
  ],
  "url": "https://chepenikconor.medium.com/day-157-e5db5d45f18b",
  "content": "# Day 157\n\nPlayed some Golf with my Grandpa this morning which was awesome. We decided to wager the cost of lunch on the last 4 holes and all of a sudden my Grandpa and I started playing the best golf of our life. Funny how that works. Ended up beating him on the very last hole by a stroke. Sunk a clutch putt after missing almost everything earlier. I let out a nice laugh when my final putt landed and my Grandpa went, \"Christ of course the one putt you make today is the last\".😂\n\nDespite being exhausted after some Golf in the Florida heat I'm going to do a workout with my Dad later today should be fun. He has always been quite the workout buff and it appears I'll be getting a nice grind sesh in.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/ghostgcom/status/1563176468511080449&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"Interracial couples fucks an entire nation\" height=\"281\" width=\"500\"></iframe>\n\nThis meme killed me. Hahahahhahahahhaha so good. The U.S empire might be run by absolute 🤡s but the memes coming out of this era are legendary. We might be living through the golden age of memes and not even realize it. What a beautiful time to be alive.\n\nAfter eating some delicious steaks last night with my Dad, sister, and Grandparents I got to have a really nice conversation with my Dad on the ride home from Daytona. We talked about finding a hub for the family to congregate in and live close by. He voted for South Carolina and I voted for New Hampshire. I'm going to be in Boston till at least May of next year, but will see. By then my Dad will have a better idea if South Carolina is somewhere he really wants to live. I'll have a better idea if New Hampshire will be my future home. Lot to figure out, but I'm excited. I would love to have family nearby.\n\nFinally, I'm not sure if this is confirmed yet but it seems to be circulating around the interwebs.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/drsimonegold/status/1563204691021819904&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nIf this is true it's absolutely F*****. What a joke. The CDC literally came out recently and said we should not treat unjabbed vs the jabbed any different. Not that the CDC has been a credible source these past 2 years by any means, but for those who are quick to point to their guidance as \"the science\" this D.C rulling would be the opposite. So heartbreaking to see schools weaponized like this and all the more reason I want to home school my children when they grow up. This ruling is wrong on so many levels. I don't even have the words to describe the stupidity of a law like this.\n\nAnyways, I'm going to keep grinding, learning, and doing my part to disrespect the idiots trying to run a complex system like the world. These people are absolute 🤡s and should be treated with disdain and mockery. God bless memes because those who think they have a right to tell others how to live usually take themself way too seriously and memes are a great way to help normies see through their B.S.\n\nNot even sure what the term normie means exactly, but I'll just define it as someone who is a good person, but doesn't pay attention and is more concerned with a sports game score than the ruling class robbing the world blind and trying to centrally plan everything.\n\n8/26/22\n\nConor Jay Chepenik",
  "wordCount": 560,
  "readingTime": 2.1132075471698113,
  "claps": 0,
  "voters": 0
}