{
  "id": "e69153b29731",
  "title": "Day 102",
  "createdAt": "2022-07-03 00:21:02",
  "tags": [
    "usa",
    "future",
    "bitcoin",
    "staying-active",
    "golf"
  ],
  "url": "https://chepenikconor.medium.com/day-102-e69153b29731",
  "content": "# Day 102\n\nYa boi has been active today, starting my day off with a walk, then crushing a tiny hike in the Tourne park, followed by a slightly over 2-mile hill run. I'm tired but it felt good being active.\n\n![](https://miro.medium.com/0*liPp3VyIxOyMoZE_)\n\nIt's amazing how when trees get full of leaves in the summer the shade they provide makes it feel so much cooler. Proud of myself for spending time outdoors. Too much of my time is spent in cyberspace (A.K.A staring at a screen). It's amazing how quickly computers are changing everything. It feels weird knowing that the giant decentralized database that is Bitcoin can be such a powerful tool for humanity, but many don't see it yet. Then again, many didn't see how impactful the internet would be when TCP/IP became the dominant protocol and made a fortune for the internet companies that made it through the .com bubble. As many, including myself, have said before: history doesn't repeat but it does rhyme.\n\n> Great piece from of [content](https://www.linkedin.com/posts/coryklippsten_the-daily-bitcoiner-activity-6948661190088699904-bddx?utm_source=linkedin_share&utm_medium=member_desktop_web) I saw on LinkedIn from Cory today \"The most interesting change Bitcoin will enable is that, now that there's a real cost of capital, people will become more thoughtful about how they spend their savings. Since their money will increase in purchasing power over time instead of losing value, individuals will only part with their money for worthy endeavors that produce real value for the world.\n\n> In my opinion, the knock-on effects of this will be profound, since it will be extremely difficult to finance things that are a huge waste of time, human resources, and money, such as wars. As a result, the world become a much more productive and efficient place.\"\n\nI'm also trying to take the time to read more but I've found my attention span has been pretty shite recently. Giving up Twitter has been good but I find myself scrolling Reddit a lot which in my opinion is not as fun an experience as scrolling Twitter. Replacing one platform with another isn't great, but baby steps. Anyways, saw my buddy Keenan today and his girlfriend Nikki. Really nice seeing them in Jersey and getting some sushi. We also got some dirty chais at Boonton Coffee which was delicious. It's funny adulting but I'm lucky to have a good set of friends. I did my stand-up set for them in the Tourne park when we were walking hiking after our meal and they laughed at the main parts. It was kind of difficult doing a set on a hike but I managed. If I can do it hiking I can do it live on a stage. My stand-up set is coming up fast and it felt good practicing it in front of people outside my class. We can do anything we set our minds to if we can find the time to put down our phones.\n\nWatched a lil bit of the new Liv Golf league today. Interesting take with the shotgun format, but I just recently got into watching Golf so I don't have much of an opinion on what I prefer better. Good to let the market decide and if people in the market like Liv Golf I don't see any problem with forcing the PGA to compete. Liv Golf does provide some cool technology that the PGA doesn't like holes in the cup to amplify the sound of a putt dropping.\n\nSaw a massive U.S.A flag in Boonton in someone's yard. This country might have it's flaws but that doesn't mean I don't believe in the values this incredible country stands for. God Bless America and happy early fourth.\n\nAlso need to go ahead and reschedule the pod with my Dad. We weren't able to do it today but hopefully tomorrow. :)\n\n7/2/22\n\nConor Jay Chepenik",
  "wordCount": 635,
  "readingTime": 2.59622641509434,
  "claps": 15,
  "voters": 0
}