{
  "id": "e6eff976ff52",
  "title": "Day 836",
  "createdAt": "2024-07-06 03:46:14",
  "tags": [
    "love",
    "you",
    "dad",
    "and-my-anon-fans",
    "sharing-is-caring"
  ],
  "url": "https://chepenikconor.medium.com/day-836-e6eff976ff52",
  "content": "# Day 836\n\nThe other day at the beach, my sister casually mentioned that a former high school acquaintance reads my blog. I was flattered, considering I never knew this person too well. It's a potent reminder that you never truly know who's lurking in the shadows of your internet presence. Ironically, this high school acquaintance learned about my child before my sister did, all because they read my Medium posts. Life has a way of creating these amusing situations.\n\nImagine if we could see everyone who's ever 'creeped' on our profiles or content. It's a bit like LinkedIn's feature that shows who viewed your profile, unless you've turned it off. (I'm pretty sure you can buy premium and still see anonymous views, though.) There's a valuable lesson here about being mindful of what we share online, as our digital footprint often reaches further than we realize.\n\nThis awareness extends beyond the digital realm as well. Even physical journals aren't immune to unexpected readers, just ask the Bidens. Hell, I learned this lesson the hard way myself.\n\nWhen I was young, my Dad read my journal despite promising me and my sisters he wouldn't. To be fair, I had written some unkind things, so perhaps we're even, Dad. (If you're reading this - which I know you do because you always clap for my stories, and I do appreciate that even if it feels like a grandparent rewarding their child who doesn't deserve a reward.)\n\nSpeaking of writing, my Dad recently gifted me a book called \"How to Write Short,\" which I'm thoroughly enjoying. Thanks, Dad, for the thoughtful present. I'll keep reading it, and who knows? Maybe one day you'll pick up \"The Bitcoin Standard\" which I bought for you and have been recommending for years now.\n\nI'll conclude my Medium with some banger tweets and a photo of a great quote.\n\n![[https://x.com/elonmusk/status/1809377894571077842](https://x.com/elonmusk/status/1809377894571077842)](https://miro.medium.com/1*Vv25I9544ilLl9vBrEFbkg.png)\n\n![[https://x.com/elonmusk/status/1809377894571077842](https://x.com/elonmusk/status/1809377894571077842)](https://miro.medium.com/1*2hNA14Ta_DRMb1kyw09aIg.png)\n\n![[https://x.com/ScottAdamsSays/status/1809199863684534326](https://x.com/ScottAdamsSays/status/1809199863684534326)](https://miro.medium.com/1*NRCXSO9IQuou5abZEvEp0A.png)\n\n![](https://miro.medium.com/0*viEAWCq1fLv17T8-.jpg)\n\n7/5/24\n\nConor Jay Chepenik",
  "wordCount": 316,
  "readingTime": 1.8924528301886792,
  "claps": 0,
  "voters": 0
}