{
  "id": "e77132d5c0a3",
  "title": "Day 580",
  "createdAt": "2023-10-24 02:08:54",
  "tags": [
    "war",
    "perspective",
    "nation",
    "states",
    "anarchism"
  ],
  "url": "https://chepenikconor.medium.com/day-580-e77132d5c0a3",
  "content": "# Day 580\n\nWrote an article about Nostr and freedom of speech in America. It can be found here.\n\n> [**Empowering Free Speech in the Digital Age - Common Sense Movement**](https://www.thecommonsensemovement.com/posts/free-speech-in-the-digital-age)\n\nAlso put up the first videos on [Valueware](https://www.valueware.ai/)'s Rumble and Youtube channel. Would recommend watching if you want to make a landing page and collect info via a contact form.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F5ZCHfEcPiDw%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D5ZCHfEcPiDw&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F5ZCHfEcPiDw%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\n> [**Effortlessly Collect User Info with a Customizable Contact Form**](https://rumble.com/v3r393a-effortlessly-collect-user-info-with-a-customizable-contact-form.html)\n\nI hadn't intended for this specific Medium to become a shilling fest for my products and services but if you want to learn about freedom technologies or technologies that allow you to create website pages with contact forms that get emailed to you... then you are in luck hahaha.\n\nToday, there just isn't much on my plate to discuss. I'm cherishing the moments spent with my family in Jacksonville. The only thing on my mind outside of trying to build and write things of value is this horrible photo I saw on Twitter today. It was a picture of a baby who seemed to be either dead or severely wounded from the war in Gaza/Israel. My heart goes out to those living in nations currently at war. I'm profoundly grateful for the peace in my life. It broke my heart seeing an innocent baby who is dead because of kleptocrats. Imaging my little angel being in that situation is truly unfathomable. I hope those in power think of their own kids before launching an attack. While it is easy to be a keyboard warrior and type things compared with those actually in the arena I know I'm correct when I say that violence only perpetuates more violence.\n\nSeriously makes me sick to think people, kids specifically, are dying because some assholes think they are morally justified to kill civilians to further their nation's interest. It is a weird irony because on the one hand nation-states have allowed for individuals to be granted rights and on the other hand they have killed more innocent people than any entity throughout history that I'm aware of. Anarchism gets a bad rep but it does not mean without rules. It just means without rulers. If there are no positions of power for tyrants to exploit it is my humble opinion the world would be a much better place.\n\nUltimately you can only control a very small number of things in your life. While there are genuine concerns in the world, the opportunities and prospects outweigh them tenfold. On challenging days, I remind myself of the broader perspective - many face more daunting challenges. Maintaining a positive outlook can indeed influence outcomes.\n\n![](https://miro.medium.com/0*y6ABEb92E2MotmN4)\n\n10/23/23\n\nConor Jay Chepenik",
  "wordCount": 478,
  "readingTime": 2.0037735849056606,
  "claps": 0,
  "voters": 0
}