{
  "id": "ead3a7ccaa63",
  "title": "Day 881",
  "createdAt": "2024-08-20 02:54:24",
  "tags": [],
  "url": "https://chepenikconor.medium.com/day-881-ead3a7ccaa63",
  "content": "# Day 881\n\n![Sloan wielding a drone :D](https://miro.medium.com/1*b-kPn3vOABPJyci_2wOMlQ.png)\n\nToday, I introduced my daughter to the fascinating world of drones, with an unexpected La Croix mishap on the side. Let's just say her attempt at sipping ended with her wearing more of it than drinking it - lol.\n\nOur drone adventure began with a dash of trepidation. Picture a tiny human facing off against a whirring, blinking contraption straight out of sci-fi. But fear not! With a bit of hands-on exploration and some reassuring dad-splaining, we transformed from drone doubters to budding pilots faster than lil miss malone can say \"propeller.\" It was both amusing and nerve-wracking to see how much the drone initially scared her. After letting her touch it, push the buttons on the controller, and showing her it's not dangerous if you're careful, she started to enjoy it.\n\nThis drone, a budget-friendly marvel from the digital bazaar known as Temu, is perfect for nurturing a newfound passion without breaking the bank. While it won't be capturing National Geographic quality footage, it's a great starting point. I love flying drones, and while drone racing might not be in my future, it's undeniably a cool hobby.\n\nAs I watched Sloan's eyes light up, I couldn't help but ponder the future. By the time she's 18, will we have drones flying us around? Like cars, but better - maybe AI drones that drive themselves with an infinitesimal fatality rate, having removed humans from the loop. I pray that's what the future holds.\n\n![What I found with a quick google search of flying cars. MF looks like a weird alien hahaha](https://miro.medium.com/1*k8NiiNcEeGy9RL7Em3lU_w.png)\n\nOf course, like any powerful technology, drones have a darker side. I recall writing about a video of a drone being used to blow up a solider in combat a few months back. Just an absolutely awful use case of the technology. It's a stark reminder that these innovations, like any technologies, can be used for good or bad. We should push for the good.\n\nOn a recent Joe Rogan podcast, Peter Thiel offered an intriguing hypothesis about nuclear power regulation. He suggested that the stringent oversight of nuclear technology stems from its dual-use potential. Despite nuclear power's promise for energy abundance, its close relationship with weapons technology has made governments wary. Thiel pointed to a historical example: when the U.S. shared nuclear reactor technology with India for peaceful purposes, it inadvertently accelerated India's development of atomic weapons. This dual-use dilemma, while particularly stark with nuclear technology, isn't unique to it. In fact, it's a challenge we face with many powerful innovations.\n\nA hammer can be used to build a house or as a weapon. Bitcoin can secure a ransom in a cyber attack or help someone flee from a tyrannical regime with their wealth intact. A lighter can burn down a house or warm a family. Even a gun can be used to kill or to protect oneself from violent criminals. It's all about how the tools are wielded, not the tools themselves.\n\nAs I watch my daughter's eyes dance with delight at the hovering drone, hope blooms in my chest. Perhaps her generation will be the one to finally harness these marvels for the greater good, to lift humanity higher rather than drag it down. But for now, as a parent in this economically turbulent world, I'd settle for sound money and an end to reckless money printing. I'm weary of seeing technology's potential to slash the cost of goods and services, only to have central banks and governments erode our purchasing power through endless currency creation. It's maddening to watch innovation drive prices down, only for inflation to push them right back up. It's high time we let technology's deflationary benefits flow.\n\n![](https://miro.medium.com/1*Csj_0yZktq_gP770hxxUvQ.png)\n\n8/19/24\n\nConor Jay Chepenik",
  "wordCount": 611,
  "readingTime": 2.8556603773584905,
  "claps": 0,
  "voters": 0
}