{
  "id": "eb22dde2ed8c",
  "title": "Day 950",
  "createdAt": "2024-10-28 01:32:14",
  "tags": [
    "boom"
  ],
  "url": "https://chepenikconor.medium.com/day-950-eb22dde2ed8c",
  "content": "# Day 950\n\n![](https://miro.medium.com/1*5RmHR4eGw_gami0xHXiWEg.png)\n\nLast night, I [listened to a podcast](https://youtu.be/P-1PlGBH1Go) that delved into the profound notion that we are spiritual beings just as much - if not more - than we are physical ones. While some might consider this obvious, I believe it's a truth that has been deliberately obscured by the pervasive propaganda saturating our society. It's one I myself often forget.\n\nConsider how many forces work tirelessly to convince us otherwise. Yuval Noah Harari, the author of _Sapiens_ - a book that I did enjoy - [claims](https://arc.net/l/quote/bzxmlpms)\n\n> \"But human rights are just like Heaven, and, like God, it's just a fictional story that we've invented and spread around. It may be a very nice story. It may be a very attractive story. We want to believe it, but it's just a story. It's not a reality. It is not a biological reality. Just as jellyfish and woodpeckers and ostriches have no rights, homo sapiens have no rights, also. Take a human, cut him open, look inside. You find their blood, and you find the heart and lungs and kidneys, but you don't find any rights. The only place you find rights is in the fictional stories that humans have invented and spread around.\"\n\nSuch a statement is not only misleading but also overlooks the essence of our being. Our rights are like our soul. It is not something you can dissect and locate within our physical bodies; it's a divine gift bestowed upon us by God. Just because we can't see it doesn't mean it doesn't exist.\n\nProponents of the World Economic Forum's (WEF) vision for a technocratic future, led by figures like Klaus Schwab and Yuval Noah Harari, are prime examples of those who misunderstand the nature of human potential. They believe that merging with machines, implanting silicon into our bodies, and becoming digital hybrids is the key to achieving greatness. However, this perspective overlooks the fact that we can accomplish incredible feats without surrendering our humanity. The smartphone revolution, for instance, has empowered us externally without invading our bodies.\n\nThe actions taken by these technocratic elites, who seek to reshape the global economy and society in their image, have far-reaching consequences. One glaring example is the reckless printing of money out of thin air, which allows them to fund complex and intricate deceptions. However, we all know that creating money without backing is unjust and harmful, undermining the value of our hard-earned savings and contributing to economic instability.\n\nWhat the podcast truly emphasized for me is that spirituality is more crucial than our physical existence. The state can't nurture our souls or support our families the way we can for each other. We are divine beings made in God's image, sovereign individuals with inherent worth. The state is a man-made construct, and we shouldn't let bureaucrats convince us otherwise, no matter how sophisticated their propaganda may be.\n\nIt's up to us to embrace our spiritual nature, strengthen our familial bonds, and resist the narratives that seek to diminish what truly makes us human. I hope to impart this wisdom to my daughter, who is growing up in a world that already looks so different from the one I knew growing up. It's amazing to witness the progress, but it's also a bit unsettling. I hope that when she has children, she can share these lessons as well, and that they endure for millennia. I aspire to meet my future descendants in God's kingdom one day.\n\nRecognize your spiritual essence and stand firm against negative influences. It is up to us to empower ourselves to live authentically and purposefully. Let's hold onto the truths we know deep within us and build a future grounded in faith, integrity, and genuine human connection.\n\n10/27/24\n\nConor Jay Chepenik",
  "wordCount": 630,
  "readingTime": 2.577358490566038,
  "claps": 4,
  "voters": 1
}