{
  "id": "ec4ec8e1c52d",
  "title": "Day 215",
  "createdAt": "2022-10-24 00:13:54",
  "tags": [
    "exercise",
    "inflation",
    "soreness",
    "politics",
    "website-development"
  ],
  "url": "https://chepenikconor.medium.com/day-215-ec4ec8e1c52d",
  "content": "# Day 215\n\nThis was a master class in showing people that the two party system is quite frankly BULLSHIT.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/comicdavesmith/status/1582413391788126208&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI know Libertarians don't get much love because people are afraid to \"waste their vote\" but damn do I wish I was in Georgia so I could vote for Shane Hazel. I can say up here in Massachusetts I decided against voting libertarian for the Governor position because I didn't want to waste my vote on a candidate I knew had almost no chance at winning. They also didn't have an excellent social media presence like Shane and weren't even on the debate stage up in Mass, or at least not in the video I watched. However, if I ever see a candidate like Shane fighting for liberty up here in Mass during a future race I will use my vote on a libertarian. I hope Shane can find a way to pull it off even if the chances are slim.\n\nThis Sunday I got some diner food with my girlfriend. Hit a local farm in Lexington afterwards and got ingredients to put on a crockpot of stew (which turned out really good). Been utilizing the crockpot a lot recently and I'm a big fan of the outcome. So easy to cook and there is always delicious food leftover. The diner bill came out to slightly over $40 bucks for 2 coffees and 2 normal breakfast meals. My buddy texted me from New York today about his grocery bills.\n\n![](https://miro.medium.com/1*jjlRKYXhEqh_ft3caB5bnQ.png)\n\nMeant to say My girlfriend not \"much\" in those texts but I'm sure anyone reading this can relate to inflation being egregious. I do worry about the social unrest this might cause. I don't want to see brutal pain for the masses but my gosh this is getting out of hand fast. I'm so grateful that Bitcoin is there to help protect my savings but it sucks not being able to afford a nice breakfast without paying 40 bucks. Crazy to see politicians acting like the CPI numbers they are reporting are legit when it's clear to anyone buying stuff that all the desirable goods are inflating near 50–100% year over year.\n\nIn better news I crushed a run today and it helped me feel a lot better. I played basketball yesterday for like 2–3 hours and while I adore a good game of pickup it wore me out. My body felt so shot and I didn't want to run today. Getting up and hitting 3 miles anyways made me feel a lot better. Ironically, I've found the best way to overcome soreness is by exercising again. Getting the blood flowing so the body can do its thing is important.\n\nFinally, made some good progress on my personal site today. Got a lot of work to do still but brick by brick I'm getting there. I'm going to go ahead and yolo a smash buy for conorchepenik.com right now so I force myself to take this more seriously.\n\n10/23/22\n\nConor Jay Chepenik",
  "wordCount": 500,
  "readingTime": 2.086792452830189,
  "claps": 0,
  "voters": 0
}