{
  "id": "ee211677e425",
  "title": "Day 45",
  "createdAt": "2022-05-07 01:55:40",
  "tags": [
    "bitcoin",
    "better-world",
    "argentina",
    "imf",
    "8-year-olds"
  ],
  "url": "https://chepenikconor.medium.com/day-55-ee211677e425",
  "content": "# Day 45\n\nWell first they laugh at you, then they mock you, then they fight you, and then will you know what happens next... WE WIN!\n\n> [**Argentina's Central Bank Bans Lenders From Offering Crypto Services**](https://www.coindesk.com/policy/2022/05/05/argentinas-central-bank-bans-lenders-from-offering-crypto-services/)\n\nThe IMF is shitting its pants because the loan shark is about to be put out of business by the hardest asset on the planet. I wrote a piece a while back about the head of the IMF comparing her organization and central bankers to 8-year-olds playing soccer chasing after the ball while ignoring the second and third order effects of going after the ball rather than going where the ball is headed. Yep, the people who give out unserviceable loans to less developed countries don't seem to think through the second and third order effects of their policy, but they are happy to attack Bitcoin because it's RiSkY. My god, these people must be malicious. You don't get to a position like that without having some wit about you and I'm sure if they took the time to study Bitcoin they could see it actually helps accomplish their mission which according to their website is \"working to achieve sustainable growth and prosperity for all of its 190 member countries. It does so by supporting economic policies that promote financial stability and monetary cooperation, which are essential to increase productivity, job creation, and economic well-being.\" I heard a great quote the other day and I apologize for not giving credit because I can't remember where I found it but the quote was, \"An abundance of money leads to scarcity while scarcity in our money leads to abundance\". When you have top-down controls via people who don't think through second and third order effects you will never see the IMF's goals being met.\n\n_Confessions of An Economic Hitman_ by John Perkins is a great book that points out how egregious these loans can be. It is highly unlikely Argentina will be able to pay back its loan and it's unfortunate that the citizens of that country can't access the life boat that is Bitcoin via banks. You can obviously plug into the network and mine bitcoin but very few people can access or afford ASICs to mine compared with how many would be able to buy via a bank if the Argentine government hadn't just screwed its people.\n\nAnyways, not my country. My heart does go out to the citizens though because dealing with 50%+ inflation and not having Bitcoin sounds like an awful situation to be in. I hope the citizens who believe in bitcoin can find a way to get some 🌽 .\n\nOutside of that, not much to report. Played 7 holes with my buddy Kuba today which was nice. Got KFC after and it was good but I do need to be better about avoiding seed oils. Feel kinda mid after the fast food but damn those chemicals are delicious when they are going down the gullet. Kuba made a good point about how stand up is just expressing yourself. Seems like one of those no shit things when you first hear it but the more you think about it the more you realize there is a lot of truth to it. Which is also what comedy is. Telling the truth and pointing out humor found in said truth. Looking forward to my stand up classes starting soon. Even if I'm nowhere near as funny as I think I am, trying stand up will be a great way to get outside my comfort zone and become an even better speaker. I imagine having a kid will also give me some good stand up material.At the least it will swing this pendeulim to the left.\n\n![](https://miro.medium.com/0*Z7s2YDAXLaZuBrnw.png)\n\n5/6/22\n\nConor Jay Chepenik",
  "wordCount": 648,
  "readingTime": 2.6452830188679246,
  "claps": 0,
  "voters": 0
}