{
  "id": "ee406981a45a",
  "title": "I’ve Fallen Prey To The Bitcoin Psychological Operation",
  "createdAt": "2022-03-15 17:49:58",
  "tags": [
    "bitcoin",
    "satire",
    "psychological-operation",
    "pleb-nation",
    "family"
  ],
  "url": "https://chepenikconor.medium.com/ive-fallen-prey-to-the-bitcoin-psychological-operation-ee406981a45a",
  "content": "# I've Fallen Prey To The Bitcoin Psychological Operation\n\nRecently, I've been spending a lot of time on Twitter with random anon plebs who are hilarious. Since coming across these folks I've started to avoid seed oils, experience rapid depreciation of my USD on hand, and eat a ton of red meat. I'm also crushing workouts, getting exposure to sunlight, and experiencing an urge to have children and leave a legacy for my UTXOs. By saving exclusively in the greatest Ponzi scheme ever invented (Thank You Satoshi) I'm confident I will be rewarded greatly in the future. Since becoming a part of this Psy-Op I've begun to notice all the other Psy-Ops I once subscribed to. (USD hegemony being the most glaring one) I still have many friends and family who take part in these Psy-Ops, but slowly they are starting to accept that the Government might not have our best interest at heart.\n\nAnother side effect of this \"Bitcoin Psy-Op\" is I'm constantly reading more books. The more I read the more I learn the more I realize I know almost nothing and it humbles me. It's lowkey a little scary because you read about places like Rome and learn the empire collapsed because the rulers started clipping gold coins. This eventually led to the majority of people losing faith in Rome's gold coin which led to the collapse of a once-prosperous civilization. The United States is still the greatest country on earth (Obviously as a citizen I am biased) but it has all the signs of a dying empire. Since Covid hit our government printed trillions of dollars, caused record-high inflation, and then [Pelosi](https://www.msn.com/en-us/money/markets/pelosi-claims-government-spending-is-e2-80-98reducing-the-national-debt-e2-80-99-not-causing-inflation/ar-AAV3uCd) has the audacity to say government spending is not the problem and it's actually helping.\n\nI'm reassured by the fact we have Bitcoin now, something the Romans did not have when their currency started being rapidly devalued. It is important to remember the Bitcoin Psy-Op is not perfect. I got into crypto in 2017 purely for speculation and the fact I could make money. I traded shitcoins for a little bit. Made some money and lost a lot more. I even got buddies convinced that crypto was the next big thing and they still trade shitcoins, but slowly I am doing everything in my power to show them why Bitcoin is different. Many plebs online are toxic (for the right reasons) because they know it's BTC vs CBDCs and not BTC vs ETH. I'd love to live in a multi-chain world where my wallet is my ID and NFTs are tickets to events, and Doge is trading over a dollar, but that only happens if Bitcoin becomes a global reserve currency.\n\nThus, until BTC officially replaces USD as a global reserve currency I will do my part as a pleb to show people the light. Convincing others the Bitcoin Psy-Op is better than the CIA-approved Psy-Ops is quite rewarding.\n\n![](https://miro.medium.com/1*fRD7M2qQi_FrEXkjZbgSIQ.jpeg)\n\nUsually, stuff is not what we perceive but the world becomes a lot more clear when you realize that incentives run everything. Anyone who has ever used bitcoin or the Bitcoin network has done so on their own accord because the incentives of the network are so good. The vast majority of the world has been coerced into using fiat currency because that is how we pay for taxes, goods, and services. Finally, there is a better path than fiat money which means \"[an authoritative or arbitrary order](https://www.merriam-webster.com/dictionary/fiat)\" according to Meriam-Webster. Think about that for a second. In the name of our current monetary system (Fiat Money) is a word that essentially means do as I say because I said so. That is nuts. If you are 18 years old you should have free will and enough critical thinking skills to ask why should I do this. Not \"yea someone is paying me so I will do this regardless of any ethical dilemmas\".\n\nUnder the Bitcoin Psy-Op, you start questioning why we do the things we do. Should I get a farm and try and become as self-sovereign as possible? It becomes clear there is no arbitrary amount of wealth that will bring you joy, but instead, you start looking for the meaningful things in life like starting a family, focusing on your mental/physical health, and acquiring actual assets like a home, land, and animals. Yes, this Bitcoin Psy-Op will also likely make you spend too much time on Twitter, your family will not understand why you relate almost every form of conversation back to bitcoin, and your girlfriend will occasionally get annoyed in the beginning when you are still trying to dollar cost average your way to 100 million sats. A small price to pay for the end game which is a life well lived and a clean conscious knowing you didn't make millions by exploiting the poorest in society. I'm grateful my buddy Patrick showed me this enlightening Psy-Op back in 2017. I'm even more grateful for the random anon pleb named Satoshi Nakamoto.\n\n3/15/22\n\nConor Jay Chepenik",
  "wordCount": 850,
  "readingTime": 3.407547169811321,
  "claps": 0,
  "voters": 0
}