{
  "id": "ee6cd04908da",
  "title": "Day 679",
  "createdAt": "2024-01-31 02:35:33",
  "tags": [
    "toasters",
    "elon-musk",
    "twitter",
    "corporate-life",
    "gaslightning"
  ],
  "url": "https://chepenikconor.medium.com/day-679-ee6cd04908da",
  "content": "# Day 679\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/elonmusk/status/1752455348106166598%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/elonmusk/status/1752486201083543842%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nCurious what happened that made Elon tweet this out. The comments section enlightened me :)\n\n![[https://x.com/darewecan/status/1752455620169441371?s=20](https://x.com/darewecan/status/1752455620169441371?s=20)](https://miro.medium.com/0*Q04xzNZs93FGQgBA)\n\nI appreciated Stacey in the replies talking her book (recommending Elon moves to the country she is helping to flourish). The funny part is she is probably giving good advice; El Salvador seems to be growing at incredible speeds.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/stacyherbert/status/1752471248448172494%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI must note that while it inspires me to see El Salvador do what it is doing I'm still an America First guy. Capitalism is what made this country great and what the judge ruled is anti-American. Since when did they swap gavels for calculators and business suits? It's like asking a chef to fix a car - sure, they might figure it out, but would you trust the brakes afterward? Elon Musk, while not the poster child of perfection (who is, apart from maybe fictional heroes like Howard Roark & John Galt), certainly knows a thing or two about making billions. Yes, executives sometimes earn money that seems to defy gravity, but hey, so do some of Musk's rockets.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/TexasLindsay_/status/1752460426409807881%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nA sad day in America, but every time this happens the pain is signal to abandon the old system. Reminder, Bitcoin is a better system because it is less prone to human error!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=d04bfffea46d4aeda930ec88cc64b87c&schema=twitter&url=https%3A//twitter.com/charliekirk11/status/1752473123088412832%3Fs%3D20&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nEvery time courts do stuff like this they lose legitimacy. Burning the system down is not it, but I also fear that when judges do stuff like this they are sending signals to the public that equate to throwing Molotov cocktails on an unstable political system.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/dowdedward/status/1752444944189669755%3Fs%3D42&image=\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nOf course maybe I'm also wrong. Maybe the court did have a real reason for declining Musk's compensation package or maybe it was just a roll of the dice in a high-stakes game of Monopoly? Perhaps Musk is playing 4D chess, planning to swoop in and buy shares at a discount, like a cosmic Black Friday sale. In this game of corporate intrigue, it's best to expect the unexpected - like finding out your toaster can tweet inspirational quotes. (I'm sure that is coming soon enough with smart toasters)\n\nI've personally like the quote only the paranoid survive. I could see any of the above possibilities being true. Keep your head on a swivel. Expect the unexpected. These last pieces of advice are specifically a reminder for myself: slow down, listen more, talk less. Life is a marathon, not a sprint.\n\nThe future will look like this. Have faith and survive so you can see it :)\n\n![](https://miro.medium.com/0*OOe8HTKJqs_IodcR)\n\n1/30/24\n\nConor Jay Chepenik",
  "wordCount": 418,
  "readingTime": 1.9606918238993711,
  "claps": 0,
  "voters": 0
}