{
  "id": "eeec5d01c700",
  "title": "Day 99",
  "createdAt": "2022-06-30 01:42:11",
  "tags": [
    "bitcoin",
    "comedy",
    "news",
    "public-speaking",
    "book"
  ],
  "url": "https://chepenikconor.medium.com/day-99-eeec5d01c700",
  "content": "# Day 99\n\nHad an incredible time at my Stand Up comedy class last night. It was much better this time around practicing and writing my set throughout the week rather than winging it. Good reminder to prepare for things that I genuinely care about. What I said in the set varied a little from my actual script, but that's the beauty of comedy. It's kind of like a sales call in the sense you have an idea of what you want to say, but when it's game time you need to be structured not scripted. The best performances (sales & comedy) comes from being in that flow state where you're able to make adjustments on the fly. In an effort to both remember my set even better and craft it to perfection I'm going to write it all out from scratch rather than copy and paste it as I have been doing this past week.\n\nHi guys thank you for coming out. Excited to be here tonight and for those that don't I'm from Florida and being a Florida man has helped me realize the importance of being open-minded. It's hard nowadays to be open-minded though because it's near impossible to tell who the snake oil salesmen are and who are the ones providing real value. We all have the entire history of humanity in our pockets and most of us use this bad boy to watch videos of people popping pimples, porn, or get food delivered to our door. This tyranny of convenience our phones provide makes it hard to keep an open mind nowadays. Luckily, my father taught me the importance of keeping an open mind by constantly reminding me that pursuing your passion regardless of what others think is the key to a happy life. For my father that passion was his children's sporting events. Yea you could always catch my dad on the sidelines of my football games drinking a Red Bull vodka, yelling PICK A SPOT! PICK A SPOT CONOR!!! All my teammates knew who my Dad was. Despite being a little overly enthusiastic at my games he did teach me a lot of important lessons like if you are going to drink at your kids high school football game make sure you put your mixie in a big gulp, that asking for forgiveness is always better than asking for permission, and that I will never understand what it's like to have a kid until I have a kid. Hard to argue with that one. To his credit, my dad lived by his advice. He really did not care what others thought when it came to training my sisters and me even when it got child protective services called on him for making me run 5 miles and give up water for 24 hours so I could make pop Warner football weigh-ins. I went on to play d3 football at a school in New England no one in Florida knows of so I guess you could say what doesn't kill you makes you stronger, amirite? Anyways, I'm very grateful for all my Dad did for me but if there is one thing I worry about it is that I inherited my Dad's trait of becoming overly obsessive. Life is about having a plethora of experiences but when my Dad and I find something we are passionate about we both go all in. For my father that was his children's sports and for me it's Bitcoin. Yes I am obsessed with this magic internet money that has led my family to think I'm crazy. You know we have a saving on Bitcoin Twitter if your family doesn't think you are insane then you are not really a bitcoiner. I'm so fascinated with this new form of currency that when my girlfriend found out she was pregnant and told me the first thing that popped in my head was \"Thank God for bitcoin\". As you can imagine that's not what I told her. I said \"Our child is either going to be driving Lamborghinis or hunting stray cats for dinner. Ain't no in between at this point baby\". I'm not going to lie I got into bitcoin because I thought I could make a lot of money and so far all I've gotten is a Twitter addiction and lost half the dollar value of what I invested. That's alright though. My friends assure me that if I hold and have a low-time preference I'll be okay. Plus the so-called economic experts who didn't realize inflating the money supply by trillions of dollars would cause inflation are now telling us that there is no chance that bitcoin will replace the US dollar as a global reserve currency. Doesn't take a rocket scientist to know what causes inflation but I guess it takes more than an economist. Anyways, while I think my bitcoin twitter friends are right about the future of money I need to remember most stuff I find online should be taken with a grain of salt. For example, there were people on twitter saying that taking a covid vaccine could cause me to become sterile. Well low and behold I debunked that theory pretty quickly. I am excited to have a kid, I am. I'm just not sure having a kid was a legit excuse to dunk on the anonymous Twitter account @mrclownworld who gave me the idea in the first place. Everything happens for a reason and I'm excited to raise a child who loves Bitcoin. You know kids today, despite all the challenges they face with social media, are bright creatures. They aren't afraid to call people out on their BS and I don't see a world where the future generations are asking old stuffy dudes working in a corporate bank for permission to send and receive value. My best guess is that children use bitcoin, a decentralized ledger that allows anyone to send and receive value without a third party. You know this past weekend I went down to New York to visit my little cousins and when my girlfriend and I walked in the youngest Vaughn came up to me and said \"Conor I'm confused why Paige is pregnant. I thought first comes love, then comes marriage, then comes the baby sitting in the baby carriage. I said Vaughn, \"When it comes to both love and money I got no idea when to pull out\". Thank you that's my time.\n\nShout out all my classmates for helping me come up with the last part of this bit. Comedy is an incredible thing and while life has its challenges, a good laugh can turn around any day. Comedy comes from truth, but a lot of this the truth in this set has been stretched. Stay safe, laugh often, and be free anon.\n\nAlso it's wild how dependent we are on social media to spread all kinds of news. Shout out to my boy Travis for helping me get this comedy set across the finish line and being supportive of me being a father (probably because the kid just wants to live in my super sweet citadel when hyperbitcoinization happens) 🤣\n\n6/29/2022\n\nConor Jay Chepenik",
  "wordCount": 1206,
  "readingTime": 4.550943396226415,
  "claps": 0,
  "voters": 0
}