{
  "id": "ef331c788450",
  "title": "Day 69",
  "createdAt": "2022-05-30 15:06:00",
  "tags": [
    "bitcoin",
    "bible",
    "truth",
    "clarity",
    "faith"
  ],
  "url": "https://chepenikconor.medium.com/day-69-ef331c788450",
  "content": "# Day 69\n\nYesterday, the piece was filled with some good information, but it was a bit repetitive. Today I hope to tighten up some of these thoughts. Religion is powerful because it teaches people to seek to understand before they judge. In this modern-day world, the opposite typically happens. Take social media for example; people post the best part of their life in an effort to get others to think highly of them. Rather than learning to love yourself for who you are, we seek validation from others online. This also goes back to the high vs low time preference point. Likes will lead to short-term gain but no feeling of true fulfillment. Introspection is kind of the opposite. It can be painful at the start as you deal with problems you've been suppressing, but in the long run, it leaves you happier because you discover your true values. One of the Bible stories that resonated with me is a bunch of people getting ready to stone a prostitute and Jesus came by and said I dare the first person without sin to cast a stone. Everyone dropped their stones and left. That was so powerful because it shows everyone is flawed, including ourselves. How can we want to cast judgment on others if we can't even pass judgment on ourselves. It takes courage to realize I am not perfect, but I love myself anyway. It is humbling and rewarding to look inward because you understand what a challenge it is to be a human being and stop passing judgment so quickly. Yes, there are good and bad people, but religion is a reminder we are all on this journey together. Everything is so connected and the more you seek truth the more willing you are to accept others for their flaws and do what you can to help rather than hinder them.\n\nOne thing I realized when I looked inward was that I was so busy trying to convince others to learn about Bitcoin I stopped seeking to understand their perspective. I let emotion get the best of me which resulted in me turning people off from Bitcoin. My heart was in the right place because I thought Bitcoin could fix so many of the problems in society, but I wasn't trying to fix the problems right in front of me. I was trying to impose my will, even if I had the best of intentions. Emotion is a powerful thing and it can cause people to stop thinking logically. Taking a step back I realized I can do so much more good if I try to understand people instead of vainly attempting to impose my will on them. I think we see this problem at scale with modern-day governments. No longer are our institutions thinking logically about how they can serve their people. Instead, they try to provoke emotion in an effort to impose their will. Bitcoin is the solution to this in my eyes, but I now realize everyone will have their own journey to it. I'll be here ready to talk and discuss it with those willing to listen. However, I'm done trying to convince people who aren't ready. It was so easy for me to get emotional when someone didn't agree that Bitcoin could change the world for the better. Instead of getting upset over someone's opinion, I should be trying to understand why they think that way. This just goes back to seeking truth. Being a good person means you seek the truth and accept the fact your view might be wrong. When you do this it is easy to have a conversation with someone you disagree with and typically you learn from that conversation. Evil comes into play when people try to impose their will even if they mean well.\n\nIt is funny too because I feel so much more at peace. I no longer worry about shilling Bitcoin because I have faith that whatever happens is meant to happen. I hope that I can convince people to get into Bitcoin, but I realize my job is to continue to love myself and try to get better each day. That is the best thing I can do for Bitcoin, rather than convince others who aren't ready to use Bitcoin. Imposing my will would make the world a more evil place. Seeking truth on my own will make the world a more just place. Big organizations break down at scale because they can never understand the need of an individual. The best organizations try to understand the people they are serving but at some point, things just can't scale. Having faith just allows you to realize good will win out and get comfortable with the fact evil won't be successful in the long run imposing its will. Next time you are in an argument anon think about whether or not you are trying to make a point based on logic or emotion. If it's the latter stop yourself and go back to logic. Arguments won based on emotion might feel good in the short term, but won't make the world a better place because they aren't based in truth. It is nearly impossible to not let emotion get the best of us sometimes, but the more you focus on the truth the less emotional you will feel about your position. At least that has been the case with me and Bitcoin recently. I've never been more sure that Bitcoin will win out and that is because I've never been more sure I have no idea what others need. I do however know that people are self-interested actors and at some point or another as governments print money and fail to address the needs of their people, self-interested actors will seek a way to preserve their purchasing power. As these people line up I will do whatever I can to convince them bitcoin is the answer from a logical perspective. Bitcoin seems like a modern-day bible in the sense it just spreads the truth. The Bible has been a source of truth for thousands of years and it seems to me Bitcoin will be the same thing for the coming thousands of years.\n\n![](https://miro.medium.com/1*RN8K_oEu3sznkIBgYJlfLQ.jpeg)\n\n![](https://miro.medium.com/1*EXSrweJzUA7yJEWHzxPDSA.jpeg)\n\n5/30/22\n\nConor Jay Chepenik",
  "wordCount": 1048,
  "readingTime": 4.338050314465409,
  "claps": 0,
  "voters": 0
}