{
  "id": "efefe8315059",
  "title": "Day 675",
  "createdAt": "2024-01-27 05:00:38",
  "tags": [
    "selfish",
    "selfless"
  ],
  "url": "https://chepenikconor.medium.com/day-675-efefe8315059",
  "content": "# Day 675\n\n![Selfish vs Selfless](https://miro.medium.com/0*FH6uAma7Bm9CQvpD)\n\nIf we were to take a global poll and ask people would makes for a better society: 'selfishness or selflessness,' I'd wager a lot of satoshis that the majority, in their blissful ignorance, would champion selflessness. But let's not be fooled by the masses! History, the great teacher with a sense of irony, tells us a different tale. Today, I'm going to explain why selfless people are in fact society's own banana peel on the stairway of progress.\n\nThe widely held belief that selflessness trumps selfishness is akin to believing that a fish can climb a tree. It's a funny but pitifully misguided notion. It makes more sense to define these terms reasonably. I must also give a shoutout to one of my fictional heroes, Howard Roark who has helped me understand why rational selfishness - not selflessness - is the societal golden ticket.\n\nFirstly, let's clear the air. Selfishness isn't the villainous caricature we see in movies, twirling its mustache with glee. No, it's the rational pursuit of one's own happiness, a veritable moral North Star. It's about thinking long-term, respecting others (yes, you heard that right!), and embracing virtues like productivity, honesty, and integrity. Selflessness, on the flip side, is like volunteering to be society's doormat - sacrificing your values and well-being for others.\n\nSo to summarize each in one sentence.\n\nSelfish: putting your own needs first in order to self-actualize and become the best human you can.\n\nSelfless: putting the needs of others above your own needs even if it makes you worse off.\n\nNow let's apply these definitions to some frameworks I've thought about:\n\n1. Innovation and Progress: History shows that the greatest achievements in science, technology, and art - the very achievements that propel societies forward - are the products of individual minds pursuing their own passions and interests. Selfishness, in its rational form, motivates individuals to innovate, create, and improve their lives, which indirectly benefits society. Selflessness does not motivate such progress; it demands sacrifice and often discourages exceptional achievement.\n\n2. Responsibility and Independence: A society that upholds rational selfishness encourages its members to be independent and responsible for their own lives. This reduces the burden on society as a whole, as individuals are not encouraged to be dependent on others for their well-being. Selflessness, conversely, can lead to a culture of dependency and entitlement, undermining both individual initiative and societal health.\n\n3. Moral Clarity and Integrity: Rational selfishness requires individuals to live by principles - to think and act with integrity, honesty, and respect for others' rights. It fosters a society where individuals interact with each other on the basis of mutual respect and voluntary exchange. Selflessness, on the other hand, often leads to moral ambiguity and hypocrisy, as it can require the sacrifice of one's own values and well-being for the sake of others.\n\n4. Harmonious Social Interactions: In a society that values rational selfishness, social interactions are based on trade, with the understanding that each party to an interaction can benefit. This fosters peaceful, voluntary, and mutually beneficial relationships. In contrast, a selfless society often creates resentment and conflict, as individuals are expected to act against their own interests for the sake of others. If coercion is involved in a trade then it is not a mutually beneficial trade\n\nI recently did a podcast which can be found in the link below. I did so because speaking with my buddy Sean helped me improve my own framework for the world. Another way of putting it is I did it out of self-interest because I thoroughly enjoy speaking & learning from Sean.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FKhDr9ThrBME%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DKhDr9ThrBME&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FKhDr9ThrBME%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nIf I had to steel man my argument I'd note there's a certain nobility in putting others before oneself for certain things, a prime example being parenting. Many view having children as a selfless act aimed at nurturing the next generation. Which I can agree with because I am sacrificing myself in many ways to raise my child as best I can. However, this too can be seen from a perspective of self-interest, as parents often seek to pass on their values and legacy. Speaking from experience, I can confirm that parenting is both one of the most selfish and selfless acts you can do as a human being.\n\nTo say that selflessness is society's savior is a tragic comedy based on a false dichotomy. Rational selfishness - the art of chasing one's own values and happiness in a principled, rights-respecting way - is what truly leads to a thriving, responsible, and morally sound society. It is selflessness, with its inherent contradictions and demands for sacrifice, that is ultimately detrimental to the health and well-being of society. So be more selfish anon :)!\n\n1/26/24\n\nConor Jay Chepenik",
  "wordCount": 798,
  "readingTime": 3.2113207547169815,
  "claps": 0,
  "voters": 0
}