{
  "id": "f13309ed940c",
  "title": "Day 1048",
  "createdAt": "2025-02-02 20:30:06",
  "tags": [
    "end",
    "the",
    "federal",
    "reserve",
    "now"
  ],
  "url": "https://chepenikconor.medium.com/day-1048-f13309ed940c",
  "content": "# Day 1048\n\nToday I wrote [a Twitter thread about the Fed](https://x.com/ConorChepenik/status/1886147315049586747). I also found out Jacksonville has a Fed Branch so I wrote them this email before posting my Twitter thread. Despite thinking what the Fed does is disgusting I would love to see inside the museum:\n\n![](https://miro.medium.com/1*-Ai_xp9oBrCVj9_vBAny6Q.png)\n\n1/ The Federal Reserve System, born in 1913, was sold as a \"stabilizing force\" for America's economy. But its 12 regional banks and centralized power structure are the antithesis of free markets. Central planning always distorts prices, fuels malinvestment, and enriches insiders.\n\n![](https://miro.medium.com/0*-oePjR4shc4DKUQq)\n\n2/ The Fed's monopoly on money creation is legalized counterfeiting. By printing fiat currency, they dilute the value of your savings through inflation. This is not a bug. It is the system's core feature. The Cantillon Effect ensures bankers and govt get new money first while you pay higher prices last.\n\n![](https://miro.medium.com/0*WsIn-0qNSnLlbB1-)\n\n3/ The Fed's \"dual mandate\" (stable prices + full employment) is a farce. Since 1971, when Nixon severed the dollar's last tie to gold, the Fed has devalued the dollar by over 80%. Your grandparents' dollar now buys what a nickel did in 1913. Inflation is theft, and the Fed is the thief.\n\n![](https://miro.medium.com/0*pDigC7cUnTRqUv2f)\n\n4/ Every crisis - Great Depression, 2008, 2020 - sees the Fed \"rescue\" the economy by bailing out connected elites. They socialize losses while privatizing gains. Artificially low rates fuel speculative bubbles, then they blame \"capitalism\" when the bubble bursts. The real culprit? Central banking.\n\n![](https://miro.medium.com/0*rSWi0zpLTPXcnpjC)\n\n5/ The Fed's \"independence\" is a myth. It serves political masters by monetizing debt - turning Congress's deficits into your inflation. Since 2007, the Fed's balance sheet ballooned from less than $900B to almost $9T in 2022 before dropping back down before the next big print. Who benefits? Wall Street, not Main Street. Your purchasing power evaporates; bankers get bonuses.\n\n![](https://miro.medium.com/0*Zy9fSiPCIbR8weYL)\n\n6/ Sound money (gold, Bitcoin) needs no central committee. Markets, not bureaucrats, are how an economy can discover the true interest rate. The Fed's \"expertise\" brought 70s stagflation, 2008 collapse, and today's cost-of-living crisis. Each bailout distorts prices, and fuels larger and larger bubbles. Real capitalism thrives on apolitical money: scarce, predictable, permissionless. Despite what Keynesians will tell you deflation isn't doom; it's prices correcting as productivity rises. Your savings gain value; your labor keeps its worth.\n\n![](https://miro.medium.com/0*2MfhX8k9ZRsdWHZI)\n\n7/ The Fed's 110-year experiment has failed. It's time to abolish this socialist relic and restore honest money. Let competition, not coercion, determine our monetary system. Only then will America's entrepreneurs and workers keep the fruits of their labor. End the Fed.\n\n![](https://miro.medium.com/0*FCASCuNZQmQtqifp)\n\nIf you enjoyed this thread consider sharing it with others to educate them on the importance of real economics (not Keynesian propaganda) & liberty. Also study Bitcoin 🙏\n\n![](https://miro.medium.com/0*dRHYC8QnXwgnJhXj)\n\n2/2/25\n\nConor Jay Chepenik",
  "wordCount": 452,
  "readingTime": 2.9056603773584904,
  "claps": 0,
  "voters": 0
}