{
  "id": "f19d9948cdaf",
  "title": "Day 237",
  "createdAt": "2022-11-14 23:54:44",
  "tags": [
    "price-controls",
    "hash-functions",
    "atlas-society",
    "bitcoin",
    "hope"
  ],
  "url": "https://chepenikconor.medium.com/day-237-f19d9948cdaf",
  "content": "# Day 237\n\nI've been thinking a lot about this idea that price discovery in a free market are like hash functions. It takes an input of data and spits out an output that only goes one way. With a normal hash the algorithm works so that it is unfeasible to reverse calculate the data. You can verify a hash by making sure the same output is achieved based on the input but you can't take the output and figure out the input. In the same way a free market will set the price of the good but you can't figure out how all the labor, work, and travel to deliver a good was calculated. The function only goes one way. Since it only goes one way it's hard to see how manipulated free markets can become when central planners start meddling in them. People get upset with the price increases that result but the blame is pushed on to the producers rather than the central planners who are causing such issues. Sound familiar? Like say the U.S government who is calling out \"greedy fossil fuel companies\" while at the same time advocating for the end of fossil fuel use.\n\nI think it's becoming so egregious many people are waking up and starting to see through the charade. It's about time though because this game has been happening for a long time. The best example is when price controls get put in which completely breaks the hash function of free market price discovery and results in shortages. It's like the economy is outputting null. Guess what fixes this? That's right: Bitcoin. If you can't access goods via the normal markets then black markets will emerge with higher priced goods because there is more risk involved in selling the product. Hard to calculate this exactly but the collective wisdom of the market finds a price as it always does.\n\nI'd like to tie this piece in with my third Bitcoin magazine article. I was heavily influenced by this panel. Do recommend watching if you have read Atlas Shrugged and know a decent amount about Bitcoin. The future is bright for those who think from first principals and don't ask permission to make a better world!\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2Fuix5BrzMTBM%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Duix5BrzMTBM&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2Fuix5BrzMTBM%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\n11/14/22\n\nConor Jay Chepenik",
  "wordCount": 377,
  "readingTime": 1.4226415094339622,
  "claps": 0,
  "voters": 0
}