{
  "id": "f20601a0527e",
  "title": "Day 797",
  "createdAt": "2024-05-28 02:02:53",
  "tags": [
    "anarchism"
  ],
  "url": "https://chepenikconor.medium.com/day-797-f20601a0527e",
  "content": "# Day 797\n\nWe live in a world of abundance, a testament to human ingenuity and the ability to organize and create despite tyrannical governmental interventions. The free market, which is inherently deflationary, has driven remarkable innovations that have transformed our lives. As I read \"The Anarchist Handbook\" organized by Michael Malice today, it became clear that we don't necessarily need governments to organize society. Of course, many will read that and think, \"But the roads?!\"\n\nMaybe I'm wrong, but the way I see it is private businesses, with their efficiency and responsiveness, often provide solutions far superior to those of a large government. When you centralize too much, you get Soviet Russia, Mao's China, and sadly, the United States is heading this way if we don't decentralize. I'm grateful for the Constitution, but our government has grown tremendously powerful, and as Lord Acton notes, absolute power corrupts absolutely. The idea that we can thrive and innovate without excessive governmental control is compelling, highlighting the potential for a more decentralized and self-organized society.\n\nThe current setup of democracy is deeply flawed. Politicians, often insulated in their ivory towers, steal wealth from the people to fund wars under the guise of spreading democracy. This disconnect between decision-makers and the consequences of their actions leads to disastrous outcomes. Those who wage war should be the ones fighting it themselves. Otherwise, they are tyrants who enslave their citizens and say it's okay becauseDeMoCrAcY. If humans were more directly connected to the results of their actions, we would likely see a more peaceful world because the bloodthirsty clowns in power would not be so quick to wage violence and enrich themselves through the military industrial complex. The insights I gathered from \"The Anarchist Handbook\" today challenged me to rethink what one's reliance on government should be and consider the benefits of a society organized through voluntary cooperation and market principles.\n\nAnyways, here are some quotes that resonated with me while I pondered the benefits of the black flag.\n\n![chatGPT version's of the black glag](https://miro.medium.com/0*6wXZEQbyrCOF3w6g)\n\n![[https://x.com/ConorChepenik/status/1795083806778556735](https://x.com/ConorChepenik/status/1795083806778556735)](https://miro.medium.com/0*m1182vGTM9Li_HM1)\n\n![[https://x.com/FromKulak/status/1794973022610243744](https://x.com/FromKulak/status/1794973022610243744)](https://miro.medium.com/0*iRi1E6bKKEvtDU3E.jpg)\n\n![[https://x.com/FromKulak/status/1795136330856292658](https://x.com/FromKulak/status/1795136330856292658)](https://miro.medium.com/1*MgWcLBE7YYnwgYWhFSzZEg.png)\n\nSomeone called Kulak a fed today, which cracked me up - partly because, for all I know, it could be true. Calling for violence on social media is not a good strategy, but speaking freely is crucial, and it's a right enshrined in my constitution. I'm a peaceful man and have no desire to commit violence. However, if someone tries to conscript me to commit violence on their behalf, I will defend myself. So, next time someone gives you a reason to resort to violence, ensure you know your boundaries so you can defend yourself accordingly. That's what Anarchism is about as far as I can tell - the right to remind others that you don't speak for me; I speak for myself.\n\n5/27/24\n\nConor Jay Chepenik",
  "wordCount": 462,
  "readingTime": 2.4433962264150946,
  "claps": 0,
  "voters": 0
}