{
  "id": "f34c72d838d8",
  "title": "Day 138",
  "createdAt": "2022-08-08 01:40:55",
  "tags": [
    "mushrooms",
    "bitcoin",
    "meetups",
    "happy",
    "new-hampshire"
  ],
  "url": "https://chepenikconor.medium.com/day-138-f34c72d838d8",
  "content": "# Day 138\n\nBitcoin meetup last night was awesome. Not surprised it's always nice meeting Bitcoiners in person, it feels good to experience the echo chamber IRL🤣🤣🤣.\n\n![](https://miro.medium.com/1*StGgyJJFI7MyvzjwWn_stQ.jpeg)\n\nHit a nice run today to sweat out some of the toxins and now getting ready to go up to New Hampshire to hang with my girlfriend. Excited to visit Exeter!\n\nUpon returning from New Hampshire I'd like to spend some time writing about Bitcoin and psilocybin. This was an interesting read from Pleb underground and I actually had an old co-worker randomly send me the link to this article today. Mushrooms are the tool to get NPCs to stop being NPCs. Don't know how else to say it. If you take the dive and experiment (safely) it can change your life for the better.\n\n![](https://miro.medium.com/0*_K164DcVtwo9GQ4O.jpg)\n\n+\n\n![](https://miro.medium.com/0*BFFLNaFkaf_rK6o2)\n\n=\n\n![](https://miro.medium.com/0*P-EqkMczLqfgc3ES.jpg)\n\n> [**Bitcoin and Psychedelics - Tools of Self-Sovereignty**](https://plebunderground.substack.com/p/bitcoin-and-psychedelics-tools-of?utm_source=email)\n\nBack from New Hampshire and I will gladly shill Exeter as a cute little town. New Hampshire is full of so many cool small towns. Small towns are what make America special. Big cities can be fun to visit, but are overrated compared to a charming small town. I love the south and I also love New England. I've been to the West Coast a couple times and Montana which is kind of midwest. Cool places as well, but my heart belongs on the (b)east coast. While in Exeter I enjoyed a solid coffee (milky way latte), stopped for groceries at an amazing farmers market, and enjoyed river views from a random bench. Also drove through Phillips Exeter which seems like a nice prep school. I knew some kids from Tufts who went there and they said it was quite a challenging curriculum. I hope to one day homeschool my child. Teach them about Bitcoin and computer science because I truly believe those skills will serve him very well in his life time. Will see though, if I could find a school that didn't seem like it was attempting to indoctrinate my children with propaganda and marxist bullshit I would be open to sending them. I just want to make sure my kid seeks truth, thinks critically, and doesn't become...well an NPC.\n\nBack to mushrooms. It's amazing how eye-opening an experience taking these plants can be. I learned today that you can buy the spores and grow them yourself. *Obviously, magic mushrooms are illegal so make sure to grow the non magic kind*. That said, it's amazing how much knowledge is online for free. This youtube [video](https://youtu.be/farYItbTlHU) was helpful to get an idea of what is required. Plenty of websites sell spores legally to everywhere except 3 states in the U.S. Sucks to be in Georgia, Cali, or Idaho. Luckily, Mass is not one of these three states :D.\n\nI can't remember where I saw it or I'd link the hypothesis but I remember someone talking about how they believed what caused homo sapiens to become what we are today is because some monkey ate some magic mushrooms off cow poop and it helped our brains grow massive amounts over the course of thousands of years. Evolution did its thing and allowed humans to use tools and language, to work together and become the most dominant species on the planet. Science is forming a hypothesis, testing, analyzing the results, writing a conclusion, and repeating the process so who knows if this is exactly how it played out, but I could see it. Seems like a solid hypothesis as far as I can tell.\n\nTo me it makes sense that these mushrooms grow our brain. They seem to let our neurons talk with other parts of the brain that it never does. The more connections you can make in your brain the better off it is. I'm not a neuroscientist so maybe I'm typing out of my ass, but I'll make two points. When I last experimented with magic mushrooms I balled my eyes out listening to this [song](https://youtu.be/qvpmtuK9W-A). It honestly felt like I was in heaven. I can't articulate in writing how it truly felt, but life just seemed to make more sense afterwards. So many of my frustrations melted away as I realized how insignificant and fortunate I am. Like anyone else I have my good and bad days, but the experience reminded me that I'm just one small part of a vast and complex system. It helped me come to terms with the fact there is so much out of my control, but also reminded me that I can make a huge difference with my own day-to-day actions. It's hard to let go, but mushrooms help you do so. The experience also helped me understand why Bitcoin is the key to fixing so much of the world. I can't remember every epiphany I had but I remember having thousands. I swear I felt pain for those who have had to experience hyperinflation and cried tears of joy for a future where no one controls money and it's politically neutral and capping monopolies power. Like I said hard to articulate everything I experienced but the second point to impose top down control and ruin free markets. The other point I wanted to make is to show this chart from the article shared earlier. Pretty sure I've shared a similar picture/meme in one of my early posts but it's so true. This shit lights up your brain and makes you think and see in ways you never imagined possible. It's a muse to be creative again and a wake up call to let go off shit you can't control.\n\n![](https://miro.medium.com/0*HGe7nsGBIXx-y1bp.png)\n\nLife is special. Don't waste it worrying about bullshit anon. Let go :)\n\n8/7/22\n\nConor Jay Chepenik",
  "wordCount": 967,
  "readingTime": 4.482389937106918,
  "claps": 0,
  "voters": 0
}