{
  "id": "f37477b00972",
  "title": "Day 451",
  "createdAt": "2023-06-17 01:50:37",
  "tags": [
    "blackrock",
    "bitcoin",
    "self-custody",
    "horse-to-water",
    "conor-chepenik"
  ],
  "url": "https://chepenikconor.medium.com/day-451-f37477b00972",
  "content": "# Day 451\n\nThere has been a lot of news recently about Blackrock filing for a Bitcoin ETF/Trust. While there are some nuanced differences, overall, a Bitcoin Trust and a spot ETF seem to be quite similar financial structures. The fact that Blackrock is getting into the Bitcoin business is seen as bullish for the price of Bitcoin, but it may be bearish for those who are too lazy to take the time to understand and set up their own private key for Bitcoin storage.\n\nIt's worth noting that Satoshi Nakamoto, the creator of Bitcoin, designed it to be a decentralized peer-to-peer network for exchanging value, not necessarily as a tool for money managers to let their customers invest in. This perspective highlights the importance of individuals educating themselves about Bitcoin and not blindly trusting institutions like Blackrock as custodians of their Bitcoin holdings. Verification and self-education are crucial.\n\n![[https://twitter.com/gaybitcoins/status/1669728665175834624?s=20](https://twitter.com/gaybitcoins/status/1669728665175834624?s=20)](https://miro.medium.com/1*uSKBJ77xhOF8OoXtyDfXRw.png)\n\nWhile it may be understandable for large institutions to opt for the convenience of the Blackrock ETF/Trust/whatever, as an individual, it is important to be cautious and not rely solely on such custodial solutions. The sentiment expressed with \"FFFFFFFF\" in the chat signifies frustration or disappointment. In this case I'm using it to emphasize the importance of taking personal responsibility and not simply following the crowd without understanding the underlying principles of Bitcoin. Don't buy bitcoin because Blackrock is in on it now. That's just incentives. Blackrock wants to make money and if they see a way to do that with Bitcoin then they will do it. Blackrock could care less about peer to peer payments in a decentralized fashion.\n\nIf you are hesitant to explore self-custody and prefer to rely on trusted custodians, it is advisable to delve deeper into the subject and understand the potential risks involved. Trust should be earned through verification and informed decision-making.\n\nYou can lead a horse to water but you can't make it drink. Hopefully though if you are the horse unwilling to drink the sweet nectar of self custody here is the 21st episode of my podcast where I did a read about the importance of language without gatekeepers.\"\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fopen.spotify.com%2Fembed%2Fepisode%2F7FVna7eNZ3mJuqDMcIJVDX%2Fvideo%3Futm_source%3Doembed&display_name=Spotify&url=https%3A%2F%2Fopen.spotify.com%2Fepisode%2F7FVna7eNZ3mJuqDMcIJVDX&image=https%3A%2F%2Fi.scdn.co%2Fimage%2Fab67656300005f1fa6f950802112e095421b6ad3&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=spotify\" title=\"\" height=\"351\" width=\"624\"></iframe>\n\n6/16/23\n\nConor Jay Chepenik",
  "wordCount": 364,
  "readingTime": 1.5735849056603772,
  "claps": 0,
  "voters": 0
}