{
  "id": "f3865dece107",
  "title": "Decentralized Platforms Seem Inevitable",
  "createdAt": "2021-10-12 15:55:57",
  "tags": [
    "bitcoin",
    "freedom",
    "individual-rights",
    "web3",
    "decentralization"
  ],
  "url": "https://chepenikconor.medium.com/decentralized-platforms-seem-inevitable-f3865dece107",
  "content": "# Decentralized Platforms Seem Inevitable\n\nYesterday Youtube randomly deleted [Anthony Pompliano](None)'s account out of the blue. I was in the middle of watching his live stream for The Best Business Show (If you haven't seen it I highly recommend giving it a watch) and all of a sudden the stream cut off and it said this account has been deleted for violating Youtube's policy. I'm not joking when I tell you I was seeing red. I really have no stake in the show besides the fact I love watching it, but the fact Youtube would delete Pomp's show when all he and his brothers do is spread financial knowledge to the masses, give out Bitcoin and other cool shit for free, and encourage the audience to think about the leadership of the United States and if what they are doing is in the best interest of the people. This country was built on individual freedom and to see a company like Youtube try and censor someone doing so much good I am appalled and flabbergasted.\n\nLuckily, Pomp has a huge following and the backlash must've been massive as Youtube reinstated his account the same day and gave this [lame-duck excuse](https://twitter.com/TeamYouTube/status/1447669730886750219?s=20 \"A) as to why it was deleted originally. \"A reviewer mistook your bitcoin giveaway to be an attempt at phishing - we've educated our reviewers to help better identify phishing attempts.\" Maybe I'm wrong and this is legitimately what happened, but if I were wagering money on this I'd put my bet on BULLSHIT.\n\nThe first time I heard Pomp speak was on the [Lex Fridman](None) Podcast and I have been a massive fan of his and Bitcoin ever since. Here's the [link](https://lexfridman.com/anthony-pompliano/) to the episode if you want to become Orange-pilled. I originally came across Bitcoin in 2017 as a sophomore in College and bought a little. Was obviously upset after the massive crash, but the ethos behind Bitcoin was something I couldn't shake. When I heard Pomp articulate his reasons for going all-in on Bitcoin while speaking with Lex I knew it was only a matter of time until I did the same. I bring this up because the more I learn, interact, and engage with Bitcoin and other orange-pilled people the more it seems inevitable that these technologies will change our world for the better. Youtube shouldn't have the power to censor Pomp for educating the masses on finance and freedom technology. It's ridiculous how complex the tax code is in the United States and the fact our education system gives people no insights into how to manage their finances. I'm grateful I live in a time where I can get educated by watching people like Pomp who have a great understanding of these concepts, but it should be something taught in our school system.\n\nAgain, maybe I'm wrong but I'd be willing to bet the reason we aren't taught about finances and the tax code in our school system is because the wealthiest people in this country are typically the ones in power. Thus, they don't want the masses to wake up and realized the majority of people are being f***** by the rules. One of my favorite points that Pomp mentioned on his Best Business Show is to watch what our leaders instead of paying attention to what they say. Pomp was referencing Jamie Dimon, CEO of JPM Chase, at the time. What is really interesting is that Jamie went on the record yesterday saying he doesn't think Bitcoin has any value and he's skeptical that there is only 21 million Bitcoin. (Check the codebase and the blockchain and you'll see there are actually less than 21 million coins since some coins are lost) At the same time, JPM is using blockchain technology for their own coin and rolling out offerings to their customers that will allow them exposure to Bitcoin. I guess I'd be nervous too if a superior technology came out that was going to make my business obsolete. You would think the CEO of the largest bank in the U.S would be doing everything they could to pivot. Instead, Jamie is publicly bashing Bitcoin while allowing his company to offer Bitcoin to its customers. I'd have a lot more respect for him if he came out and said I was wrong about this technology and that's why JPM Chase is now offering solutions that will give our clients exposure to this exciting new asset.\n\nI want to mention that I don't mean to demonize or imply that making a bunch of money is wrong. I think it's a great thing and we should commend those who become rich and successful. What I despise is when someone becomes wealthy and then actively tries to convince the less fortunate to do things that don't benefit them... like mentioning Bitcoin is worthless and then turning around and offering it to your customers. If we let the markets decide what something is worth rather than printing money hand over fist we would be much better off. Instead, it seems like everytime the wealthiest people in this country fuck up Uncle Sam swoops in and makes sure stonks don't fall too much.\n\nIn conclusion, it is good to see that Youtube decided to reactivate Pomp's channel after the backlash, but it seems inevitable people will opt into Web 3 services where corporations can't censor people in the first place. It's worth noting I have found tons of value on Youtube (besides when they try to push Youtube Premium down my throat) and I'm grateful that I have a wifi connection and live in a country where people can freely speak their minds on most Web 2 platforms. However, Youtube making the choice to ban Pomp, even if momentarily, was wrong and I'm going to make an effort to use more Web 3 tools now. What makes Youtube valuable is the millions of people who post great content on there and Youtube shouldn't get to decide who is and isn't censored. Their decision to ban Pomp was a wake up call that these big tech companies hold immense power and if what makes them valuable is the content creators I'm eager to see what happens when the creators start to utilize Web 3 platforms where they can control their own data instead of a corporation. [Tim Denning](None) had an [amazing post](https://bettermarketing.pub/the-creator-economy-will-slowly-then-quickly-migrate-to-web-3-0-3971d5d32f54) about how Web 3 will change everything and as you will see in the title it's going to be slow at first and then suddenly almost every content creator will be using Web 3. I'm sure some Web 2 services will remain and some Web 2 services I've really appreciated, like Medium, the platform I'm using to write this article. However, the ones that I think will be the most successful are the ones who decide to pivot their business model to a Web 3 solution just like Jack Dorsey is doing with Twitter.\n\nGiving the power back to individuals and letting them vote on stuff like a democracy is much better than letting a corporation make decisions for the masses. If you don't agree with this my guess is that you probably run one of these corporations and have a lot to lose.\n\n10/12/21\n\nConor Chepenik",
  "wordCount": 1212,
  "readingTime": 4.573584905660377,
  "claps": 0,
  "voters": 0
}