{
  "id": "f440421a7d8e",
  "title": "Day 192",
  "createdAt": "2022-09-30 20:08:45",
  "tags": [
    "money",
    "ukraine",
    "russia",
    "usa",
    "communist-organizations"
  ],
  "url": "https://chepenikconor.medium.com/day-192-f440421a7d8e",
  "content": "# Day 192\n\nSo there was news Ukraine tried to join NATO today. My gosh. They say there are years where nothing happens and weeks where years happen. feels like we are in the latter part of this process. So naturally I hit a run, listened to some podcasts, and doom scrolled Twitter for longer than I should've. Before I get into the Ukraine stuff I'd like to talk about a podcast that really challenged my perception of Abe Lincoln, someone who I always thought freed the slaves and was one of the United States' best Presidents.\n\n> [**Ep 87: Bitcoin's Peaceful Revolution with Peter St Onge PhD**](https://open.spotify.com/episode/1cHPDTL6KTsJtSTOjUeQHP?si=L_6GvmI1QJWuR3GXpb5qSQ)\n\nThe first part of this podcast was good and I recommend that one as well. However, part 2 is linked above which is the pod that Svetski and Peter talked about Lincoln. Peter made the point Lincoln was a dictator and normalized making secession something that was not allowed in the United States even though it was the thing that kept the federal government in check before this. I had never thought about that. Not saying Lincoln was all bad but it does remind me Lincoln freed the slave out of his own self-interest not because he believed in equal rights for all. This is speculation on my part but it is good to think through this stuff because my U.S based history education that I received growing up in Florida painted Lincoln as the most benevolent man ever who could hold an axe all the way out and support it with one arm. I don't know why but that one tid-bit always stuck with me.\n\nAnother thing I had not considered is that Putin might be looked at as the good guy 100s of years from now. Of course Putin has always been painted as a horrible dictator from all the Western sources I've seen. This speech was spot on though and it irks me to no end seeing kleptocrats and the western ruling class (who should be called parasites not elites) leading civilization straight into world war 3. Scary times and I desperately hope peace can be achieved. I'm not saying Putin is a good guy, but like the whole Abe Lincoln thing people should consider more than one perspective. Please someone tell me where Putin is off the mark in this speech that I will post below. I can't get the \"You cannot feed your people with printed dollars and social media. You need food and energy. But Western elites have no desire to find a solution to the food and energy crises *they* (emphasis his) created.\" line out of my head.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/konstantinkisin/status/1575853684852150272&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMan this speech has me shook. I don't agree with a lot of what Putin has done (from the little I've seen like poisoning [Alexei Navalny](https://en.wikipedia.org/wiki/Alexei_Navalny)) but truth be told I know almost nothing else about the man except he used to be KGB and is the President of Russia. Of course he gets painted in a bad light by the West but man this speech was so spot on. I wish I spoke Russian so I could've listened and appreciated the little details rather than having someone translate it to English.\n\nAnways, I think Bitcoin will help fix these problems if WW3 doesn't blow us all up. I deeply hope Bitcoin can fix these problems because inflation sucks, hypocrisy sucks, war sucks, and this kind of uncertainty about nuclear war being on the horizon sucks.\n\nLike I've said many times before though all I can control is my own thoughts and actions. So on to more positive things like this awesome music video that gave me goosebumps. Bitcoin is freedom money. It is the cure to the parasite that fiat money is. It is the answer to never ending war that results from central banks.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2F_9WndByCoG0%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D_9WndByCoG0&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2F_9WndByCoG0%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nHard to go up to a random person and convince them the Fed is a communist organization hell bent on causing never ending war but that is essentially what it is as far as I can tell. The Fed has help from the military-industrial complex, and the kleptocrats in the swamp but without a central bank to fund these never ending wars they wouldn't be possible. That is why I Bitcoin. I want to see the parasite that is our Federal Reserve die so we can return to reality and have abundance, prosperity, and inviolable property rights here again in the United States again. God Bless the U.S.A and our constitution.\n\nPrinting money out of thin air no matter how just the cause if theft and should not be tolerated. It is unfortunate to see central banks normalize this concept and justify inflation & fiat currency not tied to Gold for the past 50 something years. May God be with every person who wishes for peace, prosperity, and liberty for all. May he help those who are lost find their path back to that of truth and righteousness.\n\n9/30/22\n\nConor Jay Chepenik",
  "wordCount": 851,
  "readingTime": 3.211320754716981,
  "claps": 0,
  "voters": 0
}