{
  "id": "f45f217d1522",
  "title": "Day 255",
  "createdAt": "2022-12-03 04:56:44",
  "tags": [
    "chatgpt",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-255-f45f217d1522",
  "content": "# Day 255\n\nYou know what's an interesting idea? The Horseshoe theory.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/trungtphan/status/1598727328510902272&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nOh the irony of two sides being so opposed with each other that they start to resemble each other. This theory helped me with the idea of yin-yang. The left and the right seem to be a much better example of yin and yang balancing each other out. The far-left and the far-right are two close to each other to provide balance. What does this mean for centralists? I'm not sure.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/mtaibbi/status/1598840927199469569&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nMy opinion, centrists need to team up with those who aren't on the far end of either spectrum and protect freedom of speech... as well as liberty, and freedom. Left or right doesn't matter. We the people matter. Those in charge have lost sight of this fact. The United States is a democracy; not a kleptocracy. Truth will be set free and as I come to peace with my inner self this becomes more and more evident.\n\nToday I had a lovely dinner with my girlfriend and her friend at a restaurant named Rosas in Seaport. My girl's friend works there so we got blessed up. Initially the wait was supposed to be an hour but the manager saw us and seated us after 10 minutes. The bill came out to be like 1/3rd of what it was supposed to be as well. I tried to give my girl's friend some money and insisted she take some bitcoin at least but she wouldn't have it. As we walked home from dinner we got to see a beautiful Christmas tree lighting. It was a reminder how fortunate I am to be a human alive during 2022 where humanity is accelerating to new heights like never before. The ai chat stuff that I've been seeing on Twitter is insane. The one promising thing is that people can ask it questions about Bitcoin, The IMF and crypto. Based on everything I've seen the AI seems to understand that only 1 of those 3 things I just listed are actually useful to humanity.\n\n> [**ChatGPT: Optimizing Language Models for Dialogue**](https://openai.com/blog/chatgpt/)\n\nThis is what is said when I asked it,\n\n\"What is the hardest money?\"\n\n\"The hardest money refers to a type of currency that is difficult to counterfeit and has a high value. Some examples of hard money include gold, silver, and other precious metals. These metals have a long history of being used as a medium of exchange, and they are generally considered to be more valuable and reliable than paper money or other forms of currency. The term \"hard money\" is often used to contrast with \"soft money,\" which refers to forms of currency that are easier to counterfeit or have a lower value.\"\n\nI also asked it\n\n\"What is the difference between bitcoin & fiat currency\"\n\n\"Bitcoin is a decentralized digital currency that uses cryptography for security and is not controlled by any government or financial institution. In contrast, fiat currency is a type of currency that is issued and backed by a government, and it derives its value from the government's ability to collect taxes and regulate the economy. One key difference between the two is that bitcoin is not backed by a physical commodity, such as gold or silver, whereas fiat money typically is. Another important difference is that the supply of bitcoin is limited, whereas the supply of fiat money can be increased by governments as needed.\"\n\nTick tock next block.\n\n12/2/22\n\nConor Jay Chepenik",
  "wordCount": 600,
  "readingTime": 2.2641509433962264,
  "claps": 6,
  "voters": 2
}