{
  "id": "f5cf5dcbfb23",
  "title": "Day 443",
  "createdAt": "2023-06-08 23:55:29",
  "tags": [
    "ghost-writing"
  ],
  "url": "https://chepenikconor.medium.com/day-443-f5cf5dcbfb23",
  "content": "# Day 443\n\nSomeone asked me to help them ghost write a book so today I'm going to work on an outline for that book. I was sent a good bit of notes and decided that trying to split it into 21 chapters would be a good first start.\n\nChapter 1: You have been lied to about Nutrition\n\n- The inner aisles of a grocery store are engineered to taste good and keep you coming back for more.\n\n- Eating 5–7x a day is not the way to boost your metabolism but a great way to create insulin resistance.\n\n- You don't need more supplements; you need a whole foods diet.\n\nChapter 2: Debunking Dietary Myths\n\n- Low fat is usually just a smoke screen for high sugar, increased triglycerides, insulin resistance, and heart disease.\n\n- The sun has endless nutritional benefits and comes at zero cost.\n\n- Everything in moderation is illogical; just because your body can deal with certain foods doesn't mean they're good for you.\n\nChapter 3: The Influence of Food Companies and Regulation\n\n- Food companies prioritize maximum profits over consumer health due to poor regulation.\n\n- Look at the incentives of big food companies. You have to really go digging to figure out how horrific they treat animals in an effort to maximize profits.\n\n- If these companies really cared about the environment they would be doing regenerative farming not virtue signaling.\n\nChapter 4: Understanding FIAT Money and its Effects\n\n- FIAT Money is responsible for poverty, wealth inequality, war, and debt slavery.\n\n- Central banks exert significant influence over various sectors, including technology companies, big pharma companies, and big agriculture companies, thereby shaping their impact on society.\n\nChapter 5: The Importance of Mindful Eating\n\n- Mindful eating and the connection between food and emotions.\n\n- The impact of stress and emotional well-being on digestion and nutrient absorption.\n\nChapter 6: Building a Nutrient-Dense Diet\n\n- The role of macronutrients and micronutrients in optimal health.\n\n- Incorporating whole foods and avoiding processed foods.\n\nChapter 7: Optimizing Digestive Health\n\n- Gut health and its influence on overall well-being.\n\n- The gut-brain connection and its impact on mood and mental health.\n\nChapter 8: Balancing Hormones through Nutrition\n\n- Understanding the role of hormones in the body.\n\n- How nutrition affects hormone production and balance.\n\nChapter 9: The Power of Phytonutrients\n\n- Exploring the health benefits of phytonutrients found in fruits and vegetables.\n\n- Incorporating a variety of colors and types of plant-based foods for optimal nutrition.\n\nChapter 10: Sports Nutrition and Performance\n\n- Fueling the body for athletic performance.\n\n- The importance of proper hydration and nutrient timing.\n\nChapter 11: Navigating Food Labels and Ingredients\n\n- Decoding food labels and understanding ingredient lists.\n\n- Identifying hidden sugars, additives, and artificial ingredients.\n\nChapter 12: Sustainable Eating for Health and the Environment\n\n- The impact of food choices on the environment. Supporting local ranchers is one of the best ways you can make an impact.\n\n- Exploring sustainable farming practices and reducing food waste is key to creating a green world.\n\nChapter 13: Meal Planning and Preparation\n\n- Tips for meal planning and preparation to support a healthy diet.\n\n- Batch cooking and kitchen hacks for efficient and nutritious meals.\n\nChapter 14: Eating Well on a Budget\n\n- Strategies for eating healthy while on a tight budget.\n\n- Tips for shopping smart and making the most of affordable ingredients.\n\nChapter 15: The Role of Sleep in Nutrition\n\n- The importance of quality sleep for overall health and metabolism.\n\n- Sleep hygiene practices and their impact on dietary choices.\n\nChapter 16: The Connection Between Exercise and Nutrition\n\n- How exercise and nutrition work together for optimal fitness.\n\n- Pre- and post-workout nutrition strategies.\n\nChapter 17: Nutrition for Different Life Stages\n\n- Nutrition considerations for children and adolescents.\n\n- Pregnancy and breastfeeding nutrition guidelines.\n\nChapter 18: Sustaining Long-Term Healthy Eating Habits\n\n- Strategies for maintaining a healthy diet in the long term.\n\n- Overcoming common challenges and staying motivated.\n\nChapter 19: The Role of Supplements in a Healthy Diet\n\n- Understanding when supplements may be necessary.\n\n- Selecting high-quality supplements and avoiding unnecessary ones.\n\nChapter 20: The Impact of Nutrition on Mental Health\n\n- The connection between nutrition and mental well-being.\n\n- Nutritional approaches to support mental health conditions.\n\nChapter 21: Making life meaningful.\n\n- It is NOT about material possession or looking good to other people.\n\n- The sooner you figure this out, the more meaningful your life will be.\n\nThis is a start. A rough estimate, non-fiction book chapters often fall within the range of 2,000 to 5,000 words so we are going to need a lot more for each chapter than a few bullet points. As corny as it sounds though I think outlining each chapter is a good way to start a book. When I was given this advice about writing essays in school I ignored it. I'll note though that many of the best articles I've written have started out all over the place and thanks to the editors of Bitcoin Magazine and other publications I was able to hone in the idea to create a coherent argument. However, I could've saved myself many hours if I had just outlined before diving in. Writing is weird though. Sometimes outlining helps and sometimes I just need to do a word vomit. You can always come back and edit later.\n\nAnyways... Excited to see what this book can turn into. Working title off the top of my head. 21 things I wish I knew earlier.\n\n![](https://miro.medium.com/0*GG_mTqQ3s7_12cBI)\n\n6/8/23\n\nConor Jay Chepenik",
  "wordCount": 894,
  "readingTime": 3.5735849056603777,
  "claps": 0,
  "voters": 0
}