{
  "id": "f6a554b2d7d5",
  "title": "Day 528",
  "createdAt": "2023-09-02 03:19:36",
  "tags": [
    "rules",
    "based",
    "order",
    "gray-areas",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-528-f6a554b2d7d5",
  "content": "# Day 528\n\n![Firefly + Canva = Create pretty much anything you can imagine :D](https://miro.medium.com/1*oI75d9zgQqWnfRIjsSH9pA.png)\n\n**Navigating the Gray Zones of a Rules-Based Order**\n\nIn a world seemingly dominated by absolutes, the concept of a rules-based order may appear straightforward: either the rules are upheld, or they are broken. However, as we delve deeper into the intricate labyrinth of international relations, we discover that the landscape is painted in shades of gray. While the fundamental principles may remain constant, the interpretation and application of these rules are subject to evolution over time. In this era of geopolitical complexities, the recent freezing of Russia's foreign reserves in response to the Ukraine invasion serves as a poignant case study, shedding light on the inherent flexibility and subjectivity woven into any rules-based system.\n\n**The Complexity of a Rules-Based Order**\n\nOn the surface, the seizure of Russia's overseas assets seemed like a dramatic breach of monetary policy norms. Foreign exchange reserves, traditionally held in central banks, had long been considered sacrosanct. Yet, the context of Russia's military aggression thrust open the door for Western allies to embark on unprecedented action. The U.S. Treasury Department argued that these were no longer \"normal times,\" and Russia's blatant violation of international law warranted a coordinated campaign to restrict its war funding.\n\nThis wasn't the first time that global monetary rules were bent for political ends. In 1971, the Nixon administration unilaterally suspended the dollar-to-gold convertibility, effectively terminating the Bretton Woods system of fixed exchange rates. While this move contradicted America's obligations under the post-WWII financial order, the constraints imposed by the gold standard on America's domestic policy goals took precedence.\n\nThese historical episodes serve as stark reminders that even the foundational pillars of the liberal rules-based order - whether we're discussing the principle of central bank independence or the maintenance of fixed exchange rates - are not impervious to the intricate web of power politics. Extraordinary circumstances or strategic priorities have the capacity to compel actors to redefine the boundaries of acceptable actions. Just look at what \"The Leader of the Free World\" is doing to their 45th President.\n\n![](https://miro.medium.com/0*WAnzp2olGF-PXtTM.jpg)\n\nIt is tempting to meme the situation. The sad part is arresting a former President during an election season, especially when he is leading one of the major political parties, has echoes of actions witnessed in less democratic contexts. It's a course of action more reminiscent of a banana republic than the United States. It's essential to remember that America, as a nation, aspires to higher standards. A friend of mine who shares the same name as me reminded me that the craziest outcome is often the most likely outcome.\n\nMany people will lean away from a return of the 45th President, but it is worth acknowledging that his remarkable ability to become a meme-worthy figure may bolster his chances in the 2024 election. This prospect, however, highlights the deep divides within the nation, with roughly half the country feeling vindicated by his potential return to power, another 30% seemingly entrenched in Trump Derangement Syndrome (TDS), and another 20% disillusioned by the political noise, recognizing that the current state of affairs doesn't necessarily serve their best interests. I made these numbers up, but I feel like this is a sound educated guess on my part.\n\nDemocratically held elections lead to tyranny of the majority but Trump won in 2016 just like Biden won in 2020. No matter who takes the office after 2024, half the country is going to be upset. There is a lot of complexities and ambiguities within any rules-based order, and I want to see America start correcting course quickly. Historical examples like Nixon's closure of the gold window underscore that adjusting the rules doesn't equate to abandoning the broader framework; we still have a dollar-based system 50+ years after the fact. The problem is the dollar monetary system weakens more and more as Western states navigate the fine line between upholding established rules and extending their limits, particularly regarding issues like reserve immunity. The West can continue to emphasize that their actions aim to strengthen the order rather than undermine it, but actions speak louder than words. The same goes for Biden speaking about \"democracy\". If people push too hard or if the system faces sustained stressors, the rules-based order can indeed fracture, highlighting the fragility that lurks beneath its surface.\n\n**The Inherent Subjectivity of Rules and Norms**\n\nThe tension between upholding institutions and bending them when circumstances dictate underscores the inherently subjective nature of interpreting rules and norms. What may appear as sharp lines can blur depending on one's vantage point. In essence, a rules-based order hinges on the shared perception of boundaries. These perceptions evolve over time, revealing shades of gray instead of strict black and white. However, the order persists as long as participants believe that the system continues to serve their long-term interests.\n\n**A System with Rules, Not Rulers**\n\nThe gray areas within the rules-based order can be exploited by those who seek to undermine it. Hence, it is imperative to advocate for a system rooted in rules rather than rulers. Rules, by their very nature, are objective and can be consistently interpreted. In contrast, rulers introduce subjectivity, allowing their decisions to be swayed by personal interests, potentially endangering the stability of the system.\n\nTake Bitcoin, for instance - a shining example of a system with rules and not rulers. It is a decentralized digital currency that operates without any central authority. The rules governing Bitcoin are embedded in its code and cannot be altered without overwhelming consensus amongst developers and network participants. This characteristic makes Bitcoin not only a secure and transparent system but also an exemplar of how a rule-based structure can resist manipulation.\n\n**The Path Forward**\n\nThe rules-based order is an intricate tapestry of evolving dynamics. We must remain vigilant and comprehend the nuances of any system's rules and the potential for exploitation. However, we should also bear in mind that the rules-based order serves as a cornerstone for global peace and stability. Our challenge is to find ways to bolster this order and make it more resilient against abuse. In this pursuit, technologies like Bitcoin hold promise, as they exemplify the potential of systems built on rules, not rulers, to safeguard our shared future. It is in our collective interest to navigate the gray zones wisely and nurture a world of critical thinkers who understand the intricate balance between rules and power.\n\n![](https://miro.medium.com/0*4RHqPiB6Z_5UbHos.jpg)\n\n9/1/23\n\nConor Jay Chepenik",
  "wordCount": 1084,
  "readingTime": 4.640566037735849,
  "claps": 0,
  "voters": 0
}