{
  "id": "f6fe1d4e2df6",
  "title": "Day 901",
  "createdAt": "2024-09-09 02:05:51",
  "tags": [
    "apps"
  ],
  "url": "https://chepenikconor.medium.com/day-901-f6fe1d4e2df6",
  "content": "# Day 901\n\nApps I am working on right now\n\n**lilSats (Bitcoin Education for Kids)**\n\n- Would be cool to create a virtual \"Bitcoin City\" with interactive buildings and characters\n\n- Age-specific learning paths (5–8, 9–12, 13–16 years)\n\n- Some sort of in game Bitcoin economy where kids earn and spend \"lilSats\" - made up sats for this game\n\n- Parent/teacher dashboard with progress tracking and customizable goals\n\n- Educational partnerships with schools and Bitcoin companies if it catches one\n\n**SaylorScope (Asset Management and Comparison)**\n\n- Comprehensive asset dashboard with real-time tracking and visualization\n\n- AI-driven predictive analysis and portfolio optimization\n\n- \"What-if\" scenario modeling for different investment strategies\n\n- Real-time tax implications and automated reporting (a far off future goal)\n\n- Augmented reality features for visualizing portfolio data. I've yet to play with this technology, but being able to see these charts in Apple vision pros would be sick\n\n- Try to attract an open-source crowd of others to help me. Here is the source code if you're interested anon >[https://github.com/Chepenik/saylorscope](https://github.com/Chepenik/saylorscope)\n\n**MortgageCalculator (Home Affordability Tool)**\n\n- An app for seeing what a mortgage costs\n\n- Some cool to add ideas to make it different from most of the other products out there:\n\n- AI-driven budget analysis using bank statement imports\n\n- \"Affordability scores\" for different neighborhoods and properties\n\n- Virtual tours and 3D home visualizations\n\n- Co-buying feature for analyzing joint purchases\n\n- Augmented reality for instant house analysis while house hunting\n\n- Maybe a good product to tie into SaylorScope\n\n**Valueware (AI Notetaking App)**\n\n- Real-time transcription with multi-speaker recognition\n\n- Knowledge graph to visualize connections between notes and ideas\n\n- AI-generated action items and follow-ups from meeting notes\n\n- AI research assistant with citation management and literature reviews\n\n- Open API and marketplace for user-created plugins and templates\n\n**anonai (Privacy-First LLM)**\n\n- End-to-end encryption and zero-knowledge architecture\n\n- Visual prompt builder with templates and natural language interface\n\n- Customizable AI personalities with user monetization options\n\n- Fully local processing option with downloadable language models\n\n- Industry-specific versions with compliance features for regulated sectors\n\nI need to hone in on the best idea. Coding is getting easier, but spreading my focus to thin is not it. Coding is still challenging in many ways. Nice to lay all this out though and also think through future plans so I let my subconscious figure out what matters most.\n\n9/8/24\n\nConor Jay Chepenik",
  "wordCount": 390,
  "readingTime": 1.471698113207547,
  "claps": 0,
  "voters": 0
}