{
  "id": "f764a55162ee",
  "title": "Day 59",
  "createdAt": "2022-05-20 22:43:05",
  "tags": [
    "creating",
    "consuming",
    "figuring-it-out"
  ],
  "url": "https://chepenikconor.medium.com/day-59-f764a55162ee",
  "content": "# Day 59\n\nRand Paul gives your boy hope. This 9-minute [clip](https://twitter.com/SenRandPaul/status/1527357198158172160?s=20&t=awcJIAlzl6JT033ough5MQ) he posted on Twitter is worth the watch and full of cold hard facts. Facts that many in their ivory tower want to ignore so they can virtue signal from their 50 thousand dollar electric cars. It is truly amazing to see someone in the United States Government stand up and say enough! It genuinely seems like the Biden administration is trying to destroy this country so they can usher in a more authoritarian regime. We would be so much better off if Biden had done literally nothing. The policies deployed by his administration are leading us into a war with a nuclear superpower and as a citizen of this country who opposes war with Russia, I feel helpless to do anything. Thus, watching Rand Paul deliver this speech gave me a lot of hope. It also feels good to vent via my Medium. The airwaves are littered with Propaganda. Even on social media where I've done a lot of curating to try and fill my feed with positive people it is near impossible to avoid stuff that upsets me. The algorithm is designed to feed people content that upsets them since that is the best way to keep people scrolling. Went back through my camera roll to find this gem.\n\n![](https://miro.medium.com/1*fn_pTQGd3a2VbUqSVmClhg.jpeg)\n\nJames Clear is spot on. When we create we are powerful. When we consume we become docile. That doesn't mean we shouldn't consume others' stuff. It just means we need to be more cautious about what we are consuming. Much of the content I consume comes from those who have been doing it forever. Joe Rogan is just one of these people but is a great example of someone who puts out genuine stuff. The guy has put out thousands of podcasts and continually gets better. You can see that the more he creates the more powerful he becomes at creating. The better his podcast gets the more I want to listen. Practice makes perfect, but in this high time preference society that is so easily lost. Even in my own life some days I don't feel like writing. Especially today hahaha. I've been consuming a lot of content since my surgery and I just feel docile. Need to be better about doing rather than consuming.\n\nGrateful I have TCP/IP and a nice streak going because if I didn't I would definitely be scrolling Twitter or watching something. Even reading, which I've been doing a lot more of lately, is still consuming. Not all forms of consumption are created equal. Much better to read a book than watch a Netflix series. That said, if you don't do anything with the knowledge it isn't much good. My uncle Bret, who is quite successful, told me that. I completely agree and since he mentioned that to me I've had a desire to do something with my newfound knowledge. Still figuring out exactly what that is going to be, but thinking through my thoughts via writing is helpful. Part of me wants to start a small business here in Cambridge, another part of me wants to learn to code, another part of me wants to keep my cushy sales gig so I can stack as many sats as possible, and a final part of me wants to move off-grid and become a farmer. Truth be told maybe I can do a little of everything. Life is more fun when you don't know what to expect in your day to day. Cheers to figuring it out as you go anon.\n\n5/20/22\n\nConor Jay Chepenik",
  "wordCount": 604,
  "readingTime": 2.479245283018868,
  "claps": 0,
  "voters": 0
}