{
  "id": "f78b1a945e99",
  "title": "Day 190",
  "createdAt": "2022-09-28 23:53:04",
  "tags": [
    "bitcoin",
    "cbdc",
    "shitpost",
    "podcasts",
    "bank-of-england"
  ],
  "url": "https://chepenikconor.medium.com/day-190-f78b1a945e99",
  "content": "# Day 190\n\nToday there was news that the Bank of England would be doing some more QE (money printing) despite inflation at double digits currently. Wild stuff and a sign things are not well in fiat land. What's infuriating is the BoE is bailing out BlackRock. I understand that BlackRock as a company holds a lot of British people's retirements funds but this is ridiculous. The free market can't operate because in our current fiat system the central banks can print money out of thin air and prevent \"to big to fail players from going under in the case of emergencies\". It is understandable why there is no political will to face the consequences of poor central planning but this is getting so out of hand it is not even funny. Then again sometimes laughing is the only way to handle the pain.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/prestonpysh/status/1575212551096664066&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nPreston nailed it with this tweet. The CEO of BlackRock wants to jam ESG narratives down the throat of people struggling to pay energy bills but has to have his own company bailed out by central banks. Thank God for Bitcoin. I'm always grateful about the orange coin but especially on days like today because without it god knows where we would be. Probably heading for a CBDC dystopia would be my guess. Speaking of CBDCs Preston released an amazing podcast about Bitcoin's polar opposite.\n\n> [**BTC097: Central Bank Digital Currencies Vs Bitcoin w/ Sam Callahan**](https://www.theinvestorspodcast.com/bitcoin-fundamentals/central-bank-digital-currencies-bitcoin-sam-callahan/)\n\nI'm still going to do everything I can to sound the alarms on these horrible dystopian 1984 style tools. However, I am going to sleep a lot easier knowing top down controls and government planning almost never work out according to plan. Creating and implementing a CBDC is way harder than I had imagined. Sam does a great job laying out all of the challenges and the fact that a CBDC would disinter-mediate the private banks. This fact leads me to believe we will see a lot of infighting between financial executives at the big banks in the U.S and the Presidents at the Fed who want a CBDC.\n\n> [**The U.S. Central Bank Digital Currency Narrative Is A Fantasy**](https://bitcoinmagazine.com/business/us-cbdc-narrative-is-a-fantasy)\n\nAnother interesting take on CBDCs. Of course it's important to keep in mind I'm getting two Bitcoiner's perspectives on why CBDCs will not come to be. That said, both Sam and Shinobi make some fantastic points about CBDCs I had not considered. I agree with this article that the bigger worry is the war on cash. I'm sure governments would love to start phasing out the one thing that makes it nearly impossible for them to track transactions. Shout out the bearer instrument that is cash. Pretty sure most crime is committed via cash but privacy is important and it's worth the trade off. I'd even argue the Central-Bank is a criminal organization at this point with the way they just create USD out of thin air. If you counterfeit the US dollar you can be thrown in jail (rightfully so) but if the Fed does it well that is their policy.\n\nI'm excited for the future. The more I think through how all this plays out the more I think we end up in a two-tiered system (over a long enough time horizon). Similar to _The Sovereign Individual_ thesis where \"value creators\" *for lack of a better word* go to where the Gov doesn't abuse their citizens via taxation & inflation and those who aren't willing to adapt end up in some digital serfdom model. China has a model like this where they can program the money to expire if it is not used in a timely manner or other nefarious stuff like turn off people's ability to buy a bus/train/plane ticket if they aren't being a \"good citizen\" in the eyes of the state.\n\nMoney is an amazing tool if the money not corrupted. While the central planners argue over how they don't have enough control with their current tools Bitcoin just keeps on beating and adding blocks every ten minutes. Love to see it.\n\nFinally, this tweet made me laugh much harder than it should have. An important reminder that music plays an absolutely pivotal role in whatever show, film, or even shitpost it is included in.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/bornakang/status/1574987646136291330&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n9/28/22\n\nConor Jay Chepenik",
  "wordCount": 750,
  "readingTime": 2.830188679245283,
  "claps": 0,
  "voters": 0
}