{
  "id": "f7e1f666aebc",
  "title": "Day 1018",
  "createdAt": "2025-01-04 04:03:18",
  "tags": [
    "abundance",
    "is",
    "coming"
  ],
  "url": "https://chepenikconor.medium.com/day-1018-f7e1f666aebc",
  "content": "# Day 1018\n\nI listened to [a podcast](https://youtu.be/i2lDSiq73rM) today about how AI could create a world of abundance. It wasn't from a typical AI guru either. It was a former finance guy who sounded surprisingly nonchalant about the profound changes on the horizon, casually mentioning how soon we'll be able to 3D print virtually anything at home.\n\nAs someone who just got into 3D printing I think he is correct. It's amazing what those printers can already do. As they get better this would mean a post-scarcity world where all our basic needs are met and for the few commodities we can't print I'm sure will be able to buy them cheaply online.\n\nWhile this prospect is exciting, it also raises a question: what won't we have in a hyper-abundant future? True love, meaningful relationships, and a deep sense of purpose or mission in life are not things you can simply print.\n\nYet AI can point us in the right direction to find these deeper connections. The podcast guest mentioned using Cursor, then quickly moving on to Replit because these platforms are improving so quickly and Replit was even easier to build with.\n\nI gave Replit's agent another try myself and built a small app that would end up hitting three different APIs over the course of building it: Wikipedia, OpenAI, and Unsplash. It has a \"surprise me\" button that delivers random results, and it's amazing how fast the tools behind it are evolving. All I had to do was copy and paste in my API key and give the app directions, just like how I'm typing out this essay, and it did everything for me.\n\nI'm optimistic about what lies ahead, but it's important to remember these technologies are double-edged swords. [Andrew Torba's post on X(Twitter)](https://x.com/BasedTorba/status/1875381322593513871) drove this home\n\n> Listen I know I'm biased but we have to build our own technology platforms. We simply cannot trust anyone in Silicon Valley to look out for our own interests, our own people, and our own nations. I've known this for almost a decade now and have been diligently building throughout that time. Combined with AI, they are going to turn these platforms into the largest propaganda machines the world has ever seen. We need to collectivize, organize, and build parallel infrastructure and technology that is beyond their control. Gab is one player in this space. We don't aim to be the only one. I have spent almost a decade trying to inspire people on our side to BUILD. Stop whining and complaining and start building. Now that we have the power of AI there are no excuses. You can have it code projects, services and tools for our cause. All of the information is out there to do this, you just have to want to make it happen. GAB: Go And Build\n\nOverall, I believe we should stay hopeful about the potential of AI, but remain vigilant about how it's used. If we seize this opportunity and guide AI responsibly, it can help shape a better future for everyone. Another great account to follow on X(Twitter) is [Brian Roemmele](https://x.com/BrianRoemmele). He is building an AI called YOUR AI which really excites me. When it gets released I will be using it quite often.\n\nBuilding great things is hard, but I see many people building the tools that will make our world a better place and boy do I feel grateful to have a front row seat. Even if that front row seat is through a glass screen. I just need to remember the real meaningful things in life aren't on a glass screen. They are in the analog world.\n\n![Start a family, have kids, build relationships, abundance is almost here.](https://miro.medium.com/1*79sTzm1BBpcmksvJgj08bg.png)\n\n1/3/25\n\nConor Jay Chepenik",
  "wordCount": 614,
  "readingTime": 2.516981132075472,
  "claps": 0,
  "voters": 0
}