{
  "id": "f9fa8e24494c",
  "title": "Day 390",
  "createdAt": "2023-04-17 03:01:39",
  "tags": [
    "social-media",
    "ai",
    "usage",
    "forthekids",
    "habits"
  ],
  "url": "https://chepenikconor.medium.com/day-390-f9fa8e24494c",
  "content": "# Day 390\n\n![](https://miro.medium.com/0*30qpjY1SnDG0OT6P.png)\n\nI came across this article on Nostr from Karnage and it led me to his website where I found this dope mansion photo. Anyways, here is the article.\n\n> [**Habla**](https://habla.news/a/naddr1qqfxummnw3ez6en0wgkhg6r9944kjernqydhwumn8ghj7un9d3shjtn0wfskuem9wp5kcmpwv3jhvtcpz9mhxue69uhkummnw3ezuamfdejj7qg4waehxw309aex2mrp0yhxgctdw4eju6t09uqsuamnwvaz7tmwdaejumr0dshsygqmcu9qzj9n7vtd5vl78jyly037wxkyl7vcqflvwy4eqhxjfa4yzypsgqqqw4rstnay0r)\n\nSuch an insightful read. It seems obvious in hindsight, but I had never put much thought into why all notification buttons are red. At least the vast majority anyways. I've turned off the notifications my iPhone besides calls and texts which has been a positive. For the kids who will grow up in a completely digital world it is important that adults start thinking through this stuff. Karnage laid out many incredible ideas for healthier social media, and while it has disadvantages I do think not showing follower count could be quite useful. Many cases where those with large follower counts will spew utter B.S and yet no one will pay attention to the 100 follower account who is trying to correct them. Far from the perfect example, but if a platform did get rid of following count it would do a lot, in my opinion, towards people having to rely on the actual messaging for signal rather than one's following. I learned from my buddy who made a lot of money selling NFTs that followers can be bought and sold. There is also many people who will boost a project because someone paid them to do so. Sad? More so a case of incentives and people not verifying things for themselves. It's unfortunate how many people will lose money from scams, rugpulls, and everything in between, but alas all we can do is our best to help educate others and not partake in those shitty practices.\n\nI wanted to think of more ideas to foster a healthy social media so naturally I asked AI. It spit out ten ideas and I've curated the ones I liked for making a positive difference.\n\n1. Rewarding users for sharing positive content and engaging in constructive conversations. Limit the visibility of negative comments or implement a reporting system to help moderate harmful content. Nostr has done this with zaps and now you can also report bad behavior to a relay operator (at least on Damus)\n\n2. Limit screen time and promote breaks: Integrate features that encourage users to take breaks from social media, such as reminders or automatic timeouts after a certain period of usage. This can help reduce the potential for addiction and encourage users to engage in other activities. Great idea and something that will not happen on traditional social media platforms because attention is money to them so it should be implemented on Nostr. Would be great to get a notification on social media after 15 minutes of scrolling (\"Hey go and get some sun PV🤙🤙)\n\n3. Promote diverse perspectives: Design features that expose users to a variety of viewpoints and encourage civil discussion on different topics. This can help counter the effect of echo chambers and foster a more balanced understanding of issues. Less echo chambers is important. Not sure how to get it done since people follow those who tend to have a similiar view but it is an important thing to consider.\n\n4. Include easily accessible mental health resources within the platform, such as links to support groups, hotlines, or informative articles. This can help users who may be struggling with the negative effects of social media usage.\n\n5. Educate users on social media literacy: Provide educational resources and tips for users on how to navigate social media responsibly, such as identifying fake news, managing their privacy, and setting healthy boundaries. I think Twitter did a good job of this with community notes.\n\n6. Implement age-appropriate content and features: Design the platform with different age groups in mind, providing age-appropriate content and features that cater to their developmental needs. This can help protect younger users from inappropriate or harmful content. (Another good idea even though it can be a slippery slope because I hate KYC laws but how do you get people to verify they are above 18 without asking for a Government issued ID)\n\n7. Encourage real-life connections: Promote features that encourage users to meet and connect with others in person, such as organizing local events or suggesting nearby activities. This can help build a sense of community and foster genuine connections. (I do love this one personally. IRL is a whole different ball game than cyberspace and that is a good thing)\n\n8. Incorporate user feedback: Regularly gather feedback from users on how to improve the platform and implement changes based on their suggestions. This can help create a more user-centric and healthier social media experience.\n\n9. Make it easier for the end user to control their social media experience, such as customizing their feeds, managing their notifications, and choosing who can interact with them. This can empower users to create a more personalized and healthier social media environment.\n\n90% is pretty good AI. Only one comment I completely deleted because even with my editing I didn't think it was worth keeping. Anyways, a good start in terms of brainstorming. I'm learning how to code so maybe I should go and develop some of these features.\n\nMy power went out while I was writing this and I'll say what a humbling experience to be reminded how reliant I am on the grid of my city. Not happy to be a gridder in this moment. Thank God for a charged laptop and my phone's hotspot. Would hate to miss a day of writing because the grid screwed me lol.\n\n4/16/23\n\nConor Jay Chepenik",
  "wordCount": 928,
  "readingTime": 3.7018867924528305,
  "claps": 0,
  "voters": 0
}