{
  "id": "fcea5c7c729b",
  "title": "Day 502",
  "createdAt": "2023-08-07 02:00:23",
  "tags": [
    "fiat",
    "bitcoin",
    "war",
    "humor"
  ],
  "url": "https://chepenikconor.medium.com/day-502-fcea5c7c729b",
  "content": "# Day 502\n\nToday I took a trip into the 'Big Apple' to see some friends from college. Getting to Manhattan from Morris County in New Jersey was quite the process. Dropped my car off near my buddies in Weehawken, took a bus in, and then rode the subway to the financial distract where my buddy Baker lives. It was great to see him and after we got a coffee I went to check out the infamous bull.\n\n![](https://miro.medium.com/1*sbQqcbhi3zW4JKLEquXifw.png)\n\nThe lines to interact with Wall Street's iconic sculptures fascinated me. While many waited eagerly to be photographed touching the bronze bull's testicles, I was not going to wait in line to touch those golden balls. Maybe it is from being outside or something but I swear the balls are more gold than the rest of the statue. The allure of posing with the Charging Bull's gilded genitals drew quite the crowd. Though I bypassed the lengthy queue to fondle its famous extremities, I still enjoyed witnessing the sculpture's popularity. The throngs of people eager to embrace this symbol of financial optimism was a testament to its meaning in popular culture. While I'm sure this changes from day to day, when I was there it seemed like the line to touch the balls was longer than the line to snap a picture in front of the bull😂 .\n\nThe lesson? I took two from this: 1. Humanity has a great sense of humor. A refreshing lesson in my opinion. 2. People care way too much about posting photos online. Considering I'm guilty myself I can't judge.\n\nThe internet is an incredible tool for providing value to others which in turn will provide value to your own life. It's also a vast place with more content than one could ever come close to consuming in a lifetime. Which is a vanilla way of saying you can get lost in the sauce if you are not careful with how you leverage your time in cyberspace.\n\nBack to my day today I must say NYC is exhausting and incredible at the same time. What's great about New York is all the walking you do. Today I logged over 25k steps. On my walk today I saw this which made me smile.\n\n![](https://miro.medium.com/0*107mREj9Ss0skS-_.jpg)\n\nWars should end. Despite our technological progress, conflict persists because those in power profit from it. However, there is hope. Fiat currency enables endless war by allowing governments to print money for military spending, even when unpopular. If people lose trust in fiat, warmongers lose this advantage. Without unlimited money creation, governments cannot fund unpopular wars indefinitely. Ending fiat could curb unchecked militarism. Technology gives us the means to connect and understand each other. With compassion and wisdom, we can solve problems without violence. But first, we must reform systems that incentivize war. It is my humble opinion Bitcoin is the best technology for this job.\n\nWhen I made my way back to New Jersey I got to link up with my other buddy, Rierce Riker. That's not his real name but it's my preferred name for him lol. He was with his roommate and when Rierce told his roommate I was a big Bitcoin guy his roommate rolled his eyes. Luckily, by the end of our dinner/hanging out the kid seemed to be much more receptive. I did do my best to explain I am a Bitcoiner, not a cRyPtObRo. Big difference. Also explaining many of the problems with fiat currency seemed to be helpful. Often better to address problems before offering a solution.\n\n8/6/23\n\nConor Jay Chepenik",
  "wordCount": 593,
  "readingTime": 2.6210691823899372,
  "claps": 5,
  "voters": 1
}