{
  "id": "fde6a1749d98",
  "title": "Day 1063",
  "createdAt": "2025-02-18 04:28:06",
  "tags": [
    "this",
    "one",
    "felt",
    "good",
    "bang-bang"
  ],
  "url": "https://chepenikconor.medium.com/day-1063-fde6a1749d98",
  "content": "# Day 1063\n\n\"I never HAVE TO do anything, I GET TO do everything!\" - Tyler Todt\n\nThat is a banger quote.\n\nTonight I had some friends over for dinner which is always great. I'm so grateful to be back in my hometown and able to connect with the people I grew up with. It's crazy how fast life flies by. Hell my own daughter feels like she was born yesterday but the reality is that she is already over two.\n\nI've got to admit, there's something deeply satisfying about showing off my 3D printer to friends and family. The whole maker culture fascinates me. It's mind-blowing to think about how innovators have created tools that let average people build almost anything. That's why I'm such a believer in capitalism; it drives people to create better products, services, and experiences that create rippling effects throughout society.\n\nSide note: I NEED TO BUILD MY OWN BITCOIN CIRCULAR ECONOMY USING SOFTWARE TO BUILD ON TOP OF A PERMISSIONLESS PROTOCOL AND ALSO LEVERAGE IT MORE IN PHYSICAL REALITY WITH FELLOW HUMANS. A reminder to myself. A.k.a sell my goods, services, and life work for Bitcoin. I need to make a 3D print website and you know what damn it I AM GOING TO DO IT. Hold me to that chat(GPT).\n\nLol...\n\nEnough Nostalgia I will finish today with an article I will be sharing with Bitcoin news to get published on Roxom.\n\n**Borja Seward and Roxom: Building the Future of Capital Markets on Bitcoin**\n\nBorja Seward, the 28-year-old CEO and co-founder of Roxom, has had an unconventional journey. He's not your typical Silicon Valley founder with a computer science degree and a string of internships at big tech companies. Instead, Seward's path started in Argentina, where he discovered Bitcoin at the young age of 14. \"Bitcoin was around 20 bucks,\" he recalls. \"I used to mine Bitcoin as a kid with my computer. I would mine something roughly like one Bitcoin per month.\" He even tried to spend his hard-earned Bitcoin on the dark web, with less than successful results. \"We tried buying things on Silk Road, but they never got to Argentina,\" he laughs. \"So we basically got scammed a couple of times.\"\n\nThese early experiences, though comical in retrospect, sparked a lifelong fascination with Bitcoin. Fast forward to 2017, and Seward found himself in a position many dream of: \"Bitcoin is 20K, I have more money than my parents,\" he says, describing the feeling as \"holy [****] man, this is insane!\" This was a pivotal moment, solidifying his commitment to the Bitcoin space.\n\nSeward's entrepreneurial drive led him to co-found [Lemon](https://lemon.me/en/), a major digital assets business in Latin America, which boasts over 3 million users and raised over $50 million in funding. \"We did very well,\" he says with characteristic understatement. \"I exited the business... sold when I was 23.\" But after a year-long sabbatical, Seward felt the pull of innovation once again. \"I got bored from my sabbatical,\" he admits. \"I wanted to build capital markets, but on-chain.\"\n\nThis desire gave birth to Roxom, a company that aims to revolutionize the way people think about trading and investing. Roxom is building a Bitcoin-denominated marketplace where users can trade a wide range of assets - stocks, ETFs, commodities, derivatives, and options - all valued and settled in Bitcoin. They say Bitcoin has no top because fiat has no bottom, but some Bitcoiners might argue the top is when we just start denominating stuff in Bitcoin andf that fundamental shift in perspective is something Roxom hopes to bring online with their Bitcoin denominated capital markets.\n\n\"Every single currency in the planet has its own capital markets, its own stock exchanges, commodities exchanges, options exchanges, and so on,\" Seward explains. \"And Bitcoin still doesn't.\" He sees this as a glaring omission, especially considering Bitcoin's growing strength and adoption. \"Bitcoin is the 10th largest currency today... and it still doesn't have its own capital markets. What the **** is going on?\"\n\nSeward believes that capital markets built on Bitcoin are inevitable and that they will ultimately become the most dominant in the world. \"We believe that Bitcoin is on its way to become one of the strongest currencies in the planet, if not the strongest,\" he states. \"And we already know from history what happens. Capital markets that are based on and that work on and settle on that currency outgrow everything else.\"\n\nThis conviction, along with a deep understanding of both traditional finance and the unique properties of Bitcoin, is what drives Seward and his team. Roxom is not just creating a platform; they are building the infrastructure for a new financial era. \"Capital markets are the backbone of any economy,\" Seward emphasizes. \"It's like issuing debt, issuing bonds, issuing stocks. Where do investors invest? In capital markets.\"\n\nBut what exactly are the advantages of using Bitcoin as the foundation for these markets? Seward points to several key benefits:\n\n- **24/7 Accessibility:** Unlike traditional markets, which operate on limited hours, Bitcoin markets can run continuously, allowing for greater flexibility and responsiveness.\n\n- **Transparency and Security:** Bitcoin's blockchain technology provides an immutable and transparent record of all transactions, reducing the risk of fraud and manipulation.\n\n- **Reduced Costs:** By eliminating intermediaries and streamlining processes, Bitcoin can significantly lower transaction fees and operational costs.\n\n- **Global Reach:** Bitcoin transcends geographical boundaries, enabling anyone with an internet connection to participate in these markets.\n\n- **Financial Sovereignty:** Individuals have complete control over their Bitcoin assets, unlike traditional systems where institutions often hold custody of the same fiat currency one will use to trade on that platform.\n\nSeward is particularly excited about the potential for Bitcoin to democratize access to capital markets. \"Imagine,\" he says, \"the entire crypto community just depositing Bitcoin on Roxom and longing GameStop in one click.\" This vision of a more inclusive and accessible financial system is a powerful motivator for the Roxom team.\n\nThe company has already made significant strides, securing a crypto license in El Salvador and a they are attracting considerable attention from investors, particularly large Bitcoin holders eager to find new avenues for yield. \"We're closing contracts with large whales to build up our Bitcoin reserves,\" Seward reveals. \"So that when we launch, we have a huge balance sheet on Bitcoin reserves, so that the market can borrow Bitcoin to operate margin markets.\"\n\nRoxom's innovative approach extends to their paper trading platform, where users can practice trading with virtual Bitcoin and even experiment with up to 100x leverage. \"Next week we're launching derivatives on paper,\" Seward announces. \"You'll be able to short Apple in Bitcoin big time, or anything that you want.\" This much leverage will just be with made up money but it's a playful approach to learning and experimentation that reflects the company's overall ethos: pushing boundaries while having fun.\n\nSeward is confident in Roxom's potential. \"The level of difficulty of what we're doing, because we have so much support, has dropped down to such a low level that it's honestly... there is no excuse for Roxom not to be a huge success.\" This confidence is contagious, and it's easy to get swept up in Seward's enthusiasm for the future of finance.\n\nRoxom seems well-positioned to lead the charge in bringing capital markets to Bitcoin. As Seward puts it, \"It's mind-blowing, man, even for us that we're building it. Holy ****! Just imagine.\" It's encouraging to see someone passionate about making sure Bitcoin becomes a unit of account. As the Lightning Network proves Bitcoin's transactional prowess and institutional adoption only continues to solidify its store-of-value status, Roxom's blueprint for Bitcoin denominated capital markets could finally complete the monetary trifecta: transforming Bitcoin from just another asset class into civilization's True measuring stick.\n\n2/17/25\n\nConor Jay Chepenik",
  "wordCount": 1304,
  "readingTime": 4.920754716981132,
  "claps": 0,
  "voters": 0
}