{
  "id": "fe241a695eb5",
  "title": "Day 561",
  "createdAt": "2023-10-04 23:22:49",
  "tags": [
    "money",
    "bitcoin",
    "fiat",
    "debt",
    "trillions"
  ],
  "url": "https://chepenikconor.medium.com/day-561-fe241a695eb5",
  "content": "# Day 561\n\n![](https://miro.medium.com/0*_eoR3_41eCB8AXZk.jpg)\n\nA fitting meme for today after reading this.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/luke_broyles/status/1709672458079588799%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n275 billion of debt in one day. The United States added over a quarter of a trillion dollars IN ONE DAY! This reminds me of when someone knows they are going to default on their credit cards so they go run up their tab at nice restaurants, fancy stores, etc.\n\nThe level of debt in the United States will have several significant impacts on the economy and financial stability. Here are 5 examples:\n\nInterest Payments: A large portion of the national budget may be allocated to servicing the interest on this debt. This reduces the funds available for essential public services and investments in areas like infrastructure, education, and healthcare. The interest payment alone on our debt has surpassed military spending. We will soon be paying over one trillion dollars in just interest payments. Not servicing the debt, just interest payments.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/NorthmanTrader/status/1708798044680974489%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nInflation Risk: Excessive debt leads to inflationary pressures. If the government resorts to printing more money to cover its obligations, it will devalue the currency, causing prices to rise and eroding the purchasing power of citizens.\n\nCreditworthiness: High debt levels can lead to credit rating downgrades, making it more expensive for the government to borrow in the future. It can also affect investor confidence in the country's financial stability. We have already seen the [U.S downgraded by Fitch.](https://www.fitchratings.com/research/sovereigns/fitch-downgrades-united-states-long-term-ratings-to-aa-from-aaa-outlook-stable-01-08-2023)\n\nCrowding Out Private Investment: When the government borrows extensively, it competes with private borrowers for available funds. This can drive up interest rates, making it more expensive for businesses and individuals to access credit for investments and consumption. I don't believe treasuries are by any means \"risk free\" but I can understand why people would say that. The U.S Government can print money so they can always pay their debts, the risk is receiving devalued dollars they printed out of thin air. So when it comes time to decide do you want 5% yield from someone who can print money vs someone who can't usually private investors will take the counter party risk of the one with the power of the printer.\n\nGlobal Confidence: The level of national debt can impact how other nations perceive a country's financial stability. A high debt-to-GDP ratio can lead to concerns among foreign investors and governments, affecting international trade and diplomacy.\n\nI hope this doesn't inspire you to go buy bitcoin on an exchange without knowing how to get it off. Please learn about Bitcoin first. Study how it eliminates counterparty risk and why it is truly scarce. Figure out why the hard cap of 21 million coins cannot be changed. Unlearn the Keynsian brainwashing. If you do this, I believe you will come to the same conclusion I have about Bitcoin. Which is that it is the most risk-free asset on the planet because it is simply the best money on the planet. And money is a winner-take-all game.\n\n10/4/23\n\nConor Jay Chepenik",
  "wordCount": 494,
  "readingTime": 2.0641509433962266,
  "claps": 7,
  "voters": 2
}