{
  "id": "ff6f3d3fe371",
  "title": "Day 439",
  "createdAt": "2023-06-05 00:18:34",
  "tags": [
    "politics",
    "democracy",
    "debates",
    "white",
    "pill"
  ],
  "url": "https://chepenikconor.medium.com/day-439-ff6f3d3fe371",
  "content": "# Day 439\n\nWhat a rollercoaster from Jack on Twitter today.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jack/status/1665428401732108290%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/jack/status/1665460519719895042%3Fs%3D20&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nI'm also hopeful about this presidential election. We should never trust a politician to fix our problems, but it does seem like more and more of America is starting to say screw another Trump v Biden race. Personally, I would much rather see Desantis vs Kennedy. I don't care who wins that race as long as it's not Trump or Biden. It's insane to think that the DNC has not allowed Biden to debate Kennedy but I also think there is a lot of signal to be found in the fact they haven't allowed Biden to debate Kennedy yet. They're scared of RFK Jr. roasting Biden.\n\nFor the party that always talks about MuH dEmoCrACy you would think they would want to have democratic debates. Anyways, it's a fools game hoping for politicians to fix your problems. I'm just pointing out that it's nice to see the public call out how ridiculous it is that the democrats are not letting Biden debate. I heard the All In podcast crew talking about it on this episode. This blog might not get a lot of views, but I know the All-In podcast is watched by a lot of people and many of those people are probably also thinking now \"yea it's ridiculous we aren't having debates for democrats\".\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FrOUDG1FB03A%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DrOUDG1FB03A&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FrOUDG1FB03A%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nI find it truly baffling that Facebook is engaging in censorship by preventing RFK Jr. from sharing campaign material on their platform. However, this situation also gives me hope because it has the potential to awaken more people to the issue at hand. Freedom of speech is a fundamental right guaranteed by the First Amendment of our constitution, and it is disheartening to witness a major tech platform censoring a democratic candidate. It's a truly absurd situation.\n\n![RFK Jr's Uncle](https://miro.medium.com/0*PwtmwcEEnRbkK4cb)\n\nOn a positive note, RFK Jr. is hosting a Twitter spaces event tomorrow at 2 PM, which presents an opportunity for people to engage with him directly. I genuinely believe that this incident will serve as a wake-up call for many, making them realize that Facebook is not their ally, ultimately leading them to explore alternative social media platforms. Sometimes, experiencing pain can be a great teacher, and witnessing their favorite candidate being deplatformed in advance of a crucial election might prompt individuals to seek out alternative sources of information and discussion.\n\nI'm looking forward to the week ahead as I have many exciting things planned. It's refreshing to see the quality of public discourse improving, despite the challenges. However, I acknowledge that the perspective I'm exposed to may be influenced by algorithms and my personal feed. I can only gather information based on what I see, but it does seem like there is progress being made. It's important to hold onto hope and maintain a positive outlook. Embracing optimism (the white pill) is preferable to succumbing to pessimism (the black pill). Let's remember that if these issues weren't significant, there wouldn't be a need for censorship in the first place.\n\n6/4/23\n\nConor Jay Chepenik",
  "wordCount": 510,
  "readingTime": 2.1245283018867926,
  "claps": 1,
  "voters": 1
}