{
  "id": "ff79123f04cb",
  "title": "Day 21",
  "createdAt": "2022-04-13 01:42:57",
  "tags": [
    "the-fed",
    "bitcoin-twitter",
    "liver",
    "steak",
    "carnivore"
  ],
  "url": "https://chepenikconor.medium.com/day-21-ff79123f04cb",
  "content": "# Day 21\n\nPetabytes upon petabytes upon petabytyes uploaded to the cloud every single day. Pretty crazy when you think about how much data is being created by the human race. Also nuts to acknowledge how valued this data has become. Wonder what massive tech companies and the government are using this data for? Probably good things :D. America is a gold mine of memes and hopefully, we can feed our AI the best memes on the planet so they know what is up.\n\n![](https://miro.medium.com/1*0vQfz8BwsaBEiOw6usivmQ.jpeg)\n\nI do feel for this girl who had to deal with bitcoin Twitter's B.S. I also think she isn't helping at all by lashing out at others. The internet is a ruthless place and we need to start teaching kids how to be more careful when online. The memes that end up on the internet though👀  God bless a good meme. With inflation at 8.5% I got another good meme about the Fed right here.\n\n![](https://miro.medium.com/1*-mmHbVgS2FcFZVhLucjc6A.jpeg)\n\nGod bless bitcoin Twitter and the creative souls out there shitposting. Life is better when it's full of pictures and words that give us visceral reactions. I've also been enjoying the bitcoin Twitter diet of mostly red meat. Ate some calve liver today and it was surprisingly good. Inflation is making my steak cuts quite expensive so I've been buying various organ cuts. They don't taste as good as steak but the extra nutrients and cheaper price make them worth mixing in. Looking forward to trying cow heart next. Anyone who is on their carnivore diet and reads this please shill me other healthy organs. Always looking to try new cuts of animals and see what I like best. Need to also read that book mi amor brought home the other day. The whole book is the author trying to answer the question \"Why do humans only eat certain animals?\". A good question I've yet to answer.\n\n4/12/22\n\nConor Jay Chepenik",
  "wordCount": 319,
  "readingTime": 1.5871069182389936,
  "claps": 0,
  "voters": 0
}