{
  "id": "ff7fd7a75ef1",
  "title": "Day 164",
  "createdAt": "2022-09-02 20:38:38",
  "tags": [
    "coding",
    "shitposting",
    "life",
    "changing-a-tire",
    "twitter-post"
  ],
  "url": "https://chepenikconor.medium.com/day-164-ff7fd7a75ef1",
  "content": "# Day 164\n\nI'd like to really start doing a deep dive into coding so some of these writings are just going to be about what I've learned so far. \"If you want to change the world, don't protest. Write code!\" - Hal Finney (1994) on [#Bitcoin](https://twitter.com/hashtag/Bitcoin?src=hashtag_click)\n\n![](https://miro.medium.com/0*FFS-VKuO29X55Lu8.png)\n\n![](https://miro.medium.com/0*Qp1zr4WwYZtyQdsn)\n\nStarting with Object Oriented Programming. A random textbook definition of \"**Object-Oriented Programming** is a methodology or paradigm to design a program using classes and objects. It simplifies the software development and maintenance by providing some concepts:\"\n\nSo essentially rather than having to tell the computer what your object is every-time OOP allows you to use classes to group code and data together for reusability and simplicity.\n\nWell get more into this later, but as I was going to pick up my Mum at the airport I saw someone hit my car and popped my back tire. So I just changed my tire and luckily the people left a note. Karma has a funny way of working out. I tweeted this right before I went and saw someone hit my car.\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?type=text%2Fhtml&key=a19fcc184b9711e1b4764040d3dc5c07&schema=twitter&url=https%3A//twitter.com/conorchepenik/status/1565779025615851520&image=https%3A//i.embed.ly/1/image%3Furl%3Dhttps%253A%252F%252Fabs.twimg.com%252Ferrors%252Flogo46x38.png%26key%3Da19fcc184b9711e1b4764040d3dc5c07\" title=\"\" height=\"281\" width=\"500\"></iframe>\n\nLmao maybe I should cut back on the shitposting. Life happens though. I appreciate the fact that they left a note. Could've been worse plus I always feel like a handyman when I change a tire. Don't get to feel that too often living in a city.\n\n9/2/22\n\nConor Jay Chepenik",
  "wordCount": 229,
  "readingTime": 1.2474842767295597,
  "claps": 0,
  "voters": 0
}