{
  "id": "ffba1ec3c004",
  "title": "Day 514",
  "createdAt": "2023-08-19 01:22:14",
  "tags": [
    "history",
    "davos",
    "federal-reserve",
    "odm",
    "bitcoin"
  ],
  "url": "https://chepenikconor.medium.com/day-514-ffba1ec3c004",
  "content": "# Day 514\n\n<iframe src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FwejhmYI9IME%3Ffeature%3Doembed&display_name=YouTube&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DwejhmYI9IME&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FwejhmYI9IME%2Fhqdefault.jpg&key=a19fcc184b9711e1b4764040d3dc5c07&type=text%2Fhtml&schema=youtube\" title=\"\" height=\"480\" width=\"854\"></iframe>\n\nThe monetary conflict going on between the Federal Reserve and the Globalists of the world is an intriguing one. The Fed wields immense power through its control of monetary policy and the US dollar, which is still the world's reserve currency. Groups like the WEF and other European plutocrats promote a more globalist vision that many in America see as threatening national sovereignty. Until I read Phil's work above I did not realize how big of a role the eurodollar market plays on the global stage.\n\nPhil's insights not only broaden our horizons but also spotlight the symbiotic yet intricate relationship between the United States and Europe. In this new era of geopolitical competition, as America and Europe's interests potentially diverge, the Federal Reserve champions its duty to fortify US economic interests. Conversely, the WEF champions the cause of a globalist international order, transcending boundaries. However, against the backdrop of escalating nationalism and trade disputes, the Federal Reserve charts a course favoring domestic priorities over seamless international integration.\n\nHowever, the relationship is complex. The Fed cannot ignore the global economy, as financial markets are interconnected. The WEF includes many powerful US business leaders and relies on global corporate participation. Finding the right balance between national autonomy and international cooperation will be a challenge which is good. I don't want to eat bugs or have a global CBDC which can be turned off by beuarcrats. Phil convinced me with his work that the Fed is fighting these dystopian futures by raising rates and crushing the offshore dollar markets (ODMs).\n\nThe future of the international monetary system currently hangs in the balance. It does feel like a credit event is coming. Will the Fed be able to keep rates up long enough to completely crush the offshore eurodollar markets and maintain independence before a massive credit event? Will stable coins become the next eurodollar market? How these things play out could determine whether a coordinated global economy or rival blocs emerge. In any case, Bitcoin makes the Fed and WEF less relevant because it means they can no longer benefit from \"money printing\". When Satoshi created Bitcoin I doubt even he could have realized the profound implications that would result in the coming years.\n\nGrateful he dead because while Phil's article taught me a lot it also reminded fractional reserve banking is way more complicated than it needs to be. Everything / 21 million is a better option as far as I'm concerned. Let's not give any human the ability to create money because when that happens it is literally just a matter of time until those humans abuse their power. The rise of Bitcoin heralds a transformative dawn. A dawn where the ethos of decentralization reshapes the very foundations of money, power, and economic order, leaving an indelible imprint on the course of history itself.\n\n8/18/23\n\nConor Jay Chepenik",
  "wordCount": 480,
  "readingTime": 1.8113207547169812,
  "claps": 2,
  "voters": 1
}